Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Configure a <literal>GitRepo</literal> resource that will be used to ship all the resources of the <literal>eib-charts-upgrader</literal> Fleet.
es: Configure un recurso <literal>GitRepo</literal> que se usará para incluir todos los recursos de la flota <literal>eib-charts-upgrader</literal>.
ja: <literal>eib-charts-upgrader</literal> Fleetのすべてのリソースを配布するために使用される<literal>GitRepo</literal>リソースを設定します。
pt_br: Configure o recurso <literal>GitRepo</literal> que será usado para enviar todos os recursos da instância do Fleet <literal>eib-charts-upgrader</literal>.
zh_cn: 配置将用于提供 <literal>eib-charts-upgrader</literal> Fleet 所有资源的 <literal>GitRepo</literal> 资源。

source: For <literal>GitRepo</literal> configuration and deployment through the Rancher UI, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link>.
es: Para la configuración y el despliegue de <literal>GitRepo</literal> mediante la interfaz de usuario de Rancher, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link> (Acceso a Fleet en la interfaz de usuario de Rancher).
ja: Rancher UIを通じた<literal>GitRepo</literal>の設定およびデプロイメントについては、「<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI (Rancher UIでのFleetへのアクセス)</link>」を参照してください。
zh_cn: 有关通过 Rancher UI 配置和部署 <literal>GitRepo</literal> 的信息，请参见<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">在 Rancher UI 中访问 Fleet</link>。

source: For <literal>GitRepo</literal> manual configuration and deployment, see <link xl:href="https://fleet.rancher.io/tut-deployment">Creating a Deployment</link>.
es: Para la configuración y el despliegue manuales de <literal>GitRepo</literal>, consulte <link xl:href="https://fleet.rancher.io/tut-deployment">Creating a Deployment</link> (Creación de un despliegue).
ja: <literal>GitRepo</literal>手動設定およびデプロイメントの場合、「<link xl:href="https://fleet.rancher.io/tut-deployment">Creating a Deployment (デプロイメントの作成)</link>」を参照してください。
pt_br: Para configuração e implantação manuais do <literal>GitRepo</literal>, consulte <link xl:href="https://fleet.rancher.io/tut-deployment">Creating a Deployment</link> (Criando uma implantação).
zh_cn: 有关 <literal>GitRepo</literal> 的手动配置和部署过程，请参见<link xl:href="https://fleet.rancher.io/tut-deployment">创建部署</link>。

source: For an environment that does not support GitOps (e.g. is air-gapped and does not allow local Git server usage):
es: En un entorno que no admita GitOps (por ejemplo, un entorno aislado que no permita el uso de un servidor Git local):
ja: GitOpsをサポートしていない環境の場合 (例: エアギャップされ、ローカルGitサーバの使用が許可されていない):
pt_br: Para um ambiente sem suporte a GitOps (por exemplo, air-gapped que não permite o uso de servidor Git local):
zh_cn: 对于不支持 GitOps 的环境（例如，不允许使用本地 Git 服务器的隔离环境）：

source: Download the <literal>fleet-cli</literal> binary from the <literal>rancher/fleet</literal> <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">release</link> page (<literal>fleet-linux-amd64</literal> for Linux). For Mac users, there is a Homebrew Formulae that can be used - <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.
es: Descargue el binario de <literal>fleet-cli</literal> de la página de <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">versión</link> de <literal>rancher/fleet</literal> (<literal>fleet-linux-amd64</literal> para Linux). Los usuarios de Mac pueden usar una versión propia: <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.
ja: <literal>rancher/fleet</literal> <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">リリース</link>ページから<literal>fleet-cli</literal>バイナリをダウンロードします(Linuxの場合は<literal>fleet-linux-amd64</literal>)。Macユーザの場合、使用可能なHomebrew Formulaeがあります(<link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>)。
zh_cn: 从 <literal>rancher/fleet</literal> <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">版本</link>页面下载 <literal>fleet-cli</literal> 二进制文件。对于 Linux，请下载 <literal>fleet-linux-amd64</literal>。对于 Mac 用户，可以使用 Homebrew Formulae - <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>。

source: Navigate to the <literal>eib-charts-upgrader</literal> Fleet:
es: Diríjase a la flota <literal>eib-charts-upgrader</literal>:
ja: <literal>eib-charts-upgrader</literal> Fleetに移動します。
pt_br: Navegue até a instância do Fleet <literal>eib-charts-upgrader</literal>:
zh_cn: 导航到 <literal>eib-charts-upgrader</literal> Fleet：

source: Create a <literal>targets.yaml</literal> file that will instruct Fleet where to deploy your resources:
es: Cree un archivo <literal>targets.yaml</literal> que indicará a Fleet dónde debe desplegar los recursos:
ja: リソースをデプロイする場所をFleetに指示する<literal>targets.yaml</literal>ファイルを作成します。
pt_br: Crie um arquivo <literal>targets.yaml</literal> para instruir o Fleet sobre onde implantar seus recursos:
zh_cn: 创建指示 Fleet 在哪里部署资源的 <literal>targets.yaml</literal> 文件：

source: Use the <literal>fleet-cli</literal> to convert the Fleet to a <literal>Bundle</literal> resource:
es: Utilice <literal>fleet-cli</literal> para convertir la flota en un recurso <literal>Bundle</literal>:
ja: <literal>fleet-cli</literal>を使用して、Fleetを <literal>バンドル</literal>リソースに変換します。
pt_br: Use <literal>fleet-cli</literal> para converter o Fleet em um recurso <literal>Bundle</literal>:
zh_cn: 使用 <literal>fleet-cli</literal> 将 Fleet 转换为<literal>捆绑包</literal>资源：

source: This will create a Bundle (<literal>bundle.yaml</literal>) that will hold all the templated resource from the <literal>eib-charts-upgrader</literal> Fleet.
es: Esto creará un Bundle (<literal>bundle.yaml</literal>) que contendrá todos los recursos de plantilla de la flota <literal>eib-charts-upgrader</literal>.
ja: これにより、<literal>eib-charts-upgrader</literal> Fleetからのすべてのテンプレート化されたリソースを保持するバンドル(<literal>bundle.yaml</literal>)が作成されます。
pt_br: Isso cria um bundle (<literal>bundle.yaml</literal>) para armazenar todos os recursos usados como gabaritos da instância do Fleet <literal>eib-charts-upgrader</literal>.
zh_cn: 这将创建一个捆绑包 (<literal>bundle.yaml</literal>)，其中包含来自 <literal>eib-charts-upgrader</literal> Fleet 的所有模板资源。

source: For more information regarding the <literal>fleet apply</literal> command, see <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>.
es: Para obtener más información sobre el comando <literal>fleet apply</literal>, consulte <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>.
ja: <literal>fleet apply</literal>コマンドに関する詳細については、「<link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>」を参照してください。
pt_br: Para obter mais informações sobre o comando <literal>fleet apply</literal>, consulte <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>.
zh_cn: 有关 <literal>fleet apply</literal> 命令的详细信息，请参见 <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>。

source: For more information regarding converting Fleets to Bundles, see <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link>.
es: Para obtener más información sobre cómo convertir flotas en Bundles, consulte <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link> (Conversión de un chart de Helm en un Bundle).
ja: Fleetをバンドルに変換する方法に関する詳細については、「 <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle (Helmチャートのバンドルへの変換)</link>」を参照してください。
pt_br: Para obter mais informações sobre como converter instâncias do Fleet em bundles, consulte <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link> (Converter um gráfico Helm em bundle).
zh_cn: 有关将 Fleet 转换为捆绑包的详细信息，请参见<link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">将 Helm Chart 转换为捆绑包</link>。

source: Deploy the <literal>Bundle</literal>. This can be done in one of two ways:
es: Despliegue el <literal>Bundle</literal>. Puede hacerlo de dos formas:
ja: <literal>バンドル</literal>をデプロイします。これは次の2つの方法のいずれかで実行できます。
pt_br: Implante o <literal>Bundle</literal>. É possível fazer isso de uma destas maneiras:
zh_cn: 通过以下方式之一部署<literal>捆绑包</literal>：

source: Through Rancher’s UI - Navigate to <emphasis role="strong">Continuous Delivery → Advanced → Bundles → Create from YAML</emphasis> and either paste the <literal>bundle.yaml</literal> contents, or click the <literal>Read from File</literal> option and pass the file itself.
es: Mediante la interfaz de usuario de Rancher: seleccione <emphasis role="strong">Continuous Delivery → Advanced → Bundles → Create from YAML</emphasis> (Entrega continua → Avanzado → Bundles → Crear desde YAML) y pegue el contenido de <literal>bundle.yaml</literal> o haga clic en la opción <literal>Read from File</literal> (Leer desde archivo) y pase el archivo.
ja: RancherのUIを通じて - <emphasis role="strong">［Continuous Delivery (継続的デリバリ)］→［Advanced (詳細)］→［Bundles (バンドル)］ → ［Create from YAML (YAMLから作成)］</emphasis>に移動して、<literal>bundle.yaml</literal> コンテンツを解析するか、［<literal>Read from File (ファイルから読み取り)</literal>］オプションをクリックして、ファイル自体を渡します。
pt_br: Pela IU do Rancher: navegue até <emphasis role="strong">Continuous Delivery → Advanced → Bundles → Create from YAML</emphasis> (Entrega contínua → Avançado → Bundles → Criar do YAML) e cole o conteúdo do <literal>bundle.yaml</literal> ou clique na opção <literal>Read from File</literal> (Ler arquivo) e especifique o arquivo.
zh_cn: 通过 Rancher UI - 导航到 <emphasis role="strong">Continuous Delivery（持续交付）→ Advanced（高级）→ Bundles（捆绑包）→ Create from YAML（基于 YAML 创建）</emphasis>，然后粘贴 <literal>bundle.yaml</literal> 内容，或单击 <literal>Read from File</literal>（从文件读取）选项并传递文件。

source: Manually - Deploy the <literal>bundle.yaml</literal> file manually inside of your <literal>management cluster</literal>.
es: Manualmente: despliegue el archivo <literal>bundle.yaml</literal> manualmente dentro de su <literal>clúster de gestión</literal>.
ja: 手動 - <literal>管理クラスタ</literal>内に<literal>bundle.yaml</literal>ファイルを手動でデプロイします。
pt_br: Manualmente: implante o arquivo <literal>bundle.yaml</literal> manualmente no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动 - 在<literal>管理群集</literal>内手动部署 <literal>bundle.yaml</literal> 文件。

source: Executing these steps will result in a successfully deployed <literal>GitRepo/Bundle</literal> resource. The resource will be picked up by Fleet and its contents will be deployed onto the target clusters that the user has specified in the previous steps. For an overview of the process, refer to <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>.
es: Al ejecutar estos pasos, se desplegará correctamente el recurso <literal>GitRepo/Bundle</literal>. Fleet recogerá el recurso y su contenido se desplegará en los clústeres de destino que el usuario haya especificado en los pasos anteriores. Para obtener una descripción general del proceso, consulte la <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>.
ja: これらの手順を実行すると、正常に<literal>GitRepo/バンドル</literal>リソースがデプロイされます。リソースはFleetによって取得され、そのコンテンツはユーザが以前の手順で指定したターゲットクラスタにデプロイされます。プロセスの概要については、<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>を参照してください。
pt_br: A execução dessas etapas resulta na implantação bem-sucedida do recurso <literal>GitRepo/Bundle</literal>. O Fleet seleciona o recurso e seu conteúdo é implantado nos clusters de destino que o usuário especificou nas etapas anteriores. Para obter uma visão geral do processo, consulte a <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>.
zh_cn: 执行这些步骤可成功部署 <literal>GitRepo/捆绑包</literal>资源。资源将由 Fleet 拾取，且其内容将部署到用户在之前的步骤中指定的目标群集上。有关该过程的概述，请参见<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>。

source: For information on how to track the upgrade process, you can refer to <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>.
es: Para obtener información sobre cómo realizar un seguimiento del proceso de actualización, consulte la <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>.
ja: アップグレードプロセスの追跡方法については、<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>を参照してください。
pt_br: Para obter informações sobre como acompanhar o processo de upgrade, consulte a <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>.
zh_cn: 有关如何跟踪升级过程的信息，请参见<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>。

source: Once the chart upgrade has been successfully verified, remove the <literal>Bundle/GitRepo</literal> resource.
es: Cuando haya verificado que el chart se ha actualizado correctamente, elimine el recurso <literal>Bundle/GitRepo</literal>.
ja: チャートアップグレードが正常に確認されたら、<literal>バンドル/GitRepo</literal>リソースを削除します。
pt_br: Após a verificação bem-sucedida da atualização do gráfico, remova o recurso <literal>Bundle/GitRepo</literal>.
zh_cn: 成功验证 chart 升级后，去除<literal>捆绑包/GitRepo</literal> 资源。

source: This will remove the no longer necessary upgrade resources from your <literal>management</literal> cluster, ensuring that no future version clashes might occur.
es: Esto eliminará los recursos de actualización que ya no son necesarios del clúster de <literal>gestión</literal>, lo que garantizará que no se produzcan conflictos entre versiones en el futuro.
ja: これにより、<literal>管理</literal>クラスタから不要になったアップグレードリソースが削除され、今後バージョンクラッシュが発生しないようになります。
pt_br: Isso removerá os recursos de upgrade que não são mais necessários do cluster de <literal>gerenciamento</literal>, garantindo que não haja conflitos com versões futuras.
zh_cn: 这将从<literal>管理</literal>群集中去除不再需要的升级资源，确保将来不会发生版本冲突。

source: Example
es: Ejemplo
ja: 例
pt_br: Exemplo
zh_cn: 示例

source: The example below demonstrates how to upgrade a Helm chart deployed via <literal>EIB</literal> from one version to another on a <literal>management</literal> cluster. Note that the versions used in this example are <emphasis role="strong">not</emphasis> recommendations. For version recommendations specific to an Edge release, refer to the release notes (<xref linkend="release-notes"/>).
es: El siguiente ejemplo muestra cómo actualizar un chart de Helm desplegado mediante <literal>EIB</literal> de una versión a otra en un clúster de <literal>gestión</literal>. Tenga en cuenta que las versiones utilizadas en este ejemplo <emphasis role="strong">no</emphasis> son recomendaciones. Para obtener recomendaciones de versiones específicas para una versión de Edge, consulte las notas de la versión (<xref linkend="release-notes"/>).
ja: 以下の例は、<literal>管理</literal>クラスタ上で、<literal>EIB</literal>を介してデプロイされたHelmチャートを、あるバージョンから別のバージョンにアップグレードする方法を示しています。この例で使用されているバージョンは、推奨バージョン<emphasis role="strong">ではない</emphasis>ことに注意してください。Edgeリリースに固有のバージョン推奨事項については、リリースノート(<xref linkend="release-notes"/>)を参照してください。
pt_br: No exemplo a seguir, demonstramos como fazer upgrade de um gráfico Helm implantado pelo <literal>EIB</literal> de uma versão para outra em um cluster de <literal>gerenciamento</literal>. Observe que as versões usadas neste exemplo <emphasis role="strong">não</emphasis> são recomendações. Para recomendações de versão específicas a um lançamento do Edge, consulte as Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: 以下示例展示了如何在<literal>管理</literal>群集上将通过 <literal>EIB</literal> 部署的 Helm chart 从一个版本升级到另一个版本。请注意，本示例中使用的版本<emphasis role="strong">并非</emphasis>推荐版本。有关特定 Edge 版本的推荐版本，请参见发行说明（<xref linkend="release-notes"/>）。

source: <emphasis>Use-case:</emphasis>
es: <emphasis>Caso práctico:</emphasis>
ja: <emphasis>ユースケース:</emphasis>
pt_br: <emphasis>Caso de uso:</emphasis>
zh_cn: <emphasis>使用场景：</emphasis>

source: A <literal>management</literal> cluster is running an older version of <link xl:href="https://longhorn.io">Longhorn</link>.
es: Se ejecuta un clúster de <literal>gestión</literal> en una versión anterior de <link xl:href="https://longhorn.io">Longhorn</link>.
ja: <literal>管理</literal>クラスタで、古いバージョンの<link xl:href="https://longhorn.io">Longhorn</link>が実行されています。
pt_br: Um cluster de <literal>gerenciamento</literal> que executa uma versão mais antiga do <link xl:href="https://longhorn.io">Longhorn</link>.
zh_cn: 某<literal>管理</literal>群集正在运行旧版 <link xl:href="https://longhorn.io">Longhorn</link>。

source: The cluster has been deployed through EIB, using the following image definition <emphasis>snippet</emphasis>:
es: El clúster se ha desplegado mediante EIB, utilizando el siguiente <emphasis>fragmento</emphasis> de definición de imagen:
ja: クラスタは、次のイメージ定義<emphasis>スニペット</emphasis>を使用して、EIBを通じてデプロイされました。
pt_br: O cluster foi implantado pelo EIB usando o seguinte <emphasis>trecho</emphasis> de definição da imagem:
zh_cn: 已使用以下映像定义<emphasis>代码段</emphasis>通过 EIB 部署群集：

source: <literal>SUSE Storage</literal> needs to be upgraded to a version that is compatible with the Edge 3.4 release. Meaning it needs to be upgraded to <literal>107.0.0+up1.9.1</literal>.
es: <literal>SUSE Storage</literal> debe actualizarse a una versión compatible con la versión Edge 3.4. Esto significa que debe actualizarse a <literal>107.0.0+up1.9.1</literal>.
ja: <literal>SUSE Storage</literal>は、Edge 3.4リリースと互換性のあるバージョンにアップグレードする必要があります。つまり、<literal>107.0.0+up1.9.1</literal>にアップグレードする必要があります。
zh_cn: <literal>SUSE Storage</literal> 需要升级到与 Edge 3.4 版兼容的版本。这意味着它需要升级到 <literal>107.0.0+up1.9.1</literal>。

source: It is assumed that the <literal>management cluster</literal> is <emphasis role="strong">air-gapped</emphasis>, without support for a local Git server and has a working Rancher setup.
es: Se entiende que el <literal>clúster de gestión</literal> está <emphasis role="strong">aislado</emphasis>, sin asistencia para un servidor Git local y con una configuración de Rancher operativa.
ja: <literal>管理クラスタ</literal>がローカルGitサーバのサポートなしで<emphasis role="strong">エアギャップ</emphasis>されており、Rancherセットアップが動作していることを前提としています。
pt_br: Presume-se que o <literal>cluster de gerenciamento</literal> seja <emphasis role="strong">air-gapped</emphasis>, sem suporte a servidor Git local e com uma instalação ativa do Rancher.
zh_cn: 假设<literal>管理群集</literal>是<emphasis role="strong">隔离式</emphasis>群集，不支持本地 Git 服务器，并且具有有效的 Rancher 设置。

source: Follow the Upgrade Steps (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>):
es: Siga los pasos de actualización (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>):
ja: アップグレード手順(<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>)に従います。
pt_br: Siga as etapas de upgrade (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>):
zh_cn: 按照升级步骤（<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>）进行操作：

source: Clone the <literal>suse-edge/fleet-example</literal> repository from the <literal>release-3.4.0</literal> tag.
es: Clone el repositorio <literal>suse-edge/fleet-example</literal> desde la etiqueta <literal>release-3.4.0</literal>.
ja: <literal>release-3.4.0</literal>タグから<literal>suse-edge/fleet-example</literal>リポジトリのクローンを作成します。
zh_cn: 从 <literal>release-3.4.0</literal> 标记处克隆 <literal>suse-edge/fleet-example</literal> 储存库。

source: Create a directory where the <literal>Longhorn</literal> upgrade archive will be stored.
es: Cree un directorio donde se almacenará el archivo de actualización de <literal>Longhorn</literal>.
ja: <literal>Longhorn</literal>アップグレードアーカイブが保存されるディレクトリを作成します。
pt_br: Crie um diretório para armazenar o arquivo de upgrade do <literal>Longhorn</literal>.
zh_cn: 创建用于存储 <literal>Longhorn</literal> 升级归档的目录。

source: Pull the desired <literal>Longhorn</literal> chart archive version:
es: Extraiga la versión del archivo de chart de <literal>Longhorn</literal> deseada:
ja: 目的の<literal>Longhorn</literal>チャートアーカイブバージョンを取得します。
pt_br: Extraia a versão desejada do arquivo de gráficos do <literal>Longhorn</literal>:
zh_cn: 提取所需的 <literal>Longhorn</literal> chart 归档版本：

source: Outside of the <literal>archives</literal> directory, download the <literal>generate-chart-upgrade-data.sh</literal> script from the <literal>suse-edge/fleet-examples</literal> release <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">tag</link>.
es: Fuera del directorio <literal>archives</literal>, descargue el guion <literal>generate-chart-upgrade-data.sh</literal> de la <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">etiqueta</link> de la versión <literal>suse-edge/fleet-examples</literal>.
ja: <literal>archives</literal>ディレクトリ以外で、<literal>suse-edge/fleet-examples</literal>リリース<link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">タグ</link>から<literal>generate-chart-upgrade-data.sh</literal>スクリプトをダウンロードします。
zh_cn: 在 <literal>archives</literal> 目录之外，从 <literal>suse-edge/fleet-examples</literal> 版本<link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">标记</link>处下载 <literal>generate-chart-upgrade-data.sh</literal> 脚本。

source: Directory setup should look similar to:
es: La configuración del directorio debería ser similar a:
ja: ディレクトリセットアップは次のようになるはずです。
pt_br: A configuração do diretório deve ter uma aparência como esta:
zh_cn: 目录设置如下所示：

source: The directory structure after the script execution should look similar to:
es: La estructura del directorio tras la ejecución del guion debería ser similar a esto:
ja: スクリプト実行後のディレクトリ構造は次のようになるはずです。
pt_br: A estrutura de diretórios após a execução do script deve ser parecida com esta:
zh_cn: 脚本执行后的目录结构如下所示：

source: The files changed in git should look like this:
es: Los archivos modificados en Git deberían tener este aspecto:
ja: Gitで変更されたファイルは次のようになるはずです。
pt_br: Os arquivos alterados no Git devem ter aparência similar a esta:
zh_cn: git 中更改的文件如下所示：

source: Create a <literal>Bundle</literal> for the <literal>eib-charts-upgrader</literal> Fleet:
es: Cree un <literal>Bundle</literal> para la flota <literal>eib-charts-upgrader</literal>:
ja: <literal>eib-charts-upgrader</literal> Fleetの<literal>バンドル</literal>を作成します。
pt_br: Crie um <literal>Bundle</literal> para a instância do Fleet <literal>eib-charts-upgrader</literal>:
zh_cn: 为 <literal>eib-charts-upgrader</literal> Fleet 创建<literal>捆绑包</literal>：

source: First, navigate to the Fleet itself:
es: En primer lugar, diríjase a la flota:
ja: まず、Fleet自体に移動します。
pt_br: Primeiro, navegue até o Fleet:
zh_cn: 首先，导航到 Fleet：

source: Then create a <literal>targets.yaml</literal> file:
es: A continuación, cree un archivo <literal>targets.yaml</literal>:
ja: 次に、<literal>targets.yaml</literal>ファイルを作成します。
pt_br: Em seguida, crie um arquivo <literal>targets.yaml</literal>:
zh_cn: 然后创建 <literal>targets.yaml</literal> 文件：
