Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Summary: SUSE Edge 3.3.0 is the first release in the SUSE Edge 3.3 release stream.
pt_br: Resumo: SUSE Edge 3.3.0 é a primeira versão no fluxo de versões do SUSE Edge 3.3.

source: Updated to Kubernetes 1.32, and Rancher Prime 2.11
pt_br: Atualizado para o Kubernetes 1.32 e o Rancher Prime 2.11

source: Updated Operating System to <link xl:href="https://documentation.suse.com/sle-micro/6.1">SUSE Linux Micro 6.1</link>
pt_br: Sistema operacional atualizado para o <link xl:href="https://documentation.suse.com/sle-micro/6.1">SUSE Linux Micro 6.1</link>

source: A container image is now provided which enables building updated SUSE Linux Micro images. See <xref linkend="guides-kiwi-builder-images"/> for more details.
pt_br: Agora uma imagem do contêiner é fornecida para criar imagens atualizadas do SUSE Linux Micro. Consulte o <xref linkend="guides-kiwi-builder-images"/> para obter mais detalhes.

source: Deployment of AArch64 downstream clusters is now possible via the directed network provisioning flow. See <xref linkend="atip-automated-provisioning"/> for more details.
pt_br: Agora a implantação de clusters downstream AArch64 é possível pelo fluxo de provisionamento de rede direcionado. Consulte o <xref linkend="atip-automated-provisioning"/> para obter mais detalhes.

source: Deployment of dual-stack downstream clusters is now possible via the directed network provisioning flow as a technology preview.
pt_br: Agora a implantação de clusters downstream de pilha dupla é possível por meio do fluxo de provisionamento de rede direcionado como prévia de tecnologia.

source: Configuration of Precision Time Protocol (PTP) is now possible as a technology preview. See <xref linkend="tech-previews"/> for more details.
pt_br: Agora a configuração do Precision Time Protocol (PTP) é possível como prévia de tecnologia. Consulte a <xref linkend="tech-previews"/> para obter mais detalhes.

source: Addresses <link xl:href="https://nvd.nist.gov/vuln/detail/CVE-2025-1974">CVE-2025-1974</link> with patches for ingress-nginx in RKE2. More information available <link xl:href="https://kubernetes.io/blog/2025/03/24/ingress-nginx-cve-2025-1974/">here</link>.
pt_br: Endereços <link xl:href="https://nvd.nist.gov/vuln/detail/CVE-2025-1974">CVE-2025-1974</link> com patches para ingress-nginx no RKE2. Há mais informações disponíveis <link xl:href="https://kubernetes.io/blog/2025/03/24/ingress-nginx-cve-2025-1974/">aqui</link>.

source: SUSE Storage (Longhorn) 1.8.1 contains several bugfixes, including
pt_br: SUSE Storage (Longhorn) 1.8.1 com várias correções de bugs, incluindo:

source: Fix volume FailedMount issue which can cause volume attachment to fail <link xl:href="https://github.com/longhorn/longhorn/issues/9939">Upstream Longhorn Issue</link>
pt_br: Correção do problema de volume FailedMount que pode provocar falha no anexo de volume <link xl:href="https://github.com/longhorn/longhorn/issues/9939">Problema do Longhorn upstream</link>

source: Fix engine stuck in stopped state issue which can prevent volume attachment <link xl:href="https://github.com/longhorn/longhorn/issues/9938">Upstream Longhorn Issue</link>
pt_br: Correção do problema do mecanismo travado no estado parado que pode impedir o anexo de volume <link xl:href="https://github.com/longhorn/longhorn/issues/9938">Problema do Longhorn upstream</link>

source: The Metal<superscript>3</superscript> chart update contains several bugfixes, including
pt_br: A atualização do gráfico do Metal<superscript>3</superscript> contém várias correções de bugs, incluindo:

source: A bug when deploying clusters with static IPs in networks with DHCP servers has been resolved <link xl:href="https://github.com/suse-edge/charts/pull/196">Upstream Issue</link>
pt_br: Foi resolvido um bug ao implantar clusters com IPs estáticos nas redes com servidores DHCP <link xl:href="https://github.com/suse-edge/charts/pull/196">Problema upstream</link>

source: The MetalLB chart contains a fix to ensure downstream images are used when frr-k8s is enabled
pt_br: O gráfico do MetalLB contém uma correção para garantir o uso das imagens downstream quando frr-k8s estiver habilitado

source: The Kiwi Builder has been updated to 10.2.12 to match recent security changes in Kiwi, shifting from <link xl:href="https://github.com/OSInside/kiwi/commit/d4d39e481aaff8be28337a9c76c3913a8a482628">md5 to sha256 checksum methods</link> for image verification.
pt_br: O construtor Kiwi foi atualizado para a versão 10.2.12 para se adequar às alterações de segurança recentes no Kiwi, mudando dos <link xl:href="https://github.com/OSInside/kiwi/commit/d4d39e481aaff8be28337a9c76c3913a8a482628">métodos de checksum md5 para sha256</link> para verificação de imagens.

source: The Edge Image Builder image has been rebuilt to include the updated MetalLB release and address the Kiwi changes, both mentioned above.
pt_br: A imagem do Edge Image Builder foi recriada para incluir a versão atualizada do MetalLB e abordar as alterações do Kiwi, ambas mencionadas acima.

source: In some cases when using a management cluster that has been upgraded from Edge 3.2, downstream rolling upgrades via CAPI can result in Machines stuck in Deleting state, this will be resolved via a future update <link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/661">Upstream RKE2 provider issue 661</link>
pt_br: Em alguns casos, ao usar um cluster de gerenciamento que foi atualizado do Edge 3.2, os upgrades downstream contínuos feitos via CAPI podem fazer com que as máquinas fiquem travadas no estado "em exclusão". Isso será resolvido com uma atualização futura (<link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/661">Upstream RKE2 provider issue 661</link>)

source: When using RKE2 1.32.3, which resolves <link xl:href="https://nvd.nist.gov/vuln/detail/CVE-2025-1974">CVE-2025-1974</link>, SUSE Linux Micro 6.1 <emphasis role="strong">must</emphasis> be updated to include kernel <literal>&gt;=6.4.0-26-default</literal> or <literal>&gt;=6.4.0-30-rt</literal> (real-time kernel) due to required SELinux kernel patches. If not applied, the ingress-nginx pod will remain in a <literal>CrashLoopBackOff</literal> state. To apply the kernel update run <literal>transactional-update</literal> on the host itself (to update all packages), or <literal>transactional-update pkg update kernel-default</literal> (or kernel-rt) to update just the kernel, then reboot the host. If deploying new clusters, please follow <xref linkend="guides-kiwi-builder-images"/> to build fresh images containing the latest kernel.
pt_br: Ao usar o RKE2 1.32.3, que é resolvido como <link xl:href="https://nvd.nist.gov/vuln/detail/CVE-2025-1974">CVE-2025-1974</link>, o SUSE Linux Micro 6.1 <emphasis role="strong">deve</emphasis> ser atualizado para incluir o kernel <literal>&gt;=6.4.0-26-default</literal> ou <literal>&gt;=6.4.0-30-rt</literal> (kernel real-time) por causa dos patches de kernel obrigatórios do SELinux. Se não forem aplicados, o pod ingress-nginx continuará no estado <literal>CrashLoopBackOff</literal>. Para aplicar a atualização do kernel, execute <literal>transactional-update</literal> no próprio host (para atualizar todos os pacotes), ou <literal>transactional-update pkg update kernel-default</literal> (ou kernel-rt) para atualizar apenas o kernel e, em seguida, reinicialize o host. Se estiver implantando novos clusters, siga o <xref linkend="guides-kiwi-builder-images"/> para criar novas imagens com o kernel mais recente.

source: When configuring networking via nm-congfigurator, certain configurations which identify interfaces by MAC currently do not work, this will be resolved in a future update <link xl:href="https://github.com/suse-edge/nm-configurator/issues/163">Upstream NM Configurator Issue</link>
pt_br: Ao configurar a rede via nm-congfigurator, determinadas configurações que identificam as interfaces por MAC atualmente não funcionam, o que será resolvido em uma atualização futura <link xl:href="https://github.com/suse-edge/nm-configurator/issues/163">Problema no NM Configurator upstream</link>

source: For long running Metal<superscript>3</superscript> management clusters, it is possible for certificate expiry to cause the baremetal-operator connection to ironic to fail, requiring a workaround of a manual pod restart <link xl:href="https://github.com/suse-edge/charts/issues/178">SUSE Edge charts issue</link>
pt_br: Nos clusters de gerenciamento Metal<superscript>3</superscript> de longa execução, o vencimento do certificado pode provocar falha na conexão do operador bare metal com o Ironic, exigindo como solução alternativa a reinicialização manual do pod <link xl:href="https://github.com/suse-edge/charts/issues/178">Problema nos gráficos do SUSE Edge</link>

source: The following table describes the individual components that make up the 3.3.0 release, including the version, the Helm chart version (if applicable), and from where the released artifact can be pulled in the binary format. Please follow the associated documentation for usage and deployment examples.
pt_br: A tabela a seguir descreve os componentes individuais que compõem o lançamento 3.3.0, incluindo a versão, a versão do gráfico Helm (se aplicável) e de onde obter o artefato lançado no formato binário. Consulte a documentação associada para ver exemplos de uso e implantação.

source: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.32.3%2Bk3s1">Upstream K3s Release</link>
pt_br: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.32.3%2Bk3s1">Versões upstream do K3s</link>

source: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.32.3%2Brke2r1">Upstream RKE2 Release</link>
pt_br: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.32.3%2Brke2r1">Versão upstream do RKE2</link>

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.7.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v4.0.1-20241007<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.12.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v7.0.2-20241007<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.12.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.14.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.45<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.7.2<?asciidoc-br?>
pt_br: <link xl:href="https://charts.rancher.io/index.yaml">Repositório de gráficos Helm do Rancher</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.7.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v4.0.1-20241007<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.12.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v7.0.2-20241007<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.12.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.14.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.7.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.45<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.7.2<?asciidoc-br?>

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/neuvector-controller:5.4.3<?asciidoc-br?> registry.suse.com/rancher/neuvector-enforcer:5.4.3<?asciidoc-br?> registry.suse.com/rancher/neuvector-manager:5.4.3<?asciidoc-br?> registry.suse.com/rancher/neuvector-compliance-config:1.0.4<?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> registry.suse.com/rancher/neuvector-updater:0.0.2
pt_br: <link xl:href="https://charts.rancher.io/index.yaml">Repositório de gráficos Helm do Rancher</link><?asciidoc-br?> registry.suse.com/rancher/neuvector-controller:5.4.3<?asciidoc-br?> registry.suse.com/rancher/neuvector-enforcer:5.4.3<?asciidoc-br?> registry.suse.com/rancher/neuvector-manager:5.4.3<?asciidoc-br?> registry.suse.com/rancher/neuvector-compliance-config:1.0.4<?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> registry.suse.com/rancher/neuvector-updater:0.0.2

source: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.2">NMConfigurator Upstream Release</link>
pt_br: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.2">Versão upstream do NMConfigurator</link>

source: Unless otherwise stated, these apply to the 3.3.0 release and all subsequent z-stream versions.
pt_br: Exceto se especificado de outra forma, elas são aplicáveis à versão 3.3.0 e a todas as versões z-stream subsequentes.

source: Akri is a Technology Preview offering and is not subject to the standard scope of support.
pt_br: Akri é uma oferta de prévia de tecnologia e não está sujeita ao escopo padrão de suporte.

source: IPv6 and dual-stack downstream deployments are a Technology Preview offering and are not subject to the standard scope of support.
pt_br: As implantações downstream IPv6 e de pilha dupla são uma oferta de prévia de tecnologia e não estão sujeitas ao escopo padrão de suporte.

source: SUSE Edge "3.3" is supported for 18-months of production support, with an initial 6-months of "full support", followed by 12-months of "maintenance support". After these support phases the product reaches "end of life" (EOL) and is no longer supported. More info about the lifecycle phases can be found in the table below:
pt_br: O SUSE Edge "3.3" tem suporte de produção de 18 meses, com os primeiros 6 meses de "suporte completo", seguidos de 12 meses de "suporte de manutenção". Após essas fases de suporte, o produto chega ao "fim do serviço" (EOL, End of Life) e não é mais suportado. Encontre mais informações sobre as fases do ciclo de vida na tabela abaixo:

source: <emphasis role="strong">Maintenance Support (12 months)</emphasis>
pt_br: <emphasis role="strong">Suporte de manutenção (12 meses)</emphasis>
