Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: An external media server can be used to store the images, and in the case you want to use it with TLS, you will need to modify the following configurations:
es: Se puede utilizar un servidor de medios externo para almacenar las imágenes y, en caso de que desee usarlo con TLS, deberá modificar las siguientes configuraciones:
ja: 外部のメディアサーバを使用してイメージを保存できます。外部のメディアサーバをTLSで使用する場合は、次の設定を変更する必要があります。
pt_br: É possível usar um servidor de mídia externo para armazenar as imagens e, caso você queira usá-lo com TLS, precisará modificar as seguintes configurações:
zh_cn: 可以使用外部媒体服务器来存储映像，如果您要将该服务器与 TLS 配合使用，则需要修改以下配置：

source: set to <literal>true</literal> the <literal>additionalTrustedCAs</literal> in the previous <literal>metal3.yaml</literal> file to enable the additional trusted CAs from the external media server.
es: Defina <literal>true</literal> en <literal>additionalTrustedCAs</literal> en el archivo <literal>metal3.yaml</literal> anterior para habilitar las CA de confianza adicionales del servidor de medios externo.
ja: 前の<literal>metal3.yaml</literal>ファイルで<literal>additionalTrustedCAs</literal>を<literal>true</literal>に設定し、外部のメディアサーバから、信頼できる追加のCAを有効にします。
pt_br: defina <literal>additionalTrustedCAs</literal> como <literal>true</literal> no arquivo <literal>metal3.yaml</literal> anterior para permitir as CAs confiáveis adicionais do servidor de mídia externo.
zh_cn: 将前面所述 <literal>metal3.yaml</literal> 文件中的 <literal>additionalTrustedCAs</literal> 设置为 <literal>true</literal>，以启用来自外部媒体服务器的附加可信 CA。

source: include the following secret configuration in the folder <literal>kubernetes/manifests/metal3-cacert-secret.yaml</literal> to store the CA certificate of the external media server.
es: Incluya la siguiente configuración de secreto en la carpeta <literal>kubernetes/manifests/metal3-cacert-secret.yaml</literal> para almacenar el certificado de CA del servidor de medios externo.
ja: <literal>kubernetes/manifests/metal3-cacert-secret.yaml</literal>フォルダに次のシークレット設定を含めて、外部のメディアサーバのCA証明書を保存します。
pt_br: inclua a seguinte configuração de segredo na pasta <literal>kubernetes/manifests/metal3-cacert-secret.yaml</literal> para armazenar o certificado CA do servidor de mídia externo.
zh_cn: 在 <literal>kubernetes/manifests/metal3-cacert-secret.yaml</literal> 文件夹中包含以下机密配置，以存储外部媒体服务器的 CA 证书。

source: The <literal>additional_ca_cert</literal> is the base64-encoded CA certificate of the external media server. You can use the following command to encode the certificate and generate the secret doing manually:
es: <literal>additional_ca_cert</literal> es el certificado de CA cifrado en base64 del servidor de medios externo. Puede usar el siguiente comando para cifrar el certificado y generar el secreto manualmente:
ja: <literal>additional_ca_cert</literal>は、外部のメディアサーバのbase64エンコードCA証明書です。次のコマンドを使用し、証明書をエンコードして手動でシークレットを生成できます。
pt_br: O <literal>additional_ca_cert</literal> é o certificado CA codificado em base64 do servidor de mídia externo. É possível usar o seguinte comando para codificar o certificado e gerar o segredo manualmente:
zh_cn: <literal>additional_ca_cert</literal> 是外部媒体服务器的 base64 编码 CA 证书。可使用以下命令对证书进行编码并手动生成机密：

source: <literal>certmanager.yaml</literal>: contains the configuration to create the <literal>Cert-Manager</literal> component (no modifications needed).
es: <literal>certmanager.yaml</literal>: contiene la configuración para crear el componente <literal>Cert-Manager</literal> (no es necesario modificarlo).
ja: <literal>certmanager.yaml</literal>: <literal>Cert-Manager</literal>コンポーネントを作成するための設定が含まれます(変更不要)。
pt_br: <literal>certmanager.yaml</literal>: contém a configuração para criar o componente <literal>Cert-Manager</literal> (sem necessidade de modificação).
zh_cn: <literal>certmanager.yaml</literal>：包含用于创建 <literal>Cert-Manager</literal> 组件的配置（无需修改）。

source: Networking folder
es: Carpeta network
ja: ネットワーキングフォルダ
pt_br: Pasta de rede
zh_cn: Network 文件夹

source: The <literal>network</literal> folder contains as many files as nodes in the management cluster. In our case, we have only one node, so we have only one file called <literal>mgmt-cluster-node1.yaml</literal>. The name of the file must match the host name defined in the <literal>mgmt-cluster.yaml</literal> definition file into the network/node section described above.
es: La carpeta <literal>network</literal> contiene tantos archivos como nodos haya en el clúster de gestión. En nuestro caso, solo tenemos un nodo, por lo que solo tenemos un archivo llamado <literal>mgmt-cluster-node1.yaml</literal>. El nombre del archivo debe coincidir con el nombre de host definido en el archivo de definición <literal>mgmt-cluster.yaml</literal> en la sección network/node descrita anteriormente.
ja: <literal>network</literal>フォルダには、管理クラスタのノードと同じ数のファイルが含まれます。ここでは、ノードは1つのみであるため、<literal>mgmt-cluster-node1.yaml</literal>というファイルが1つあるだけです。ファイルの名前は、上述のnetwork/nodeセクションで<literal>mgmt-cluster.yaml</literal>定義ファイルに定義されているホスト名と一致させる必要があります。
pt_br: A pasta <literal>network</literal> contém o mesmo número de arquivos e nós no cluster de gerenciamento. Em nosso caso, temos apenas um nó, portanto, temos somente um arquivo chamado <literal>mgmt-cluster-node1.yaml</literal>. O nome do arquivo deve ser igual ao nome de host especificado no arquivo de definição <literal>mgmt-cluster.yaml</literal> incluído na seção network/node descrita acima.
zh_cn: <literal>Network</literal> 文件夹中的文件数量与管理群集中的节点数量相同。在本例中，我们只有一个节点，因此此文件夹中只有一个文件，名为 <literal>mgmt-cluster-node1.yaml</literal>。该文件的名称必须与 <literal>mgmt-cluster.yaml</literal> 定义文件的上述 network/node 部分中定义的主机名一致。

source: If you need to customize the networking configuration, for example, to use a specific static IP address (DHCP-less scenario), you can use the <literal>mgmt-cluster-node1.yaml</literal> file under the <literal>network</literal> folder. It contains the following information:
es: Si necesita personalizar la configuración de red, por ejemplo, para utilizar una dirección IP estática específica (si no se usa DHCP), puede utilizar el archivo <literal>mgmt-cluster-node1.yaml</literal> que se encuentra en la carpeta <literal>network</literal>. Contiene la siguiente información:
ja: ネットワーキング設定をカスタマイズして特定の静的IPアドレスを使用する必要がある場合(たとえばDHCPを使用しないシナリオの場合)、<literal>network</literal>フォルダにある<literal>mgmt-cluster-node1.yaml</literal>ファイルを使用できます。このファイルには次の情報が含まれます。
pt_br: Se você precisa personalizar a configuração de rede, por exemplo, para usar um endereço IP estático específico (cenário sem DHCP), use o arquivo <literal>mgmt-cluster-node1.yaml</literal> na pasta <literal>network</literal>, que contém as seguintes informações:
zh_cn: 如果您需要自定义网络配置，例如要使用特定的静态 IP 地址（无 DHCP 的方案），可以使用 <literal>network</literal> 文件夹中的 <literal>mgmt-cluster-node1.yaml</literal> 文件。该文件包含以下信息：

source: <literal>${MGMT_GATEWAY}</literal>: The gateway IP address.
es: <literal>${MGMT_GATEWAY}</literal>: la dirección IP del gateway.
ja: <literal>${MGMT_GATEWAY}</literal>: ゲートウェイのIPアドレス。
pt_br: <literal>${MGMT_GATEWAY}</literal>: o endereço IP do gateway.
zh_cn: <literal>${MGMT_GATEWAY}</literal>：网关 IP 地址。

source: <literal>${MGMT_DNS}</literal>: The DNS server IP address.
es: <literal>${MGMT_DNS}</literal>: la dirección IP del servidor DNS.
ja: <literal>${MGMT_DNS}</literal>: DNSサーバのIPアドレス。
pt_br: <literal>${MGMT_DNS}</literal>: o endereço IP do servidor DNS.
zh_cn: <literal>${MGMT_DNS}</literal>：DNS 服务器 IP 地址。

source: <literal>${MGMT_MAC}</literal>: The MAC address of the network interface.
es: <literal>${MGMT_MAC}</literal>: la dirección MAC de la interfaz de red.
ja: <literal>${MGMT_MAC}</literal>: ネットワークインタフェースのMACアドレス。
pt_br: <literal>${MGMT_MAC}</literal>: o endereço MAC da interface de rede.
zh_cn: <literal>${MGMT_MAC}</literal>：网络接口的 MAC 地址。

source: <literal>${MGMT_NODE_IP}</literal>: The IP address of the management cluster.
es: <literal>${MGMT_NODE_IP}</literal>: la dirección IP del clúster de gestión.
ja: <literal>${MGMT_NODE_IP}</literal>: 管理クラスタのIPアドレス。
pt_br: <literal>${MGMT_NODE_IP}</literal>: o endereço IP do cluster de gerenciamento.
zh_cn: <literal>${MGMT_NODE_IP}</literal>：管理群集的 IP 地址。

source: If you want to use DHCP to get the IP address, you can use the following configuration (the <literal>MAC</literal> address must be set properly using the <literal>${MGMT_MAC}</literal> variable):
es: Si desea utilizar DHCP para obtener la dirección IP, puede usar la siguiente configuración (la dirección <literal>MAC</literal> debe configurarse correctamente utilizando la variable <literal>${MGMT_MAC}</literal>):
ja: DHCPを使用してIPアドレスを取得する場合、次の設定を使用できます(<literal>${MGMT_MAC}</literal>変数を使用して、<literal>MAC</literal>アドレスを正しく設定する必要があります)。
pt_br: Para usar DHCP para obter o endereço IP, você pode definir a seguinte configuração (o endereço <literal>MAC</literal> deve ser devidamente definido por meio da variável <literal>${MGMT_MAC}</literal>):
zh_cn: 如果您要使用 DHCP 获取 IP 地址，可使用以下配置（必须使用 <literal>${MGMT_MAC}</literal> 变量正确设置 <literal>MAC</literal> 地址）：

source: Depending on the number of nodes in the management cluster, you can create more files like <literal>mgmt-cluster-node2.yaml</literal>, <literal>mgmt-cluster-node3.yaml</literal>, etc. to configure the rest of the nodes.
es: Dependiendo del número de nodos del clúster de gestión, puede crear más archivos como <literal>mgmt-cluster-node2.yaml</literal>, <literal>mgmt-cluster-node3.yaml</literal>, etc. para configurar el resto de los nodos.
ja: 管理クラスタのノード数に応じて、<literal>mgmt-cluster-node2.yaml</literal>、<literal>mgmt-cluster-node3.yaml</literal>などのように追加のファイルを作成して残りのノードを設定できます。
pt_br: Dependendo do número de nós no cluster de gerenciamento, você poderá criar mais arquivos, como <literal>mgmt-cluster-node2.yaml</literal>, <literal>mgmt-cluster-node3.yaml</literal> etc., para configurar o restante dos nós.
zh_cn: 根据管理群集中的节点数，您可以创建更多文件（例如 <literal>mgmt-cluster-node2.yaml</literal>、<literal>mgmt-cluster-node3.yaml</literal> 等）来配置其余节点。

source: The <literal>routes</literal> section is used to define the routing table for the management cluster.
es: La sección <literal>routes</literal> se utiliza para definir la tabla de enrutamiento del clúster de gestión.
ja: <literal>routes</literal>セクションは、管理クラスタのルーティングテーブルを定義するために使用します。
pt_br: A seção <literal>routes</literal> é usada para definir a tabela de roteamento para o cluster de gerenciamento.
zh_cn: <literal>routes</literal> 部分用于定义管理群集的路由表。

source: Image preparation for air-gap environments
es: Preparación de la imagen para entornos aislados
ja: エアギャップ環境のイメージの準備
pt_br: Preparação da imagem para ambientes air-gapped
zh_cn: 为隔离环境准备映像

source: This section describes how to prepare the image for air-gap environments showing only the differences from the previous sections. The following changes to the previous section (Image preparation for connected environments (<xref linkend="mgmt-cluster-image-preparation-connected"/>)) are required to prepare the image for air-gap environments:
es: En esta sección se describe cómo preparar la imagen para entornos aislados. Muestra solo las diferencias con respecto a las secciones anteriores. Para preparar la imagen para entornos aislados, es necesario realizar los siguientes cambios con respecto a la sección sobre la preparación de imagen en entornos conectados (<xref linkend="mgmt-cluster-image-preparation-connected"/>):
ja: このセクションでは、エアギャップ環境のイメージを準備する方法について説明し、前の各セクションとの相違点のみを示します。エアギャップ環境のイメージを準備するには、前のセクション(接続環境のイメージの準備(<xref linkend="mgmt-cluster-image-preparation-connected"/>))を次のように変更する必要があります。
pt_br: Esta seção descreve como preparar a imagem para ambientes air-gapped mostrando apenas as diferenças das seções anteriores. As seguintes alterações na seção anterior (Preparação da imagem para ambientes conectados (<xref linkend="mgmt-cluster-image-preparation-connected"/>)) são necessárias para preparar a imagem para os ambientes air-gapped:
zh_cn: 本节介绍如何为隔离环境准备映像，其中只说明了与前面几节内容存在的差别。为隔离环境准备映像需要对上一节（为联网环境准备映像（<xref linkend="mgmt-cluster-image-preparation-connected"/>））的内容进行以下更改：

source: The <literal>mgmt-cluster.yaml</literal> file must be modified to include the <literal>embeddedArtifactRegistry</literal> section with the <literal>images</literal> field set to all container images to be included into the EIB output image.
es: El archivo <literal>mgmt-cluster.yaml</literal> debe modificarse para incluir la sección <literal>embeddedArtifactRegistry</literal> con el campo <literal>images</literal> definido con todas las imágenes de contenedor que se incluirán en la imagen de salida de EIB.
ja: <literal>mgmt-cluster.yaml</literal>ファイルを変更して<literal>embeddedArtifactRegistry</literal>セクションを含め、<literal>images</literal>フィールドに、EIB出力イメージに組み込むすべてのコンテナイメージを設定する必要があります。
pt_br: É necessário modificar o arquivo <literal>mgmt-cluster.yaml</literal> para incluir a seção <literal>embeddedArtifactRegistry</literal> com o campo <literal>images</literal> definido para que todas as imagens do contêiner sejam incluídas na imagem de saída do EIB.
zh_cn: 必须修改 <literal>mgmt-cluster.yaml</literal> 文件，以包含 <literal>embeddedArtifactRegistry</literal> 部分，并将 <literal>images</literal> 字段设置为要包含在 EIB 输出映像中的所有容器映像。

source: The <literal>mgmt-cluster.yaml</literal> file must be modified to include <literal>rancher-turtles-airgap-resources</literal> helm chart.
es: El archivo <literal>mgmt-cluster.yaml</literal> debe modificarse para incluir el chart de Helm <literal>rancher-turtles-airgap-resources</literal>.
ja: <literal>mgmt-cluster.yaml</literal>ファイルは、 <literal>rancher-turtles-airgap-resources</literal> helmチャートを含むように変更される必要があります。
pt_br: É necessário modificar o arquivo <literal>mgmt-cluster.yaml</literal> para incluir o gráfico Helm <literal>rancher-turtles-airgap-resources</literal>.
zh_cn: 必须修改 <literal>mgmt-cluster.yaml</literal> 文件，以包含 <literal>rancher-turtles-airgap-resources</literal> Helm chart。

source: The <literal>custom/scripts/99-register.sh</literal> script must be removed when use an air-gap environment.
es: El guion <literal>custom/scripts/99-register.sh</literal> debe eliminarse si se utiliza un entorno aislado.
ja: エアギャップ環境を使用する場合、<literal>custom/scripts/99-register.sh</literal>スクリプトは削除する必要があります。
pt_br: É necessário remover o script <literal>custom/scripts/99-register.sh</literal> ao usar um ambiente air-gapped.
zh_cn: 使用隔离环境时，必须去除 <literal>custom/scripts/99-register.sh</literal> 脚本。

source: Modifications in the definition file
es: Modificaciones del archivo de definición
ja: 定義ファイルの変更
pt_br: Modificações no arquivo de definição
zh_cn: 定义文件中的修改

source: The <literal>mgmt-cluster.yaml</literal> file must be modified to include the <literal>embeddedArtifactRegistry</literal> section. In this section the <literal>images</literal> field must contain the list of all container images to be included in the output image.
es: El archivo <literal>mgmt-cluster.yaml</literal> debe modificarse para incluir la sección <literal>embeddedArtifactRegistry</literal>. En ella, el campo <literal>images</literal> debe contener la lista de todas las imágenes de contenedor que se incluirán en la imagen de salida.
ja: <literal>mgmt-cluster.yaml</literal>ファイルを変更して<literal>embeddedArtifactRegistry</literal>セクションを含める必要があります。このセクションで、<literal>images</literal>フィールドには、出力イメージに含めるすべてのコンテナイメージのリストを含める必要があります。
pt_br: É necessário modificar o arquivo <literal>mgmt-cluster.yaml</literal> para incluir a seção <literal>embeddedArtifactRegistry</literal>. Nessa seção, o campo <literal>images</literal> deve conter a lista de todas as imagens do contêiner que serão incluídas na imagem de saída.
zh_cn: 必须修改 <literal>mgmt-cluster.yaml</literal> 文件，以包含 <literal>embeddedArtifactRegistry</literal> 部分。在此部分中，<literal>images</literal> 字段必须设置为要包含在输出映像中的所有容器映像的列表。

source: The following is an example of the <literal>mgmt-cluster.yaml</literal> file with the <literal>embeddedArtifactRegistry</literal> section included. Make sure to the listed images contain the component versions you need.
es: A continuación, se muestra un ejemplo del archivo <literal>mgmt-cluster.yaml</literal> con la sección <literal>embeddedArtifactRegistry</literal> incluida. Asegúrese de que las imágenes indicadas contengan las versiones de los componentes que necesita.
ja: 次に、<literal>embeddedArtifactRegistry</literal>セクションが含まれる<literal>mgmt-cluster.yaml</literal>ファイルの例を示します。リストされているイメージに、必要なコンポーネントのバージョンが含まれていることを確認してください。
pt_br: Veja a seguir um exemplo do arquivo <literal>mgmt-cluster.yaml</literal> com a seção <literal>embeddedArtifactRegistry</literal> incluída. Garanta que as imagens listadas contenham as versões dos componentes necessárias.
zh_cn: 以下是包含 <literal>embeddedArtifactRegistry</literal> 部分的 <literal>mgmt-cluster.yaml</literal> 文件示例。请确保列出的映像包含您所需的组件版本。

source: The <literal>rancher-turtles-airgap-resources</literal> helm chart must also be added, this creates resources as described in the <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/v0.19/en/getting-started/air-gapped-environment.html">Rancher Turtles Airgap Documentation</link>. This also requires a turtles.yaml values file for the rancher-turtles chart to specify the necessary configuration.
es: También se debe añadir el chart de Helm <literal>rancher-turtles-airgap-resources</literal>, que crea los recursos descritos en la <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/v0.19/en/getting-started/air-gapped-environment.html">documentación de Rancher Turtles para entornos aislados</link>. Esto también requiere un archivo de valores turtles.yaml para que el chart de rancher-turtles especifique la configuración necesaria.
ja: <literal>rancher-turtles-airgap-resources</literal> helmチャートは追加される必要もあり、これにより、<link xl:href="https://documentation.suse.com/cloudnative/cluster-api/v0.19/en/getting-started/air-gapped-environment.html">Rancher Turtlesエアギャップドキュメント</link>で説明されているリソースが作成されます。また、必要な設定を指定するために、rancher-turtlesチャート用の turtles.yaml値ファイルも必要です。
pt_br: É necessário também adicionar o gráfico Helm <literal>rancher-turtles-airgap-resources</literal> para criar os recursos conforme descrito na <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/v0.19/en/getting-started/air-gapped-environment.html">documentação do Rancher Turtles sobre ambientes air-gapped</link>. Isso também requer um arquivo de valores turtles.yaml para que o gráfico rancher-turtles especifique a configuração necessária.
zh_cn: 此外，还必须添加 <literal>rancher-turtles-airgap-resources</literal> Helm chart，以创建 <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/v0.19/en/getting-started/air-gapped-environment.html">Rancher Turtles 隔离文档</link>中所述的资源。还需要 rancher-turtles chart 的 turtles.yaml 值文件来指定必要的配置。

source: Modifications in the custom folder
es: Modificaciones de la carpeta custom
ja: カスタムフォルダの変更
pt_br: Modificações na pasta custom
zh_cn: custom 文件夹中的修改

source: The <literal>custom/scripts/99-register.sh</literal> script must be removed when using an air-gap environment. As you can see in the directory structure, the <literal>99-register.sh</literal> script is not included in the <literal>custom/scripts</literal> folder.
es: El guion <literal>custom/scripts/99-register.sh</literal> debe eliminarse si se utiliza un entorno aislado. Como se puede ver en la estructura del directorio, el guion <literal>99-register.sh</literal> no está incluido en la carpeta <literal>custom/scripts</literal>.
ja: エアギャップ環境を使用する場合、<literal>custom/scripts/99-register.sh</literal>スクリプトを削除する必要があります。ディレクトリ構造からわかるように、<literal>99-register.sh</literal>スクリプトは<literal>custom/scripts</literal>フォルダに含まれていません。
pt_br: É necessário remover o script <literal>custom/scripts/99-register.sh</literal> ao usar um ambiente air-gapped. Conforme você pode observar na estrutura de diretórios, o script <literal>99-register.sh</literal> não está incluído na pasta <literal>custom/scripts</literal>.
zh_cn: 使用隔离环境时，必须去除 <literal>custom/scripts/99-register.sh</literal> 脚本。如目录结构中所示，<literal>99-register.sh</literal> 脚本并未包含在 <literal>custom/scripts</literal> 文件夹中。

source: Modifications in the helm values folder
es: Modificaciones de la carpeta de valores de Helm
ja: Helm値フォルダの変更
pt_br: Modificações na pasta de valores do Helm
zh_cn: Helm 值文件夹中的修改

source: The <literal>turtles.yaml</literal>: contains the configuration required to specify airgapped operation for Rancher Turtles, note this depends on installation of the rancher-turtles-airgap-resources chart.
es: El archivo <literal>turtles.yaml</literal> contiene la configuración necesaria para especificar el funcionamiento con aislamiento para Rancher Turtles. Tenga en cuenta que esto depende de la instalación del chart de rancher-turtles-airgap-resources.
ja: <literal>turtles.yaml</literal>: Rancher Turtlesのエアギャップ操作を指定するために必要な設定が含まれます。これはrancher-turtles-airgap-resourcesチャートのインストールによって異なることに注意してください。
pt_br: O <literal>turtles.yaml</literal>: contém a configuração necessária para especificar a operação air-gapped para o Rancher Turtles. Observe que isso depende da instalação do gráfico rancher-turtles-airgap-resources.
zh_cn: <literal>turtles.yaml</literal>：包含为 Rancher Turtles 指定隔离操作所需的配置，请注意，具体配置取决于 rancher-turtles-airgap-resources chart 的安装。

source: Once the directory structure is prepared following the previous sections (for both, connected and air-gap scenarios), run the following command to build the image:
es: Una vez preparada la estructura de directorios siguiendo las secciones anteriores (tanto para escenarios conectados como aislados), ejecute el comando siguiente para crear la imagen:
ja: 前の各セクションに従ってディレクトリ構造を準備したら(接続シナリオとエアギャップシナリオの両方が対象です)、次のコマンドを実行してイメージを構築します。
pt_br: Depois que a estrutura de diretórios foi preparada de acordo com as seções anteriores (para os cenários tanto conectados quanto air-gapped), execute o comando abaixo para criar a imagem:
zh_cn: 按照前面的章节准备好目录结构后（适用于联网场景和隔离场景），运行以下命令来构建映像：

source: This creates the ISO output image file that, in our case, based on the image definition described above, is <literal>eib-mgmt-cluster-image.iso</literal>.
es: Esto crea el archivo de imagen ISO de salida que, en nuestro caso, según la definición de imagen descrita anteriormente, es <literal>eib-mgmt-cluster-image.iso</literal>.
ja: ISO出力イメージファイルが作成されます。ここでは、上記のイメージ定義に基づく<literal>eib-mgmt-cluster-image.iso</literal>という名前のファイルです。
pt_br: Isso cria o arquivo de imagem ISO de saída que, com base na definição da imagem descrita acima, no nosso caso é <literal>eib-mgmt-cluster-image.iso</literal>.
zh_cn: 这会创建 ISO 输出映像文件，根据前面所述的映像定义，本例中该文件是 <literal>eib-mgmt-cluster-image.iso</literal>。

source: Provision the management cluster
es: Aprovisionamiento del clúster de gestión
ja: 管理クラスタのプロビジョニング
pt_br: Provisionar o cluster de gerenciamento
zh_cn: 置备管理群集

source: The previous image contains all components explained above, and it can be used to provision the management cluster using a virtual machine or a bare-metal server (using the virtual-media feature).
es: La imagen anterior contiene todos los componentes explicados anteriormente y se puede utilizar para aprovisionar el clúster de gestión mediante una máquina virtual o un servidor bare metal (usando la función de medios virtuales).
ja: 前のイメージには、上述のコンポーネントがすべて含まれています。このイメージを使って、仮想マシンまたはベアメタルサーバを使用して(仮想メディア機能を使用して)管理クラスタをプロビジョニングできます。
pt_br: A imagem anterior contém todos os componentes explicados acima e pode ser usada para provisionar o cluster de gerenciamento usando uma máquina virtual ou um servidor bare metal (com o recurso de mídia virtual).
zh_cn: 上图包含前面介绍的所有组件，可以使用虚拟机或裸机服务器（使用虚拟媒体功能）根据此图置备管理群集。

source: Dual-stack considerations and configuration
es: Asuntos a tener en cuenta y configuración de la doble pila
ja: デュアルスタックの考慮事項と設定
zh_cn: 双栈考虑因素和配置
