Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: It is only advised to use this field for values that are critical for upgrades. Standard chart value updates should be performed after the respective charts have been upgraded to the next version.
es: Se recomienda utilizar este campo únicamente para valores que sean críticos para las actualizaciones. Las actualizaciones estándares de valores de chart deben realizarse después de que los charts correspondientes se hayan actualizado a la siguiente versión.
ja: アップグレードに重要な値についてのみこのフィールドを使用することをお勧めします。標準のチャート値の更新は、各チャートが次のバージョンにアップグレードされた後に実行する必要があります。
pt_br: Somente é aconselhável usar esse campo para valores que sejam críticos aos upgrades. As atualizações nos valores de gráficos padrão deverão ser feitas depois que o upgrade dos respectivos gráficos for feito para a versão seguinte.
zh_cn: 建议仅将此字段用于对升级至关重要的值。标准 chart 值的更新应在相应 chart 升级到下一版本后进行。

source: Example:
es: Ejemplo:
ja: 例:
pt_br: Exemplo:
zh_cn: 示例：

source: The Upgrade Controller introduces a new Kubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">custom resource</link> called a <literal>ReleaseManifest</literal>.
es: Upgrade Controller introduce un nuevo <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recurso personalizado</link> de Kubernetes llamado <literal>ReleaseManifest</literal>.
ja: Upgrade Controllerは、<literal>ReleaseManifest</literal>と呼ばれる新たなKubernetes<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">カスタムリソース</link>を導入しました。
pt_br: O Controller de upgrade lança um novo <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recurso personalizado</link> do Kubernetes chamado <literal>ReleaseManifest</literal>.
zh_cn: 升级控制器引入了一个名为 <literal>ReleaseManifest</literal> 的新 Kubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">自定义资源</link>。

source: The <literal>ReleaseManifest</literal> resource is created by the Upgrade Controller and holds component data for <emphasis role="strong">one</emphasis> specific Edge release version. This means that each Edge release version upgrade will be represented by a different <literal>ReleaseManifest</literal> resource.
es: El recurso <literal>ReleaseManifest</literal> lo crea Upgrade Controller y contiene datos de componentes para <emphasis role="strong">una</emphasis> versión específica de Edge. Esto significa que cada actualización de la versión de Edge estará representada por un recurso <literal>ReleaseManifest</literal> diferente.
ja: <literal>ReleaseManifest</literal>リソースは、Upgrade Controllerによって作成され、<emphasis role="strong">1つ</emphasis>の特定のEdgeリリースバージョンのコンポーネントデータを保持します。つまり、各Edgeリリースバージョンのアップグレードは、異なる<literal>ReleaseManifest</literal>リソースによって表されます。
pt_br: O recurso <literal>ReleaseManifest</literal> é criado pelo Controller de upgrade e armazena os dados de componente referentes a <emphasis role="strong">uma</emphasis> versão de lançamento específica do Edge. Isso significa que o upgrade de cada versão de lançamento do Edge será representado por um recurso <literal>ReleaseManifest</literal> diferente.
zh_cn: <literal>ReleaseManifest</literal> 资源由升级控制器创建，保存<emphasis role="strong">一个</emphasis>特定 Edge 版本的组件数据。这意味着每个 Edge 版本升级都将由不同的 <literal>ReleaseManifest</literal> 资源表示。

source: The Release Manifest should always be created by the Upgrade Controller.
es: El recurso ReleaseManifest siempre debe crearlo Upgrade Controller.
ja: Release Manifestは常に、Upgrade Controllerによって作成される必要があります。
pt_br: O Controller de upgrade sempre deve criar o ReleaseManifest.
zh_cn: ReleaseManifest 只能由升级控制器创建。

source: It is not advisable to manually create or edit the <literal>ReleaseManifest</literal> resources. Users that decide to do so should do this <emphasis role="strong">at their own risk</emphasis>.
es: No es recomendable crear o editar manualmente los recursos <literal>ReleaseManifest</literal>. Si un usuario decide hacerlo, será <emphasis role="strong">bajo su propia responsabilidad</emphasis>.
ja: <literal>ReleaseManifest</literal>リソースを手動で作成または編集することはお勧めしていません。ユーザが手動で作成または編集することを決めた場合は、<emphasis role="strong">自己責任</emphasis>で行う必要があります。
pt_br: Não é aconselhável criar manualmente ou editar os recursos <literal>ReleaseManifest</literal> . O usuários que decidirem por esse método devem fazê-lo <emphasis role="strong">por sua conta e risco</emphasis>.
zh_cn: 不建议手动创建或编辑 <literal>ReleaseManifest</literal> 资源，否则，用户需<emphasis role="strong">自行承担风险</emphasis>。

source: Component data that the Release Manifest ships include, but is not limited to:
es: Estos son algunos de los componentes que incluye ReleaseManifest:
ja: Release Manifestが提供するコンポーネントデータには、以下が含まれますが、これに制限されません。
pt_br: O ReleaseManifest inclui os seguintes dados de componente, mas sem limitação:
zh_cn: 版本清单附带的组件数据包括但不限于：

source: Operating System data - version, supported architectures, additional upgrade data, etc.
es: Datos del sistema operativo: versión, arquitecturas compatibles, datos adicionales sobre actualizaciones, etc.
ja: オペレーティングシステムデータ - バージョン、サポートされているアーキテクチャ、追加のアップグレードデータなど
pt_br: Dados de sistema operacional: versão, arquiteturas suportadas, dados adicionais de upgrade etc.
zh_cn: 操作系统数据 - 版本、支持的体系结构、其他升级数据等

source: Kubernetes distribution data - <link xl:href="https://docs.rke2.io">RKE2</link>/<link xl:href="https://k3s.io">K3s</link> supported versions
es: Datos de distribución de Kubernetes: versiones admitidas de <link xl:href="https://docs.rke2.io">RKE2</link>/<link xl:href="https://k3s.io">K3s</link>
ja: Kubernetesディストリビューションデータ - <link xl:href="https://docs.rke2.io">RKE2</link>/<link xl:href="https://k3s.io">K3s</link>でサポートされているバージョン
pt_br: Dados de distribuição Kubernetes: versões suportadas do <link xl:href="https://docs.rke2.io">RKE2</link>/<link xl:href="https://k3s.io">K3s</link>
zh_cn: Kubernetes 发行版数据 - <link xl:href="https://docs.rke2.io">RKE2</link>/<link xl:href="https://k3s.io">K3s</link> 支持的版本

source: Additional components data - SUSE Helm chart data (location, version, name, etc.)
es: Datos de componentes adicionales: datos del chart de Helm de SUSE (ubicación, versión, nombre, etc.)
ja: 追加のコンポーネントデータ - SUSE Helmチャートデータ(場所、バージョン、名前など)
pt_br: Dados de componentes adicionais: dados de gráficos Helm do SUSE (local, versão, nome etc.)
zh_cn: 其他组件数据 - SUSE Helm chart 数据（位置、版本、名称等）

source: For an example of how a Release Manifest can look, refer to the <link xl:href="https://github.com/suse-edge/upgrade-controller/blob/main/config/samples/lifecycle_v1alpha1_releasemanifest.yaml">upstream</link> documentation. <emphasis>Please note that this is just an example and it is not intended to be created as a valid <literal>ReleaseManifest</literal> resource.</emphasis>
es: Para ver un ejemplo de recurso ReleaseManifest, consulte la <link xl:href="https://github.com/suse-edge/upgrade-controller/blob/main/config/samples/lifecycle_v1alpha1_releasemanifest.yaml">documentación original</link>. <emphasis>Tenga en cuenta que se trata solo de un ejemplo, no de un recurso <literal>ReleaseManifest</literal> válido.</emphasis>
ja: ReleaseManifestの例については、<link xl:href="https://github.com/suse-edge/upgrade-controller/blob/main/config/samples/lifecycle_v1alpha1_releasemanifest.yaml">アップストリーム</link>ドキュメントを参照してください。<emphasis>これは単なる例であって、有効な<literal>ReleaseManifest</literal>リソースとして作成することを目的としたものではないことに注意してください。</emphasis>
pt_br: Para ver um exemplo da aparência de um ReleaseManifest, consulte a documentação <link xl:href="https://github.com/suse-edge/upgrade-controller/blob/main/config/samples/lifecycle_v1alpha1_releasemanifest.yaml">upstream</link>. <emphasis>Tenha em mente que se trata apenas de um exemplo, sem a intenção de criar um recurso <literal>ReleaseManifest</literal> válido.</emphasis>
zh_cn: 有关版本清单的示例，请参见<link xl:href="https://github.com/suse-edge/upgrade-controller/blob/main/config/samples/lifecycle_v1alpha1_releasemanifest.yaml">上游</link>文档。<emphasis>请注意，这只是一个示例，不可用于创建为有效的 <literal>ReleaseManifest</literal> 资源。</emphasis>

source: Tracking the upgrade process
es: Seguimiento del proceso de actualización
ja: アップグレードプロセスの追跡
pt_br: Acompanhando o processo de upgrade
zh_cn: 跟踪升级过程

source: This section serves as means to track and debug the upgrade process that the Upgrade Controller initiates once the user creates an <literal>UpgradePlan</literal> resource.
es: Esta sección sirve como medio para realizar un seguimiento y depurar el proceso de actualización que inicia Upgrade Controller después de que el usuario haya creado un recurso <literal>UpgradePlan</literal>.
ja: このセクションは、ユーザが<literal>UpgradePlan</literal>リソースを作成すると、Upgrade Controllerが開始するアップグレードプロセスを追跡およびデバッグする手段として機能します。
pt_br: Esta seção apresenta como acompanhar e depurar o processo de upgrade que o Controller de upgrade inicia após a criação do recurso <literal>UpgradePlan</literal>.
zh_cn: 本节介绍如何跟踪和调试升级控制器在用户创建 <literal>UpgradePlan</literal> 资源后启动的升级资源过程。

source: General
ja: 一般
pt_br: Geral
zh_cn: 一般信息

source: General information about the state of the upgrade process can be viewed in the Upgrade Plan’s status conditions.
es: La información general sobre el estado del proceso de actualización se puede consultar en las condiciones de estado del recurso UpgradePlan.
ja: アップグレードプロセスの状態に関する一般情報は、Upgrade Planのステータス状況で確認できます。
pt_br: Acesse as informações gerais sobre o estado do processo de upgrade em Condições de status do UpgradePlan.
zh_cn: 有关升级过程状态的一般信息，可以在升级计划的状态条件中查看。

source: The Upgrade Plan resource’s status can be viewed in the following way:
es: El estado del recurso UpgradePlan se puede consultar de la siguiente manera:
ja: Upgrade Planリソースのステータスは、次の方法で確認できます。
pt_br: Veja o status do recurso UpgradePlan da seguinte maneira:
zh_cn: 可以通过以下方式查看升级计划资源的状态：

source: Running Upgrade Plan example:
es: Ejemplo de UpgradePlan en ejecución:
ja: Upgrade Planの実行例:
pt_br: Exemplo de execução do UpgradePlan:
zh_cn: 升级计划运行示例：

source: Here you can view every component that the Upgrade Controller will try to schedule an upgrade for. Each condition follows the below template:
es: Aquí puede ver todos los componentes para los que Upgrade Controller intentará programar una actualización. Cada condición sigue el siguiente formato:
ja: ここで、 Upgrade Controllerがアップグレードをスケジュールしようとするすべてのコンポーネントを確認できます。各状態は、次のテンプレートに従います。
pt_br: Aqui você vê todos os componentes para os quais o Controller de upgrade tentará programar um upgrade. Cada condição segue o gabarito abaixo:
zh_cn: 通过这种方式，您可以查看升级控制器将尝试安排升级的每个组件。每个条件都采用以下模板：

source: <literal>lastTransitionTime</literal> - the last time that this component condition has transitioned from one status to another.
es: <literal>lastTransitionTime</literal>: la hora a la que esta condición del componente pasó de un estado a otro por última vez.
ja: <literal>lastTransitionTime</literal> - このコンポーネントの状態が、あるステータスから別のステータスに遷移した最後の時刻。
pt_br: <literal>lastTransitionTime</literal>: a hora em que a condição do componente mudou de um status para outro pela última vez.
zh_cn: <literal>lastTransitionTime</literal> - 此组件条件上一次改变状态的时间。

source: <literal>message</literal> - message that indicates the current upgrade state of the specific component condition.
es: <literal>message</literal>: mensaje que indica el estado actual de actualización de la condición específica del componente.
ja: <literal>message (メッセージ)</literal> - 特定のコンポーネントの状態の現在のアップグレード状態を示すメッセージ。
pt_br: <literal>message</literal>: mensagem que indica o estado atual do upgrade da condição do componente específico.
zh_cn: <literal>message</literal> - 指示特定组件条件当前升级状态的消息。

source: <literal>reason</literal> - the current upgrade state of the specific component condition. Possible <literal>reasons</literal> include:
es: <literal>reason</literal>: el estado actual de actualización de la condición específica del componente. Los valores posibles para <literal>reasons</literal> son:
ja: <literal>reason (理由)</literal> - 特定のコンポーネントの状態の現在のアップグレード状態。考えられる<literal>理由</literal>には次のものが含まれます。
pt_br: <literal>reason</literal>: o estado atual do upgrade da condição do componente específico. Os possíveis <literal>motivos</literal> incluem:
zh_cn: <literal>reason</literal> - 特定组件条件的当前升级状态。可能的 <literal>reason</literal> 包括：

source: <literal>Succeeded</literal> - upgrade of the specific component is successful.
es: <literal>Succeeded</literal>: la actualización del componente específico se ha realizado correctamente.
ja: <literal>Succeeded (成功)</literal> - 特定のコンポーネントのアップグレードが成功しました。
pt_br: <literal>Succeeded</literal>: o upgrade do componente específico foi bem-sucedido.
zh_cn: <literal>Succeeded</literal> - 特定组件升级成功。

source: <literal>Failed</literal> - upgrade of the specific component has failed.
es: <literal>Failed</literal>: la actualización del componente específico ha fallado.
ja: <literal>Failed (失敗)</literal> - 特定のコンポーネントアップグレードが失敗しました。
pt_br: <literal>Failed</literal>: falha no upgrade do componente específico.
zh_cn: <literal>Failed</literal> - 特定组件升级失败。

source: <literal>InProgress</literal> - upgrade of the specific component is currently in progress.
es: <literal>InProgress</literal>: la actualización del componente específico está en curso.
ja: <literal>InProgress (進行中)</literal> - 特定のコンポーネントのアップグレードは現在進行中です。
pt_br: <literal>InProgress</literal>: o upgrade do componente específico está em andamento.
zh_cn: <literal>InProgress</literal> - 特定组件的升级当前正在进行中。

source: <literal>Pending</literal> - upgrade of the specific component is not yet scheduled.
es: <literal>Pending</literal>: la actualización del componente específico aún no se ha programado.
ja: <literal>Pending (保留中)</literal> - 特定のコンポーネントのアップグレードは、まだスケジュールされていません。
pt_br: <literal>Pending</literal>: o upgrade do componente específico ainda não foi programado.
zh_cn: <literal>Pending</literal> - 尚未安排特定组件的升级。

source: <literal>Skipped</literal> - specific component is not found on the cluster, so its upgrade will be skipped.
es: <literal>Skipped</literal>: el componente específico no se encuentra en el clúster, por lo que se omitirá su actualización.
ja: <literal>Skipped (スキップ)</literal> - 特定のコンポーネントがクラスタで見つからないため、アップグレードはスキップされます。
pt_br: <literal>Skipped</literal>: o componente específico não foi encontrado no cluster, portanto, o upgrade dele será ignorado.
zh_cn: <literal>Skipped</literal> - 在群集上找不到特定组件，因此将跳过其升级。

source: <literal>Error</literal> - specific component has encountered a transient error.
es: <literal>Error</literal>: se ha producido un error transitorio en un componente específico.
ja: <literal>Error (エラー)</literal> - 特定のコンポーネントで一時的なエラーが発生しました。
pt_br: <literal>Error</literal>: o componente específico encontrou um erro temporário.
zh_cn: <literal>Error</literal> - 特定组件发生了临时错误。

source: <literal>status</literal> - status of the current condition <literal>type</literal>, one of <literal>True</literal>, <literal>False</literal>, <literal>Unknown</literal>.
es: <literal>status</literal>: el estado de <literal>type</literal> (tipo) de la condición actual. Puede ser <literal>True</literal> (Verdadero), <literal>False</literal> (Falso) o <literal>Unknown</literal> (Desconocido).
ja: <literal>status (ステータス)</literal> - 現在の状態 <literal>タイプ</literal>のステータス。<literal>True</literal>、<literal>False</literal>、<literal>Unknown (不明)</literal>のいずれか。
pt_br: <literal>status</literal>: o status do <literal>type</literal> (tipo) da condição atual, que pode ser <literal>True</literal> (Verdadeiro), <literal>False</literal> (Falso) ou <literal>Unknown</literal> (Desconhecido).
zh_cn: <literal>status</literal> - 当前条件 <literal>type</literal> 的状态，可以是 <literal>True</literal>、<literal>False</literal> 或 <literal>Unknown</literal>。

source: <literal>type</literal> - indicator for the currently upgraded component.
es: <literal>type</literal>: indicador del componente actualmente actualizado.
ja: <literal>type (タイプ)</literal> - 現在アップグレードされたコンポーネントのインジケータ。
pt_br: <literal>type</literal>: indicador do componente que está passando por upgrade.
zh_cn: <literal>type</literal> - 当前已升级组件的指示器。

source: The Upgrade Controller creates SUC Plans for component conditions of type <literal>OSUpgraded</literal> and <literal>KubernetesUpgraded</literal>. To further track the SUC Plans created for these components, refer to <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
es: Upgrade Controller crea planes de SUC para las condiciones de componentes de tipo <literal>OSUpgraded</literal> y <literal>KubernetesUpgraded</literal>. Para realizar un seguimiento más detallado de los planes de SUC creados para estos componentes, consulte la <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
ja: Upgrade Controllerは、<literal>OSUpgraded</literal>および<literal>KubernetesUpgraded</literal>タイプのコンポーネント状態のSUC Planを作成します。これらのコンポーネント用に作成されたSUC Planを詳細に追跡するには、<xref linkend="components-system-upgrade-controller-monitor-plans"/>を参照してください。
pt_br: O Controller de upgrade cria planos do SUC para as condições de componente do tipo <literal>OSUpgraded</literal> e <literal>KubernetesUpgraded</literal>. Para acompanhar em mais detalhes os planos do SUC criados para esses componentes, consulte a <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
zh_cn: 升级控制器会为 <literal>OSUpgraded</literal> 和 <literal>KubernetesUpgraded</literal> 类型的组件条件创建 SUC 计划。要进一步跟踪为这些组件创建的 SUC 计划，请参见<xref linkend="components-system-upgrade-controller-monitor-plans"/>。

source: All other component condition types can be further tracked by viewing the resources created for them by the <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>. For more information, see <xref linkend="components-upgrade-controller-how-track-helm"/>.
es: Es posible seguir realizando un seguimiento de todos los demás tipos de condiciones de los componentes mediante la visualización de los recursos creados para ellos por <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>. Para obtener más información, consulte la <xref linkend="components-upgrade-controller-how-track-helm"/>.
ja: 他のすべてのコンポーネント状態のタイプは、<link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>によって作成されたリソースを表示することで詳細に追跡できます。詳細については、<xref linkend="components-upgrade-controller-how-track-helm"/>を参照してください。
pt_br: É possível acompanhar em mais detalhes todos os outros tipos de condição de componente visualizando os recursos criados para eles pelo <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>. Para obter mais informações, consulte a <xref linkend="components-upgrade-controller-how-track-helm"/>.
zh_cn: 要进一步跟踪所有其他组件条件类型，可以查看 <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link> 为它们创建的资源。有关详细信息，请参见<xref linkend="components-upgrade-controller-how-track-helm"/>。

source: An Upgrade Plan scheduled by the Upgrade Controller can be marked as <literal>successful</literal> once:
es: Un recurso UpgradePlan programado por Upgrade Controller se puede marcar como <literal>successful</literal> (correcto) si cumple estas condiciones:
ja: Upgrade ControllerによってスケジュールされたUpgrade Planは、次の場合に<literal>successful (成功)</literal>とマーク付けすることができます。
pt_br: É possível marcar um UpgradePlan programado pelo Controller de upgrade como <literal>successful</literal> (bem-sucedido) se:
zh_cn: 当满足以下条件时，升级控制器安排的升级计划可以标记为 <literal>successful</literal>：

source: There are no <literal>Pending</literal> or <literal>InProgress</literal> component conditions.
es: No hay condiciones de componentes con el estado <literal>Pending</literal> o <literal>InProgress</literal>.
ja: <literal>Pending (保留中)</literal>または<literal>InProgress (進行中)</literal>のコンポーネントの状態がありません。
pt_br: Não há condições de componente <literal>Pending</literal> ou <literal>InProgress</literal>.
zh_cn: 不存在 <literal>Pending</literal> 或 <literal>InProgress</literal> 的组件条件。

source: The <literal>lastSuccessfulReleaseVersion</literal> property points to the <literal>releaseVersion</literal> that is specified in the Upgrade Plan’s configuration. <emphasis>This property is added to the Upgrade Plan’s status by the Upgrade Controller once the upgrade process is successful.</emphasis>
es: La propiedad <literal>lastSuccessfulReleaseVersion</literal> apunta a la versión de <literal>releaseVersion</literal> especificada en la configuración de UpgradePlan. <emphasis>Upgrade Controller añade esta propiedad al estado de UpgradePlan después de que el proceso de actualización se ha completado correctamente.</emphasis>
ja: <literal>lastSuccessfulReleaseVersion</literal>プロパティがUpgrade Planの設定で指定された<literal>releaseVersion</literal>を指しています。<emphasis>このプロパティは、 アップグレードプロセスが成功すると、Upgrade ControllerによってUpgrade Planのステータスに追加されます。</emphasis>
pt_br: A propriedade <literal>lastSuccessfulReleaseVersion</literal> aponta para a <literal>releaseVersion</literal>, que é especificada na configuração do UpgradePlan. <emphasis>O Controller de upgrade adiciona essa propriedade ao status do UpgradePlan após o processo de upgrade bem-sucedido.</emphasis>
zh_cn: <literal>lastSuccessfulReleaseVersion</literal> 属性指向升级计划配置中指定的 <literal>releaseVersion</literal>。<emphasis>升级过程成功后，升级控制器会将此属性添加至升级计划的状态。</emphasis>

source: Successful <literal>UpgradePlan</literal> example:
es: Ejemplo de <literal>UpgradePlan</literal> correcto:
ja: 成功した<literal>UpgradePlan</literal>の例:
pt_br: Exemplo de <literal>UpgradePlan</literal> bem-sucedido:
zh_cn: 成功的 <literal>UpgradePlan</literal> 示例：

source: Helm Controller
zh_cn: Helm 控制器

source: This section covers how to track resources created by the <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>.
es: Esta sección explica cómo realizar un seguimiento de los recursos creados por <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>.
ja: このセクションでは、<link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>によって作成されたリソースを追跡する方法について説明します。
pt_br: Esta seção explica como acompanhar os recursos criados pelo <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>.
zh_cn: 本节介绍如何跟踪 <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link> 创建的资源。

source: The below steps assume that <literal>kubectl</literal> has been configured to connect to the cluster where the Upgrade Controller has been deployed to.
es: En los pasos siguientes se da por supuesto que <literal>kubectl</literal> se ha configurado para conectarse al clúster en el que se ha desplegado Upgrade Controller.
ja: 以下の手順は、<literal>kubectl</literal>がUpgrade Controllerが導入されているクラスタに接続するように設定されていることを前提としています。
pt_br: As etapas a seguir consideram que o <literal>kubectl</literal> foi configurado para conectar-se ao cluster no qual o Controller de upgrade foi implantado.
zh_cn: 以下步骤假设 <literal>kubectl</literal> 已配置为连接到已部署升级控制器的群集。

source: Locate the <literal>HelmChart</literal> resource for the specific component:
es: Localice el recurso <literal>HelmChart</literal> para el componente específico:
ja: 特定のコンポーネントの<literal>HelmChart</literal>リソースを見つけます。
pt_br: Localize o recurso <literal>HelmChart</literal> para o componente específico:
zh_cn: 找到特定组件的 <literal>HelmChart</literal> 资源：

source: Using the name of the <literal>HelmChart</literal> resource, locate the upgrade Pod that was created by the <literal>helm-controller</literal>:
es: Use el nombre del recurso <literal>HelmChart</literal> para localizar el pod de actualización que creó <literal>helm-controller</literal>:
ja: <literal>HelmChart</literal>リソースの名前を使用して、 <literal>helm-controller</literal>によって作成されたアップグレードPodを見つけます。
pt_br: Usando o nome do recurso <literal>HelmChart</literal>, localize o pod de upgrade que foi criado pelo <literal>helm-controller</literal>:
zh_cn: 使用 <literal>HelmChart</literal> 资源的名称找到由 <literal>helm-controller</literal> 创建的升级 Pod：
