Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Manually deployed Helm charts cannot be reliably upgraded. We suggest to redeploy the Helm chart using the <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster"/> method.
es: Los charts de Helm desplegados manualmente no se pueden actualizar de forma fiable. Recomendamos volver a desplegar el chart de Helm utilizando el método <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster"/>.
ja: 手動でデプロイしたHelmチャートを確実にアップグレードすることはできません。<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster"/>で説明する方法を使用してHelmチャートを再デプロイすることをお勧めします。
pt_br: Não é possível fazer upgrade confiável de gráficos Helm implantados manualmente. Sugerimos reimplantá-los usando o método da <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster"/>.
zh_cn: 手动部署的 Helm chart 无法可靠升级。我们建议使用<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster"/>中所述的方法重新部署这些 Helm chart。

source: You can deploy the fleet for your chart by either using a GitRepo (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>) or Bundle (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>).
es: Puede desplegar la flota de su chart usando GitRepo (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>) o Bundle (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>).
ja: チャートのFleetをデプロイするには、GitRepo (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>)またはバンドル(<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>)のいずれかを使用できます。
pt_br: Você pode implantar a instância do Fleet para seu gráfico usando o GitRepo (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>) ou o bundle (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>).
zh_cn: 您可以使用 GitRepo（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>）或捆绑包（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>）来部署 chart 的 Fleet。

source: For a more granular downstream cluster selection, refer to <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link>.
es: Para una selección más detallada de clústeres descendentes, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Asignación a clústeres descendentes).
ja: ダウンストリームクラスタをより細かく選択したい場合は、「<link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Cluster (ダウンストリームクラスタへのマッピング)</link>」を参照してください。
pt_br: Para uma seleção mais granular de clusters downstream, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Mapeando para clusters downstream).
zh_cn: 若要更精细地选择下游群集，请参见<link xl:href="https://fleet.rancher.io/gitrepo-targets">映射到下游群集</link>。

source: Following these steps will ensure that <literal>SUSE Storage</literal> is deployed on all of the specified downstream cluster.
es: Seguir estos pasos garantizará que <literal>SUSE Storage</literal> se despliegue en todos los clústeres descendentes especificados.
ja: これらの手順に従うと、<literal>SUSE Storage</literal>が指定されたダウンストリームクラスタのすべてにデプロイされます。
pt_br: Siga estas etapas para garantir que o <literal>SUSE Storage</literal> seja implantado em todos os clusters downstream especificados.
zh_cn: 按照以上步骤操作，将 <literal>SUSE Storage</literal> 部署到所有指定的下游群集上。

source: Once deployed with Fleet, for Helm chart upgrades, see <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>.
es: Cuando se complete el despliegue con Fleet, para actualizaciones de charts de Helm, consulte la <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>.
ja: Fleetでデプロイした後のHelmチャートのアップグレードについては、<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>を参照してください。
pt_br: Após a implantação com o Fleet, para fazer upgrade dos gráficos Helm, consulte a <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>.
zh_cn: 通过 Fleet 完成部署后，若要进行 Helm chart 升级，请参见<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>。

source: The general overview (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>) of the upgrade process.
es: La descripción general (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>) del proceso de actualización.
ja: アップグレードプロセスの一般的な概要(<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>)。
pt_br: A visão geral (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>) do processo de upgrade.
zh_cn: 升级过程的一般概述（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>）。

source: The necessary upgrade steps (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>).
es: Los pasos necesarios para la actualización (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>).
ja: 必要なアップグレード手順(<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>)。
pt_br: As etapas de upgrade necessárias (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>).
zh_cn: 必要的升级步骤（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>）。

source: An example (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>) showcasing a <link xl:href="https://longhorn.io">Longhorn</link> chart upgrade using the explained method.
es: Un ejemplo (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>) que muestra la actualización de un chart de <link xl:href="https://longhorn.io">Longhorn</link> usando el método explicado.
ja: 説明した方法を使用した<link xl:href="https://longhorn.io">Longhorn</link>チャートアップグレードを示す例(<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>)。
pt_br: Um exemplo (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>) que demonstra o upgrade de um gráfico <link xl:href="https://longhorn.io">Longhorn</link> usando o método explicado.
zh_cn: 展示使用所述方法进行 <link xl:href="https://longhorn.io">Longhorn</link> chart 升级的示例（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>）。

source: How to use the upgrade process with a different GitOps tool (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>).
es: Cómo usar el proceso de actualización con una herramienta GitOps diferente (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>).
ja: 異なるGitOpsツールを使用したアップグレードプロセスを使用する方法(<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>)。
pt_br: Como usar o processo de upgrade com uma ferramenta GitOps diferente (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>).
zh_cn: 如何使用其他 GitOps 工具完成升级过程（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>）。

source: Once deployed, the <literal>eib-charts-upgrader</literal>, with the help of Fleet, will ship its resources to the desired downstream cluster.
es: Una vez desplegado, <literal>eib-charts-upgrader</literal>, con ayuda de Fleet, incluirá sus recursos en el clúster descendente deseado.
ja: デプロイされたら、<literal>eib-charts-upgrader</literal>がFleetのサポートによって、そのリソースを目的のダウンストリームクラスタに配布します。
pt_br: Após a implantação, o <literal>eib-charts-upgrader</literal>, com ajuda do Fleet, enviará os recursos para o cluster downstream desejado.
zh_cn: 部署后，<literal>eib-charts-upgrader</literal> 会借助 Fleet 将其资源分发到目标下游群集。

source: fleet day2 downstream helm eib upgrade
es: actualización eib de helm descendente de día 2 con fleet
ja: fleet day2ダウンストリームhelm eibアップグレード
pt_br: upgrade eib helm downstream dia2 fleet
zh_cn: Fleet Day2 下游 Helm EIB 升级

source: For information on how to map target clusters, see the upstream <link xl:href="https://fleet.rancher.io/gitrepo-targets">documentation</link>.
es: Para obtener información sobre cómo asignar clústeres de destino, consulte la <link xl:href="https://fleet.rancher.io/gitrepo-targets">documentación original</link>.
ja: ターゲットクラスタをマップする方法については、アップストリーム<link xl:href="https://fleet.rancher.io/gitrepo-targets">ドキュメント</link>を参照してください。
pt_br: Para obter informações sobre como mapear clusters de destino, consulte a <link xl:href="https://fleet.rancher.io/gitrepo-targets">documentação</link> upstream.
zh_cn: 有关如何映射目标群集的信息，请参见上游<link xl:href="https://fleet.rancher.io/gitrepo-targets">文档</link>。

source: Executing these steps will result in a successfully deployed <literal>GitRepo/Bundle</literal> resource. The resource will be picked up by Fleet and its contents will be deployed onto the target clusters that the user has specified in the previous steps. For an overview of the process, refer to <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>.
es: Al ejecutar estos pasos, se desplegará correctamente el recurso <literal>GitRepo/Bundle</literal>. Fleet recogerá el recurso y su contenido se desplegará en los clústeres de destino que el usuario haya especificado en los pasos anteriores. Para obtener una descripción general del proceso, consulte la <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>.
ja: これらの手順を実行すると、正常に<literal>GitRepo/バンドル</literal>リソースがデプロイされます。リソースはFleetによって取得され、そのコンテンツはユーザが以前の手順で指定したターゲットクラスタにデプロイされます。プロセスの概要については、<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>を参照してください。
pt_br: A execução dessas etapas resulta na implantação bem-sucedida do recurso <literal>GitRepo/Bundle</literal>. O Fleet seleciona o recurso e seu conteúdo é implantado nos clusters de destino que o usuário especificou nas etapas anteriores. Para obter uma visão geral do processo, consulte a <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>.
zh_cn: 执行这些步骤可成功部署 <literal>GitRepo/捆绑包</literal>资源。资源将由 Fleet 拾取，且其内容将部署到用户在之前的步骤中指定的目标群集上。有关该过程的概述，请参见<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>。

source: For information on how to track the upgrade process, you can refer to <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>.
es: Para obtener información sobre cómo realizar un seguimiento del proceso de actualización, consulte la <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>.
ja: アップグレードプロセスの追跡方法については、 <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>を参照してください。
pt_br: Para obter informações sobre como acompanhar o processo de upgrade, consulte a <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>.
zh_cn: 有关如何跟踪升级过程的信息，请参见<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>。

source: This will remove the no longer necessary upgrade resources from your <literal>downstream</literal> cluster, ensuring that no future version clashes might occur.
es: Esto eliminará los recursos de actualización que ya no son necesarios de su clúster <literal>descendente</literal>, lo que garantizará que no se produzcan conflictos entre versiones en el futuro.
ja: これにより、<literal>ダウンストリーム</literal>クラスタから不要になったアップグレードリソースが削除され、今後バージョンクラッシュが発生しないようになります。
pt_br: Isso removerá os recursos de upgrade que não são mais necessários do cluster <literal>downstream</literal>, garantindo que não haja conflitos com versões futuras.
zh_cn: 这将从<literal>下游</literal>群集中去除不再需要的升级资源，确保将来不会发生版本冲突。

source: The example below demonstrates how to upgrade a Helm chart deployed via <literal>EIB</literal> from one version to another on a <literal>downstream</literal> cluster. Note that the versions used in this example are <emphasis role="strong">not</emphasis> recommendations. For version recommendations specific to an Edge release, refer to the release notes (<xref linkend="release-notes"/>).
es: El siguiente ejemplo muestra cómo actualizar un chart de Helm desplegado con <literal>EIB</literal> de una versión a otra en un clúster <literal>descendente</literal>. Tenga en cuenta que las versiones utilizadas en este ejemplo <emphasis role="strong">no</emphasis> son recomendaciones. Para obtener recomendaciones de versiones específicas para una versión de Edge, consulte las notas de la versión (<xref linkend="release-notes"/>).
ja: 以下の例は、<literal>ダウンストリーム</literal>クラスタ上で、<literal>EIB</literal>を介してデプロイされたHelmチャートを、あるバージョンから別のバージョンにアップグレードする方法を示しています。この例で使用されているバージョンは、推奨バージョン<emphasis role="strong">ではない</emphasis>ことに注意してください。Edgeリリースに固有のバージョン推奨事項については、リリースノート(<xref linkend="release-notes"/>)を参照してください。
pt_br: No exemplo a seguir, demonstramos como fazer upgrade de um gráfico Helm implantado pelo <literal>EIB</literal> de uma versão para outra em um cluster <literal>downstream</literal>. Observe que as versões usadas neste exemplo <emphasis role="strong">não</emphasis> são recomendações. Para recomendações de versão específicas a um lançamento do Edge, consulte as Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: 以下示例展示了如何在<literal>下游</literal>群集上将通过 <literal>EIB</literal> 部署的 Helm chart 从一个版本升级到另一个版本。请注意，本示例中使用的版本<emphasis role="strong">并非</emphasis>推荐版本。有关特定 Edge 版本的推荐版本，请参见发行说明（<xref linkend="release-notes"/>）。

source: A cluster named <literal>doc-example</literal> is running an older version of <link xl:href="https://longhorn.io">Longhorn</link>.
es: Un clúster denominado <literal>doc-example</literal> ejecuta una versión anterior de <link xl:href="https://longhorn.io">Longhorn</link>.
ja: クラスタ名<literal>doc-example</literal>が<link xl:href="https://longhorn.io">Longhorn</link>の古いバージョンを実行しています。
pt_br: Um cluster chamado <literal>doc-example</literal> executa uma versão mais antiga do <link xl:href="https://longhorn.io">Longhorn</link>.
zh_cn: 名为 <literal>doc-example</literal> 的群集正在运行旧版 <link xl:href="https://longhorn.io">Longhorn</link>。

source: It is assumed that the <literal>management cluster</literal> in charge of managing <literal>doc-example</literal> is <emphasis role="strong">air-gapped</emphasis>, without support for a local Git server and has a working Rancher setup.
es: Se sobrentiende que el <literal>clúster de gestión</literal> encargado de gestionar <literal>doc-example</literal> está <emphasis role="strong">aislado</emphasis>, sin asistencia para un servidor Git local y con una configuración de Rancher operativa.
ja: <literal>doc-example</literal>の管理を担当する<literal>管理クラスタ</literal>がローカルGitサーバのサポートなしで<emphasis role="strong">エアギャップ</emphasis>されており、Rancherセットアップが動作していることを前提としています。
pt_br: Presume-se que o <literal>cluster de gerenciamento</literal> responsável pelo gerenciamento do <literal>doc-example</literal> seja <emphasis role="strong">air-gapped</emphasis>, sem suporte a servidor Git local e com uma instalação ativa do Rancher.
zh_cn: 假设负责管理 <literal>doc-example</literal> 群集的<literal>管理群集</literal>是<emphasis role="strong">隔离式</emphasis>群集，不支持本地 Git 服务器，并且具有有效的 Rancher 设置。

source: Follow the Upgrade Steps (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>):
es: Siga los pasos de actualización (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>):
ja: アップグレード手順(<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>)に従います。
pt_br: Siga as etapas de upgrade (<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>):
zh_cn: 按照升级步骤（<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>）进行操作：

source: Now, transfer the <literal>bundle.yaml</literal> on your <literal>management cluster</literal> machine.
es: Ahora, transfiera <literal>bundle.yaml</literal> a su equipo del <literal>clúster de gestión</literal>.
ja: ここで、 <literal>管理クラスタ</literal>マシンに<literal>bundle.yaml</literal>を転送します。
pt_br: Agora transfira o <literal>bundle.yaml</literal> para a máquina do <literal>cluster de gerenciamento</literal>.
zh_cn: 现在，在您的<literal>管理群集</literal>计算机上传输 <literal>bundle.yaml</literal>。

source: day2 helm chart upgrade example 3 downstream
es: ejemplo 3 de actualización de chart de helm de día dos descendente
ja: day2 helmチャートアップグレード例3ダウンストリーム
pt_br: downstream exemplo 3 upgrade gráfico helm dia2
zh_cn: Day2 Helm chart 升级示例 3 下游

source: day2 helm chart upgrade example 4 downstream
es: ejemplo 4 de actualización de chart de helm de día dos descendente
ja: day2 helmチャートアップグレード例4ダウンストリーム
pt_br: downstream exemplo 4 upgrade gráfico helm dia2
zh_cn: Day2 Helm chart 升级示例 4 下游

source: To produce the resources needed for the upgrade procedure, you can use the <literal>generate-chart-upgrade-data.sh</literal> script to populate the <literal>eib-charts-upgrader</literal> Fleet with the user provided data. For more information on how to do this, see <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
es: Para generar los recursos necesarios para el procedimiento de actualización, puede usar el guion <literal>generate-chart-upgrade-data.sh</literal> para rellenar la flota <literal>eib-charts-upgrader</literal> con los datos proporcionados por el usuario. Para obtener más información sobre cómo hacerlo, consulte la <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
ja: アップグレード手順に必要なリソースを生成するには、<literal>generate-chart-upgrade-data.sh</literal>スクリプトを使用して、ユーザが提供するデータを<literal>eib-charts-upgrader</literal> Fleetに入力することができます。この実行方法の詳細については、<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>を参照してください。
pt_br: Para gerar os recursos necessários ao procedimento de upgrade, você pode usar o script <literal>generate-chart-upgrade-data.sh</literal> para preencher a instância do Fleet <literal>eib-charts-upgrader</literal> com os dados fornecidos pelo usuário. Para obter mais informações sobre como fazer isso, consulte a <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
zh_cn: 要生成升级过程所需的资源，可以使用 <literal>generate-chart-upgrade-data.sh</literal> 脚本将用户提供的数据填充到 <literal>eib-charts-upgrader</literal> Fleet。有关如何执行此操作的详细信息，请参见<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>。

source: To understand how this workflow is intended to be used, it can be beneficial to look at <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/> and <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
es: Para comprender cómo se pretende usar este flujo de trabajo, puede resultar útil consultar la <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/> y la <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
ja: このワークフローの使用方法を理解するには<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>と<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>を参照すると役立つでしょう。
pt_br: Para saber qual é a finalidade de uso desse fluxo de trabalho, consulte a <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/> e a <xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
zh_cn: 要了解如何使用此工作流程，可以查看<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>和<xref linkend="downstream-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>。

source: SUSE Telco Cloud Documentation
es: Documentación de SUSE Telco Cloud
ja: SUSE Telco Cloudのドキュメント
zh_cn: SUSE Telco Cloud 文档

source: Find the SUSE Telco Cloud documentation here
es: Encontrará la documentación de SUSE Telco Cloud aquí
ja: SUSE Telco Cloudのドキュメントはこちらでご確認ください。
zh_cn: 此处为关于 SUSE Telco Cloud 的文档

source: SUSE Telco Cloud (formerly known as SUSE Edge for Telco) is a telecom-optimized computing platform that enables telecom operators and telecom network vendors to innovate and accelerate the modernization of their networks.
es: SUSE Telco Cloud (anteriormente denominado SUSE Edge for Telco) es una plataforma de computación optimizada para las telecomunicaciones que permite a las empresas de ese sector innovar y acelerar la modernización de sus redes.
ja: SUSE Telco Cloud (旧称: SUSE Edge for Telco)は、通信事業者向けに最適化されたコンピューティングプラットフォームであり、通信事業者や通信ネットワークベンダはそのネットワークを刷新し、その最新化を加速できます。
zh_cn: SUSE Telco Cloud（前身为 SUSE Edge for Telco）是一款针对电信行业优化的计算平台，可帮助电信运营商和电信网络供应商实现创新，并加速其网络现代化进程。

source: SUSE Telco Cloud is a complete Telco-enabled cloud native stack for hosting CNFs, covering all telecom domains: Packet Core, RAN, OSS and BSS.
es: SUSE Telco Cloud es una pila nativa de la nube para telecomunicaciones diseñada para alojar CNF (construcciones de nube) y cubrir todos los ámbitos de las telecomunicaciones: Packet Core, RAN, OSS y BSS.
ja: SUSE Telco Cloudは、CNFをホストするための完全な通信事業者対応のクラウドネイティブなスタックであり、すべての通信ドメイン(Packet Core、RAN、OSS、BSS)をカバーします。
zh_cn: SUSE Telco Cloud 是一套支持电信功能的完整云原生技术栈，适用于托管云原生网络功能 (CNF)，覆盖所有电信领域：分组核心网 (Packet Core)、无线接入网 (RAN)、运营支撑系统 (OSS) 和业务支撑系统 (BSS)。

source: Automates zero-touch rollout and lifecycle management of complex edge stack configurations at Telco scale.
es: Automatiza la distribución sin intervención y la gestión del ciclo de vida de configuraciones complejas de pilas periféricas dirigidas a las telecomunicaciones.
ja: エッジスタックの複雑な設定を通信事業者の規模で自動的にゼロタッチでロールアウトし、ライフサイクルを管理します。
pt_br: Automatiza a distribuição "zero touch" e o gerenciamento do ciclo de vida de configurações complexas da pilha de borda de acordo com a escala de telecomunicações.
zh_cn: 能实现电信级规模下复杂边缘堆栈配置的零接触部署及生命周期管理自动化。

source: Continuously assures quality on Telco-grade hardware, using Telco-specific configurations and workloads.
es: Garantiza continuamente la calidad del hardware para telecomunicaciones, utilizando configuraciones y cargas de trabajo específicas para el sector.
ja: 通信事業者に固有の設定とワークロードを使用して、通信事業者グレードのハードウェアの品質を継続的に保証します。
pt_br: Garante a qualidade contínua do hardware voltado para telecomunicações usando as configurações e cargas de trabalho específicas dessa área.
zh_cn: 借助电信专用配置与工作负载，在电信级硬件上持续保障质量。

source: Consists of components that are purpose-built for the edge and hence have smaller footprint and higher performance per Watt.
es: Sus componentes están específicamente diseñados para usarse en edge computing, lo que ocupan menos espacio y ofrecen un mayor rendimiento por vatio.
ja: エッジ専用に設計されたコンポーネントで構成されているため、フットプリントが小さく、ワットパフォーマンスが高くなっています。
pt_br: Consiste em componentes desenvolvidos especificamente para a borda e, portanto, com menor pegada e maior desempenho por Watt.
zh_cn: 其组件专为边缘场景打造，因此资源占用更少，并且性能功耗比更高。
