Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Once the object is created, find and note the endpoint that gets assigned:
es: Una vez creado el objeto, busque y anote el punto final que se le asigna:
ja: オブジェクトが作成されたら、割り当てられるエンドポイントを見つけてメモを取ります。
pt_br: Depois que o objeto é criado, encontre e observe o endpoint que foi atribuído:
zh_cn: 创建该对象后，找到并记下分配的端点：

source: Alternatively, this can also be done from the UI.
es: Alternativamente, puede hacerlo desde la interfaz de usuario.
ja: または、UIからこの操作を実行することもできます。
pt_br: Você também pode fazer isso pela IU.
zh_cn: 或者，可以在 UI 中执行此操作。

source: UI Extension
es: Extensión de interfaz de usuario
ja: UI拡張機能
pt_br: Extensão de IU
zh_cn: UI 扩展

source: From the OS Management extension, click "Create Registration Endpoint":
es: Desde la extensión de gestión del sistema operativo, haga clic en "Create Registration Endpoint" (Crear punto final de registro):
ja: ［OS Management extension (OS管理拡張機能)］から［Create Registration Endpoint (登録エンドポイントの作成) ］をクリックします。
pt_br: Na extensão OS Management, clique em "Create Registration Endpoint" (Criar endpoint de registro):
zh_cn: 在“OS Management”（操作系统管理）扩展中，单击“Create Registration Endpoint”（创建注册端点）：

source: Click Create Registration
es: Haga clic en Create Registration (Crear registro).
ja: ［Create Registration (登録の作成)］をクリックします。
pt_br: Clique em Create Registration (Criar registro).
zh_cn: 单击“Create Registration”（创建注册）

source: Give this configuration a name.
es: Asigne un nombre a esta configuración.
ja: この設定に名前を付けます。
pt_br: Dê um nome para esta configuração.
zh_cn: 为此配置命名。

source: Add Name
es: Adición del nombre
ja: 名前の追加
pt_br: Adicionar nome
zh_cn: 添加名称

source: You can ignore the Cloud Configuration field as the data here is overridden by the following steps with Edge Image Builder.
es: Puede ignorar el campo "Cloud Configuration" (Configuración de la nube) porque estos datos se sobrescriben con los del paso siguiente con Edge Image Builder.
ja: ［Cloud Configuration (クラウドの設定)］フィールドは無視して構いません。ここのデータは、Edge Image Builderを使用した次の手順で上書きされるためです。
pt_br: Você pode ignorar o campo Cloud Configuration (Configuração de nuvem) já que os dados nele serão substituídos ao executar as etapas a seguir com o Edge Image Builder.
zh_cn: 您可以忽略“Cloud Configuration”（云配置）字段，因为此处的数据将被 Edge Image Builder 中的后续步骤覆盖。

source: Next, scroll down and click "Add Label" for each label you want to be on the resource that gets created when a machine registers. This is useful for distinguishing machines.
es: A continuación, desplácese hacia abajo y haga clic en "Add Label" (Añadir etiqueta) para cada etiqueta que desee que aparezca en el recurso que se crea cuando se registra un equipo. Esto resulta útil para distinguir cada equipo.
ja: 次に、下にスクロールして、マシンの登録時に作成されるリソースに付ける各ラベルに対して［Add Label (ラベルの追加)］をクリックします。これはマシンを区別するのに役立ちます。
pt_br: Em seguida, role para baixo e clique em "Add Label" (Adicionar rótulo) para cada rótulo que deseja incluir no recurso criado quando a máquina é registrada. Isso é útil para distinguir as máquinas.
zh_cn: 接下来，向下滚动并单击“Add Label”（添加标签），为注册计算机时创建的每个资源添加标签。标签可用于区分计算机。

source: Add Labels
es: Adición de etiquetas
ja: ラベルの追加
pt_br: Adicionar rótulos
zh_cn: 添加标签

source: Click "Create" to save the configuration.
es: Haga clic en "Create" (Crear) para guardar la configuración.
ja: ［Create (作成)］をクリックして、設定を保存します。
pt_br: Clique em "Create" (Criar) para salvar a configuração.
zh_cn: 单击“Create”（创建）以保存配置。

source: Once the registration is created, you should see the Registration URL listed and can click "Copy" to copy the address:
es: Una vez creado el registro, debería ver la URL de registro en la lista y puede hacer clic en "Copy" (Copiar) para copiar la dirección:
ja: 登録が作成されると、登録URLが表示され、［Copy (コピー)］ をクリックしてアドレスをコピーできます。
pt_br: Após a criação do registro, você deverá ver o URL dele listado e poderá clicar em "Copy" (Copiar) para copiar o endereço:
zh_cn: 创建注册后，您应该就会看到列出的注册 URL，此时可以单击“Copy”（复制）来复制该网址：

source: Copy URL
es: Copia de la URL
ja: URLのコピー
pt_br: Copiar URL
zh_cn: 复制 URL

source: If you clicked away from that screen, you can click "Registration Endpoints" in the left menu, then click the name of the endpoint you just created.
es: Si ha salido de esa pantalla, puede hacer clic en "Registration Endpoints" (Puntos finales de registro) en el menú de la izquierda y, a continuación, hacer clic en el nombre del punto final que acaba de crear.
ja: クリックしてその画面から移動してしまった場合は、左側のメニューの［Registration Endpoints (登録エンドポイント)］をクリックし、先ほど作成したエンドポイント名をクリックできます。
pt_br: Se você clicou fora dessa tela, pode clicar em "Registration Endpoints" (Endpoints de registro) no menu esquerdo e, depois, no nome do endpoint que acabou de criar.
zh_cn: 如果您退出了该屏幕，可以单击左侧菜单中的“Registration Endpoints”（注册端点），然后单击刚刚创建的端点的名称。

source: This URL is used in the next step.
es: Esta URL se usa en el paso siguiente.
ja: このURLは次の手順で使用します。
pt_br: Esse URL será usado na próxima etapa.
zh_cn: 此 URL 将在下一步骤中使用。

source: Build the image
es: Creación de la imagen
ja: イメージの構築
pt_br: Criar a imagem
zh_cn: 构建映像

source: While the current version of Elemental has a way to build its own installation media, in SUSE Edge 3.4 we do this with Kiwi and Edge Image Builder instead, so the resulting system is built with <link xl:href="https://www.suse.com/products/micro/">SUSE Linux Micro</link> as the base Operating System.
es: Aunque la versión actual de Elemental tiene una forma de crear su propio medio de instalación, en SUSE Edge 3.4 se hace con Kiwi y Edge Image Builder, por lo que el sistema resultante se crea con <link xl:href="https://www.suse.com/products/micro/">SUSE Linux Micro</link> como sistema operativo base.
ja: Elementalの現在のバージョンには独自のインストールメディアを構築する方法が用意されていますが、SUSE Edge 3.4では代わりにKiwiとEdge Image Builderでインストールメディアを構築します。したがって、生成されるシステムは、<link xl:href="https://www.suse.com/products/micro/">SUSE Linux Micro</link>をベースオペレーティングシステムとして構築されます。
zh_cn: 尽管当前版本的 Elemental 支持构建自身的安装媒体，但在 SUSE Edge 3.4 中，我们改用 Kiwi 和 Edge Image Builder 来完成此项工作，因此最终生成的系统将以 <link xl:href="https://www.suse.com/products/micro/">SUSE Linux Micro</link> 作为基础操作系统。

source: For more details on Kiwi, please follow Kiwi Image Builder process (<xref linkend="guides-kiwi-builder-images"/>) to build fresh images first and for Edge Image Builder, check out the Edge Image Builder Getting Started Guide (<xref linkend="quickstart-eib"/>) and also the Component Documentation (<xref linkend="components-eib"/>).
es: Para obtener más información sobre Kiwi, siga el proceso de creación de imágenes de Kiwi (<xref linkend="guides-kiwi-builder-images"/>) para crear imágenes nuevas en primer lugar. En el caso de Edge Image Builder, consulte la guía de introducción a Edge Image Builder (<xref linkend="quickstart-eib"/>) y la documentación de los componentes (<xref linkend="components-eib"/>).
ja: Kiwiの詳細については、まずKiwi Image Builderプロセス(<xref linkend="guides-kiwi-builder-images"/>)に従って、新しいイメージを構築してください。また、Edge Image Builderについては、Edge Image Builder導入ガイド(<xref linkend="quickstart-eib"/>)のほかに、コンポーネントのドキュメント(<xref linkend="components-eib"/>)も参照してください。
pt_br: Para saber mais detalhes sobre o Kiwi, siga o processo do construtor de imagens do Kiwi (<xref linkend="guides-kiwi-builder-images"/>) para primeiro criar novas imagens e, para o Edge Image Builder, consulte o Guia de Introdução do Edge Image Builder (<xref linkend="quickstart-eib"/>) e também a documentação do componente (<xref linkend="components-eib"/>).
zh_cn: 有关使用 Kiwi 的详细信息，请先按照 Kiwi 映像构建器流程（<xref linkend="guides-kiwi-builder-images"/>）构建全新映像；如要使用 Edge Image Builder，请参见 Edge Image Builder 入门指南（<xref linkend="quickstart-eib"/>）和组件文档（<xref linkend="components-eib"/>）。

source: From a Linux system with Podman installed, create the directories and place the base image being built by Kiwi:
es: Desde un sistema Linux con Podman instalado, cree los directorios y coloque la imagen base que está creando Kiwi:
ja: PodmanをインストールしたLinuxシステムで、ディレクトリを作成し、Kiwiによって構築されるゴールデンイメージを配置します。
pt_br: Em um sistema Linux com o Podman instalado, crie os diretórios e insira a imagem base criada pelo Kiwi:
zh_cn: 在安装了 Podman 的 Linux 系统中，创建相应目录并将 Kiwi 所构建的基础映像存放到其中：

source: The unencoded password is <literal>eib</literal>.
es: La contraseña sin cifrar es <literal>eib</literal>.
ja: エンコードされていないパスワードは<literal>eib</literal>です。
pt_br: A senha não codificada é <literal>eib</literal>.
zh_cn: 未编码的口令是 <literal>eib</literal>。

source: The <literal>sccRegistrationCode</literal> is needed to download and install the necessary RPMs from the official sources (alternatively, the <literal>elemental-register</literal> and <literal>elemental-system-agent</literal> RPMs can be manually side-loaded instead)
es: Se necesita el código <literal>sccRegistrationCode</literal> para descargar e instalar los paquetes RPM necesarios de las fuentes oficiales (alternativamente, los RPM <literal>elemental-register</literal> y <literal>elemental-system-agent</literal> se pueden cargar de forma manual y local).
ja: <literal>sccRegistrationCode</literal>は、公式なソースから必要なRPMをダウンロードしてインストールするために必要です(または、代わりに<literal>elemental-register</literal>および<literal>elemental-system-agent</literal>のRPMを手動でサイドロードすることもできます)。
pt_br: O <literal>sccRegistrationCode</literal> é necessário para fazer download e instalar os RPMs exigidos das fontes oficiais (se preferir, faça sideload manual dos RPMs <literal>elemental-register</literal> e o <literal>elemental-system-agent</literal> ).
zh_cn: 要从官方来源下载和安装必要的 RPM，则需要配置 <literal>sccRegistrationCode</literal>（或者，也可以手动侧载 <literal>elemental-register</literal> 和 <literal>elemental-system-agent</literal>）

source: The installation device will be wiped during the installation.
es: El dispositivo de instalación se borrará durante la instalación.
ja: インストールデバイスは、インストール中に消去されます。
pt_br: O dispositivo de instalação será apagado durante a instalação.
zh_cn: 安装期间将会擦除安装设备。

source: If you are booting a physical device, we need to burn the image to a USB flash drive. This can be done with:
es: Si está arrancando un dispositivo físico, es necesario grabar la imagen en una unidad flash USB. Puede hacerlo con:
ja: 物理デバイスをブートする場合は、イメージをUSBフラッシュ ドライブに書き込む必要があります。これは、次のコマンドで実行できます。
pt_br: Se você está inicializando um dispositivo físico, precisa gravar a imagem em uma unidade flash USB, o que pode ser feito com o comando:
zh_cn: 如果要引导物理设备，我们需要将映像刻录到 USB 闪存盘中。为此请使用以下命令：

source: Boot the downstream nodes
es: Arranque de los nodos descendentes
ja: ダウンストリームノードのブート
pt_br: Inicializar os nós downstream
zh_cn: 引导下游节点

source: Now that we have created the installation media, we can boot our downstream nodes with it.
es: Ahora que se ha creado el medio de instalación, se pueden arrancar los nodos descendentes con él.
ja: インストールメディアを作成したので、それを使用してダウンストリームノードをブートできます。
pt_br: Agora que já criamos a mídia de instalação, podemos inicializar os nós downstream com ela.
zh_cn: 现在我们已创建安装媒体，接下来可以用它来引导下游节点。

source: For each of the systems that you want to control with Elemental, add the installation media and boot the device. After installation, it will reboot and register itself.
es: Para cada sistema que desee controlar con Elemental, añada el medio de instalación y arranque el dispositivo. Tras la instalación, se reiniciará y se registrará automáticamente.
ja: Elementalで制御するシステムごとに、インストールメディアを追加してデバイスをブートします。インストールが完了すると、デバイスは再起動して自身を登録します。
pt_br: Para cada um dos sistemas que você quer controlar usando o Elemental, adicione a mídia de instalação e inicialize o dispositivo. Após a instalação, ele será reinicializado e se registrará.
zh_cn: 对于您要使用 Elemental 控制的每个系统，请添加安装媒体并引导设备。安装后，系统会重引导并自行注册。

source: If you are using the UI extension, you should see your node appear in the "Inventory of Machines."
es: Si utiliza la extensión de la interfaz de usuario, debería ver su nodo aparecer en "Inventory of Machines" (Inventario de equipos).
ja: UI拡張機能を使用している場合は、［Inventory of Machines (マシンのインベントリ)］にノードが表示されます。
pt_br: Se você usa a extensão de IU, deve ver o nó listado em "Inventory of Machines" (Inventário de máquinas).
zh_cn: 如果您正在使用 UI 扩展，则应会看到您的节点出现在“Inventory of Machines”（计算机清单）中。

source: Do not remove the installation medium until you’ve seen the login prompt; during first-boot files are still accessed on the USB stick.
es: No retire el medio de instalación hasta que haya visto el mensaje de inicio de sesión; durante el primer arranque, se sigue accediendo a los archivos desde la memoria USB.
ja: ログインプロンプトが表示されるまでインストールメディアを取り外さないでください。初回ブート時には、USBスティック上のファイルにアクセスしたままになります。
pt_br: Não remova o meio de instalação antes de ver o prompt de login. Durante a primeira inicialização, os arquivos ainda são acessados no dispositivo USB.
zh_cn: 在出现登录提示之前，请勿移除安装媒体；在首次引导期间，仍需访问 USB 记忆棒上的文件。

source: Create downstream clusters
es: Creación de clústeres descendentes
ja: ダウンストリームクラスタの作成
pt_br: Criar clusters downstream
zh_cn: 创建下游群集

source: There are two objects we need to create when provisioning a new cluster using Elemental.
es: Para aprovisionar un clúster nuevo con Elemental, debe crear dos objetos.
ja: Elementalを使用して新しいクラスタをプロビジョニングする際に作成する必要があるオブジェクトが2つあります。
pt_br: Precisamos criar dois objetos ao provisionar um novo cluster usando o Elemental.
zh_cn: 使用 Elemental 置备新群集时，需要创建两个对象。

source: The first is the <literal>MachineInventorySelectorTemplate</literal>. This object allows us to specify a mapping between clusters and the machines in the inventory.
es: El primero es <literal>MachineInventorySelectorTemplate</literal>. Este objeto permite especificar una asignación entre los clústeres y los equipos del inventario.
ja: 最初のオブジェクトは<literal>MachineInventorySelectorTemplate</literal>です。このオブジェクトにより、クラスタとインベントリ内のマシン間のマッピングを指定できます。
pt_br: O primeiro é o <literal>MachineInventorySelectorTemplate</literal>. Esse objeto permite especificar um mapeamento entre os clusters e as máquinas no inventário.
zh_cn: 第一个对象是 <literal>MachineInventorySelectorTemplate</literal>。此对象用于指定群集与清单中计算机之间的映射。

source: Create a selector which will match any machine in the inventory with a label:
es: Cree un selector que coincida con cualquier equipo del inventario con una etiqueta:
ja: インベントリ内のマシンをラベルに一致させるセレクタを作成します。
pt_br: Crie um seletor que corresponda qualquer máquina no inventário com um rótulo:
zh_cn: 创建一个选择器，用于根据标签匹配清单中的任何计算机：

source: Apply the resource to the cluster:
es: Aplique el recurso al clúster:
ja: リソースをクラスタに適用します。
pt_br: Aplique o recurso ao cluster:
zh_cn: 将资源应用于群集：

source: Obtain the name of the machine and add the matching label:
es: Obtenga el nombre del equipo máquina y añada la etiqueta correspondiente:
ja: マシンの名前を取得し、一致するラベルを追加します。
pt_br: Obtenha o nome da máquina e adicione o rótulo correspondente:
zh_cn: 获取计算机名称并添加匹配标签：

source: Create a simple single-node K3s cluster resource and apply it to the cluster:
es: Cree un recurso de clúster K3s simple de un solo nodo y aplíquelo al clúster:
ja: シンプルなシングルノードK3sクラスタリソースを作成し、クラスタに適用します。
pt_br: Crie um recurso de cluster K3s simples de nó único e aplique-o ao cluster:
zh_cn: 创建简单的单节点 K3s 群集资源，并将其应用于群集：

source: The UI extension allows for a few shortcuts to be taken. Note that managing multiple locations may involve too much manual work.
es: La extensión de la interfaz de usuario permite utilizar algunos atajos. Tenga en cuenta que la gestión de varias ubicaciones puede implicar mucho trabajo manual.
ja: UI拡張機能では、ショートカットをいくつか使用できます。複数の場所を管理する場合は、手動による作業が多くなりすぎる可能性があります。
pt_br: A extensão de IU permite o uso de alguns atalhos. Observe que o gerenciamento de vários locais pode envolver um trabalho manual excessivo.
zh_cn: 通过 UI 扩展可以采取几种简便做法。请注意，管理多个位置可能涉及大量的手动工作。

source: As before, open the left three-line menu and select "OS Management." This brings you back to the main screen for managing your Elemental systems.
es: Como antes, abra el menú de tres líneas de la izquierda y seleccione "OS Management" (Gestión del sistema operativo). Esto le llevará de vuelta a la pantalla principal para gestionar sus sistemas Elemental.
ja: 以前と同様に、左側の三本線メニューを開いて、［OS Management (OS管理)］を選択します。これで、Elementalシステムを管理するためのメイン画面に戻ります。
pt_br: Como já foi feito, abra o menu esquerdo de três linhas e selecione "OS Management". Você será levado de volta à tela principal para gerenciar seus sistemas Elemental.
zh_cn: 如前所述，打开左侧的三线菜单并选择“OS Management”（操作系统管理）。您随即会转到管理 Elemental 系统的主屏幕。

source: On the left sidebar, click "Inventory of Machines." This opens the inventory of machines that have registered.
es: En la barra lateral izquierda, haga clic en "Inventory of Machines" (Inventario de máquinas). Se abrirá el inventario de equipos que se han registrado.
ja: 左側のサイドバーで、［Inventory of Machines (マシンのインベントリ)］をクリックします。登録済みのマシンのインベントリが開きます。
pt_br: Na barra lateral esquerda, clique em "Inventory of Machines" (Inventário de máquinas). Essa ação abre o inventário das máquinas que foram registradas.
zh_cn: 在左侧边栏上，单击“Inventory of Machines”（计算机清单）。这会打开已注册计算机的清单。

source: To create a cluster from these machines, select the systems you want, click the "Actions" drop-down list, then "Create Elemental Cluster." This opens the Cluster Creation dialog while also creating a MachineSelectorTemplate to use in the background.
es: Para crear un clúster a partir de estos equipos, seleccione los sistemas que desee, haga clic en la lista desplegable "Actions" (Acciones) y, a continuación, en "Create Elemental Cluster" (Crear clúster de Elemental). Se abrirá el cuadro de diálogo "Cluster Creation" (Creación de clúster) y, al mismo tiempo, se creará una plantilla MachineSelectorTemplate para utilizarla en segundo plano.
ja: これらのマシンからクラスタを作成するには、必要なシステムを選択し、［Actions (アクション)］ドロップダウンリストから［Create Elemental Cluster (Elementalクラスタの作成)］をクリックします。［Cluster Creation (クラスタの作成)］ダイアログが開き、それと同時に、使用するMachineSelectorTemplateがバックグラウンドで作成されます。
pt_br: Para criar um cluster dessas máquinas, selecione os sistemas desejados, clique na lista suspensa "Actions" (Ações) e em "Create Elemental Cluster" (Criar cluster Elemental). Isso abre a caixa de diálogo Cluster Creation (Criação de cluster) e cria, ao mesmo tempo, um MachineSelectorTemplate para usar em segundo plano.
zh_cn: 要基于这些计算机创建群集，请选择所需的系统，单击“Actions”（操作）下拉列表，然后单击“Create Elemental Cluster”（创建 Elemental 群集）。这会打开“Cluster Creation”（创建群集）对话框，同时还会创建要在后台使用的 MachineSelectorTemplate。

source: On this screen, configure the cluster you want to be built. For this quick start, K3s v1.30.5+k3s1 is selected and the rest of the options are left as is.
es: En esta pantalla, configure el clúster que quiera crear. En esta guía, se selecciona K3s v1.30.5+k3s1, y el resto de las opciones se dejan tal cual.
ja: この画面では、構築するクラスタを設定します。このクイックスタートでは、K3s v1.30.5+k3s1が選択され、残りのオプションはそのままにしておきます。
pt_br: Nessa tela, configure o cluster que deseja criar. Neste início rápido, o K3s v1.30.5+k3s1 foi selecionado, e as demais opções foram mantidas como estavam.
zh_cn: 在此屏幕上，配置您要构建的群集。本快速入门选择了“K3s v1.30.5+k3s1”，其余选项保持原样。

source: You may need to scroll down to see more options.
es: Tendrá que desplazarse por la página para ver más opciones.
ja: 他のオプションを表示するには、下にスクロールする必要がある場合があります。
pt_br: Pode ser necessário rolar para abaixo para ver mais opções.
zh_cn: 可能需要向下滚动才能看到更多选项。

source: After creating these objects, you should see a new Kubernetes cluster spin up using the new node you just installed with.
es: Después de crear estos objetos, debería ver cómo se inicia un nuevo clúster de Kubernetes que usa el nuevo nodo que acaba de instalar.
ja: これらのオブジェクトを作成したら、先ほどインストールした新しいノードを使用して新しいKubernetesクラスタがスピンアップするはずです。
pt_br: Após a criação dos objetos, você deverá ver um novo cluster Kubernetes dar arranque (partida) usando o nó com o qual você acabou de instalar.
zh_cn: 创建这些对象后，您应会看到一个新的 Kubernetes 群集使用刚刚安装的新节点运行。

source: Node Reset (Optional)
es: Restablecimiento del nodo (opcional)
ja: ノードリセット(オプション)
pt_br: Redefinição de nó (opcional)
zh_cn: 节点重置（可选）

source: SUSE Rancher Elemental supports the ability to perform a "node reset" which can optionally trigger when either a whole cluster is deleted from Rancher, a single node is deleted from a cluster, or a node is manually deleted from the machine inventory. This is useful when you want to reset and clean-up any orphaned resources and want to automatically bring the cleaned node back into the machine inventory so it can be reused. This is not enabled by default, and thus any system that is removed, will not be cleaned up (i.e. data will not be removed, and any Kubernetes cluster resources will continue to operate on the downstream clusters) and it will require manual intervention to wipe data and re-register the machine to Rancher via Elemental.
es: SUSE Rancher Elemental permite realizar un "restablecimiento de nodo", que se puede activar opcionalmente cuando se elimina todo un clúster de Rancher o un solo nodo de un clúster, o cuando se elimina manualmente un nodo del inventario de equipos. Esto resulta útil cuando se desean restablecer y limpiar los recursos huérfanos y se quiere volver a incorporar automáticamente el nodo limpiado al inventario de equipos para que pueda reutilizarse. Esta función no está habilitada de forma predeterminada, por lo que no se limpiará cualquier sistema que se elimine (es decir, los datos no se eliminarán y los recursos del clúster de Kubernetes seguirán funcionando en los clústeres descendentes) y será necesaria una intervención manual para borrar los datos y volver a registrar el equipo en Rancher a través de Elemental.
ja: SUSE Rancher Elementalは、「ノードリセット」を実行する機能をサポートしています。ノードリセットは、Rancherからクラスタ全体が削除されたとき、クラスタからシングルノードが削除されたとき、またはマシンインベントリからノードが手動で削除されたときに任意でトリガできます。これは、孤立したリソースをリセットしてクリーンアップし、クリーンアップされたノードを自動的にマシンインベントリに戻して再利用可能にする場合に役立ちます。ノードリセットはデフォルトでは有効になっていないため、削除されたシステムはクリーンアップされず(つまり、データは削除されず、Kubernetesクラスタリソースはダウンストリームクラスタで動作し続けます)、データを消去してマシンをElemental経由でRancherに再登録するには手動操作が必要となります。
pt_br: O SUSE Rancher Elemental permite executar uma "redefinição de nó", que pode ser acionada quando um cluster inteiro é excluído do Rancher, um único nó é excluído do cluster ou um nó é excluído manualmente do inventário de máquinas. Esse recurso é útil para redefinir e limpar recursos órfãos e recuperar automaticamente o nó limpo no inventário de máquinas para que possa ser reutilizado. Isso não está habilitado por padrão e, portanto, um sistema que foi removido não será limpo (ou seja, os dados não serão removidos, e os recursos do cluster Kubernetes continuarão operando nos clusters downstream), será necessária uma intervenção manual para limpar os dados e registrar a máquina novamente no Rancher pelo Elemental.
zh_cn: SUSE Rancher Elemental 支持执行“节点重置”，从 Rancher 中删除整个群集、从群集中删除单个节点或者从计算机清单中手动删除某个节点时，可以选择性地触发该操作。当您想要重置和清理任何孤立资源，并希望自动将清理的节点放回计算机清单以便重复使用时，此功能非常有用。默认未启用此功能，因此不会清理任何已去除的系统（即，不会去除数据，任何 Kubernetes 群集资源将继续在下游群集上运行），并且需要手动干预才能擦除数据，并通过 Elemental 将计算机重新注册到 Rancher。

source: If you wish for this functionality to be enabled by default, you need to make sure that your <literal>MachineRegistration</literal> explicitly enables this by adding <literal>config.elemental.reset.enabled: true</literal>, for example:
es: Si desea que esta funcionalidad esté habilitada de forma predeterminada, debe asegurarse de que esté explícitamente habilitada en <literal>MachineRegistration</literal> añadiendo <literal>config.elemental.reset.enabled: true</literal>, por ejemplo:
ja: この機能をデフォルトで有効にするには、&#x200B;<literal>MachineRegistration</literal>に&#x200B;<literal>config.elemental.reset.enabled: true</literal>を追加して明示的に有効にする必要があります。例:
pt_br: Para habilitar essa funcionalidade por padrão, você precisa garantir que o <literal>MachineRegistration</literal> a habilite explicitamente adicionando <literal>config.elemental.reset.enabled: true</literal>, por exemplo:
zh_cn: 如果您希望默认启用此功能，则需要通过添加 <literal>config.elemental.reset.enabled: true</literal>，来确保 <literal>MachineRegistration</literal> 明确启用此功能，例如：
