Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Minimum 8 GB RAM and 20 GB disk space for development or testing (see <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements#hardware-requirements">here</link> for production use)
es: Un mínimo de 8 GB de RAM y 20 GB de espacio en disco para desarrollo o pruebas (consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements#hardware-requirements">este documento</link> para casos de producción)
ja: 開発またはテスト用の場合、最小8GBのRAMと20GBのディスク容量(運用環境での使用については<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements#hardware-requirements">こちら</link>を参照)
zh_cn: 开发或测试环境至少需要 8 GB 内存和 20 GB 磁盘空间（生产环境要求请参见<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements#hardware-requirements">此处</link>）

source: A target node to be provisioned, i.e. the edge device (a virtual machine can be used for demoing or testing purposes)
es: Un nodo de destino que se va a aprovisionar, es decir, el dispositivo periférico (se puede utilizar una máquina virtual para fines de demostración o pruebas)
ja: プロビジョニングするターゲットノード、すなわちエッジデバイス(デモまたはテストの場合は仮想マシンを使用可能)
pt_br: O provisionamento de um nó de destino, ou seja, o dispositivo de borda (é possível usar uma máquina virtual para fins de demonstração ou teste)
zh_cn: 要置备的目标节点，即边缘设备（可以使用虚拟机进行演示或测试）

source: Minimum 4GB RAM, 2 CPU cores, and 20 GB disk
es: Mínimo de 4 GB de RAM, CPU de 2 núcleos y 20 GB de disco
ja: 最小4GBのRAM、2 CPUコア、20GBのディスク
pt_br: Mínimo de 4GB de RAM, 2 núcleos de CPU e disco de 20 GB
zh_cn: 至少 4GB RAM、2 个 CPU 核心和 20 GB 磁盘空间

source: A resolvable host name for the management cluster or a static IP address to use with a service like sslip.io
es: Un nombre de host resoluble para el clúster de gestión o una dirección IP estática para utilizar con un servicio como sslip.io
ja: 管理クラスタの解決可能なホスト名、またはsslip.ioなどのサービスで使用する静的IPアドレス
pt_br: Um nome de host "resolvable" para o cluster de gerenciamento ou um endereço IP estático para usar com um serviço do tipo sslip.io
zh_cn: 管理群集的可解析主机名，或用于 sslip.io 等服务的静态 IP 地址

source: A host to build the installation media via Edge Image Builder
es: Un host para crear el medio de instalación a través de Edge Image Builder
ja: Edge Image Builderでインストールメディアを構築するためのホスト
pt_br: Um host para montar a mídia de instalação usando o Edge Image Builder
zh_cn: 用于通过 Edge Image Builder 构建安装媒体的主机

source: Running SLES 15 SP6, openSUSE Leap 15.6, or another compatible operating system that supports Podman.
es: Ejecutar SLES 15 SP6, openSUSE Leap 15.6 u otro sistema operativo compatible que admita Podman
ja: SLES 15 SP6、openSUSE Leap 15.6、またはPodmanをサポートする他の互換性のあるオペレーティングシステムを実行している
pt_br: SLES 15 SP6, openSUSE Leap 15.6 ou outro sistema operacional compatível em execução com suporte ao Podman
zh_cn: 运行 SLES 15 SP6、openSUSE Leap 15.6 或其他支持 Podman 的兼容操作系统。

source: With <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>, <link xl:href="https://podman.io">Podman</link>, and <link xl:href="https://helm.sh">Helm</link> installed
es: Con <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>, <link xl:href="https://podman.io">Podman</link> y <link xl:href="https://helm.sh">Helm</link> instalados
ja: <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>、<link xl:href="https://podman.io">Podman</link>、および<link xl:href="https://helm.sh">Helm</link>がインストールされていること
pt_br: Com o <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>, o <link xl:href="https://podman.io">Podman</link> e o <link xl:href="https://helm.sh">Helm</link> instalados
zh_cn: 已安装 <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>、<link xl:href="https://podman.io">Podman</link> 和 <link xl:href="https://helm.sh">Helm</link>

source: A USB flash drive to boot from (if using physical hardware)
es: Una unidad flash USB desde la que arrancar (si se utiliza hardware físico)
ja: ブート用のUSBフラッシュドライブ(物理ハードウェアを使用する場合)
pt_br: Uma unidade flash USB de origem para inicialização (em caso de hardware físico)
zh_cn: 用于引导的 USB 闪存盘（如果使用物理硬件）

source: A downloaded copy of the latest SUSE Linux Micro 6.1 SelfInstall ISO image found <link xl:href="https://www.suse.com/download/sle-micro/">here</link>.
es: Una copia descargada de la última imagen ISO de autoinstalación de SUSE Linux Micro 6.1, que se encuentra <link xl:href="https://www.suse.com/download/sle-micro/">aquí</link>
ja: 最新のSUSE Linux Micro 6.1 SelfInstall ISOイメージのダウンロードコピー(<link xl:href="https://www.suse.com/download/sle-micro/">こちら</link>から入手可能です)
pt_br: Uma cópia baixada da imagem ISO mais recente do SelfInstall do SUSE Linux Micro 6.1 disponível <link xl:href="https://www.suse.com/download/sle-micro/">aqui</link>.
zh_cn: 下载的最新 SUSE Linux Micro 6.1 自安装 ISO 映像，该映像可在<link xl:href="https://www.suse.com/download/sle-micro/">此处</link>获取。

source: Existing data found on target machines will be overwritten as part of the process, please make sure you backup any data on any USB storage devices and disks attached to target deployment nodes.
es: Los datos existentes en los equipos de destino se sobrescribirán como parte del proceso, por lo que debe asegurarse de realizar una copia de seguridad de todos los datos almacenados en dispositivos USB y discos conectados a los nodos de despliegue de destino.
ja: ターゲットマシンにある既存のデータはこのプロセスの一環として上書きされます。ターゲットデプロイメントノードに接続されているUSBストレージデバイスやディスク上のデータは、必ずバックアップしてください。
pt_br: Os dados existentes nas máquinas de destino serão substituídos como parte do processo. Faça um backup dos dados em dispositivos de armazenamento USB e discos conectados aos nós de implantação de destino.
zh_cn: 在初始配置过程中会重写目标计算机上的现有数据，因此请务必备份挂接到目标部署节点的所有 USB 存储设备和磁盘上的所有数据。

source: This guide is created using a Digital Ocean droplet to host the upstream cluster and an Intel NUC as the downstream device. For building the installation media, SUSE Linux Enterprise Server is used.
es: En esta guía se utiliza un droplet de Digital Ocean para alojar el clúster ascendente y un NUC Intel como dispositivo descendente. Para crear el medio de instalación, se utiliza SUSE Linux Enterprise Server.
ja: このガイドは、アップストリームクラスタをホストするためにDigital Oceanドロップレットを使用し、ダウンストリームデバイスとしてIntel NUCを使用して作成されています。インストールメディアの構築には、SUSE Linux Enterprise Serverを使用しています。
pt_br: Este guia foi criado com um droplet da DigitalOcean para hospedar o cluster upstream e com um Intel NUC como dispositivo downstream. Para montar a mídia de instalação, o SUSE Linux Enterprise Server foi usado.
zh_cn: 本指南是使用托管上游群集的 Digital Ocean droplet 以及用作下游设备的 Intel NUC 制作的。为了构建安装媒体，我们使用了 SUSE Linux Enterprise Server。

source: Build bootstrap cluster
es: Creación del clúster de arranque
ja: ブートストラップクラスタの構築
pt_br: Criar o cluster de inicialização
zh_cn: 构建引导群集

source: Start by creating a cluster capable of hosting Rancher and Elemental. This cluster needs to be routable from the network that the downstream nodes are connected to.
es: Para empezar, cree un clúster capaz de alojar Rancher y Elemental. Este clúster debe ser enrutable desde la red a la que están conectados los nodos descendentes.
ja: まず、RancherとElementalをホストできるクラスタを作成します。このクラスタは、ダウンストリームノードが接続されているネットワークからルーティングできる必要があります。
pt_br: Para começar, crie um cluster capaz de hospedar o Rancher e o Elemental. Esse cluster precisa ser roteável na rede à qual os nós downstream estão conectados.
zh_cn: 首先创建一个能够托管 Rancher 和 Elemental 的群集。必须可以从下游节点所连接到的网络路由此群集。

source: Create Kubernetes cluster
es: Creación del clúster de Kubernetes
ja: Kubernetesクラスタの作成
pt_br: Criar o cluster Kubernetes
zh_cn: 创建 Kubernetes 群集

source: If you are using a hyperscaler (such as Azure, AWS or Google Cloud), the easiest way to set up a cluster is using their built-in tools. For the sake of conciseness in this guide, we do not detail the process of each of these options.
es: Si utiliza un hiperescalador (como Azure, AWS o Google Cloud), la forma más sencilla de configurar un clúster es utilizando sus herramientas integradas. Para que esta guía sea más concisa, no se detalla el proceso de cada una de estas opciones.
ja: ハイパースケーラ(Azure、AWS、Google Cloudなど)を使用している場合、クラスタを設定する最も簡単な方法は、ハイパースケーラのビルトインツールを使用することです。このガイドでは、簡潔にするために、これらの各オプションのプロセスについては詳述しません。
pt_br: Se você usa um hiperescalador (como Azure, AWS ou Google Cloud), a maneira mais fácil de configurar um cluster é usar as ferramentas incorporadas dele. Para manter este guia conciso, não detalhamos o processo de cada uma dessas opções.
zh_cn: 如果您使用的是超大规模云（例如 Azure、AWS 或 Google Cloud），那么，设置群集的最简单方法是使用这些云的内置工具。为简洁起见，本指南不会详细介绍使用每种选项的操作过程。

source: If you are installing onto bare-metal or another hosting service where you need to also provide the Kubernetes distribution itself, we recommend using <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>.
es: Si va a realizar la instalación en un servidor físico u otro servicio de alojamiento en el que también deba proporcionar la distribución de Kubernetes, le recomendamos que utilice <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>.
ja: ベアメタルや別のホスティングサービスにインストールしようとしていて、Kubernetesディストリビューションそのものも用意する必要がある場合は、<link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>を使用することをお勧めします。
pt_br: Se você está instalando em um serviço de hospedagem bare metal, ou algum outro, e precisa também providenciar a própria distribuição Kubernetes, recomendamos usar o <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>.
zh_cn: 如果您要安装到裸机或其他宿主服务，同时需要提供 Kubernetes 发行版本身，我们建议您使用 <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>。

source: Set up DNS
es: Configuración de DNS
ja: DNSの設定
pt_br: Configurar o DNS
zh_cn: 设置 DNS

source: Before continuing, you need to set up access to your cluster. As with the setup of the cluster itself, how you configure DNS will be different depending on where it is being hosted.
es: Antes de continuar, debe configurar el acceso a su clúster. Como ocurre con la configuración del propio clúster, la forma de configurar el servidor DNS variará en función del lugar donde esté alojado.
ja: 続行する前に、クラスタへのアクセスを設定する必要があります。クラスタ自体のセットアップと同様に、DNSの設定方法は、クラスタがホストされている場所によって異なります。
pt_br: Antes de continuar, você precisa configurar o acesso ao cluster. Assim como na configuração do próprio cluster, a configuração do DNS será diferente dependendo do local onde ele está hospedado.
zh_cn: 在继续之前，需要设置群集访问权限。与群集本身的设置一样，DNS 的配置方式因群集的托管位置而异。

source: If you do not want to handle setting up DNS records (for example, this is just an ephemeral test server), you can use a service like <link xl:href="https://sslip.io">sslip.io</link> instead. With this service, you can resolve any IP address with <literal>&lt;address&gt;.sslip.io</literal>.
es: Si no desea ocuparse de la configuración de los registros DNS (por ejemplo, si se trata solo de un servidor de prueba efímero), puede utilizar un servicio como <link xl:href="https://sslip.io">sslip.io</link> en su lugar. Con este servicio, puede resolver cualquier dirección IP con <literal>&lt;dirección&gt;.sslip.io</literal>.
ja: DNSレコードの設定を扱わない場合(たとえば、これが一時的なテストサーバである場合)、代わりに<link xl:href="https://sslip.io">sslip.io</link>などのサービスを使用できます。このサービスを使用すると、<literal>&lt;address&gt;.sslip.io</literal>を使用して任意のIPアドレスを解決できます。
pt_br: Se você não deseja configurar registros DNS (por exemplo, quando se trata apenas de um servidor de teste efêmero), uma alternativa é usar um serviço como o <link xl:href="https://sslip.io">sslip.io</link>. Com ele, você resolve qualquer endereço IP com <literal>&lt;endereço&gt;.sslip.io</literal>.
zh_cn: 如果您不想处理 DNS 记录的设置（例如，这只是一个临时使用的测试服务器），可以改用 <link xl:href="https://sslip.io">sslip.io</link> 之类的服务。通过此服务，可以使用 <literal>&lt;address&gt;.sslip.io</literal> 解析任何 IP 地址。

source: To install Rancher, you need to get access to the Kubernetes API of the cluster you just created. This looks different depending on what distribution of Kubernetes is being used.
es: Para instalar Rancher, necesitas acceder a la API de Kubernetes del clúster que acabas de crear. Esto varía en función de la distribución de Kubernetes que se utilice.
ja: Rancherをインストールするには、作成したクラスタのKubernetes APIにアクセスする必要があります。これは、使用しているKubernetesのディストリビューションによって異なります。
pt_br: Para instalar o Rancher, você precisa acessar a API Kubernetes do cluster que acabou de criar. Esse procedimento muda dependendo da distribuição Kubernetes que é usada.
zh_cn: 要安装 Rancher，需要访问刚刚创建的群集的 Kubernetes API。具体方式因使用的 Kubernetes 发行版而异。

source: For RKE2, the kubeconfig file will have been written to <literal>/etc/rancher/rke2/rke2.yaml</literal>. Save this file as <literal>~/.kube/config</literal> on your local system. You may need to edit the file to include the correct externally routable IP address or host name.
es: Para RKE2, el archivo kubeconfig se habrá escrito en <literal>/etc/rancher/rke2/rke2.yaml</literal>. Guarde este archivo como <literal>~/.kube/config</literal> en su sistema local. Es posible que tenga que editar el archivo para incluir la dirección IP o el nombre de host externos correctos.
ja: RKE2の場合、kubeconfigファイルは<literal>/etc/rancher/rke2/rke2.yaml</literal>に書き込まれます。このファイルをローカルシステムに<literal>~/.kube/config</literal>として保存します。このファイルを編集して、外部にルーティング可能な正しいIPアドレスまたはホスト名を含めなければならない場合があります。
pt_br: Para o RKE2, o arquivo kubeconfig será gravado em <literal>/etc/rancher/rke2/rke2.yaml</literal>. Salve-o como <literal>~/.kube/config</literal> no sistema local. Talvez você tenha que editar o arquivo para incluir o endereço IP ou o nome de host roteável externamente correto.
zh_cn: 对于 RKE2，kubeconfig 文件会写入 <literal>/etc/rancher/rke2/rke2.yaml</literal>。将此文件作为 <literal>~/.kube/config</literal> 保存在本地系统上。可能需要编辑该文件，以包含正确的外部可路由 IP 地址或主机名。

source: Install Rancher easily with the commands from the <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancher Documentation</link>:
es: Instale Rancher fácilmente con los comandos de la <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">documentación de Rancher</link>:
ja: <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancherのドキュメント</link>に記載されているコマンドを使用して、Rancherを簡単にインストールできます。
zh_cn: 您可通过 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancher 文档</link>中的命令轻松安装 Rancher：

source: Install <link xl:href="https://cert-manager.io">cert-manager</link>:
es: Instale <link xl:href="https://cert-manager.io">cert-manager</link>:
ja: <link xl:href="https://cert-manager.io">cert-manager</link>をインストールします。
pt_br: Instale o <link xl:href="https://cert-manager.io">cert-manager</link>:
zh_cn: 安装 <link xl:href="https://cert-manager.io">cert-manager</link>：

source: Then install Rancher itself:
es: Después, instale Rancher:
ja: 次に、Rancher自体をインストールします。
pt_br: Em seguida, instale o próprio Rancher:
zh_cn: 然后安装 Rancher 本身：

source: If this is intended to be a production system, please use cert-manager to configure a real certificate (such as one from Let’s Encrypt).
es: Si se trata de un sistema de producción, use cert-manager para configurar un certificado real (como uno de Let’s Encrypt).
ja: これを運用システムにする予定の場合は、cert-managerを使用して、実際の証明書(Let's Encryptの証明書など)を設定してください。
pt_br: Se a finalidade do sistema é de produção, use o cert-manager para configurar um certificado real (como aquele da Let’s Encrypt).
zh_cn: 如果目标系统是生产系统，请使用 cert-manager 配置实际证书（例如 Let's Encrypt 提供的证书）。

source: Browse to the host name you set up and log in to Rancher with the <literal>bootstrapPassword</literal> you used. You will be guided through a short setup process.
es: Busque el nombre de host que ha configurado e inicie sesión en Rancher con la contraseña que ha utilizado en <literal>bootstrapPassword</literal>. Se le guiará a través de un breve proceso de configuración.
ja: 設定したホスト名をブラウズし、使用した<literal>bootstrapPassword</literal>でRancherにログインします。ガイドに従って簡単なセットアッププロセスを完了します。
pt_br: Procure o nome de host que você configurou e faça login no Rancher com a <literal>bootstrapPassword</literal> usada. Você será guiado por um curto processo de configuração.
zh_cn: 浏览到您设置的主机名，然后使用您的 <literal>bootstrapPassword</literal> 登录到 Rancher。系统将指导您完成一个简短的设置过程。

source: Install Elemental
es: Instalación de Elemental
ja: Elementalのインストール
pt_br: Instalar o Elemental
zh_cn: 安装 Elemental

source: With Rancher installed, you can now install the Elemental operator and required CRD’s. The Helm chart for Elemental is published as an OCI artifact so the installation is a little simpler than other charts. It can be installed from either the same shell you used to install Rancher or in the browser from within Rancher’s shell.
es: Una vez instalado Rancher, ya puede instalar el operador de Elemental y las CRD necesarias. El chart de Helm para Elemental se publica como un artefacto OCI, por lo que la instalación es un poco más sencilla que la de otros charts. Se puede instalar desde la misma shell que se utilizó para instalar Rancher o en el navegador desde la shell de Rancher.
ja: Rancherをインストールしたら、続いてElementalのオペレータと必要なCRDをインストールできます。Elemental用のHelmチャートはOCIアーティファクトとして公開されているため、インストールは他のチャートよりも若干シンプルです。Rancherのインストールに使用したものと同じシェルからインストールすることも、ブラウザでRancherのシェル内からインストールすることもできます。
pt_br: Com o Rancher instalado, agora você pode instalar o operador Elemental e as CRDs necessárias. O gráfico Helm do Elemental foi publicado como um artefato OCI, portanto, a instalação é um pouco mais simples do que a dos outros gráficos. É possível instalá-lo do mesmo shell usado para instalar o Rancher ou no navegador dentro do shell do Rancher.
zh_cn: 安装 Rancher 后，接下来可以安装 Elemental Operator 和所需的 CRD。Elemental 的 Helm chart 作为 OCI 制品发布，因此其安装过程比其他 chart 略简单一些。可以通过您用来安装 Rancher 的同一外壳安装 Helm chart，也可以在浏览器中通过 Rancher 的外壳安装。

source: (Optionally) Install the Elemental UI extension
es: (Opcional) Instale la extensión de interfaz de usuario de Elemental
ja: (オプション) Elemental UI拡張機能のインストール
pt_br: Instalar a extensão de IU do Elemental (opcional)
zh_cn: （可选）安装 Elemental UI 扩展

source: To use the Elemental UI, log in to your Rancher instance, click the three-line menu in the upper left:
es: Para usar la interfaz de usuario de Elemental, inicie sesión en su instancia de Rancher y haga clic en el menú de tres líneas de la parte superior izquierda:
ja: Elemental UIを使用するには、Rancherインスタンスにログインし、左上の三本線のメニューをクリックします。
pt_br: Para usar a IU do Elemental, faça login na instância do Rancher e clique no menu de três linhas na parte superior esquerda:
zh_cn: 要使用 Elemental UI，请登录到您的 Rancher 实例，单击左上角的三线菜单：

source: Installing Elemental extension 1
es: Instalación de la extensión de Elemental 1
ja: Elemental拡張機能のインストール1
zh_cn: 安装 Elemental 扩展 1

source: From the "Available" tab on this page, click "Install" on the Elemental card:
es: En la pestaña "Available" (Disponible) de esta página, haga clic en "Install" (Instalar) en la tarjeta de Elemental:
ja: このページの［Available (使用可能)］タブから、Elementalカードの［Install (インストール)］をクリックします。
pt_br: Na guia "Available" (Disponível) nesta página, clique em "Install" (Instalar) no cartão Elemental:
zh_cn: 在此页面上的“Available”（可用）选项卡中，单击“Elemental”卡片上的“Install”（安装）：

source: Installing Elemental extension 2
es: Instalación de la extensión 2 de Elemental
ja: Elemental拡張機能のインストール2
pt_br: Instalando a extensão 2 do Elemental
zh_cn: 安装 Elemental 扩展 2

source: Confirm that you want to install the extension:
es: Confirme que desea instalar la extensión:
ja: 拡張機能をインストールすることを確認します。
pt_br: Confirme que você deseja instalar a extensão:
zh_cn: 确认您要安装该扩展：

source: Installing Elemental extension 3
es: Instalación de la extensión 3 de Elemental
ja: Elemental拡張機能のインストール3
pt_br: Instalando a extensão 3 do Elemental
zh_cn: 安装 Elemental 扩展 3

source: After it installs, you will be prompted to reload the page.
es: Cuando se instale, se le pedirá que vuelva a cargar la página.
ja: インストール後、ページを再ロードするよう求められます。
pt_br: Após a instalação, será solicitado que você recarregue a página.
zh_cn: 安装后，系统将提示您重新加载页面。

source: Installing Elemental extension 4
es: Instalación de la extensión 4 de Elemental
ja: Elemental拡張機能のインストール4
pt_br: Instalando a extensão 4 do Elemental
zh_cn: 安装 Elemental 扩展 4

source: Once you reload, you can access the Elemental extension through the "OS Management" global app.
es: Tras el reinicio, podrá acceder a la extensión de Elemental a través de la aplicación global "OS Management" (Gestión del sistema operativo).
ja: 再ロードすると、［OS Management (OS管理)］グローバルアプリからElemental拡張機能にアクセスできるようになります。
pt_br: Após o recarregamento, acesse a extensão do Elemental pelo app global "OS Management".
zh_cn: 重新加载后，可以通过“OS Management”（操作系统管理）全局应用程序访问 Elemental 扩展。

source: Accessing Elemental extension
es: Acceso a la extensión de Elemental
ja: Elemental拡張機能へのアクセス
pt_br: Acessando a extensão do Elemental
zh_cn: 访问 Elemental 扩展

source: Configure Elemental
es: Configuración de Elemental
ja: Elementalの設定
pt_br: Configurar o Elemental
zh_cn: 配置 Elemental

source: For simplicity, we recommend setting the variable <literal>$ELEM</literal> to the full path of where you want the configuration directory:
es: Por sencillez, se recomienda configurar la variable <literal>$ELEM</literal> con la vía completa donde desea que se encuentre el directorio de configuración:
ja: シンプルにするために、変数<literal>$ELEM</literal>を、設定ディレクトリを配置する場所のフルパスに設定することをお勧めします。
pt_br: Para simplificar, recomendamos definir a variável <literal>$ELEM</literal> como o caminho completo do local desejado para o diretório de configuração:
zh_cn: 为方便起见，我们建议将变量 <literal>$ELEM</literal> 设置为配置目录所在的完整路径：

source: To allow machines to register to Elemental, we need to create a <literal>MachineRegistration</literal> object in the <literal>fleet-default</literal> namespace.
es: Para permitir que las máquinas se registren en Elemental, se necesita crear un objeto <literal>MachineRegistration</literal> en el espacio de nombres <literal>fleet-default</literal>.
ja: マシンがElementalに登録できるようにするために、<literal>fleet-default</literal>ネームスペースに<literal>MachineRegistration</literal>オブジェクトを作成する必要があります。
pt_br: Para que as máquinas sejam registradas no Elemental, precisamos criar um objeto <literal>MachineRegistration</literal> no namespace <literal>fleet-default</literal>.
zh_cn: 为了能够将计算机注册到 Elemental，我们需要在 <literal>fleet-default</literal> 名称空间中创建 <literal>MachineRegistration</literal> 对象。

source: Let us create a basic version of this object:
es: Vamos a crear una versión básica de este objeto:
ja: このオブジェクトの基本的なバージョンを作成してみましょう。
pt_br: Vamos criar uma versão básica desse objeto:
zh_cn: 我们来创建该对象的基本版本：

source: The <literal>cat</literal> command escapes each <literal>$</literal> with a backslash (<literal>\</literal>) so that Bash does not template them. Remove the backslashes if copying manually.
es: El comando <literal>cat</literal> escapa cada <literal>$</literal> con una barra invertida (<literal>\</literal>) para que Bash no las utilice como plantilla. Elimine las barras invertidas si va a realizar una copia manualmente.
ja: この<literal>cat</literal>コマンドでは、各<literal>$</literal>をバックスラッシュ(<literal>\</literal>)でエスケープしています。このため、バッシュではテンプレート化されていません。手動でコピーする場合は、バックスラッシュを削除してください。
pt_br: O comando <literal>cat</literal> insere um caractere de escape de barra (<literal>\</literal>) para cada <literal>$</literal> para que o Bash não os utilize como gabarito. Remova as barras se estiver copiando manualmente.
zh_cn: <literal>cat</literal> 命令使用反斜杠 (<literal>\</literal>) 将每个 <literal>$</literal> 符号转义，以免 Bash 将其模板化。如果手动复制命令，请去除反斜杠。
