Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Some <literal>VFs</literal> (<literal>numVfs</literal>) from the device (<literal>rootDevices</literal>) will be created, and it will be configured with the driver <literal>deviceType</literal> and the <literal>MTU</literal>:
es: Se crearán algunas <literal>funciones virtuales</literal> (<literal>numVfs</literal>) desde el dispositivo (<literal>rootDevices</literal>) y se configurarán con el controlador <literal>deviceType</literal> y el <literal>MTU</literal>:
ja: <literal>VF</literal> (<literal>numVfs</literal>)がデバイス(<literal>rootDevices</literal>)から作成され、ドライバ<literal>deviceType</literal>と<literal>MTU</literal>が設定されます。
pt_br: Serão criadas algumas <literal>VFs</literal> (<literal>numVfs</literal>) do dispositivo (<literal>rootDevices</literal>), e ela será configurada com o <literal>deviceType</literal> do driver e a <literal>MTU</literal>:
zh_cn: 将在设备 (<literal>rootDevices</literal>) 中创建一些 <literal>VF</literal> (<literal>numVfs</literal>)，并在其上配置驱动程序 <literal>deviceType</literal> 和 <literal>MTU</literal>：

source: The <literal>resourceName</literal> field must not contain any special characters and must be unique across the cluster. The example uses the <literal>deviceType: vfio-pci</literal> because <literal>dpdk</literal> will be used in combination with <literal>sr-iov</literal>. If you don’t use <literal>dpdk</literal>, the deviceType should be <literal>deviceType: netdevice</literal> (default value).
es: El campo <literal>resourceName</literal> no debe contener caracteres especiales y debe ser único en todo el clúster. En el ejemplo se usa <literal>deviceType: vfio-pci</literal> porque <literal>dpdk</literal> se usará junto a <literal>sr-iov</literal>. Si no utiliza <literal>dpdk</literal>, el valor de deviceType debe ser <literal>deviceType: netdevice</literal> (valor predeterminado).
ja: <literal>resourceName</literal>フィールドには特殊文字を含めないでください。また、このフィールドはクラスタ全体で一意である必要があります。この例では、<literal>dpdk</literal>を<literal>sr-iov</literal>と組み合わせて使用するため、<literal>deviceType: vfio-pci</literal>を使用しています。<literal>dpdk</literal>を使用しない場合は、deviceTypeを<literal>deviceType: netdevice</literal> (デフォルト値)にする必要があります。
pt_br: O campo <literal>resourceName</literal> não deve conter caracteres especiais e deve ser exclusivo em todo o cluster. O exemplo usa <literal>deviceType: vfio-pci</literal> porque <literal>dpdk</literal> será usado em conjunto com <literal>sr-iov</literal>. Se você não usar <literal>dpdk</literal>, o deviceType deverá ser <literal>deviceType: netdevice</literal> (valor padrão).
zh_cn: <literal>resourceName</literal> 字段不得包含任何特殊字符，并且在整个群集中必须是唯一的。该示例使用 <literal>deviceType: vfio-pci</literal>，因为 <literal>dpdk</literal> 将与 <literal>sr-iov</literal> 结合使用。如果您不使用 <literal>dpdk</literal>，则 deviceType 应为 <literal>deviceType: netdevice</literal>（默认值）。

source: Validate configurations:
es: Valide las configuraciones:
ja: 設定を検証します。
pt_br: Valide as configurações:
zh_cn: 验证配置：

source: Create the sr-iov network (optional, just in case a different network is needed):
es: Cree la red sr-iov (opcional, si se necesita una red diferente):
ja: sr-iovネットワークを作成します(別のネットワークが必要な場合のオプション)。
pt_br: Crie a rede sr-iov (opcional, caso seja necessária uma rede diferente):
zh_cn: 创建 sr-iov 网络（可选操作，仅在需要不同的网络时才执行）：

source: Check the network created:
es: Compruebe la red creada:
ja: 作成されたネットワークを確認します。
pt_br: Verifique a rede criada:
zh_cn: 检查创建的网络：

source: <literal>DPDK</literal> (Data Plane Development Kit) is a set of libraries and drivers for fast packet processing. It is used to accelerate packet processing workloads running on a wide variety of CPU architectures. The DPDK includes data plane libraries and optimized network interface controller (<literal>NIC</literal>) drivers for the following:
es: <literal>DPDK</literal> (Data Plane Development Kit, kit de desarrollo del plano de datos) es un conjunto de bibliotecas y controladores para el procesamiento rápido de paquetes. Se utiliza para acelerar las cargas de trabajo de procesamiento de paquetes que se ejecutan en una amplia variedad de arquitecturas de CPU. DPDK incluye bibliotecas de plano de datos y controladores de controlador de interfaz de red (<literal>NIC</literal>) optimizados para lo siguiente:
ja: <literal>DPDK</literal> (データプレーン開発キット)は、パケットの高速処理用の一連のライブラリとドライバです。DPDKは、広範なCPUアーキテクチャ上で実行されるパケット処理ワークロードを高速化するために使用されます。DPDKには、データプレーンライブラリと、以下のために最適化されたネットワークインタフェースコントローラ(<literal>NIC</literal>)ドライバが含まれています。
pt_br: <literal>DPDK</literal> (Data Plane Development Kit) é um conjunto de bibliotecas e drivers para processamento rápido de pacotes. Ele é usado para acelerar as cargas de trabalho de processamento de pacotes executadas em uma ampla variedade de arquiteturas de CPU. O DPDK inclui as bibliotecas de plano de controle e os drivers otimizados de placa de interface de rede (<literal>NIC</literal>) para o seguinte:
zh_cn: <literal>DPDK</literal>（数据平面开发包）是一组用于实现快速数据包处理的库和驱动程序。它用于加速各种 CPU 体系结构上运行的数据包处理工作负载。DPDK 包含以下组件的数据平面库和优化的网络接口控制器 (<literal>NIC</literal>) 驱动程序：

source: A queue manager implements lockless queues.
es: Un gestor de colas implementa colas sin bloqueo.
ja: キューマネージャはロックなしのキューを実装します。
pt_br: Um gerenciador de fila que implementa filas sem bloqueio.
zh_cn: 队列管理器，实现无锁队列。

source: A buffer manager pre-allocates fixed size buffers.
es: Un gestor de búferes preasigna búferes de tamaño fijo.
ja: バッファマネージャは固定サイズのバッファを事前割り当てします。
pt_br: Um gerenciador de buffer que pré-aloca buffers de tamanho fixo.
zh_cn: 缓冲区管理器，预先分配固定大小的缓冲区。

source: A memory manager allocates pools of objects in memory and uses a ring to store free objects; ensures that objects are spread equally on all <literal>DRAM</literal> channels.
es: Un gestor de memoria asigna pools de objetos en la memoria y usa un anillo para almacenar los objetos libres; esto garantiza que los objetos se distribuyan de forma equitativa en todos los canales <literal>DRAM</literal>.
ja: メモリマネージャは、メモリ内にオブジェクトのプールを割り当て、リングを使用してフリーオブジェクトを格納します。オブジェクトがすべての<literal>DRAM</literal>チャンネルに均等に分散されるようにします。
pt_br: Um gerenciador de memória que aloca pools de objetos na memória e usa um anel para armazenar objetos livres; garante que os objetos sejam igualmente distribuídos por todos os canais <literal>DRAM</literal>.
zh_cn: 内存管理器，在内存中分配对象池，并使用环来存储空闲对象；确保对象均匀分布在所有 <literal>DRAM</literal> 通道上。

source: Poll mode drivers (<literal>PMD</literal>) are designed to work without asynchronous notifications, reducing overhead.
es: Los controladores en modo de sondeo (Poll mode drivers, <literal>PMD</literal>) están diseñados para funcionar sin notificaciones asíncronas, lo que reduce la sobrecarga.
ja: ポールモードドライバ(<literal>PMD</literal>)は、非同期通知なしで動作するように設計されているため、オーバーヘッドが軽減されます。
pt_br: Drivers de modo de sondagem (<literal>PMD</literal>) desenvolvidos para operar sem notificações assíncronas, reduzindo a sobrecarga.
zh_cn: 轮询模式驱动程序 (<literal>PMD</literal>)，可在没有异步通知的情况下运行，从而降低开销。

source: A packet framework as a set of libraries that are helpers to develop packet processing.
es: Un marco de paquetes como un conjunto de bibliotecas que sirven de ayuda para desarrollar el procesamiento de paquetes.
ja: パケット処理を開発するためのヘルパーである一連のライブラリとしてのパケットフレームワーク。
pt_br: Uma estrutura de pacotes como um conjunto de bibliotecas auxiliares para desenvolver o processamento de pacotes.
zh_cn: 作为一组库提供的数据包框架，可帮助开发数据包处理解决方案。

source: The following steps will show how to enable <literal>DPDK</literal> and how to create <literal>VFs</literal> from the <literal>NICs</literal> to be used by the <literal>DPDK</literal> interfaces:
es: Los siguientes pasos muestran cómo habilitar <literal>DPDK</literal> y cómo crear <literal>funciones virtuales</literal> a partir de las <literal>NIC</literal> que se utilizarán en las interfaces de <literal>DPDK</literal>:
ja: 次の手順では、<literal>DPDK</literal>を有効にする方法と、<literal>DPDK</literal>インタフェースが使用する<literal>NIC</literal>から<literal>VF</literal>を作成する方法を示します。
pt_br: As seguintes etapas mostram como habilitar o <literal>DPDK</literal> e criar <literal>VFs</literal> das <literal>NICs</literal> usadas pelas interfaces do <literal>DPDK</literal>:
zh_cn: 以下步骤说明如何启用 <literal>DPDK</literal>，以及如何从 <literal>NIC</literal> 创建供 <literal>DPDK</literal> 接口使用的 <literal>VF</literal>：

source: Install the <literal>DPDK</literal> package:
es: Instale el paquete de <literal>DPDK</literal>:
ja: <literal>DPDK</literal>パッケージをインストールします。
pt_br: Instale o pacote <literal>DPDK</literal>:
zh_cn: 安装 <literal>DPDK</literal> 软件包：

source: Kernel parameters:
es: Parámetros del kernel:
ja: カーネルパラメータ:
pt_br: Parâmetros do kernel:
zh_cn: 内核参数：

source: To use DPDK, employ some drivers to enable certain parameters in the kernel:
es: Para usar DPDK, emplee algunos controladores para habilitar ciertos parámetros en el kernel:
ja: DPDKを使用するには、ドライバをいくつか使用して、カーネルの特定のパラメータを有効にします。
pt_br: Para usar o DPDK, aplique alguns drivers para habilitar determinados parâmetros no kernel:
zh_cn: 要使用 DPDK，请采用一些驱动程序来启用内核中的某些参数：

source: This option enables the use of the <literal>vfio</literal> driver for the DPDK interfaces.
es: Esta opción permite el uso del controlador <literal>vfio</literal> para las interfaces de DPDK.
ja: このオプションを使用すると、DPDKインタフェースに<literal>vfio</literal>ドライバを使用できます。
pt_br: Essa opção permite usar o driver <literal>vfio</literal> para as interfaces do DPDK.
zh_cn: 此选项允许为 DPDK 接口使用 <literal>vfio</literal> 驱动程序。

source: intel_iommu or amd_iommu
es: intel_iommu o amd_iommu
ja: intel_iommuまたはamd_iommu
pt_br: intel_iommu ou amd_iommu
zh_cn: intel_iommu 或 amd_iommu

source: This option enables the use of <literal>vfio</literal> for <literal>VFs</literal>.
es: Esta opción permite el uso de <literal>vfio</literal> para las <literal>funciones virtuales</literal>.
ja: このオプションを使用すると、<literal>VF</literal>に<literal>vfio</literal>を使用できます。
pt_br: Essa opção permite usar o <literal>vfio</literal> para <literal>VFs</literal>.
zh_cn: 此选项允许为 <literal>VF</literal> 使用 <literal>vfio</literal>。

source: To enable the parameters, add them to the <literal>/etc/default/grub</literal> file:
es: Para habilitar los parámetros, añádalos al archivo <literal>/etc/default/grub</literal>:
ja: これらのパラメータを有効にするには、各パラメータを<literal>/etc/default/grub</literal>ファイルに追加します。
pt_br: Para habilitar os parâmetros, adicione-os ao arquivo <literal>/etc/default/grub</literal>:
zh_cn: 要启用这些参数，请将其添加到 <literal>/etc/default/grub</literal> 文件中：

source: Update the GRUB configuration and reboot the system to apply the changes:
es: Actualice la configuración de GRUB y rearranque el sistema para aplicar los cambios:
ja: GRUBの設定を更新し、システムを再起動して変更を適用します。
pt_br: Atualize a configuração do GRUB e reinicialize o sistema para aplicar as alterações:
zh_cn: 更新 GRUB 配置，并重引导系统以应用更改：

source: Load <literal>vfio-pci</literal> kernel module and enable <literal>SR-IOV</literal> on the <literal>NICs</literal>:
es: Cargue el módulo del kernel <literal>vfio-pci</literal> y habilite <literal>SR-IOV</literal> en las tarjetas <literal>NIC</literal>:
ja: <literal>vfio-pci</literal>カーネルモジュールを読み込み、<literal>NIC</literal>で<literal>SR-IOV</literal>を有効にします。
pt_br: Carregue o módulo do kernel <literal>vfio-pci</literal> e habilite o <literal>SR-IOV</literal> nas <literal>NICs</literal>:
zh_cn: 加载 <literal>vfio-pci</literal> 内核模块，并在 <literal>NIC</literal> 上启用 <literal>SR-IOV</literal>：

source: Create some virtual functions (<literal>VFs</literal>) from the <literal>NICs</literal>.
es: Cree algunas funciones virtuales (<literal>VF</literal>) a partir de las tarjetas <literal>NIC</literal>.
ja: <literal>NIC</literal>から仮想機能(<literal>VF</literal>)をいくつか作成します。
pt_br: Crie algumas funções virtuais (<literal>VFs</literal>) das <literal>NICs</literal>.
zh_cn: 从 <literal>NIC</literal> 创建一些虚拟功能 (<literal>VF</literal>)。

source: To create for <literal>VFs</literal>, for example, for two different <literal>NICs</literal>, the following commands are required:
es: Para crear <literal>funciones virtuales</literal>, por ejemplo, para dos <literal>NIC</literal> distintas, se requieren los siguientes comandos:
ja: たとえば、2つの異なる<literal>NIC</literal>に対して<literal>VF</literal>を作成するには、次のコマンドが必要です。
pt_br: Por exemplo, para criar <literal>VFs</literal> para duas <literal>NICs</literal> diferentes, os seguintes comandos são necessários:
zh_cn: 例如，要为两个不同的 <literal>NIC</literal> 创建 <literal>VF</literal>，需要运行以下命令：

source: Bind the new VFs with the <literal>vfio-pci</literal> driver:
es: Vincule las nuevas funciones virtuales con el controlador <literal>vfio-pci</literal>:
ja: 新しいVFを<literal>vfio-pci</literal>ドライバにバインドします。
pt_br: Vincule as novas VFs ao driver <literal>vfio-pci</literal>:
zh_cn: 将新的 VF 绑定到 <literal>vfio-pci</literal> 驱动程序：

source: Review the configuration is correctly applied:
es: Compruebe que la configuración se haya aplicado correctamente:
ja: 設定が正しく適用されたことを確認します。
pt_br: Verifique se a configuração foi aplicada corretamente:
zh_cn: 检查是否正确应用了配置：

source: vRAN acceleration (<literal>Intel ACC100/ACC200</literal>)
es: Aceleración vRAN (<literal>Intel ACC100/ACC200</literal>)
ja: vRANアクセラレーション(<literal>Intel ACC100/ACC200</literal>)
pt_br: Aceleração vRAN (<literal>Intel ACC100/ACC200</literal>)
zh_cn: vRAN 加速 (<literal>Intel ACC100/ACC200</literal>)

source: As communications service providers move from 4 G to 5 G networks, many are adopting virtualized radio access network (<literal>vRAN</literal>) architectures for higher channel capacity and easier deployment of edge-based services and applications. vRAN solutions are ideally located to deliver low-latency services with the flexibility to increase or decrease capacity based on the volume of real-time traffic and demand on the network.
es: A medida que los proveedores de servicios de comunicaciones pasan de las redes 4G a las 5G, muchos están adoptando arquitecturas de redes de acceso por radio virtualizadas (<literal>vRAN</literal>) para obtener una mayor capacidad de canal y facilitar el despliegue de servicios y aplicaciones basados en la periferia. Las soluciones vRAN son perfectas para ofrecer servicios de baja latencia con la flexibilidad de aumentar o disminuir la capacidad en función del volumen de tráfico en tiempo real y la demanda de la red.
ja: 4Gから5Gネットワークへの移行に伴い、多くの通信サービスプロバイダが仮想化無線アクセスネットワーク(<literal>vRAN</literal>)アーキテクチャを採用して、チャンネル容量を増やし、エッジベースのサービスとアプリケーションのデプロイメントを容易にしようとしています。vRANソリューションは、ネットワーク上のリアルタイムのトラフィックと需要の量に応じて容量を柔軟に増減できるため、低レイテンシのサービスを提供するのに理想的です。
pt_br: À medida que os provedores de serviços de comunicação migram da rede 4G para 5G, muitos deles estão adotando as arquiteturas de rede de acesso por rádio virtualizada (<literal>vRAN</literal>) para maior capacidade dos canais e implantação mais fácil dos serviços e aplicativos de borda. As soluções vRAN estão no local ideal para oferecer serviços de baixa latência com flexibilidade para aumentar ou reduzir a capacidade de acordo com o volume do tráfego e da demanda em tempo real na rede.
zh_cn: 随着通信服务提供商从 4G 过渡到 5G 网络，有许多提供商正在采用虚拟化无线接入网络 (<literal>vRAN</literal>) 体系结构来提高信道容量及简化基于边缘的服务和应用程序的部署。vRAN 解决方案非常适合用于提供低延迟服务，并可以根据实时流量和网络需求灵活地增加或减少容量。

source: One of the most compute-intensive 4 G and 5 G workloads is RAN layer 1 (<literal>L1</literal>) <literal>FEC</literal>, which resolves data transmission errors over unreliable or noisy communication channels. <literal>FEC</literal> technology detects and corrects a limited number of errors in 4 G or 5 G data, eliminating the need for retransmission. Since the <literal>FEC</literal> acceleration transaction does not contain cell state information, it can be easily virtualized, enabling pooling benefits and easy cell migration.
es: Una de las cargas de trabajo de 4G y 5G que más recursos informáticos consume es la <literal>FEC</literal> de la capa 1 (<literal>L1</literal>) de la RAN, que resuelve los errores de transmisión de datos en canales de comunicación poco fiables o con ruido. La tecnología <literal>FEC</literal> detecta y corrige un número limitado de errores en los datos 4G o 5G, lo que elimina la necesidad de retransmisión. Dado que la transacción de aceleración de <literal>FEC</literal> no contiene información sobre el estado de las celdas, se puede virtualizar fácilmente, de forma que se puede aprovechar la agrupación y facilitar la migración de celdas.
ja: 4Gおよび5Gで最も計算負荷が高いワークロードの1つがRANレイヤ1 (<literal>L1</literal>)の<literal>FEC</literal>です。これは、信頼性の低い通信チャンネルやノイズの多い通信チャンネルでのデータ伝送エラーを解消するものです。<literal>FEC</literal>技術は、4Gまたは5Gデータの一定数のエラーを検出して訂正することで、再送信の必要性を解消します。<literal>FEC</literal>アクセラレーショントランザクションにはセルの状態情報が含まれないため、簡単に仮想化でき、プールするメリットとセルの容易な移行が実現します。
pt_br: Uma das cargas de trabalho 4G e 5G com uso mais intenso de recursos é a <literal>FEC</literal> da RAN de camada 1 (<literal>L1</literal>), que resolve os erros de transmissão de dados por meio de canais de comunicação incertos ou ruidosos. A tecnologia <literal>FEC</literal> detecta e corrige um número limitado de erros em dados 4G ou 5G, eliminando a necessidade de retransmissão. Como a transação de aceleração da <literal>FEC</literal> não contém informações de estado da célula, é possível virtualizá-la com facilidade para aproveitar os benefícios dos agrupamentos e facilitar a migração de células.
zh_cn: 计算密集程度最高的 4G 和 5G 工作负载之一是 RAN 第 1 层 (<literal>L1</literal>) <literal>FEC</literal>，它可以解决不可靠或高干扰信道上的数据传输错误。<literal>FEC</literal> 技术可以检测并纠正 4G 或 5G 数据中有限数量的错误，因此消除了重新传输的需要。由于 <literal>FEC</literal> 加速事务不包含特定的单元状态信息，因此可以轻松虚拟化，从而带来了池化优势并可实现轻松的单元迁移。

source: Kernel parameters
es: Parámetros del kernel
ja: カーネルパラメータ
pt_br: Parâmetros do kernel
zh_cn: 内核参数

source: To enable the <literal>vRAN</literal> acceleration, we need to enable the following kernel parameters (if not present yet):
es: Para habilitar la aceleración <literal>vRAN</literal>, es preciso habilitar los siguientes parámetros del kernel (si aún no están presentes):
ja: <literal>vRAN</literal>アクセラレーションを有効にするには、次のカーネルパラメータを有効にする必要があります(まだ存在しない場合)。
pt_br: Para habilitar a aceleração da <literal>vRAN</literal>, precisamos habilitar os seguintes parâmetros do kernel (se ainda não estiverem presentes):
zh_cn: 要启用 <literal>vRAN</literal> 加速，需要启用以下内核参数（如果尚未启用）：

source: This option enables the use of vfio for the DPDK interfaces.
es: Esta opción permite el uso de vfio para las interfaces DPDK.
ja: このオプションを使用すると、DPDKインタフェースにvfioを使用できます。
pt_br: Essa opção permite usar vfio paras as interfaces do DPDK.
zh_cn: 此选项允许为 DPDK 接口使用 vfio。

source: This option enables the use of vfio for VFs.
es: Esta opción permite el uso de vfio para las funciones virtuales.
ja: このオプションを使用すると、VFにvfioを使用できます。
pt_br: Essa opção permite usar vfio para VFs.
zh_cn: 此选项允许为 VF 使用 vfio。

source: Modify the GRUB file <literal>/etc/default/grub</literal> to add them to the kernel command line:
es: Modifique el archivo GRUB <literal>/etc/default/grub</literal> para añadirlos a la línea de comandos del kernel:
ja: GRUBファイル<literal>/etc/default/grub</literal>を変更して、これらのパラメータをカーネルコマンドラインに追加します。
pt_br: Modifique o arquivo GRUB <literal>/etc/default/grub</literal> para adicioná-los à linha de comando do kernel:
zh_cn: 修改 GRUB 文件 <literal>/etc/default/grub</literal>，以将这些参数添加到内核命令行：

source: To verify that the parameters are applied after the reboot, check the command line:
es: Para verificar que los parámetros se han aplicado después del rearranque, compruebe la línea de comandos:
ja: 再起動後にパラメータが適用されていることを確認するには、コマンドラインを確認します。
pt_br: Para verificar se os parâmetros foram aplicados após a reinicialização, consulte a linha de comando:
zh_cn: 要校验重引导后是否应用了这些参数，请检查命令行：

source: Load vfio-pci kernel modules to enable the <literal>vRAN</literal> acceleration:
es: Cargue los módulos del kernel vfio-pci para habilitar la aceleración <literal>vRAN</literal>:
ja: vfio-pciカーネルモジュールを読み込み、<literal>vRAN</literal>アクセラレーションを有効にします。
pt_br: Carregue os módulos do kernel vfio-pci para habilitar a aceleração da <literal>vRAN</literal>:
zh_cn: 加载 vfio-pci 内核模块以启用 <literal>vRAN</literal> 加速：

source: Get interface information Acc100:
es: Obtenga información de la interfaz Acc100:
ja: インタフェース情報Acc100を取得します。
pt_br: Obtenha as informações da interface Acc100:
zh_cn: 获取 Acc100 接口信息：

source: Bind the physical interface (<literal>PF</literal>) with <literal>vfio-pci</literal> driver:
es: Vincule la interfaz física (<literal>PF</literal>) con el controlador <literal>vfio-pci</literal>:
ja: 物理インタフェース(<literal>PF</literal>)を<literal>vfio-pci</literal>ドライバにバインドします。
pt_br: Vincule a interface física (<literal>PF</literal>) ao driver <literal>vfio-pci</literal>:
zh_cn: 将物理接口 (<literal>PF</literal>) 绑定到 <literal>vfio-pci</literal> 驱动程序：

source: Create the virtual functions (<literal>VFs</literal>) from the physical interface (<literal>PF</literal>).
es: Cree las funciones virtuales (<literal>VF</literal>) a partir de la interfaz física (<literal>PF</literal>).
ja: 仮想機能(<literal>VF</literal>)を物理インタフェース(<literal>PF</literal>)から作成します。
pt_br: Crie as funções virtuais (<literal>VFs</literal>) da interface física (<literal>PF</literal>).
zh_cn: 从物理接口 (<literal>PF</literal>) 创建虚拟功能 (<literal>VF</literal>)。

source: Create 2 <literal>VFs</literal> from the <literal>PF</literal> and bind with <literal>vfio-pci</literal> following the next steps:
es: Cree dos <literal>VF</literal> desde la <literal>PF</literal> y vincúlelas con <literal>vfio-pci</literal> así:
ja: 2つの<literal>VF</literal>を<literal>PF</literal>から作成し、次の手順に従って<literal>vfio-pci</literal>にバインドします。
pt_br: Crie 2 <literal>VFs</literal> da <literal>PF</literal> e vincule a elas o <literal>vfio-pci</literal> seguindo estas etapas:
zh_cn: 从 <literal>PF</literal> 创建 2 个 <literal>VF</literal>，并按照以下步骤将其绑定到 <literal>vfio-pci</literal>：

source: Configure acc100 with the proposed configuration file:
es: Configure acc100 con el archivo de configuración propuesto:
ja: 提案された設定ファイルを使用してacc100を設定します。
pt_br: Configure a acc100 com o arquivo de configuração proposto:
zh_cn: 使用建议的配置文件配置 acc100：

source: Check the new VFs created from the FEC PF:
es: Compruebe las nuevas funciones virtuales creadas desde la interfaz física FEC:
ja: FEC PFから作成した新しいVFを確認します。
pt_br: Verifique as novas VFs criadas da PF FEC:
zh_cn: 检查从 FEC PF 创建的新 VF：

source: Huge pages
es: Páginas enormes
ja: Huge Page
zh_cn: 大页

source: When a process uses <literal>RAM</literal>, the <literal>CPU</literal> marks it as used by that process. For efficiency, the <literal>CPU</literal> allocates <literal>RAM</literal> in chunks <literal>4K</literal> bytes is the default value on many platforms. Those chunks are named pages. Pages can be swapped to disk, etc.
es: Cuando un proceso utiliza <literal>RAM</literal>, la <literal>CPU</literal> lo marca como utilizado por ese proceso. Por motivos de eficiencia, la <literal>CPU</literal> asigna <literal>RAM</literal> en bloques de <literal>4K</literal> bytes, que es el valor predeterminado en muchas plataformas. Esos bloques se denominan páginas. Las páginas se pueden intercambiar en el disco, etc.
ja: プロセスが<literal>RAM</literal>を使用すると、<literal>CPU</literal>はそのメモリ領域をプロセスが使用中であるとマークします。効率を高めるために、<literal>CPU</literal>は<literal>RAM</literal>をチャンクで割り当てます。多くのプラットフォームでは<literal>4K</literal>バイトがチャンクのデフォルト値です。これらのチャンクをページと呼び、ディスクなどにスワップできます。
pt_br: Quando um processo usa <literal>RAM</literal>, a <literal>CPU</literal> a marca como usada por esse processo. Para manter a eficiência, a <literal>CPU</literal> aloca a <literal>RAM</literal> em blocos de <literal>4K</literal> bytes, que é o valor padrão em muitas plataformas. Esses blocos são chamados de páginas. As páginas podem ser substituídas por discos, entre outros.
zh_cn: 当某个进程使用 <literal>RAM</literal> 时，<literal>CPU</literal> 会将 RAM 标记为已由该进程使用。为提高效率，<literal>CPU</literal> 会以区块的形式分配 <literal>RAM</literal>，在许多平台上，默认的区块大小值为 <literal>4K</literal> 字节。这些区块称为页。页可以交换到磁盘等位置。
