Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <link xl:href="https://documentation.suse.com/multi-linux-manager/5.1/en/docs/administration/troubleshooting/tshoot-intro.html">SUSE Multi-Linux Manager Troubleshooting</link>
es: <link xl:href="https://documentation.suse.com/multi-linux-manager/5.1/en/docs/administration/troubleshooting/tshoot-intro.html">Resolución de problemas de SUSE Multi-Linux Manager</link>
ja: <link xl:href="https://documentation.suse.com/multi-linux-manager/5.1/en/docs/administration/troubleshooting/tshoot-intro.html">SUSE Multi-Linux Managerのトラブルシューティング</link>
pt_br: <link xl:href="https://documentation.suse.com/multi-linux-manager/5.1/en/docs/administration/troubleshooting/tshoot-intro.html">Solução de problemas do SUSE Multi-Linux Manager</link>
zh_cn: <link xl:href="https://documentation.suse.com/multi-linux-manager/5.1/en/docs/administration/troubleshooting/tshoot-intro.html">SUSE Multi-Linux Manager 查错</link>

source: <link xl:href="https://elemental.docs.rancher.com/troubleshooting-support/">Elemental Support</link>
es: <link xl:href="https://elemental.docs.rancher.com/troubleshooting-support/">Asistencia de Elemental</link>
ja: <link xl:href="https://elemental.docs.rancher.com/troubleshooting-support/">Elementalサポート</link>
pt_br: <link xl:href="https://elemental.docs.rancher.com/troubleshooting-support/">Suporte do Elemental</link>
zh_cn: <link xl:href="https://elemental.docs.rancher.com/troubleshooting-support/">Elemental 支持</link>

source: <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/troubleshooting/troubleshooting.html">Rancher Turtles Troubleshooting</link>
es: <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/troubleshooting/troubleshooting.html">Resolución de problemas de Rancher Turtles</link>
ja: <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/troubleshooting/troubleshooting.html">Rancher Turtlesのトラブルシューティング</link>
pt_br: <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/troubleshooting/troubleshooting.html">Solução de problemas do Rancher Turtles</link>
zh_cn: <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/troubleshooting/troubleshooting.html">Rancher Turtles 查错</link>

source: <link xl:href="https://longhorn.io/docs/1.9.1/troubleshoot/troubleshooting/">Longhorn Troubleshooting</link>
es: <link xl:href="https://longhorn.io/docs/1.9.1/troubleshoot/troubleshooting/">Resolución de problemas de Longhorn</link>
ja: <link xl:href="https://longhorn.io/docs/1.9.1/troubleshoot/troubleshooting/">Longhornのトラブルシューティング</link>
zh_cn: <link xl:href="https://longhorn.io/docs/1.9.1/troubleshoot/troubleshooting/">Longhorn 查错</link>

source: <link xl:href="https://open-docs.neuvector.com/next/troubleshooting/troubleshooting/">Neuvector Troubleshooting</link>
es: <link xl:href="https://open-docs.neuvector.com/next/troubleshooting/troubleshooting/">Resolución de problemas de Neuvector</link>
ja: <link xl:href="https://open-docs.neuvector.com/next/troubleshooting/troubleshooting/">Neuvectorのトラブルシューティング</link>
pt_br: <link xl:href="https://open-docs.neuvector.com/next/troubleshooting/troubleshooting/">Solução de problemas do Neuvector</link>
zh_cn: <link xl:href="https://open-docs.neuvector.com/next/troubleshooting/troubleshooting/">Neuvector 查错</link>

source: <link xl:href="https://fleet.rancher.io/troubleshooting">Fleet Troubleshooting</link>
es: <link xl:href="https://fleet.rancher.io/troubleshooting">Resolución de problemas de Fleet</link>
ja: <link xl:href="https://fleet.rancher.io/troubleshooting">Fleetのトラブルシューティング</link>
pt_br: <link xl:href="https://fleet.rancher.io/troubleshooting">Solução de problemas do Fleet</link>
zh_cn: <link xl:href="https://fleet.rancher.io/troubleshooting">Fleet 查错</link>

source: You can also see <link xl:href="https://www.suse.com/support/kb/">SUSE Knowledgebase</link>.
es: También puede consultar la <link xl:href="https://www.suse.com/support/kb/">Base de conocimientos de SUSE</link>.
ja: また、<link xl:href="https://www.suse.com/support/kb/">SUSEナレッジベース</link>も参照してください。
pt_br: Você também pode consultar o <link xl:href="https://www.suse.com/support/kb/">SUSE Knowledgebase</link>.
zh_cn: 您还可以访问 <link xl:href="https://www.suse.com/support/kb/">SUSE 知识库</link>。

source: Collecting Diagnostics for Support
es: Recopilación de diagnóstico para la asistencia
ja: サポートのための診断情報の収集
pt_br: Coletando diagnósticos para o suporte
zh_cn: 收集支持团队所需的诊断信息

source: When contacting SUSE Support, providing comprehensive diagnostic information is crucial.
es: Al ponerse en contacto con el servicio de asistencia técnica de SUSE, es fundamental proporcionar información de diagnóstico completa.
ja: SUSEサポートに連絡する場合は、包括的な診断情報を提供することが重要です。
pt_br: Ao contatar o suporte da SUSE, é essencial passar todas as informações de diagnóstico.
zh_cn: 联系 SUSE 支持团队时，提供全面的诊断信息至关重要。

source: Essential Information to Collect
es: Información esencial que se debe recopilar
ja: 収集すべき重要な情報
pt_br: Informações essenciais para coletar
zh_cn: 需收集的基本信息

source: <emphasis role="strong">Detailed problem description</emphasis>: What happened, when did it happen, what were you doing, what is the expected behavior, and what is the actual behavior?
es: <emphasis role="strong">Descripción detallada del problema</emphasis>: ¿Qué ha ocurrido?, ¿cuándo?, ¿qué estaba haciendo?, ¿cuál es el comportamiento esperado?, y ¿cuál es el comportamiento real?
ja: <emphasis role="strong">問題の詳細な説明</emphasis>: 何が起こったか、いつ起こったか、その際に何をしていたのか、どのような動作が期待されるか、実際の動作はどのようなものか?
pt_br: <emphasis role="strong">Descrição detalhada do problema</emphasis>: o que aconteceu, quando aconteceu, o que você estava fazendo, qual era o comportamento esperado e qual foi o comportamento real?
zh_cn: <emphasis role="strong">详细问题描述</emphasis>：发生了什么、何时发生、操作过程、预期行为及实际行为。

source: <emphasis role="strong">Steps to reproduce</emphasis>: Can you reliably reproduce the issue? If so, list the exact steps.
es: <emphasis role="strong">Pasos para reproducir el problema</emphasis>: ¿Puede reproducir el problema de forma fiable? Si es así, indique los pasos exactos.
ja: <emphasis role="strong">再現する手順</emphasis>: 問題を忠実に再現できますか? 再現できる場合は、正確な手順をリストしてください。
pt_br: <emphasis role="strong">Etapas de reprodução</emphasis>: você pode reproduzir o problema de maneira confiável? Se puder, faça uma lista das etapas exatas.
zh_cn: <emphasis role="strong">重现步骤</emphasis>：能否稳定重现问题？如果可以，请列出确切步骤。

source: <emphasis role="strong">Component versions</emphasis>: SUSE Edge version, components versions (RKE2/K3, EIB, Metal<superscript>3</superscript>, Elemental,..).
es: <emphasis role="strong">Versiones de los componentes</emphasis>: Versión de SUSE Edge, versiones de los componentes (RKE2/K3, EIB, Metal<superscript>3</superscript>, Elemental, etc.).
ja: <emphasis role="strong">コンポーネントのバージョン</emphasis>: SUSE Edgeバージョン、コンポーネントのバージョン(RKE2/K3、EIB、Metal<superscript>3</superscript>、Elemental、..)。
pt_br: <emphasis role="strong">Versões dos componentes</emphasis>: as versões do SUSE Edge e dos componentes (RKE2/K3, EIB, Metal<superscript>3</superscript>, Elemental etc.).
zh_cn: <emphasis role="strong">组件版本</emphasis>：SUSE Edge 版本、各组件版本（RKE2/K3、EIB、Metal<superscript>3</superscript>、Elemental 等）。

source: <emphasis role="strong">Relevant logs</emphasis>:
es: <emphasis role="strong">Registros relevantes</emphasis>:
ja: <emphasis role="strong">関連するログ</emphasis>:
pt_br: <emphasis role="strong">Registros relevantes</emphasis>:
zh_cn: <emphasis role="strong">相关日志</emphasis>：

source: <literal>journalctl</literal> output (filtered by service if possible, or full boot logs).
es: Resultado de <literal>journalctl</literal> (filtrado por servicio, si es posible, o registros de arranque completos).
ja: <literal>journalctl</literal>の出力(可能な場合はサービス別にフィルタリング、または完全な起動ログ)。
pt_br: Saída do <literal>journalctl</literal> (filtrada por serviço, se possível, ou os registros completos de inicialização)
zh_cn: <literal>journalctl</literal> 输出（尽可能按服务过滤，或提供完整的引导日志）。

source: Kubernetes pod logs (kubectl logs).
es: Registros de pod de Kubernetes (registros kubectl).
ja: Kubernetes Podのログ(kubectlログ)。
pt_br: Registros do pod Kubernetes (registros do kubectl)
zh_cn: Kubernetes Pod 日志 (kubectl logs)。

source: Metal³/Elemental component logs.
es: Registros de componente de Metal³/Elemental.
ja: Metal³/Elementalコンポーネントのログ。
pt_br: Registros do componente Metal³/Elemental
zh_cn: Metal³/Elemental 组件日志。

source: EIB build logs and other logs
es: Registros de creación de EIB y otros registros
ja: EIB構築ログおよびその他のログ。
pt_br: Registros do build do EIB e outros registros
zh_cn: EIB 构建日志及其他日志。

source: <emphasis role="strong">System information</emphasis>:
es: <emphasis role="strong">Información del sistema</emphasis>:
ja: <emphasis role="strong">システム情報</emphasis>:
pt_br: <emphasis role="strong">Informações do sistema</emphasis>:
zh_cn: <emphasis role="strong">系统信息</emphasis>：

source: <emphasis role="strong">Configuration files</emphasis>: Relevant configuration files for Elemental, Metal<superscript>3</superscript>, EIB such as helm chart values, configmaps, etc.
es: <emphasis role="strong">Archivos de configuración</emphasis>: archivos de configuración relevantes para Elemental, Metal<superscript>3</superscript>, EIB, tales como valores de charts de helm, mapas de configuración, etc.
ja: <emphasis role="strong">設定ファイル</emphasis>: Elemental、Metal<superscript>3</superscript>、EIBに関連する設定ファイル(Helmチャート値、configmapなど)。
pt_br: <emphasis role="strong">Arquivos de configuração</emphasis>: arquivos de configuração relevantes para Elemental, Metal<superscript>3</superscript> e EIB, como valores de gráficos Helm, mapas de configuração etc.
zh_cn: <emphasis role="strong">配置文件</emphasis>：Elemental、Metal<superscript>3</superscript>、EIB 的相关配置文件，例如 Helm chart 值文件、configmap 等。

source: <emphasis role="strong">Kubernetes information</emphasis>: Nodes, Services, Deployments, etc.
es: <emphasis role="strong">Información de Kubernetes</emphasis>: nodos, servicios, despliegues, etc.
ja: <emphasis role="strong">Kubernetes情報</emphasis>: ノード、サービス、デプロイメントなど。
pt_br: <emphasis role="strong">Informações do Kubernetes</emphasis>: nós, serviços, implantações etc.
zh_cn: <emphasis role="strong">Kubernetes 信息</emphasis>：节点、服务、部署等。

source: <emphasis role="strong">Kubernetes objects affected</emphasis>: BMH, MachineRegistration, etc.
es: <emphasis role="strong">Objetos de Kubernetes afectados</emphasis>: BMH, MachineRegistration, etc.
ja: <emphasis role="strong">影響を受けるKubernetesオブジェクト</emphasis>: BMH、MachineRegistrationなど。
pt_br: <emphasis role="strong">Objetos do Kubernetes afetados</emphasis>: BMH, MachineRegistration etc.
zh_cn: <emphasis role="strong">受影响的 Kubernetes 对象</emphasis>：BMH、MachineRegistration 等。

source: How to collect
es: Cómo recopilar la información
ja: 収集方法
pt_br: Como fazer a coleta
zh_cn: 收集方式

source: <emphasis role="strong">For logs</emphasis>: Redirect command output to files (for example, <literal>journalctl -u k3s &gt; k3s_logs.txt</literal>).
es: <emphasis role="strong">Registros</emphasis>: redirija la salida del comando a archivos (por ejemplo, <literal>journalctl -u k3s &gt; k3s_logs.txt</literal>).
ja: <emphasis role="strong">ログの場合</emphasis>: コマンド出力をファイルにリダイレクトします(例: <literal>journalctl -u k3s &gt; k3s_logs.txt</literal>)。
pt_br: <emphasis role="strong">Dos registros</emphasis>: redirecione a saída do comando para os arquivos (por exemplo, <literal>journalctl -u k3s &gt; k3s_logs.txt</literal>).
zh_cn: <emphasis role="strong">对于日志</emphasis>：将命令输出重定向到文件（例如，使用 <literal>journalctl -u k3s &gt; k3s_logs.txt</literal>）。

source: <emphasis role="strong">For Kubernetes resources</emphasis>: Use <literal>kubectl get &lt;resource&gt; -o yaml &gt; &lt;resource_name&gt;.yaml</literal> to get detailed YAML definitions.
es: <emphasis role="strong">Recursos de Kubernetes</emphasis>: use <literal>kubectl get &lt;recurso&gt; -o yaml &gt; &lt;nombre_de_recurso&gt;.yaml</literal> para obtener definiciones YAML detalladas.
ja: <emphasis role="strong">Kubernetesリソースの場合</emphasis>: <literal>kubectl get &lt;resource&gt; -o yaml &gt; &lt;resource_name&gt;.yaml</literal>を使用して、詳細なYAML定義を取得します。
pt_br: <emphasis role="strong">Dos recursos do Kubernetes</emphasis>: use <literal>kubectl get &lt;recurso&gt; -o yaml &gt; &lt;nome_do_recurso&gt;.yaml</literal> para obter as definições detalhadas do YAML.
zh_cn: <emphasis role="strong">对于 Kubernetes 资源</emphasis>：使用 <literal>kubectl get &lt;resource&gt; -o yaml &gt; &lt;resource_name&gt;.yaml</literal> 获取详细的 YAML 定义。

source: <emphasis role="strong">For system information</emphasis>: Collect output of the commands listed above.
es: <emphasis role="strong">Información del sistema</emphasis>: recopile los resultados de los comandos indicados anteriormente.
ja: <emphasis role="strong">システム情報の場合</emphasis>: 上記のコマンドの出力を収集します。
pt_br: <emphasis role="strong">Das informações do sistema</emphasis>: colete a saída dos comandos listados acima.
zh_cn: <emphasis role="strong">对于系统信息</emphasis>：收集上述命令的输出。

source: <emphasis role="strong">For SL Micro</emphasis>: Check the <link xl:href="https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/cha-adm-support-slemicro.html">SUSE Linux Micro Troubleshooting Guide</link> documentation on how to gather system information for support with <literal>supportconfig</literal>.
es: <emphasis role="strong">SL Micro</emphasis>: consulte en la <link xl:href="https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/cha-adm-support-slemicro.html">guía de resolución de problemas de SUSE Linux Micro</link> cómo recopilar información del sistema para obtener asistencia con <literal>supportconfig</literal>.
ja: <emphasis role="strong">SL Microの場合</emphasis>: <literal>supportconfig</literal>を使用してサポートのためのシステム情報を収集する方法については、<link xl:href="https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/cha-adm-support-slemicro.html">SUSE Linux Microトラブルシューティングガイド</link>のドキュメントを確認してください。
pt_br: <emphasis role="strong">Do SL Micro</emphasis>: consulte a documentação do <link xl:href="https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/cha-adm-support-slemicro.html">Guia de Solução de Problemas do SUSE Linux Micro</link> sobre como reunir as informações do sistema para o suporte com <literal>supportconfig</literal>.
zh_cn: <emphasis role="strong">对于 SL Micro</emphasis>：参考 <link xl:href="https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/cha-adm-support-slemicro.html">SUSE Linux Micro 查错指南</link>文档，了解如何使用 <literal>supportconfig</literal> 收集支持团队所需的系统信息。

source: <emphasis role="strong">For RKE2/Rancher</emphasis>: Check the <link xl:href="https://www.suse.com/support/kb/doc/?id=000020191">The Rancher v2.x Linux log collector script</link> article to run The Rancher v2.x Linux log collector script.
es: <emphasis role="strong">RKE2/Rancher</emphasis>: consulte el artículo <link xl:href="https://www.suse.com/support/kb/doc/?id=000020191">The Rancher v2.x Linux log collector script</link> (Guion de recopilación de registros de Linux de Rancher v2.x) para ejecutar dicho guion.
ja: <emphasis role="strong">RKE2/Rancher の場合</emphasis>: Rancher v2.x Linuxログコレクタスクリプトを実行するには、<link xl:href="https://www.suse.com/support/kb/doc/?id=000020191">Rancher v2.x Linuxログコレクタスクリプト</link>の記事を確認してください。
pt_br: <emphasis role="strong">Do RKE2/Rancher</emphasis>: consulte o artigo <link xl:href="https://www.suse.com/support/kb/doc/?id=000020191">The Rancher v2.x Linux log collector script</link> para executar o script do coletor de registros do Linux para Rancher v2.x.
zh_cn: <emphasis role="strong">对于 RKE2/Rancher</emphasis>：参考<link xl:href="https://www.suse.com/support/kb/doc/?id=000020191">《The Rancher v2.x Linux log collector script》</link>一文，运行 Rancher v2.x Linux 日志收集器脚本。

source: Contact Support
es: Póngase en contacto con el servicio de asistencia
ja: サポートに問い合わせる
pt_br: Contatar o suporte
zh_cn: 联系支持团队

source: Please check the article available at <link xl:href="https://www.suse.com/support/kb/doc/?id=000019452">How-to effectively work with SUSE Technical Support</link> and the support handbook located at <link xl:href="https://www.suse.com/support/handbook/">SUSE Technical Support Handbook</link> for more details on how to contact SUSE support.
es: Consulte el artículo <link xl:href="https://www.suse.com/support/kb/doc/?id=000019452">How-to effectively work with SUSE Technical Support</link> (Cómo trabajar eficazmente con el servicio de asistencia técnica de SUSE) y el manual de asistencia técnica disponible en <link xl:href="https://www.suse.com/support/handbook/">SUSE Technical Support Handbook</link> para obtener más detalles sobre cómo ponerse en contacto con el servicio de asistencia técnica de SUSE.
ja: SUSEサポートへの問い合わせ方法の詳細については、「<link xl:href="https://www.suse.com/support/kb/doc/?id=000019452">How-to effectively work with SUSE Technical Support (SUSEテクニカルサポートを効果的に活用する方法)</link>」にある記事と、「<link xl:href="https://www.suse.com/support/handbook/">SUSEテクニカルサポートのハンドブック</link>」にあるサポートハンドブックを参照してください。
pt_br: Leia o artigo disponível em <link xl:href="https://www.suse.com/support/kb/doc/?id=000019452">How-to effectively work with SUSE Technical Support</link> (Como trabalhar de maneira eficiente com o suporte técnico da SUSE) e o manual de suporte localizado em <link xl:href="https://www.suse.com/support/handbook/">SUSE Technical Support Handbook</link> (Manual de Suporte Técnico da SUSE) para obter mais detalhes sobre como contatar o suporte da SUSE.
zh_cn: 有关如何联系 SUSE 支持团队的详细信息，请参见<link xl:href="https://www.suse.com/support/kb/doc/?id=000019452">《How-to effectively work with SUSE Technical Support》</link>一文，以及 <link xl:href="https://www.suse.com/support/handbook/">SUSE Technical Support Handbook</link> 页面中提供的支持手册。

source: Appendix
es: Apéndice
ja: 付録
pt_br: Apêndice
zh_cn: 附录

source: Release Notes
es: Notas de la versión
ja: リリースノート
pt_br: Notas de lançamento
zh_cn: 发行说明

source: Abstract
es: Resumen
ja: 要約
pt_br: Resumo
zh_cn: 摘要

source: SUSE Edge 3.4 is a tightly integrated and comprehensively validated end-to-end solution for addressing the unique challenges of the deployment of infrastructure and cloud-native applications at the edge. Its driving focus is to provide an opinionated, yet highly flexible, highly scalable, and secure platform that spans initial deployment image building, node provisioning and onboarding, application deployment, observability, and lifecycle management.
es: SUSE Edge 3.4 es una solución integral, estrechamente integrada y validada de forma exhaustiva para abordar los retos únicos que plantea el despliegue de infraestructura y aplicaciones nativas de la nube en el perímetro. Su objetivo principal es proporcionar una plataforma propia, pero altamente flexible, escalable y segura que abarque la creación de imágenes de distribución inicial, el aprovisionamiento y la incorporación de nodos, el despliegue de aplicaciones, la observabilidad y las operaciones completas del ciclo de vida.
ja: SUSE Edge 3.4は、インフラストラクチャとクラウドネイティブなアプリケーションをエッジにデプロイするという独自の課題に対処することに特化した、緊密に統合されて包括的に検証されたエンドツーエンドのソリューションです。重点を置いているのは、独創的でありながら高い柔軟性とスケーラビリティを持つセキュアなプラットフォームを提供し、初期デプロイメントイメージの構築からノードのプロビジョニングとオンボーディング、アプリケーションのデプロイメント、可観測性、ライフサイクル管理にまで対応することです。
zh_cn: SUSE Edge 3.4 是一套紧密集成且经过全面验证的端到端解决方案，旨在应对边缘基础架构和云原生应用程序部署的独特挑战。其核心目标是提供一个既有明确设计导向、又具备高度灵活性与可扩缩性的安全平台，覆盖从初始部署映像构建、节点置备与接入，到应用程序部署、可观测性及生命周期管理的全流程。

source: The solution is designed with the notion that there is no "one-size-fits-all" edge platform due to our customers’ widely varying requirements and expectations. Edge deployments push us to solve, and continually evolve, some of the most challenging problems, including massive scalability, restricted network availability, physical space constraints, new security threats and attack vectors, variations in hardware architecture and system resources, the requirement to deploy and interface with legacy infrastructure and applications, and customer solutions that have extended lifespans.
es: La solución se ha diseñado partiendo de la idea de que no existe una plataforma periférica única "válida para todo", debido a la gran variedad de requisitos y expectativas de los clientes. Los despliegues periféricos nos obligan a evolucionar para resolver continuamente problemas difíciles, como la escalabilidad masiva, la disponibilidad limitada de la red, las restricciones de espacio físico, las nuevas amenazas de seguridad y vectores de ataque, las variaciones en la arquitectura del hardware y los recursos del sistema, la necesidad de implantar e interactuar con infraestructuras y aplicaciones heredadas, y las soluciones de los clientes que tienen una vida útil prolongada.
ja: このソリューションは、顧客の要件や期待はさまざまであるため「万能」なエッジプラットフォームは存在しないという考え方に基づいて設計されています。エッジデプロイメントにより、実に困難な問題を解決し、継続的に進化させることが要求されます。たとえば、大規模なスケーラビリティ、ネットワークの可用性の制限、物理的なスペースの制約、新たなセキュリティの脅威と攻撃ベクトル、ハードウェアアーキテクチャとシステムリソースのバリエーション、レガシインフラストラクチャやレガシアプリケーションのデプロイとインタフェースの要件、耐用年数を延長している顧客ソリューションといった課題があります。
pt_br: A solução foi criada com a ideia de que não existe uma plataforma de borda do tipo "tamanho único" porque os requisitos e as expectativas dos clientes variam de maneira significativa. As implantações de borda nos levam a resolver (e sempre aprimorar) alguns dos problemas mais desafiadores, como escalabilidade massiva, disponibilidade de rede restrita, limitações de espaço físico, novas ameaças à segurança e vetores de ataque, variações na arquitetura de hardware e nos recursos de sistema, a necessidade de implantar e estabelecer interface com infraestruturas e aplicativos legados e soluções de clientes com durações estendidas.
zh_cn: 该解决方案的设计考虑到了客户的需求和期望千差万别，因此不存在“以一应百”的边缘平台。边缘部署促使我们解决并不断设想出一些极具挑战性的问题，包括大规模可伸缩性、网络受限情况下的可用性、物理空间限制、新的安全威胁和攻击途径、硬件体系结构和系统资源的差异、部署旧式基础架构和应用程序并与之连接的要求，以及使用寿命较长的客户解决方案。

source: SUSE Edge is built on best-of-breed open source software from the ground up, consistent with both our 30-year history in delivering secure, stable, and certified SUSE Linux platforms and our experience in providing highly scalable and feature-rich Kubernetes management with our Rancher portfolio. SUSE Edge builds on-top of these capabilities to deliver functionality that can address a wide number of market segments, including retail, medical, transportation, logistics, telecommunications, smart manufacturing, and Industrial IoT.
es: La plataforma se basa por completo en el mejor software de código abierto, en consonancia con nuestros más de 30 años de historia proporcionando plataformas SUSE Linux seguras, estables y certificadas, y en nuestra experiencia en la gestión de Kubernetes altamente escalable y rica en funciones con nuestra cartera de productos Rancher. SUSE Edge se basa en estas capacidades para ofrecer funcionalidades que pueden aplicarse a numerosos segmentos de mercado, incluyendo el comercio minorista, la medicina, el transporte, la logística, las telecomunicaciones, la fabricación inteligente y el IoT industrial.
ja: SUSE Edgeは、最良のオープンソースソフトウェアに基づいてゼロから構築されており、SUSEが持つ、30年にわたってセキュアで安定した定評あるSUSE Linuxプラットフォームを提供してきた歴史と、Rancherポートフォリオによって拡張性に優れ機能豊富なKubernetes管理を提供してきた経験の両方に合致するものです。SUSE Edgeは、これらの機能の上に構築されており、小売、医療、輸送、物流、通信、スマート製造、産業用IoTなど、さまざまな市場セグメントに対応できる機能を提供します。
pt_br: O SUSE Edge foi criado do zero, com base no melhor software de código aberto, e condiz com os nossos 30 anos de história como provedores de plataformas SUSE Linux seguras, estáveis e certificadas e com a nossa experiência em oferecer gerenciamento Kubernetes altamente escalável e repleto de recursos com o nosso portfólio Rancher. O SUSE Edge é fundamentado nesses recursos para entregar funcionalidades que atendem a inúmeros segmentos de mercado, como varejo, medicina, transporte, logística, telecomunicações, manufatura inteligente e IoT industrial.
zh_cn: SUSE Edge 完全基于一流的开源软件构建而成，这既符合我们 30 年来交付安全、稳定且经过认证的 SUSE Linux 平台的历史，也延续了我们通过 Rancher 产品组合提供高可可缩放且功能丰富的 Kubernetes 管理方案的经验。SUSE Edge 依托这些既有能力，提供能够满足众多市场领域需求的功能，包括零售、医疗、交通、物流、电信、智能制造业以及工业物联网等。
