Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Then use the <literal>fleet-cli</literal> binary to convert the Fleet to a Bundle:
es: Después, use el binario de <literal>fleet-cli</literal> para convertir la flota en un Bundle:
ja: 次に、<literal>fleet-cli</literal>バイナリを使用して、Fleetをバンドルに変換します。
pt_br: Depois disso, use o binário <literal>fleet-cli</literal> para converter a instância do Fleet em um bundle:
zh_cn: 接下来，使用 <literal>fleet-cli</literal> 二进制文件将 Fleet 转换为捆绑包：

source: Deploy the Bundle through the Rancher UI:
es: Despliegue el Bundle mediante la interfaz de usuario de Rancher:
ja: Rancher UIを通じてバンドルをデプロイします。
pt_br: Implante o bundle usando a IU do Rancher:
zh_cn: 通过 Rancher UI 部署捆绑包：

source: Deploy Bundle through Rancher UI
es: Despliegue del Bundle mediante la interfaz de Rancher
ja: Rancher UIを通じたバンドルのデプロイ
pt_br: Implantar o bundle usando a IU do Rancher
zh_cn: 通过 Rancher UI 部署捆绑包

source: day2 helm chart upgrade example 1
es: ejemplo 1 de actualización del chart de helm de día 2
ja: day2 helmチャートアップグレード例1
pt_br: exemplo 1 upgrade gráfico helm dia2
zh_cn: Day2 Helm chart 升级示例 1

source: From here, select <emphasis role="strong">Read from File</emphasis> and find the <literal>bundle.yaml</literal> file on your system.
es: Ahora, seleccione <emphasis role="strong">Read from File</emphasis> (Leer desde archivo) y busque el archivo <literal>bundle.yaml</literal> en su sistema.
ja: ここから、<emphasis role="strong">［Read from File (ファイルから読み取り)］</emphasis>を選択し、システムで<literal>bundle.yaml</literal>ファイルを見つけます。
pt_br: Agora selecione <emphasis role="strong">Read from File</emphasis> (Ler arquivo) e encontre o arquivo <literal>bundle.yaml</literal> no sistema.
zh_cn: 在此处选择 <emphasis role="strong">Read from File</emphasis>（从文件读取），并找到系统上的 <literal>bundle.yaml</literal> 文件。

source: This will auto-populate the <literal>Bundle</literal> inside of Rancher’s UI.
es: El <literal>Bundle</literal> se rellenará automáticamente en la interfaz de usuario de Rancher.
ja: これにより、Rancher UI内に<literal>バンドル</literal>が自動入力されます。
pt_br: Isso preencherá automaticamente o <literal>Bundle</literal> na IU do Rancher.
zh_cn: 此时会在 Rancher UI 中自动填充<literal>捆绑包</literal>。

source: Select <emphasis role="strong">Create</emphasis>.
es: Seleccione <emphasis role="strong">Create</emphasis> (Crear).
ja: <emphasis role="strong">［Create (作成)］</emphasis>を選択します。
pt_br: Selecione <emphasis role="strong">Create</emphasis> (Criar).
zh_cn: 选择 <emphasis role="strong">Create</emphasis>（创建）。

source: After a successful deployment, your Bundle would look similar to:
es: Cuando haya finalizado el despliegue correctamente, el Bundle deberá tener un aspecto similar al siguiente:
ja: 正常にデプロイされたら、バンドルは次のようになります。
pt_br: Após a implantação bem-sucedida, o bundle terá uma aparência similar a esta:
zh_cn: 成功部署后，捆绑包如下所示：

source: Successfully deployed Bundle
es: Bundle desplegado correctamente
ja: 正常にデプロイされたバンドル
pt_br: Bundle implantado com sucesso
zh_cn: 已成功部署的捆绑包

source: day2 helm chart upgrade example 2
es: ejemplo 2 de actualización de chart del helm de día 2
ja: day2 helmチャートアップグレード例2
pt_br: exemplo 2 upgrade gráfico helm dia2
zh_cn: Day2 Helm chart 升级示例 2

source: After the successful deployment of the <literal>Bundle</literal>, to monitor the upgrade process:
es: Cuando haya finalizado el despliegue del <literal>Bundle</literal> correctamente, para supervisar el proceso de actualización:
ja: <literal>バンドル</literal>のデプロイメントが成功した後で、アップグレードプロセスを監視するには次のようにします。
pt_br: Após a implantação bem-sucedida do <literal>Bundle</literal>, monitore o processo de upgrade da seguinte maneira:
zh_cn: 成功部署<literal>捆绑包</literal>后，要监控升级过程，请执行以下操作：

source: Verify the logs of the <literal>Upgrade Pod</literal>:
es: Verifique los registros del <literal>pod de actualización</literal>:
ja: <literal>アップグレードPod</literal>のログを確認します。
pt_br: Consulte os registros do <literal>pod de upgrade</literal>:
zh_cn: 验证<literal>升级 Pod</literal> 的日志：

source: day2 helm chart upgrade example 3 management
es: ejemplo 3 de actualización de chart de helm de día 2 gestión
ja: day2 helmチャートアップグレード例3管理
pt_br: gerenciamento exemplo 3 upgrade gráfico helm dia2
zh_cn: Day2 Helm chart 升级示例 3 管理

source: Now verify the logs of the Pod created for the upgrade by the helm-controller:
es: Ahora, verifique los registros del pod creado para la actualización por helm-controller:
ja: ここで、helm-controllerによってアップグレードに作成されたPodのログを確認します。
pt_br: Agora consulte os registros do pod criado pelo helm-controller para o upgrade:
zh_cn: 现在验证 helm-controller 针对升级过程创建的 Pod 日志：

source: The Pod name will be with the following template - <literal>helm-install-longhorn-&lt;random-suffix&gt;</literal>
es: El nombre del pod tendrá este formato: <literal>helm-install-longhorn-&lt;sufijo aleatorio&gt;</literal>
ja: Pod名は次のテンプレートを使用します - <literal>helm-install-longhorn-&lt;random-suffix&gt;</literal>
pt_br: O nome do pod seguirá o seguinte gabarito: <literal>helm-install-longhorn-&lt;sufixo-aleatório&gt;</literal>
zh_cn: Pod 名称将使用以下模板 - <literal>helm-install-longhorn-&lt;random-suffix&gt;</literal>

source: The Pod will be in the namespace where the <literal>HelmChart</literal> resource was deployed. In our case this is <literal>kube-system</literal>.
es: El pod estará en el espacio de nombres donde se desplegó el recurso <literal>HelmChart</literal>. En nuestro caso, <literal>kube-system</literal>.
ja: Podは、<literal>HelmChart</literal>リソースがデプロイされたネームスペースにあります。この場合、このネームスペースは<literal>kube-system</literal>です。
pt_br: O pod estará no namespace em que o recurso <literal>HelmChart</literal> foi implantado. No nosso caso, o namespace é <literal>kube-system</literal>.
zh_cn: Pod 将位于部署了 <literal>HelmChart</literal> 资源的名称空间中。在本例中为 <literal>kube-system</literal> 名称空间。

source: Logs for successfully upgraded Longhorn chart
es: Registros de chart de Longhorn actualizado correctamente
ja: 正常にアップグレードされたLonghornチャートのログ
pt_br: Registros do gráfico do Longhorn atualizado com sucesso
zh_cn: 成功升级的 Longhorn chart 的日志

source: day2 helm chart upgrade example 4 management
es: ejemplo 4 de actualización de chart de helm de día 2 gestión
ja: day2 helmチャートアップグレード例4管理
pt_br: gerenciamento exemplo 4 upgrade gráfico helm dia2
zh_cn: Day2 Helm chart 升级示例 4 管理

source: Verify that the <literal>HelmChart</literal> version has been updated by navigating to Rancher’s <literal>HelmCharts</literal> section (<literal>More Resources → HelmCharts</literal>). Select the namespace where the chart was deployed, for this example it would be <literal>kube-system</literal>.
es: Compruebe que la versión de <literal>HelmChart</literal> se ha actualizado. Para ello, diríjase a la sección <literal>HelmCharts</literal> de Rancher seleccionando <literal>More Resources → HelmCharts</literal> (Más recursos → HelmCharts). Seleccione el espacio de nombres donde se desplegó el chart; en este ejemplo, sería <literal>kube-system</literal>.
ja: Rancherの<literal>HelmCharts</literal>セクション(<literal>［More Resources (その他のリソース)］ → ［HelmCharts］</literal>)に移動して、<literal>HelmChart</literal>のバージョンが更新されていることを確認します。チャートがデプロイされたネームスペースを選択します。この例では、<literal>kube-system</literal>です。
pt_br: Verifique se a versão do <literal>HelmChart</literal> foi atualizada navegando até a seção <literal>HelmCharts</literal> do Rancher (<literal>More Resources → HelmCharts</literal> "Mais recursos → HelmCharts"). Selecione o namespace em que o gráfico foi implantado; que, neste exemplo, é <literal>kube-system</literal>.
zh_cn: 导航到 Rancher 的 <literal>HelmChart</literal> 部分（<literal>More Resources（更多资源）→ HelmChart</literal>），验证 <literal>HelmChart</literal> 版本是否已更新。选择部署了该 chart 的名称空间，在本例中为 <literal>kube-system</literal>。

source: Finally check that the Longhorn Pods are running.
es: Por último, compruebe que los pods de Longhorn se estén ejecutando.
ja: 最後に、 Longhorn Podが実行されていることを確認します。
pt_br: Por fim, verifique se os pods do Longhorn estão em execução.
zh_cn: 最后检查 Longhorn Pod 是否正在运行。

source: After making the above validations, it is safe to assume that the Longhorn Helm chart has been upgraded to the <literal>107.0.0+up1.9.1</literal> version.
es: Después de realizar las validaciones anteriores, se puede entender con seguridad que el chart de Helm de Longhorn se ha actualizado a la versión <literal>107.0.0+up1.9.1</literal>.
ja: 上記の検証後、Longhorn Helmチャートが<literal>107.0.0+up1.9.1</literal>バージョンにアップグレードされていると仮定しても問題ないでしょう。
zh_cn: 完成上述验证后，可以确定 Longhorn Helm chart 已升级到 <literal>107.0.0+up1.9.1</literal> 版本。

source: Helm chart upgrade using a third-party GitOps tool
es: Actualización del chart de Helm con una herramienta GitOps de terceros
ja: サードパーティのGitOpsツールを使用したHelmチャートのアップグレード
pt_br: Upgrade do gráfico Helm usando uma ferramenta GitOps de terceiros
zh_cn: 使用第三方 GitOps 工具进行 Helm chart 升级

source: There might be use-cases where users would like to use this upgrade procedure with a GitOps workflow other than Fleet (e.g. <literal>Flux</literal>).
es: Puede darse el caso de que los usuarios deseen utilizar este procedimiento de actualización con un flujo de trabajo de GitOps que no sea Fleet (por ejemplo, <literal>Flux</literal>).
ja: ユーザがこのアップグレード手順をFleet以外のGitOpsワークフロー(<literal>Flux</literal>など)で実行したいユースケースが存在する場合があります。
pt_br: Em alguns casos de uso, os usuários talvez queiram seguir esse procedimento de upgrade com um fluxo de trabalho do GitOps diferente do Fleet (por exemplo, <literal>Flux</literal>).
zh_cn: 在某些使用场景中，用户可能希望将此升级过程与 Fleet 以外的 GitOps 工作流程（例如 <literal>Flux</literal>）配合使用。

source: To produce the resources needed for the upgrade procedure, you can use the <literal>generate-chart-upgrade-data.sh</literal> script to populate the <literal>eib-charts-upgrader</literal> Fleet with the user provided data. For more information on how to do this, see <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
es: Para generar los recursos necesarios para el procedimiento de actualización, puede usar el guion <literal>generate-chart-upgrade-data.sh</literal> para rellenar la flota <literal>eib-charts-upgrader</literal> con los datos proporcionados por el usuario. Para obtener más información sobre cómo hacerlo, consulte la <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
ja: アップグレード手順に必要なリソースを生成するには、 <literal>generate-chart-upgrade-data.sh</literal>スクリプトを使用して、ユーザが提供するデータを<literal>eib-charts-upgrader</literal> Fleetに入力することができます。この実行方法の詳細については、<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>を参照してください。
pt_br: Para gerar os recursos necessários ao procedimento de upgrade, você pode usar o script <literal>generate-chart-upgrade-data.sh</literal> para preencher a instância do Fleet <literal>eib-charts-upgrader</literal> com os dados fornecidos pelo usuário. Para obter mais informações sobre como fazer isso, consulte a <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
zh_cn: 要生成升级过程所需的资源，可以使用 <literal>generate-chart-upgrade-data.sh</literal> 脚本将用户提供的数据填充到 <literal>eib-charts-upgrader</literal> Fleet。有关如何执行此操作的详细信息，请参见<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>。

source: After you have the full setup, you can use <link xl:href="https://kustomize.io">kustomize</link> to generate a full working solution that you can deploy in your cluster:
es: Cuando haya completado la configuración, puede utilizar <link xl:href="https://kustomize.io">kustomize</link> para generar una solución totalmente funcional que puede desplegar en su clúster:
ja: 完全なセットアップ後、<link xl:href="https://kustomize.io">kustomize</link>を使用して、クラスタにデプロイ可能な完全な動作ソリューションを生成することができます。
pt_br: Com a configuração completa, você pode usar o <link xl:href="https://kustomize.io">kustomize</link> para gerar uma solução totalmente funcional para ser implantada no seu cluster:
zh_cn: 完成所有设置后，可以使用 <link xl:href="https://kustomize.io">kustomize</link> 生成一个可在群集中部署且完整有效的解决方案：

source: If you want to include the solution to your GitOps workflow, you can remove the <literal>fleet.yaml</literal> file and use what is left as a valid <literal>Kustomize</literal> setup. Just do not forget to first run the <literal>generate-chart-upgrade-data.sh</literal> script, so that it can populate the <literal>Kustomize</literal> setup with the data for the Helm charts that you wish to upgrade to.
es: Si desea incluir la solución en su flujo de trabajo de GitOps, puede eliminar el archivo <literal>fleet.yaml</literal> y usar lo que queda como una configuración válida de <literal>Kustomize</literal>. No olvide ejecutar primero el guion <literal>generate-chart-upgrade-data.sh</literal>, para poder rellenar la configuración de <literal>Kustomize</literal> con los datos de los charts de Helm a los que desea actualizar.
ja: GitOpsワークフローにソリューションを含める場合は、<literal>fleet.yaml</literal>ファイルを削除して、残ったものを有効な<literal>Kustomize</literal>セットアップとして使用できます。まず、<literal>generate-chart-upgrade-data.sh</literal>スクリプトを実行し、アップグレードするHelmチャートのデータを<literal>Kustomize</literal>セットアップに読み込ませることを忘れないでください。
pt_br: Para incluir a solução no fluxo de trabalho do GitOps, remova o arquivo <literal>fleet.yaml</literal> e use o que sobrou como configuração válida do <literal>Kustomize</literal>. Lembre-se de executar primeiro o script <literal>generate-chart-upgrade-data.sh</literal> para que ele possa preencher a configuração do <literal>Kustomize</literal> com os dados dos gráficos Helm para o qual você quer fazer upgrade.
zh_cn: 如果想将解决方案包含在 GitOps 工作流程中，可以去除 <literal>fleet.yaml</literal> 文件，并将其余内容用作有效的 <literal>Kustomize</literal> 设置。只是别忘了先运行 <literal>generate-chart-upgrade-data.sh</literal> 脚本，以便其可以将您想要升级到的 Helm chart 的数据填充到 <literal>Kustomize</literal> 设置中。

source: To understand how this workflow is intended to be used, it can be beneficial to look at <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/> and <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
es: Para comprender cómo se pretende usar este flujo de trabajo, puede resultar útil consultar la <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/> y la <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
ja: このワークフローの使用方法を理解するには、<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>と<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>を参照すると役立つでしょう。
pt_br: Para saber qual é a finalidade de uso desse fluxo de trabalho, consulte a <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/> e a <xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>.
zh_cn: 要了解如何使用此工作流程，可以查看<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>和<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>。

source: Downstream clusters
es: Clústeres descendentes
ja: ダウンストリームクラスタ
pt_br: Clusters downstream
zh_cn: 下游群集

source: The following steps do not apply to <literal>downstream</literal> clusters managed by SUSE Telco Cloud (<xref linkend="atip"/>). For guidance on upgrading these clusters, refer to <xref linkend="atip-lifecycle-downstream"/>.
es: Los pasos siguientes no se aplican a clústeres <literal>descendentes</literal> gestionados por SUSE Telco Cloud (<xref linkend="atip"/>). Para obtener información sobre cómo actualizar estos clústeres, consulte la <xref linkend="atip-lifecycle-downstream"/>.
ja: 以下の手順は、SUSE Telco Cloud (<xref linkend="atip"/>)によって管理される<literal>ダウンストリーム</literal>クラスタには適用されません。ダウンストリームクラスタのアップグレードに関するガイダンスについては、<xref linkend="atip-lifecycle-downstream"/>を参照してください。
zh_cn: 以下步骤不适用于由 SUSE Telco Cloud （<xref linkend="atip"/>）管理的<literal>下游</literal>群集。有关这些群集的升级指南，请参见<xref linkend="atip-lifecycle-downstream"/>。

source: This section covers the possible ways to perform "Day 2" operations for different parts of your <literal>downstream</literal> cluster.
es: Esta sección describe las formas posibles de realizar operaciones de "día 2" para diferentes partes de su clúster <literal>descendente</literal>.
ja: このセクションでは、 <literal>ダウンストリーム</literal>クラスタのさまざまな部分に対して「Day 2」操作を実行可能な方法について説明します。
pt_br: Esta seção apresenta as maneiras possíveis de executar operações de "dia 2" em diferentes partes do cluster <literal>downstream</literal>.
zh_cn: 本章介绍对<literal>下游</literal>群集的不同部分执行“Day 2”操作的可能方式。

source: <xref linkend="downstream-day2-fleet-components"/> - default components used for all "Day 2" operations.
es: <xref linkend="downstream-day2-fleet-components"/>: los componentes predeterminados usados para todas las operaciones de "día 2".
ja: <xref linkend="downstream-day2-fleet-components"/> - すべての「Day 2」操作に使用されるデフォルトコンポーネント。
pt_br: <xref linkend="downstream-day2-fleet-components"/>: componentes padrão usados para todas as operações de "dia 2".
zh_cn: <xref linkend="downstream-day2-fleet-components"/> - 执行所有“Day 2”操作时需要使用的默认组件。

source: <xref linkend="downstream-day2-fleet-determine-use-case"/> - provides an overview of the Fleet custom resources that will be used and their suitability for different "Day 2" operations use-cases.
es: <xref linkend="downstream-day2-fleet-determine-use-case"/>: proporciona una descripción general de los recursos personalizados de Fleet que se usarán y su idoneidad para diferentes casos de uso de operaciones de "día 2".
ja: <xref linkend="downstream-day2-fleet-determine-use-case"/> - 使用されるFleetカスタムリソースの概要と、これらのリソースがさまざまな「Day 2」操作のユースケースに適しているかどうかを説明します。
pt_br: <xref linkend="downstream-day2-fleet-determine-use-case"/>: apresenta uma visão geral dos recursos personalizados do Fleet que serão usados e como se adaptam aos diferentes casos de uso das operações de "dia 2".
zh_cn: <xref linkend="downstream-day2-fleet-determine-use-case"/> - 概述将使用的 Fleet 自定义资源及其在不同“Day 2”操作场景中的适用性。

source: <xref linkend="downstream-day2-upgrade-workflow"/> - provides a workflow guide for executing "Day 2" operations with Fleet.
es: <xref linkend="downstream-day2-upgrade-workflow"/>: proporciona una guía del flujo de trabajo para ejecutar operaciones de "día 2" con Fleet.
ja: <xref linkend="downstream-day2-upgrade-workflow"/> - Fleetを使用して「Day 2」操作を実行するためのワークフローガイドを提供します。
pt_br: <xref linkend="downstream-day2-upgrade-workflow"/>: fornece um guia de fluxo de trabalho para execução de operações de "dia 2" com o Fleet.
zh_cn: <xref linkend="downstream-day2-upgrade-workflow"/> - 提供使用 Fleet 执行“Day 2”操作的工作流程指南。

source: <xref linkend="downstream-day2-fleet-os-upgrade"/> - describes how to do OS upgrades using Fleet.
es: <xref linkend="downstream-day2-fleet-os-upgrade"/>: describe cómo realizar actualizaciones del sistema operativo con Fleet.
ja: <xref linkend="downstream-day2-fleet-os-upgrade"/> - Fleetを使用してOSアップグレードを実行する方法を説明します。
pt_br: <xref linkend="downstream-day2-fleet-os-upgrade"/>: descreve como fazer upgrades de sistema operacional com o Fleet.
zh_cn: <xref linkend="downstream-day2-fleet-os-upgrade"/> - 说明如何使用 Fleet 进行操作系统升级。

source: <xref linkend="downstream-day2-fleet-k8s-upgrade"/> - describes how to do Kubernetes version upgrades using Fleet.
es: <xref linkend="downstream-day2-fleet-k8s-upgrade"/>: describe cómo realizar actualizaciones de la versión de Kubernetes con Fleet.
ja: <xref linkend="downstream-day2-fleet-k8s-upgrade"/> - Fleetを使用してKubernetesバージョンアップグレードを実行する方法を説明します。
pt_br: <xref linkend="downstream-day2-fleet-k8s-upgrade"/>: descreve como fazer upgrades de versão do Kubernetes com o Fleet.
zh_cn: <xref linkend="downstream-day2-fleet-k8s-upgrade"/> - 说明如何使用 Fleet 进行 Kubernetes 版本升级。

source: <xref linkend="downstream-day2-fleet-helm-upgrade"/> - describes how to do Helm chart upgrades using Fleet.
es: <xref linkend="downstream-day2-fleet-helm-upgrade"/>: describe cómo realizar actualizaciones de charts de Helm con Fleet.
ja: <xref linkend="downstream-day2-fleet-helm-upgrade"/> - Fleetを使用してHelmチャートアップグレードを実行する方法を説明します。
pt_br: <xref linkend="downstream-day2-fleet-helm-upgrade"/>: descreve como fazer upgrades de gráficos Helm com o Fleet.
zh_cn: <xref linkend="downstream-day2-fleet-helm-upgrade"/> - 说明如何使用 Fleet 进行 Helm chart 升级。

source: Below you can find a description of the default components that should be set up on your <literal>downstream</literal> cluster so that you can successfully perform "Day 2" operations using Fleet.
es: A continuación, encontrará una descripción de los componentes predeterminados que deben configurarse en el clúster <literal>descendente</literal> para poder realizar correctamente operaciones de "día 2" con Fleet.
ja: 以下に、Fleetを使用して「Day 2」操作を正常に実行できるように、<literal>ダウンストリーム</literal>クラスタで設定する必要があるデフォルトコンポーネントについて説明します。
pt_br: Veja a seguir uma descrição dos componentes padrão que você deve configurar no cluster <literal>downstream</literal> para realizar operações de "dia 2" com sucesso pelo Fleet.
zh_cn: 下文将介绍为使用 Fleet 顺利执行“Day 2”操作而应在<literal>下游</literal>群集上设置的默认组件。

source: <emphasis role="strong">Must</emphasis> be deployed on each downstream cluster.
es: <emphasis role="strong">Debe</emphasis> desplegarse en cada clúster descendente.
ja: 各ダウンストリームクラスタ上にデプロイする<emphasis role="strong">必要があります</emphasis>。
pt_br: <emphasis role="strong">Deve</emphasis> ser implantado em cada cluster downstream.
zh_cn: <emphasis role="strong">必须</emphasis>在每个下游群集上部署。

source: For information on how to deploy <emphasis role="strong">SUC</emphasis>, first determine your use-case (<xref linkend="downstream-day2-fleet-determine-use-case"/>) and then refer to System Upgrade Controller installation - GitRepo (<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>), or System Upgrade Controller installation - Bundle (<xref linkend="components-system-upgrade-controller-fleet-bundle"/>).
es: Para obtener información sobre cómo desplegar <emphasis role="strong">SUC</emphasis>, determine primero su caso práctico <xref linkend="downstream-day2-fleet-determine-use-case"/>) y, a continuación, consulte las secciones Instalación de System Upgrade Controller - GitRepo (<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>) o Instalación de System Upgrade Controller - Bundle (<xref linkend="components-system-upgrade-controller-fleet-bundle"/>).
ja: <emphasis role="strong">SUC</emphasis>をデプロイする方法については、まずユースケースを決定し(<xref linkend="downstream-day2-fleet-determine-use-case"/>)、次に「System Upgrade Controllerのインストール - GitRepo」(<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>)、または「System Upgrade Controller のインストール - バンドル」(<xref linkend="components-system-upgrade-controller-fleet-bundle"/>)を参照してください。
pt_br: Para obter informações sobre como implantar o <emphasis role="strong">SUC</emphasis>, determine primeiro o seu caso de uso (<xref linkend="downstream-day2-fleet-determine-use-case"/>) e depois consulte Instalação do System Upgrade Controller – GitRepo (<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>) ou Instalação do System Upgrade Controller – Bundle (<xref linkend="components-system-upgrade-controller-fleet-bundle"/>).
zh_cn: 有关如何部署 <emphasis role="strong">SUC</emphasis> 的信息，请先确定您的使用场景（<xref linkend="downstream-day2-fleet-determine-use-case"/>），然后参见<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>或<xref linkend="components-system-upgrade-controller-fleet-bundle"/>。
