Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Check logs</emphasis>: Logs are the primary source of information. Most of the times the errors are self explanatory and contain hints on what failed.
es: <emphasis role="strong">Consulte los registros</emphasis>: los registros son la principal fuente de información. La mayoría de las veces, los errores se explican por sí mismos y contienen pistas sobre lo que ha fallado.
ja: <emphasis role="strong">ログの確認</emphasis>: ログは主要な情報源です。ほとんどの場合、エラーは説明不要で、何が失敗したかに関するヒントが含まれています。
pt_br: <emphasis role="strong">Consultar os registros</emphasis>: os registros são a principal fonte de informações. Na maior parte das vezes, os erros são autoexplicativos e contêm dicas sobre o motivo da falha.
zh_cn: <emphasis role="strong">检查日志</emphasis>：日志是主要的信息来源。大多数情况下，错误消息会自行说明问题，且包含失败原因的提示。

source: <emphasis role="strong">Check clocks</emphasis>: Having clock differences between systems can lead to all kinds of different errors. Ensure clocks are in sync. EIB can be instructed to force clock sync at boot time, see Configuring OS Time (<xref linkend="quickstart-eib"/>).
es: <emphasis role="strong">Compruebe los relojes</emphasis>: la diferencia horaria entre sistemas pueden provocar todo tipo de errores. Asegúrese de que los relojes estén sincronizados. Se puede indicar a EIB que fuerce la sincronización del reloj al arrancar el sistema. Consulte la sección sobre cómo configurar la hora del sistema operativo (<xref linkend="quickstart-eib"/>).
ja: <emphasis role="strong">クロックの確認</emphasis>: システム間にクロックの相違があると、あらゆる種類の異なるエラーが発生する可能性があります。クロックが同期していることを確認します。EIBにブート時にクロック同期を強制するように指示することができます。「OSの時刻の設定」(<xref linkend="quickstart-eib"/>)を参照してください。
pt_br: <emphasis role="strong">Verificar os relógios</emphasis>: as diferenças entre os relógios dos sistemas podem provocar diversos tipos de erros. Assegure a sincronização dos relógios. É possível instruir o EIB a forçar a sincronização dos relógios no momento da inicialização. Consulte Configurando a hora do sistema operacional (<xref linkend="quickstart-eib"/>).
zh_cn: <emphasis role="strong">检查时钟</emphasis>：系统间的时钟差异可能导致各种错误。确保时钟同步。可通过 EIB 配置在引导时强制时钟同步，请参见“配置操作系统时间”（<xref linkend="quickstart-eib"/>）。

source: <emphasis role="strong">Boot Issues</emphasis>: If the system is stuck during boot, note down the last messages displayed. Access the console (physical or via BMC) to observe boot messages.
es: <emphasis role="strong">Problemas de arranque</emphasis>: si el sistema se bloquea durante el arranque, anote los últimos mensajes que se muestran. Acceda al panel de control (físico o a través de BMC) para leer los mensajes de arranque.
ja: <emphasis role="strong">ブートの問題</emphasis>: システムがブート中に停止した場合、最後に表示されたメッセージをメモします。コンソール(物理的またはBMC経由)にアクセスして、ブートメッセージを確認します。
pt_br: <emphasis role="strong">Problemas na inicialização</emphasis>: se o sistema travar durante a inicialização, anote as últimas mensagens exibidas. Acesse o console (físico ou via BMC) para observar as mensagens de inicialização.
zh_cn: <emphasis role="strong">引导问题</emphasis>：如果系统在引导过程中陷入停滞状态，则记录显示的最后一条消息。可访问控制台（物理连接或通过 BMC）查看引导消息。

source: <emphasis role="strong">Network Issues</emphasis>: Verify network interface configuration (<literal>ip a</literal>), routing table (<literal>ip route</literal>), test connectivity from/to other nodes and external services (<literal>ping</literal>, <literal>nc</literal>). Ensure firewall rules are not blocking necessary ports.
es: <emphasis role="strong">Problemas de red</emphasis>: verifique la configuración de la interfaz de red (<literal>ip a</literal>), la tabla de enrutamiento (<literal>ip route</literal>), pruebe la conectividad desde y hacia otros nodos y servicios externos (<literal>ping</literal>, <literal>nc</literal>). Asegúrese de que las reglas del cortafuegos no estén bloqueando los puertos necesarios.
ja: <emphasis role="strong">ネットワークの問題</emphasis>: ネットワークインタフェースの設定(<literal>ip a</literal>)、ルーティングテーブル(<literal>ip route</literal>)、他のノードと外部サービスとの間のテスト接続(<literal>ping</literal>、 <literal>nc</literal>)を確認します。ファイアウォールルールがネットワークポートをブロックしていないことを確認します。
pt_br: <emphasis role="strong">Problemas de rede</emphasis>: verifique a configuração da interface de rede (<literal>ip a</literal>) e a tabela de roteamento (<literal>ip route</literal>), teste a conectividade com outros nós e serviços externos (<literal>ping</literal>, <literal>nc</literal>) e garanta que as regras de firewall não bloqueiem as portas necessárias.
zh_cn: <emphasis role="strong">网络问题</emphasis>：验证网络接口配置 (<literal>ip a</literal>)、路由表 (<literal>ip route</literal>)，测试与其他节点及外部服务的连通性（<literal>ping</literal>、<literal>nc</literal>）。确保防火墙规则未封锁必要端口。

source: <emphasis role="strong">Verify component status</emphasis>: Use <literal>kubectl get</literal> and <literal>kubectl describe</literal> for Kubernetes resources. Use <literal>kubectl get events --sort-by='.lastTimestamp' -n &lt;namespace&gt;</literal> to see the events on a particular Kubernetes namespace.
es: <emphasis role="strong">Verifique el estado de los componentes</emphasis>: use <literal>kubectl get</literal> y <literal>kubectl describe</literal> para los recursos de Kubernetes. Use <literal>kubectl get events --sort-by='.lastTimestamp' -n &lt;espaciodenombres&gt;</literal> para ver los eventos de un espacio de nombres concreto de Kubernetes.
ja: <emphasis role="strong">コンポーネントのステータスの確認</emphasis>: Kubernetesリソースの場合は、 <literal>kubectl get</literal>と<literal>kubectl describe</literal>を使用します。特定のKubernetesネームスペースのイベントを確認するには、<literal>kubectl get events --sort-by='.lastTimestamp' -n &lt;namespace&gt;</literal>を使用します。
pt_br: <emphasis role="strong">Verificar o status dos componentes</emphasis>: use <literal>kubectl get</literal> e <literal>kubectl describe</literal> para os recursos do Kubernetes. Use <literal>kubectl get events --sort-by='.lastTimestamp' -n &lt;namespace&gt;</literal> para ver os eventos em um determinado namespace do Kubernetes.
zh_cn: <emphasis role="strong">验证组件状态</emphasis>：使用 <literal>kubectl get</literal> 和 <literal>kubectl describe</literal> 查看 Kubernetes 资源。使用 <literal>kubectl get events --sort-by='.lastTimestamp' -n &lt;namespace&gt;</literal> 查看特定 Kubernetes 名称空间的事件。

source: <emphasis role="strong">Verify services status</emphasis>: Use <literal>systemctl status &lt;service&gt;</literal> for systemd services.
es: <emphasis role="strong">Verifique el estado de los servicios</emphasis>: use <literal>systemctl status &lt;servicio&gt;</literal> para los servicios systemd.
ja: <emphasis role="strong">サービスステータスの確認</emphasis>: systemdサービスの場合は、<literal>systemctl status &lt;service&gt;</literal>を使用します。
pt_br: <emphasis role="strong">Verificar o status dos serviços</emphasis>: use <literal>systemctl status &lt;serviço&gt;</literal> para os serviços systemd.
zh_cn: <emphasis role="strong">验证服务状态</emphasis>：使用 <literal>systemctl status &lt;service&gt;</literal> 检查 systemd 服务状态。

source: <emphasis role="strong">Check syntax</emphasis>: Software expects certain structure and syntax on configuration files. For yaml files, for example, use <literal>yamllint</literal> or similar tools to verify the proper syntax.
es: <emphasis role="strong">Compruebe la sintaxis</emphasis>: el software espera una estructura y sintaxis determinadas en los archivos de configuración. Para los archivos yaml, por ejemplo, utilice <literal>yamllint</literal> o herramientas similares para verificar que la sintaxis sea correcta.
ja: <emphasis role="strong">構文の確認</emphasis>: ソフトウェアは設定ファイルに特定の構造と構文を想定しています。たとえばYAMLファイルの場合、<literal>yamllint</literal>や類似のツールを使用して、正しい構文を確認します。
pt_br: <emphasis role="strong">Verificar a sintaxe</emphasis>: o software espera uma determinada estrutura e sintaxe nos arquivos de configuração. Para os arquivos yaml, por exemplo, use <literal>yamllint</literal> ou ferramentas similares para verificar a sintaxe adequada.
zh_cn: <emphasis role="strong">检查语法</emphasis>：软件对配置文件的结构和语法有特定要求。例如，对于 YAML 文件，可使用 <literal>yamllint</literal> 或类似工具验证语法正确性。

source: <emphasis role="strong">Isolate the problem</emphasis>: Try to narrow down the issue to a specific component or layer (for example, network, storage, OS, Kubernetes, Metal<superscript>3</superscript>, Ironic,…​).
es: <emphasis role="strong">Aísle el problema</emphasis>: intente delimitar el problema a un componente o capa específicos (por ejemplo, la red, el almacenamiento, el sistema operativo, Kubernetes, Metal<superscript>3</superscript>, Ironic, etc.​).
ja: <emphasis role="strong">問題の特定</emphasis>: 問題を特定のコンポーネントまたはレイヤ(たとえば、ネットワーク、ストレージ、OS、Kubernetes、Metal<superscript>3</superscript>、Ironicなど​)に絞り込みます。
pt_br: <emphasis role="strong">Isolar o problema</emphasis>: tente restringir o problema a um componente ou uma camada específica (por exemplo, rede, armazenamento, sistema operacional, Kubernetes, Metal<superscript>3</superscript>, Ironic etc.).
zh_cn: <emphasis role="strong">隔离问题</emphasis>：尝试将问题缩小到特定组件或层级（例如，网络、存储、操作系统、Kubernetes、Metal<superscript>3</superscript>、Ironic 等）。

source: <emphasis role="strong">Documentation</emphasis>: Always refer to the official <link xl:href="https://documentation.suse.com/suse-edge/">SUSE Edge documentation</link> and also upstream documentation for detailed information.
es: <emphasis role="strong">Documentación</emphasis>: consulte siempre la <link xl:href="https://documentation.suse.com/suse-edge/">documentación oficial de SUSE Edge</link> y la documentación original para obtener información detallada.
ja: <emphasis role="strong">ドキュメント</emphasis>: 詳細については、常に公式の<link xl:href="https://documentation.suse.com/suse-edge/">SUSE Edgeドキュメント</link>およびアップストリームドキュメントを参照してください。
pt_br: <emphasis role="strong">Documentação</emphasis>: consulte sempre a <link xl:href="https://documentation.suse.com/suse-edge/">documentação oficial do SUSE Edge</link> e também a documentação upstream para obter informações detalhadas.
zh_cn: <emphasis role="strong">文档参考</emphasis>：始终参考官方 <link xl:href="https://documentation.suse.com/suse-edge/">SUSE Edge 文档</link>及上游文档以获取详细信息。

source: <emphasis role="strong">Versions</emphasis>: SUSE Edge is an opinionated and thoroughly tested version of different SUSE components. The versions of each component per SUSE Edge release can be observed in the <link xl:href="https://documentation.suse.com/suse-edge/support-matrix/html/support-matrix/index.html">SUSE Edge support matrix</link>.
es: <emphasis role="strong">Versiones</emphasis>: SUSE Edge es una versión rigurosa y exhaustivamente probada de diferentes componentes de SUSE. Las versiones de cada componente en cada versión de SUSE Edge se pueden consultar en la <link xl:href="https://documentation.suse.com/suse-edge/support-matrix/html/support-matrix/index.html">matriz de asistencia de SUSE Edge</link>.
ja: <emphasis role="strong">バージョン</emphasis>: SUSE Edgeは、さまざまなSUSEコンポーネントを独自に徹底的にテストしたバージョンです。SUSE Edgeリリースごとの各コンポーネントのバージョンは、<link xl:href="https://documentation.suse.com/suse-edge/support-matrix/html/support-matrix/index.html">SUSE Edgeサポートマトリックス</link>で確認できます。
zh_cn: <emphasis role="strong">版本</emphasis>：SUSE Edge 是经过明确设计且全面测试的 SUSE 各组件集合版本。每个 SUSE Edge 版本所含各组件的版本信息可在 <link xl:href="https://documentation.suse.com/suse-edge/support-matrix/html/support-matrix/index.html">SUSE Edge 支持矩阵</link>中找到。

source: <emphasis role="strong">Known issues</emphasis>: For each SUSE Edge release there is a “Known issues” section on the release notes that contains information of issues that will be fixed on future releases but can affect the current one.
es: <emphasis role="strong">Problemas conocidos</emphasis>: en las notas de cada versión de SUSE Edge hay una sección titulada "Problemas conocidos" que contiene información sobre problemas que se solucionarán en futuras versiones, pero que pueden afectar a la actual.
ja: <emphasis role="strong">既知の問題</emphasis>: SUSE Edgeの各リリースには、リリースノートに「既知の問題」セクションがあり、今後のリリースで修正する予定だが、現在のリリースに影響する可能性のある問題に関する情報が記載されています。
pt_br: <emphasis role="strong">Problemas conhecidos</emphasis>: para cada versão do SUSE Edge existe uma seção de "problemas conhecidos" nas Notas de lançamento, com informações dos problemas que serão corrigidos em versões futuras, mas que podem afetar a versão atual.
zh_cn: <emphasis role="strong">已知问题</emphasis>：每个 SUSE Edge 版本的发行说明中都含有“已知问题”部分，包含有关将在未来版本中修复但可能影响当前版本的问题的信息。

source: Troubleshooting Kiwi
es: Resolución de problemas de Kiwi
ja: Kiwiのトラブルシューティング
pt_br: Solução de problemas do Kiwi
zh_cn: Kiwi 查错

source: Kiwi is used to generate updated SUSE Linux Micro images to be used with Edge Image Builder.
es: Kiwi se usa para generar imágenes actualizadas de SUSE Linux Micro que se utilizarán con Edge Image Builder.
ja: Kiwiを使用して、Edge Image Builderで使用される、更新されたSUSE Linux Microイメージを生成します。
pt_br: O Kiwi é usado para gerar as imagens atualizadas do SUSE Linux Micro que serão usadas com o Edge Image Builder.
zh_cn: Kiwi 用于生成更新的 SUSE Linux Micro 映像，供 Edge Image Builder 使用。

source: Common Issues
es: Problemas comunes
ja: 一般的な問題
pt_br: Problemas comuns
zh_cn: 常见问题

source: <emphasis role="strong">SL Micro Version Mismatch</emphasis>: The build host operating system version must match the operating system version being built (SL Micro 6.0 host → SL Micro 6.0 image).
es: <emphasis role="strong">La versión de SL Micro no coincide</emphasis>: la versión del sistema operativo del host debe coincidir con la del sistema operativo que se está creando (host SL Micro 6.0 → imagen SL Micro 6.0).
ja: <emphasis role="strong">SL Microバージョンの不一致</emphasis>: 構築ホストのオペレーティングシステムのバージョンは、構築されるオペレーティングシステムのバージョンと一致する必要があります(SL Micro 6.0ホスト → SL Micro 6.0イメージ)。
pt_br: <emphasis role="strong">Incompatibilidade de versões do SL Micro</emphasis>: a versão do sistema operacional do host de build deve ser compatível com a versão do sistema operacional que está sendo criada (host do SL Micro 6.0 → imagem do SL Micro 6.0).
zh_cn: <emphasis role="strong">SL Micro 版本不匹配</emphasis>：构建主机的操作系统版本必须与待构建的操作系统版本匹配（例如，SL Micro 6.0 主机 → SL Micro 6.0 映像）。

source: <emphasis role="strong">SELinux in Enforcing State</emphasis>: Due to certain limitations, it is currently required to disable SELinux temporarily to be able to build images with Kiwi. Check the SElinux status with <literal>getenforce</literal> and disable it before running the build process with <literal>setenforce 0</literal>.
es: <emphasis role="strong">SELinux en estado forzado</emphasis>: debido a ciertas limitaciones, es necesario inhabilitar SELinux temporalmente para poder crear imágenes con Kiwi. Compruebe el estado de SELinux con <literal>getenforce</literal> e inhabilítelo antes de ejecutar el proceso de creación con <literal>setenforce 0</literal>.
ja: <emphasis role="strong">SELinuxをEnforcing状態にする</emphasis>: 特定の制限のため、Kiwiを使用してイメージを構築できるように、現在はSELinuxを一時的に無効にする必要があります。<literal>getenforce</literal>でSElinuxステータスを確認し、<literal>setenforce 0</literal>を使用して構築プロセスを実行する前にSElinuxを無効にしてください。
pt_br: <emphasis role="strong">SELinux no estado de imposição</emphasis>: devido a algumas limitações, é necessário desabilitar o SELinux temporariamente para criar imagens com o Kiwi. Verifique o status do SElinux com o comando <literal>getenforce</literal> e desabilite-o antes de executar o processo de criação com <literal>setenforce 0</literal>.
zh_cn: <emphasis role="strong">SELinux 处于强制模式</emphasis>：由于存在某些限制，目前需要临时禁用 SELinux 才能使用 Kiwi 构建映像。请使用 <literal>getenforce</literal> 检查 SELinux 状态，并在运行构建过程前使用 <literal>setenforce 0</literal> 将其禁用。

source: <emphasis role="strong">Build host not registered</emphasis>: The build process uses the build host subscriptions to be able to pull packages from SUSE SCC. If the host is not registered it fails.
es: <emphasis role="strong">Host de creación no registrado</emphasis>: el proceso de creación utiliza las suscripciones del host de creación para poder extraer paquetes del Centro de servicios al cliente de SUSE. Si el host no está registrado, se produce un error.
ja: <emphasis role="strong">構築ホストが登録されていない</emphasis>: 構築プロセスでは、SUSE SCCからパッケージをプルできるように、構築ホストサブスクリプションを使用します。ホストが登録されていない場合は失敗します。
pt_br: <emphasis role="strong">Host de build não registrado</emphasis>: o processo de build usa os registros dos hosts de build para obter os pacotes do SUSE SCC. Se o host não foi registrado, o processo falha.
zh_cn: <emphasis role="strong">构建主机未注册</emphasis>：构建过程会使用构建主机订阅从 SUSE SCC 提取软件包。如果主机未注册，构建将会失败。

source: <emphasis role="strong">Loop Device Test Failure</emphasis>: The first time that the Kiwi build process is executed, it will fail shortly after starting with "ERROR: Early loop device test failed, please retry the container run.", this is a symptom of loop devices being created on the underlying host system that are not immediately visible inside of the container image. Re-run the Kiwi build process again and it should proceed without issue.
es: <emphasis role="strong">Error en la prueba del dispositivo de bucle</emphasis>: la primera vez que se ejecuta el proceso de creación de Kiwi, falla poco después de iniciarse con el mensaje "ERROR: Early loop device test failed, please retry the container run" (Error: la prueba inicial del dispositivo de bucle ha fallado. Intente ejecutar el contenedor de nuevo.). Esto se debe a que se están creando dispositivos de bucle en el sistema host subyacente que no son visibles inmediatamente dentro de la imagen del contenedor. Vuelva a ejecutar el proceso de creación de Kiwi y debería continuar sin problemas.
ja: <emphasis role="strong">ループデバイステスト失敗</emphasis>: 初めてKiwi構築プロセスが実行されると、 開始直後に失敗し、「ERROR: Early loop device test failed, please retry the container run. (エラー: ループデバイスの早期テストが失敗しました。もう一度コンテナの実行を試してください)」というエラーメッセージが表示されます。これは、基になるホストシステム上に作成されるループデバイスがすぐにはコンテナイメージ内に表示されないことを示す症状です。Kiwi構築プロセスを再実行すれば、問題なく続行されるはずです。
pt_br: <emphasis role="strong">Falha no teste do dispositivo em loop</emphasis>: na primeira execução do processo de criação do Kiwi, ocorre uma falha logo depois que ele é iniciado com o erro: "ERROR: Early loop device test failed, please retry the container run." (ERRO: Falha no teste do dispositivo no ciclo inicial. Tente executar o contêiner novamente.). Trata-se de um sintoma em que os dispositivos que são criados em loop no sistema host subjacente não ficam imediatamente visíveis dentro da imagem do contêiner. Execute novamente o processo de criação do Kiwi, e ele deverá prosseguir sem problemas.
zh_cn: <emphasis role="strong">循环设备测试失败</emphasis>：首次执行 Kiwi 构建过程时，启动后不久就会失败，并显示“ERROR: Early loop device test failed, please retry the container run.”，这是由于底层主机系统上正在创建的循环设备无法立即在容器映像内可见所致。重新运行该 Kiwi 构建过程，通常即可顺利进行。

source: <emphasis role="strong">Missing Permissions</emphasis>: The build process expects to be run as root user (or via sudo).
es: <emphasis role="strong">Faltan permisos</emphasis>: se espera que sea el usuario root quien ejecute el proceso de creación (o que se haga mediante sudo).
ja: <emphasis role="strong">許可がない</emphasis>: 構築プロセスはルートユーザとして(またはsudoを介して)実行されることが想定されています。
pt_br: <emphasis role="strong">Permissões ausentes</emphasis>: o processo de build espera sua execução como usuário root (ou via sudo).
zh_cn: <emphasis role="strong">权限缺失</emphasis>：构建过程需要以 root 用户（或通过 sudo）运行。

source: <emphasis role="strong">Wrong Privileges</emphasis>: The build process expects the <literal>--privileged</literal> flag when running the container. Double-check that it is present.
es: <emphasis role="strong">Privilegios incorrectos</emphasis>: el proceso de creación espera el indicador <literal>--privileged</literal> al ejecutar el contenedor. Compruebe que está presente.
ja: <emphasis role="strong">間違った権限</emphasis>: 構築プロセスは、コンテナを実行する際には<literal>--privileged</literal>フラグが指定されていることが想定されています。このフラグが指定されていることを再度確認してください。
pt_br: <emphasis role="strong">Privilégios incorretos</emphasis>: o processo de build espera o sinalizador <literal>--privileged</literal> ao executar o contêiner. Certifique-se de que ele esteja presente.
zh_cn: <emphasis role="strong">权限错误</emphasis>：运行容器时，应为构建过程指定 <literal>--privileged</literal> 标志。请仔细检查是否指定了该标志。

source: Logs
es: Registros
ja: ログ
pt_br: Registros
zh_cn: 日志

source: <emphasis role="strong">Build container logs</emphasis>: Check the logs of the build container. The logs are generated in the directory that was used to store the artifacts. Check docker logs or podman logs for the necessary information as well.
es: <emphasis role="strong">Registros del contenedor de creación</emphasis>: compruebe los registros del contenedor de creación. Los registros se generan en el directorio que se utilizó para almacenar los artefactos. Compruebe también los registros de Docker o Podman para obtener la información necesaria.
ja: <emphasis role="strong">構築コンテナのログ</emphasis>: 構築コンテナのログを確認します。ログはアーティファクトの保存に使用されたディレクトリに生成されます。必要な情報については、dockerログまたはpodmanログも確認してください。
pt_br: <emphasis role="strong">Registros do contêiner de build</emphasis>: consulte os registros do contêiner de build. Os registros são gerados no diretório que foi usado para armazenar os artefatos. Consulte também os registros do docker ou do podman para ver as informações necessárias.
zh_cn: <emphasis role="strong">构建容器日志</emphasis>：检查构建容器的日志。生成的日志存放在用于存储制品的目录中。也可通过 docker logs 或 podman logs 获取必要信息。

source: <emphasis role="strong">Temporary build directories</emphasis>: Kiwi creates temporary directories during the build process. Check these for intermediate logs or artifacts if the main output is insufficient.
es: <emphasis role="strong">Directorios temporales de creación</emphasis>: Kiwi crea directorios temporales durante el proceso de creación. Compruebe esos directorios en busca de registros intermedios o artefactos si el resultado principal es insuficiente.
ja: <emphasis role="strong">一時構築ディレクトリ</emphasis>: Kiwiは、構築プロセス中に一時ディレクトリを作成します。メイン出力が不十分な場合は、これらのディレクトリに中間ログやアーティファクトがないか確認します。
pt_br: <emphasis role="strong">Diretórios temporários de build</emphasis>: o Kiwi cria diretórios temporários durante o processo de build. Consulte-os para acessar os registros ou os artefatos intermediários se a saída principal não for suficiente.
zh_cn: <emphasis role="strong">临时构建目录</emphasis>：Kiwi 会在构建过程中创建临时目录。如果主要输出的信息不充足，可在这些目录中查看中间日志或制品。

source: Troubleshooting steps
es: Pasos para resolver problemas
ja: トラブルシューティング手順
pt_br: Etapas da solução de problemas
zh_cn: 查错步骤

source: <emphasis role="strong">Review <literal>build-image</literal> output</emphasis>: The error message in the console output is usually very indicative.
es: <emphasis role="strong">Revise el resultado de <literal>build-image</literal></emphasis>: el mensaje de error que aparece en el panel de control suele ser muy explicativo.
ja: <emphasis role="strong"><literal>build-image</literal>出力の確認</emphasis>: コンソール出力のエラーメッセージは通常、非常にわかりやすいものです。
pt_br: <emphasis role="strong">Revise a saída de <literal>build-image</literal></emphasis>: a mensagem de erro na saída do console costuma ser muito clara.
zh_cn: <emphasis role="strong">查看 <literal>build-image</literal> 输出</emphasis>：控制台输出中的错误消息通常具有明确指示性。

source: <emphasis role="strong">Check build environment</emphasis>: Ensure all prerequisites for Kiwi itself (for example, docker/podman, SElinux, sufficient disk space) are met on the machine running Kiwi.
es: <emphasis role="strong">Compruebe el entorno de creación</emphasis>: asegúrese de que se cumplen todos los requisitos previos para Kiwi (por ejemplo, docker/podman, SElinux, espacio suficiente en disco) en el equipo donde se ejecuta.
ja: <emphasis role="strong">構築環境の確認</emphasis>: Kiwiを実行しているマシンでKiwi自体のすべての前提条件( docker/podman、SElinux, 十分なディスク容量など)が満たされていることを確認します。
pt_br: <emphasis role="strong">Verifique o ambiente do build</emphasis>: garanta que todos os pré-requisitos para o próprio Kiwi (por exemplo, docker/podman, SElinux, espaço em disco suficiente) sejam atendidos na máquina que executa o Kiwi.
zh_cn: <emphasis role="strong">检查构建环境</emphasis>：确保运行 Kiwi 的计算机满足 Kiwi 本身的所有先决条件（例如，docker/podman、SELinux、充足的磁盘空间）。
