Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Adding in additional RPM’s via this method is meant for the addition of supported third party components or user-supplied (and maintained) packages; this mechanism should not be used to add packages that would not usually be supported on SUSE Linux Micro. If this mechanism is used to add components from openSUSE repositories (which are not supported), including from newer releases or service packs, you may end up with an unsupported configuration, especially when dependency resolution results in core parts of the operating system being replaced, even though the resulting system may appear to function as expected. If you’re unsure, contact your SUSE representative for assistance in determining the supportability of your desired configuration.
es: La adición de paquetes RPM adicionales mediante este método permite añadir componentes de terceros compatibles o paquetes proporcionados (y mantenidos) por el usuario. Este mecanismo no debe utilizarse para añadir paquetes que normalmente no serían compatibles con SUSE Linux Micro. Si se utiliza este mecanismo para añadir componentes de los repositorios de openSUSE (que no son compatibles), incluidos los de versiones más recientes o paquetes de servicio, es posible que se obtenga una configuración no compatible, especialmente si al resolver las dependencias se sustituyen partes fundamentales del sistema operativo, aunque el sistema resultante parezca funcionar según lo esperado. Si no está seguro, póngase en contacto con su representante de SUSE para que le ayude a determinar la compatibilidad de la configuración que desea.
ja: この方法でRPMを追加することは、サポートされているサードパーティコンポーネント、またはユーザが提供(および保守)するパッケージを追加することを目的としています。このメカニズムは、通常ではSUSE Linux Microでサポートされないパッケージを追加する目的では使用しないでください。このメカニズムを使用して、openSUSEのリポジトリから新しいリリースやサービスパックなどのコンポーネントを追加した場合(この操作はサポートされません)、最終的にサポート対象外の設定になるおそれがあります。特に、依存関係の解決によってオペレーティングシステムのコア部分が置き換えられる場合は、作成されたシステムが期待どおりに機能しているように見えても注意が必要です。確信が持てない場合は、SUSEの担当者に連絡してサポートを依頼し、目的の設定がサポート可能かどうかを判断してください。
pt_br: A adição de outros RPMs por esse método tem como objetivo incluir componentes de terceiros compatíveis ou pacotes fornecidos (e mantidos) pelo usuário. Esse mecanismo não deve ser usado para adicionar pacotes que não costumam ser suportados no SUSE Linux Micro. Se ele for usado para adicionar componentes de repositórios openSUSE (que não são suportados), inclusive de versões ou pacotes de serviço mais recentes, você poderá acabar com um configuração sem suporte, principalmente quando a resolução de dependência resulta na substituição de partes importantes do sistema operacional, mesmo que o sistema resultante pareça funcionar conforme o esperado. Se você tiver qualquer dúvida, entre em contato com seu representante SUSE para obter ajuda para determinar se a configuração desejada é suportada.
zh_cn: 通过此方法添加其他 RPM 的目的是添加受支持的第三方组件或用户提供（和维护）的软件包；请不要使用此机制来添加通常不受 SUSE Linux Micro 支持的软件包。如果使用此机制从 openSUSE 储存库（不受支持）添加组件，包括来自更新版本或服务包的组件，可能会导致配置不受支持 - 尤其是当依赖项解析导致操作系统核心部分被替换时，即便最终系统看似能正常运行，也可能存在问题。如有不确定之处，请联系 SUSE 代表，以协助确定您所需配置的可支持性。

source: A more comprehensive guide with additional examples can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">upstream installing packages guide</link>.
es: Encontrará una guía más completa con ejemplos adicionales en la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">guía original sobre instalación de paquetes</link>.
ja: 追加の例を含む総合的なガイドについては、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">アップストリームのパッケージインストールガイド</link>を参照してください。
zh_cn: 在<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">上游安装软件包指南</link>中可以找到更详细的指南和更多示例。

source: Configuring Kubernetes cluster and user workloads
es: Configuración del clúster de Kubernetes y las cargas de trabajo de los usuarios
ja: Kubernetesクラスタとユーザワークロードの設定
pt_br: Configurando o cluster Kubernetes e as cargas de trabalho dos usuários
zh_cn: 配置 Kubernetes 群集和用户工作负载

source: Another feature of EIB is the ability to use it to automate the deployment of both single-node and multi-node highly-available Kubernetes clusters that "bootstrap in place" (i.e. don’t require any form of centralized management infrastructure to coordinate). The primary driver behind this approach is for air-gapped deployments, or network restricted environments, but it also serves as a way of quickly bootstrapping standalone clusters, even if full and unrestricted network access is available.
es: Otra característica de EIB es la posibilidad de utilizarlo para automatizar el despliegue de clústeres de Kubernetes de alta disponibilidad, tanto de un solo nodo como de varios nodos, que se "arrancan en el lugar" (es decir, que no requieren infraestructura de gestión centralizada para coordinarse). Este enfoque está pensado principalmente para despliegues en entornos aislados o con restricciones de red, pero también sirve como una forma de arrancar rápidamente clústeres independientes, incluso si se dispone de acceso completo y sin restricciones a la red.
ja: EIBのもう1つの特徴は、EIBを使用すると、「インプレースでブートストラップ」する(つまり調整のためにどのような形態の集中管理インフラストラクチャも必要としない)シングルノードとマルチノード両方の高可用性Kubernetesクラスタのデプロイメントを自動化できることです。このアプローチは主にエアギャップデプロイメント、すなわちネットワークが制限された環境のためのものですが、ネットワークに制限なく完全にアクセスできる場合であっても、スタンドアロンクラスタを迅速にブートストラップする方法として役立ちます。
pt_br: Outro recurso do EIB é a capacidade de usá-lo para automatizar a implantação de clusters Kubernetes altamente disponíveis, tanto de nó único quanto de vários nós, que são "inicializados no local" (ou seja, não exigem a coordenação de nenhuma forma de infraestrutura de gerenciamento centralizado). O principal motivador dessa abordagem são as implantações air-gapped, ou ambientes de rede restrita, mas ela também é útil para inicializar rapidamente clusters independentes, mesmo com acesso à rede total e irrestrito disponível.
zh_cn: EIB 的另一个特点是，可以使用它来自动部署可“就地引导”（即不需要任何形式的集中式管理基础架构来进行协调）的单节点和多节点高可用性 Kubernetes 群集。这种方式的主要应用场景是隔离式部署或网络受限环境，但即便在可完全无限制访问网络的情况下，它也可用于快速引导独立群集。

source: This method enables not only the deployment of the customized operating system, but also the ability to specify Kubernetes configuration, any additional layered components via Helm charts, and any user workloads via supplied Kubernetes manifests. However, the design principle behind using this method is that we default to assuming that the user is wanting to air-gap. Therefore, any items specified in the image definition will be pulled into the image, which includes user-supplied workloads. EIB ensures that any discovered images that are required by definitions are copied locally and are served by the embedded image registry in the resulting deployed system.
es: Este método permite no solo desplegar el sistema operativo personalizado, sino también especificar la configuración de Kubernetes, cualquier componente adicional en capas a través de charts de Helm y cualquier carga de trabajo del usuario mediante los manifiestos de Kubernetes proporcionados. Sin embargo, el principio de diseño detrás del uso de este método es que, por defecto, se presupone que el usuario desea un entorno aislado. Por lo tanto, cualquier elemento especificado en la definición de la imagen se incorporará a la imagen, lo que incluye las cargas de trabajo proporcionadas por el usuario. EIB garantiza que todas las imágenes descubiertas que sean necesarias según las definiciones se copien localmente y que el registro de imágenes integrado las proporcione en el sistema desplegado resultante.
ja: この方法を使用すると、カスタマイズされたオペレーティングシステムをデプロイできるだけでなく、Kubernetesの設定を指定したり、Helmチャートを介して追加の階層化コンポーネントを指定したり、指定したKubernetesマニフェストを介してユーザワークロードを指定したりすることもできます。ただしこの方法を使用する場合、その背景にある設計理念として、ユーザがエアギャップ化を望んでいるとデフォルトで想定します。したがって、イメージ定義で指定されているすべての項目を、ユーザが指定したワークロードを含めてイメージにプルします。その際に、EIBは、定義で要求されている検出済みイメージをすべてローカルにコピーし、作成されたデプロイ済みシステムの組み込みのイメージレジストリで提供します。
zh_cn: 此方法不仅支持部署自定义操作系统，还能够指定 Kubernetes 配置、通过 Helm chart 添加任何额外的分层组件，以及通过提供的 Kubernetes 清单文件部署任何用户工作负载。不过，此方法的设计原则默认假设用户需要在隔离式环境下操作。因此，映像定义中指定的所有项目（包括用户提供的工作负载）都将被纳入映像。EIB 会确保将定义所需的所有已发现映像复制到本地，并由最终部署的系统中的嵌入式映像仓库提供服务。

source: In this next example, we’re going to take our existing image definition and will specify a Kubernetes configuration (in this example it doesn’t list the systems and their roles, so we default to assuming single-node), which will instruct EIB to provision a single-node RKE2 Kubernetes cluster. To show the automation of both the deployment of both user-supplied workloads (via manifest) and layered components (via Helm), we are going to install KubeVirt via the SUSE Edge Helm chart, as well as NGINX via a Kubernetes manifest. The additional configuration we need to append to the existing image definition is as follows:
es: En el siguiente ejemplo, vamos a utilizar nuestra definición de imagen existente y especificaremos una configuración de Kubernetes (no se muestra una lista de los sistemas y sus funciones, por lo que entenderemos por defecto que se trata de un solo nodo). Se indicará a EIB que aprovisione un clúster RKE2 Kubernetes de un solo nodo. Para mostrar la automatización tanto del despliegue de las cargas de trabajo proporcionadas por el usuario (a través del manifiesto) como de los componentes en capas (a través de Helm), vamos a instalar KubeVirt a través del chart de Helm de SUSE Edge, así como NGINX a través de un manifiesto de Kubernetes. La configuración adicional que debemos añadir a la definición de imagen existente es la siguiente:
ja: 次の例では、既存のイメージ定義を使用してKubernetesの設定を指定します(この例では、複数のシステムとその役割が一覧にされていないため、デフォルトでシングルノードを想定します)。この設定により、シングルノードのRKE2 KubernetesクラスタをプロビジョニングするようにEIBに指示します。ユーザが指定したワークロード(マニフェストを使用)と階層化コンポーネント(Helmを使用)の両方のデプロイメントの自動化を説明するために、SUSE EdgeのHelmチャートを使用してKubeVirtをインストールし、Kubernetesマニフェストを使用してNGINXをインストールします。既存のイメージ定義に追加する必要がある設定は次のとおりです。
pt_br: Neste exemplo, vamos usar nossa definição de imagem existente e especificar uma configuração do Kubernetes (não há uma lista dos sistemas e suas funções, portanto, vamos considerar um nó único), que vai instruir o EIB a provisionar um cluster Kubernetes RKE2 de nó único. Para mostrar a automação da implantação das cargas de trabalho fornecidas pelo usuário (por manifesto) e dos componentes em camadas (por Helm), vamos instalar o KubeVirt por meio do gráfico Helm do SUSE Edge e o NGINX por meio de um manifesto do Kubernetes. A configuração adicional que precisamos para anexar a definição da imagem existente é:
zh_cn: 在下一个示例中，我们将采用现有的映像定义并指定 Kubernetes 配置（在本示例中，未列出系统及其角色，因此我们默认假设使用单节点群集），这会指示 EIB 置备单节点 RKE2 Kubernetes 群集。为了展示用户提供的工作负载（通过清单）和分层组件（通过 Helm）部署的自动化，我们将通过 SUSE Edge Helm chart 安装 KubeVirt，并通过 Kubernetes 清单安装 NGINX。需要追加到现有映像定义的附加配置如下：

source: The resulting full definition file should now look like:
es: El archivo de definición completo resultante debería tener ahora este aspecto:
ja: 作成された完全な定義ファイルは次のようになります。
pt_br: O arquivo de definição completo resultante agora tem esta aparência:
zh_cn: 最终的完整定义文件现在应如下所示：

source: Further examples of options such as multi-node deployments, custom networking, and Helm chart options/values can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">upstream documentation</link>.
es: Encontrará más ejemplos como despliegues de varios nodos, redes personalizadas y opciones/valores de charts de Helm en la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">documentación original</link>.
ja: マルチノードデプロイメント、カスタムネットワーキング、Helmチャートのオプション/値など、オプションの他の例については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">アップストリームドキュメント</link>を参照してください。
zh_cn: 有关多节点部署、自定义网络和 Helm chart 选项/值等更多选项示例，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">上游文档</link>。

source: Configuring the network
es: Configuración de la red
ja: ネットワークの設定
pt_br: Configurando a rede
zh_cn: 配置网络

source: In the last example in this quickstart, let’s configure the network that will be brought up when a system is provisioned with the image generated by EIB. It’s important to understand that unless a network configuration is supplied, the default model is that DHCP will be used on all interfaces discovered at boot time. However, this is not always a desirable configuration, especially if DHCP is not available and you need to provide static configurations, or you need to set up more complex networking constructs, e.g. bonds, LACP, and VLAN’s, or need to override certain parameters, e.g. hostnames, DNS servers, and routes.
es: En el último ejemplo de esta guía rápida, vamos a configurar la red que se activará cuando se aprovisione un sistema con la imagen generada por EIB. Es importante comprender que, a menos que se proporcione una configuración de red, el modelo predeterminado es que se utilizará DHCP en todas las interfaces detectadas en el momento del arranque. Sin embargo, no siempre se trata de la configuración deseable, especialmente si DHCP no está disponible y es necesario proporcionar configuraciones estáticas, o si es necesario configurar estructuras de red más complejas (por ejemplo, enlaces, LACP y VLAN) o si hay que anular ciertos parámetros (por ejemplo, nombres de host, servidores DNS y rutas).
ja: このクイックスタートの最後の例では、EIBで生成したイメージを使ってシステムをプロビジョニングした場合に作成されるネットワークを設定しましょう。ネットワーク設定を指定しない限り、ブート時に検出されたすべてのインタフェースでDHCPが使用されるのがデフォルトのモデルであることを理解することが重要です。ただし、これが常に望ましい設定であるとは限りません。これは特に、DHCPが利用できず静的な設定を指定する必要がある場合や、より複雑なネットワーキング構造(ボンド、LACP、VLANなど)を設定する必要がある場合、特定のパラメータ(ホスト名、DNSサーバ、ルートなど)を上書きする必要がある場合に該当します。
pt_br: No último exemplo deste início rápido, vamos configurar a rede que será criada quando um sistema for provisionado com a imagem gerada pelo EIB. É importante entender que, exceto se uma configuração de rede for especificada, o DHCP usará o modelo padrão em todas as interfaces descobertas no momento da inicialização. No entanto, ela nem sempre é a configuração desejada, principalmente se o DHCP não estiver disponível e você precisar fazer configurações estáticas, configurar estruturas de rede mais complexas, como vínculos, LACP e VLANs, ou substituir determinados parâmetros, por exemplo, nomes de host, servidores DNS e rotas.
zh_cn: 在本快速入门的最后一个示例中，我们来配置在使用 EIB 生成的映像置备系统时启动的网络。请务必知道，除非提供网络配置，否则默认模式是在引导时对所有发现的接口使用 DHCP。但这并非在所有情况下都是理想配置，尤其是在 DHCP 不可用而需要提供静态配置时，或者需要设置更复杂的网络结构（例如绑定、LACP 和 VLAN）时，又或者需要覆盖某些参数（例如主机名、DNS 服务器和路由）时。

source: EIB provides the ability to provide either per-node configurations (where the system in question is uniquely identified by its MAC address), or an override for supplying an identical configuration to each machine, which is more useful when the system MAC addresses aren’t known. An additional tool is used by EIB called Network Manager Configurator, or <literal>nmc</literal> for short, which is a tool built by the SUSE Edge team to allow custom networking configurations to be applied based on the <link xl:href="https://nmstate.io/">nmstate.io</link> declarative network schema, and at boot time will identify the node it’s booting on and will apply the desired network configuration prior to any services coming up.
es: EIB ofrece la posibilidad de proporcionar configuraciones por nodo (donde el sistema en cuestión se identifica de forma única por su dirección MAC) o de sustituir la existente y proporcionar una configuración idéntica a cada equipo, lo que resulta más útil cuando se desconocen las direcciones MAC del sistema. EIB utiliza una herramienta adicional llamada Network Manager Configurator, o <literal>nmc</literal> para abreviar, que es una herramienta creada por el equipo de SUSE Edge para permitir la aplicación de configuraciones de red personalizadas basadas en el esquema de red declarativo <link xl:href="https://nmstate.io/">nmstate.io</link>, y que en el momento del arranque identificará el nodo en el que se está iniciando y aplicará la configuración de red deseada antes de que se inicien los servicios.
ja: EIBでは、ノードごとの設定を指定することも(対象のシステムをMACアドレスで一意に識別します)、上書きによって各マシンに同一の設定を指定することもできます(システムのMACアドレスが不明な場合に便利です)。またEIBでは、Network Manager Configurator (<literal>nmc</literal>)というツールも追加で使用されます。Network Manager ConfiguratorはSUSE Edgeチームによって構築されたツールであり、<link xl:href="https://nmstate.io/">nmstate.io</link>の宣言型ネットワークスキーマに基づいてカスタムネットワーキング設定を適用できるようにします。また、ブートしているノードをブート時に識別し、必要なネットワーク設定をサービス開始前に適用します。
pt_br: O EIB permite fazer configurações por nó (em que o sistema em questão é identificado exclusivamente por seu endereço MAC) ou uma substituição para especificar uma configuração idêntica para cada máquina, o que é mais útil quando não se sabe os endereços MAC do sistema. O EIB usa uma ferramenta adicional chamada Network Manager Configurator, ou <literal>nmc</literal> na forma abreviada, que foi desenvolvida pela equipe do SUSE Edge para que a configuração de rede personalizada seja aplicada com base no esquema de rede declarativo <link xl:href="https://nmstate.io/">nmstate.io</link> e, no momento da inicialização, identificará o nó em que está sendo inicializado e aplicará a configuração de rede desejada antes da ativação de quaisquer serviços.
zh_cn: EIB 能够提供每个节点的配置（其中的相关系统由其 MAC 地址唯一标识），或者为每台计算机提供相同配置的覆盖值，这在系统 MAC 地址未知时更有用。EIB 使用一个称为 Network Manager Configurator（简称为 <literal>nmc</literal>）的附加工具，这是 SUSE Edge 团队构建的工具，用于基于 <link xl:href="https://nmstate.io/">nmstate.io</link> 声明式网络纲要应用自定义网络配置，在引导时识别其正在引导的节点，并在任何服务启动之前应用所需的网络配置。

source: We’ll now apply a static network configuration for a system with a single interface by describing the desired network state in a node-specific file (based on the desired hostname) in the required <literal>network</literal> directory:
es: Ahora aplicaremos una configuración de red estática para un sistema con una única interfaz describiendo el estado de red deseado en un archivo específico del nodo (basado en el nombre de host deseado) en el directorio <literal>network</literal> requerido:
ja: ここでは、1つのインタフェースを持つシステムに静的ネットワーク設定を適用します。そのために、ネットワークの望ましい状態を、必要な<literal>network</literal>ディレクトリ内にある(目的のホスト名に基づく)ノード固有のファイルに記述します。
pt_br: Agora vamos aplicar uma configuração de rede estática a um sistema com uma interface única descrevendo o estado desejado da rede em um arquivo específico do nó (com base no nome de host desejado) no diretório <literal>network</literal> exigido:
zh_cn: 我们现在通过在所需 <literal>network</literal> 目录中特定于节点的文件中（基于所需主机名）描述期望的网络状态，为使用单一接口的系统应用静态网络配置：

source: The above example is set up for the default <literal>192.168.122.0/24</literal> subnet assuming that testing is being executed on a virtual machine, please adapt to suit your environment, not forgetting the MAC address. As the same image can be used to provision multiple nodes, networking configured by EIB (via <literal>nmc</literal>) is dependent on it being able to uniquely identify the node by its MAC address, and hence during boot <literal>nmc</literal> will apply the correct networking configuration to each machine. This means that you’ll need to know the MAC addresses of the systems you want to install onto. Alternatively, the default behavior is to rely on DHCP, but you can utilize the <literal>configure-network.sh</literal> hook to apply a common configuration to all nodes - see the networking guide (<xref linkend="components-nmc"/>) for further details.
es: El ejemplo anterior está configurado para la subred predeterminada <literal>192.168.122.0/24</literal>, suponiendo que la prueba se ejecuta en una máquina virtual. Adáptelo a su entorno, sin olvidar la dirección MAC. Dado que se puede utilizar la misma imagen para aprovisionar varios nodos, la configuración de red realizada por EIB (a través de <literal>nmc</literal>) depende de que pueda identificar de forma única el nodo por su dirección MAC y, por lo tanto, durante el arranque, <literal>nmc</literal> aplicará la configuración de red correcta a cada equipo. Esto significa que deberá conocer las direcciones MAC de los sistemas en los que desea realizar la instalación. Alternativamente, el comportamiento predeterminado es confiar en DHCP, pero puede utilizar el gancho <literal>configure-network.sh</literal> para aplicar una configuración común a todos los nodos. Consulte la guía sobre conexión de redes (<xref linkend="components-nmc"/>) para obtener más detalles.
ja: 上記の例は、テストを仮想マシン上で実行すると仮定して、デフォルトの<literal>192.168.122.0/24</literal>サブネット用に設定されています。ご使用の環境に合わせて、MACアドレスも忘れずに変更してください。同じイメージを使用して複数のノードをプロビジョニングできるため、 EIBで(<literal>nmc</literal>を介して)設定されたネットワーキングは、各ノードをMACアドレスで一意に識別できるかどうかに依存しており、その後、ブート中に<literal>nmc</literal>は正しいネットワーキング設定を各マシンに適用します。つまり、インストール先のシステムのMACアドレスを把握する必要があります。また、デフォルトの動作ではDHCPに依存しますが、<literal>configure-network.sh</literal>フックを利用して、すべてのノードに共通の設定を適用することもできます。詳細については、ネットワーキングのガイド(<xref linkend="components-nmc"/>)を参照してください。
pt_br: O exemplo acima foi configurado para a sub-rede padrão <literal>192.168.122.0/24</literal> considerando que o teste é executado em uma máquina virtual. Adapte-o de acordo com o seu ambiente, lembrando do endereço MAC. Como é possível usar a mesma imagem para provisionar vários nós, a rede configurada pelo EIB (via <literal>nmc</literal>) depende da capacidade de identificar exclusivamente o nó por seu endereço MAC. Como resultado, durante a inicialização, o <literal>nmc</literal> aplicará a configuração de rede correta a cada máquina. Isso significa que você precisa saber os endereços MAC dos sistemas nos quais deseja instalar. Como alternativa, o comportamento padrão é confiar no DHCP, mas você pode usar o gancho <literal>configure-network.sh</literal> para aplicar uma configuração comum a todos os nós. Consulte o guia de rede (<xref linkend="components-nmc"/>) para obter mais detalhes.
zh_cn: 上述示例是针对默认 <literal>192.168.122.0/24</literal> 子网设置的，假设测试在虚拟机上执行，请根据您的环境进行调整，不要忘记设置 MAC 地址。由于可以使用同一映像来置备多个节点，EIB（通过 <literal>nmc</literal>）配置的网络取决于它是否能够根据节点 MAC 地址唯一标识节点，因此在引导期间 <literal>nmc</literal> 将向每台计算机应用正确的网络配置。这意味着，您需要知道所要安装到的系统的 MAC 地址。或者，默认行为是依赖 DHCP，但您可以利用 <literal>configure-network.sh</literal> 钩子将通用配置应用于所有节点 - 有关详细信息，请参见网络指南（<xref linkend="components-nmc"/>）。

source: The resulting file structure should look like:
es: La estructura de archivo resultante tendrá este aspecto:
ja: 作成されるファイル構造は、次のようになります。
pt_br: A estrutura do arquivo resultante deverá ter esta aparência:
zh_cn: 最终的文件结构应如下所示：

source: The network configuration we just created will be parsed and the necessary NetworkManager connection files will be automatically generated and inserted into the new installation image that EIB will create. These files will be applied during the provisioning of the host, resulting in a complete network configuration.
es: La configuración de red que acabamos de crear se analizará y los archivos de conexión de NetworkManager necesarios se generarán automáticamente y se insertarán en la nueva imagen de instalación que creará EIB. Estos archivos se aplicarán durante el aprovisionamiento del host, lo que dará como resultado una configuración de red completa.
ja: 作成したネットワーク設定が解析され、必要なNetworkManager接続ファイルが自動的に生成されて、EIBが作成する新しいインストールイメージに挿入されます。これらのファイルはホストのプロビジョニング中に適用され、完全なネットワーク設定が生成されます。
pt_br: A configuração de rede que acabamos de criar será analisada, e os arquivos de conexão necessários do NetworkManager serão automaticamente gerados e inseridos na nova imagem de instalação que o EIB criará. Esses arquivos serão aplicados durante o provisionamento do host, resultando na configuração de rede completa.
zh_cn: 我们刚刚创建的网络配置将被分析，必要的 NetworkManager 连接文件将自动生成并插入到 EIB 要创建的新安装映像中。这些文件将在主机置备期间应用，从而生成完整的网络配置。
