Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: If these entries are not present, the detection might have failed. This could be due to the machine or the Kubernetes services not being restarted. Add these manually as above, if required.
es: Si estas entradas no están presentes, es posible que la detección haya fallado. Podría deberse a que el equipo o los servicios de Kubernetes no se han reiniciado. Si es necesario, añádalos manualmente como se indica anteriormente.
ja: これらのエントリが存在しない場合は、検出が失敗している可能性があります。この原因として考えられるのは、マシンまたはKubernetesサービスを再起動していないことです。必要に応じて、上記のようにこれらを手動で追加してください。
pt_br: Se estas entradas não estiverem presentes, talvez a detecção tenha falhado. O motivo pode ser a máquina ou os serviços do Kubernetes que não foram reiniciados. Se necessário, adicione-os manualmente conforme explicado acima.
zh_cn: 如果未显示这些项，则可能表示检测失败。原因可能是计算机或 Kubernetes 服务未重启。如果需要，请如前文所述手动添加这些项。

source: Next, we need to configure the NVIDIA <literal>RuntimeClass</literal> as an additional Kubernetes runtime to the default, ensuring that any user requests for pods that need access to the GPU can use the NVIDIA Container Toolkit to do so, via the <literal>nvidia-container-runtime</literal>, as configured in the <literal>containerd</literal> configuration:
es: A continuación, debemos configurar <literal>RuntimeClass</literal> de NVIDIA como entorno de ejecución adicional al predeterminado de Kubernetes, lo que garantiza que cualquier solicitud de pods que haga el usuario y que necesite acceder a la GPU pueda utilizar NVIDIA Container Toolkit para hacerlo, a través de <literal>nvidia-container-runtime</literal>, tal y como se configura en <literal>containerd</literal>:
ja: 次に、NVIDIA <literal>RuntimeClass</literal>を追加のKubernetesランタイムとしてデフォルト値に設定する必要があります。これにより、GPUへのアクセスが必要なPodに対するユーザ要求が、 <literal>containerd</literal>の設定に従って、NVIDIA Container Toolkitを使用して<literal>nvidia-container-runtime</literal>を介してアクセスできるようにします。
pt_br: Depois disso, precisamos configurar o <literal>RuntimeClass</literal> NVIDIA como runtime do Kubernetes adicional ao padrão, garantindo que as solicitações dos usuários para pods que precisam de acesso à GPU possam usar o NVIDIA Container Toolkit para fazer isso, por meio do comando <literal>nvidia-container-runtime</literal>, conforme definido na configuração de <literal>containerd</literal>:
zh_cn: 接下来，我们需要将作为附加 Kubernetes 运行时的 NVIDIA <literal>RuntimeClass</literal> 配置为默认设置，以确保需要访问 GPU 的任何用户 Pod 请求都可以按照 <literal>containerd</literal> 配置中指定的方式，使用 NVIDIA Container Toolkit 通过 <literal>nvidia-container-runtime</literal> 进行这种访问：

source: The next step is to configure the <link xl:href="https://github.com/NVIDIA/k8s-device-plugin">NVIDIA Device Plugin</link>, which configures Kubernetes to leverage the NVIDIA GPUs as resources within the cluster that can be used, working in combination with the NVIDIA Container Toolkit. This tool initially detects all capabilities on the underlying host, including GPUs, drivers and other capabilities (such as GL) and then allows you to request GPU resources and consume them as part of your applications.
es: El siguiente paso es configurar el <link xl:href="https://github.com/NVIDIA/k8s-device-plugin">complemento de dispositivos de NVIDIA</link>. Este complemento configura Kubernetes para aprovechar las GPU NVIDIA como recursos que se pueden utilizar dentro del clúster, en combinación con NVIDIA Container Toolkit. Esta herramienta detecta inicialmente todas las capacidades del host subyacente, incluidas las GPU, los controladores y otras (como GL) y, luego, permite solicitar recursos de GPU y consumirlos como parte de sus aplicaciones.
ja: 次の手順は、<link xl:href="https://github.com/NVIDIA/k8s-device-plugin">NVIDIA Device Plugin</link>を設定することです。これにより、NVIDIA Container Toolkitと連携して、クラスタ内で使用可能なリソースとしてNVIDIA GPUを利用するようにKubernetesを設定します。このツールはまず、基盤となるホスト上のすべての機能(GPU、ドライバ、その他の機能(GLなど)を含む)を検出し、その後、ユーザがGPUリソースを要求してアプリケーションの一部として使用できるようにします。
pt_br: A próxima etapa é configurar o <link xl:href="https://github.com/NVIDIA/k8s-device-plugin">plug-in de dispositivo NVIDIA</link>, que configura o Kubernetes para aproveitar as GPUs NVIDIA como recursos no cluster que pode ser usado, trabalhando em conjunto com o NVIDIA Container Toolkit. Inicialmente, essa ferramenta detecta todos os recursos no host subjacente, incluindo GPUs, drivers e outros (como GL), e permite solicitar recursos para a GPU e consumi-los como parte dos seus aplicativos.
zh_cn: 下一步是配置 <link xl:href="https://github.com/NVIDIA/k8s-device-plugin">NVIDIA Device Plugin</link>，该插件会将 Kubernetes 配置为利用 NVIDIA GPU 作为群集中可用的资源，并与 NVIDIA Container Toolkit 配合工作。此工具最初会检测底层主机上的所有功能，包括 GPU、驱动程序和其他功能（例如 GL），然后允许您请求 GPU 资源并将其用作应用程序的一部分。

source: First, you need to add and update the Helm repository for the NVIDIA Device Plugin:
es: Primero, debe añadir y actualizar el repositorio de Helm para el complemento de dispositivos de NVIDIA:
ja: まず、NVIDIA Device Plugin用のHelmリポジトリを追加して更新する必要があります。
pt_br: Primeiro, você precisa adicionar e atualizar o repositório Helm para o plug-in de dispositivo NVIDIA:
zh_cn: 首先，需要添加并更新 NVIDIA Device Plugin 的 Helm 储存库：

source: Now you can install the NVIDIA Device Plugin:
es: Ahora puede instalar el complemento de dispositivos de NVIDIA:
ja: これで、NVIDIA Device Pluginをインストールできます。
pt_br: Agora você pode instalar o plug-in de dispositivo NVIDIA:
zh_cn: 现在可以安装 NVIDIA Device Plugin：

source: After a few minutes, you see a new pod running that will complete the detection on your available nodes and tag them with the number of GPUs that have been detected:
es: Después de unos minutos, verá un nuevo pod en ejecución que completará la detección en los nodos disponibles y los etiquetará con el número de GPU que se han detectado:
ja: 数分後、新しいPodが実行されているのがわかります。これで、利用可能なノード上での検出は完了し、検出されたGPUの数を示すタグがノードに付けられます。
pt_br: Após alguns minutos, você verá um novo pod em execução que concluirá a detecção em seus nós disponíveis e os marcará com o número de GPUs que foram detectadas:
zh_cn: 几分钟后，您会看到一个新的 Pod 正在运行，它将在可用节点上完成检测，并根据检测到的 GPU 数量来标记节点：

source: Now you are ready to create an NVIDIA pod that attempts to use this GPU. Let us try with the CUDA Benchmark container:
es: Ahora ya está listo para crear un pod de NVIDIA que intentará utilizar esta GPU. Probemos con el contenedor CUDA Benchmark:
ja: これで、このGPUを使用するNVIDIA Podを作成する準備ができました。CUDA Benchmarkコンテナで試してみましょう。
pt_br: Agora você está pronto para criar um pod NVIDIA que tenta usar essa GPU. Vamos tentar com o contêiner de benchmark CUDA:
zh_cn: 现在，可以创建一个 NVIDIA Pod 来尝试使用此 GPU。我们来尝试在 CUDA 基准容器上执行此操作：

source: If all went well, you can look at the logs and see the benchmark information:
es: Si todo ha ido bien, puede consultar los registros y ver la información del benchmark:
ja: すべて問題なければ、ログを見て、ベンチマーク情報を確認できます。
pt_br: Se tudo correu bem, você pode consultar os registros para ver as informações de benchmark:
zh_cn: 如果一切顺利，您可以在日志中看到基准测试信息：

source: Finally, if your applications require OpenGL, you can install the required NVIDIA OpenGL libraries at the host level, and the NVIDIA Device Plugin and NVIDIA Container Toolkit can make them available to containers. To do this, install the package as follows:
es: Por último, si sus aplicaciones requieren OpenGL, puede instalar las bibliotecas de OpenGL de NVIDIA necesarias en el nivel del host. El complemento de dispositivos de NVIDIA y NVIDIA Container Toolkit las pondrán a disposición de los contenedores. Para ello, instale el paquete de la siguiente manera:
ja: 最後に、アプリケーションでOpenGLが必要な場合は、必要なNVIDIA OpenGLライブラリをホストレベルでインストールし、NVIDIA Device PluginとNVIDIA Container Toolkitを使用してそのライブラリをコンテナで利用できるようにすることができます。これを行うには、次のようにパッケージをインストールします。
pt_br: Por fim, se os seus aplicativos exigem OpenGL, instale as bibliotecas OpenGL da NVIDIA necessárias no nível do host; e o plug-in de dispositivo NVIDIA e o NVIDIA Container Toolkit podem torná-las disponíveis aos contêineres. Para isso, instale o pacote da seguinte maneira:
zh_cn: 最后，如果您的应用程序需要 OpenGL，您可以在主机级别安装所需的 NVIDIA OpenGL 库，NVIDIA Device Plugin 和 NVIDIA Container Toolkit 可将这些库提供给容器。为此，请如下所示安装软件包：

source: You need to reboot to make this package available to your applications. The NVIDIA Device Plugin should automatically redetect this via the NVIDIA Container Toolkit.
es: Debe rearrancar el sistema para que este paquete esté disponible para sus aplicaciones. El complemento de dispositivos de NVIDIA debería volver a detectarlo automáticamente mediante NVIDIA Container Toolkit.
ja: このパッケージをアプリケーションで使用できるようにするには再起動が必要です。NVIDIA Device Pluginは、NVIDIA Container Toolkitを介してこれを自動的に再検出します。
pt_br: Você precisa reinicializar para disponibilizar esse pacote aos seus aplicativos. O plug-in de dispositivo NVIDIA deve fazer essa nova detecção automaticamente por meio do NVIDIA Container Toolkit.
zh_cn: 需要重引导系统才能将此软件包提供给应用程序。NVIDIA Device Plugin 会通过 NVIDIA Container Toolkit 自动重新检测此软件包。

source: Bringing it together via Edge Image Builder
es: Unificación mediante Edge Image Builder
ja: Edge Image Builderを使用した統合
pt_br: Reunindo tudo com o Edge Image Builder
zh_cn: 通过 Edge Image Builder 整合配置

source: Okay, so you have demonstrated full functionality of your applications and GPUs on SUSE Linux Micro and you now want to use <xref linkend="components-eib"/> to provide it all together via a deployable/consumable ISO or RAW disk image. This guide does not explain how to use Edge Image Builder, but it provides the necessary configurations to build such image. Below you can find an example of an image definition, along with the necessary Kubernetes configuration files, to ensure that all the required components are deployed out of the box. Here is the directory structure of the Edge Image Builder directory for the example shown below:
es: Ya ha demostrado la plena funcionalidad de sus aplicaciones y GPU en SUSE Linux Micro y ahora desea utilizar <xref linkend="components-eib"/> para unificarlo todo en una imagen de disco ISO o RAW desplegable/consumible. Esta guía no explica cómo usar Edge Image Builder, pero proporciona las configuraciones necesarias para crear dicha imagen. A continuación encontrará un ejemplo de definición de imagen, junto con los archivos de configuración de Kubernetes necesarios, para garantizar que todos los componentes requeridos se desplieguen. Esta es la estructura de directorio de Edge Image Builder para el ejemplo que se muestra a continuación:
ja: さて、SUSE Linux Micro上のアプリケーションとGPUの全機能をデモで示したので、 <xref linkend="components-eib"/>を使用してすべてをまとめ、デプロイ可能/使用可能なISOまたはRAWディスクイメージで提供したいと思います。このガイドでは、Edge Image Builderの使用方法は説明せずに、このようなイメージを構築するために必要な設定について説明します。以下に、必要なすべてのコンポーネントを追加設定なしにデプロイするためのイメージ定義の例と、必要なKubernetes設定ファイルを示します。以下に示す例では、Edge Image Builderディレクトリは次のようなディレクトリ構造になっています。
pt_br: Você demonstrou a total funcionalidade dos aplicativos e das GPUs no SUSE Linux Micro e agora quer usar o <xref linkend="components-eib"/> para disponibilizar tudo em uma imagem de disco ISO ou RAW implantável/consumível. Este guia não explica como usar o Edge Image Builder, mas aborda as configurações necessárias para criar essa imagem. Veja a seguir um exemplo de definição de imagem, junto com os arquivos de configuração necessários do Kubernetes, para garantir que todos os componentes obrigatórios sejam implantados imediatamente. Esta é a estrutura de diretórios do Edge Image Builder para o exemplo apresentado abaixo:
zh_cn: 现在您已经在 SUSE Linux Micro 上验证了应用程序和 GPU 的完整功能，现在可能希望通过<xref linkend="components-eib"/>将所有配置整合到一个可部署/可使用的 ISO 或 RAW 磁盘映像。本指南不会介绍如何使用 Edge Image Builder，但提供了构建此类映像所需的配置。以下是一个映像定义示例以及必要的 Kubernetes 配置文件，确保所有必需组件都能在部署时默认安装到位。下面是该示例对应的 Edge Image Builder 目录结构：

source: Let us explore those files. First, here is a sample image definition for a single-node cluster running K3s that deploys the utilities and OpenGL packages, too (<literal>eib-config-iso.yaml</literal>):
es: Exploremos esos archivos. En primer lugar, hay una definición de imagen de muestra para un clúster de un solo nodo que ejecuta K3s y que despliega las utilidades y los paquetes OpenGL (<literal>eib-config-iso.yaml</literal>):
ja: これらのファイルを調べてみましょう。まず、K3sを実行するシングルノードクラスタのサンプルイメージ定義を次に示します。このイメージ定義では、ユーティリティとOpenGLパッケージもデプロイします(<literal>eib-config-iso.yaml</literal>)。
pt_br: Vamos explorar esses arquivos. Primeiro, esta é uma definição da imagem de amostra para um cluster de nó único com o K3s e que também implanta os utilitários e os pacotes OpenGL (<literal>eib-config-iso.yaml</literal>):
zh_cn: 我们来浏览这些文件。首先，这是一个运行 K3s 的单节点群集的示例映像定义，它还会部署实用程序和 OpenGL 软件包 (<literal>eib-config-iso.yaml</literal>)：

source: This is just an example. You may need to customize it to fit your requirements and expectations. Additionally, if using SUSE Linux Micro, you need to provide your own <literal>sccRegistrationCode</literal> to resolve package dependencies and pull the NVIDIA drivers.
es: Esto es solo un ejemplo. Deberá personalizarlo según sus necesidades y expectativas. Además, si utiliza SUSE Linux Micro, debe proporcionar su propio código <literal>sccRegistrationCode</literal> para resolver las dependencias del paquete y conseguir los controladores de NVIDIA.
ja: これは単なる例です。要件や期待に合うようにカスタマイズする必要がある場合があります。また、SUSE Linux Microを使用する場合は、パッケージの依存関係を解決してNVIDIAドライバをプルするために、独自の <literal>sccRegistrationCode</literal>を指定する必要があります。
pt_br: Este é apenas um exemplo. Você pode precisar personalizá-lo de acordo com os seus requisitos e expectativas. Além disso, se você usa o SUSE Linux Micro, precisa inserir seu próprio <literal>sccRegistrationCode</literal> para resolver as dependências de pacotes e obter os drivers da NVIDIA.
zh_cn: 这只是一个示例。您可能需要根据自己的要求和期望对其进行自定义。此外，如果使用 SUSE Linux Micro，您需要提供自己的 <literal>sccRegistrationCode</literal> 来解析软件包依赖项并提取 NVIDIA 驱动程序。

source: Besides this, we need to add additional components, so they get loaded by Kubernetes at boot time. The EIB directory needs a <literal>kubernetes</literal> directory first, with subdirectories for the configuration, Helm chart values and any additional manifests required:
es: Además, debemos añadir componentes adicionales para que Kubernetes los cargue durante el arranque. El directorio de EIB necesita primero un directorio <literal>kubernetes</literal>, con subdirectorios para la configuración, los valores del chart de Helm y cualquier manifiesto adicional que sea necesario:
ja: これに加えて、他のコンポーネントを追加して、ブート時にKubernetesによってロードされるようにする必要があります。EIBディレクトリにはまず<literal>kubernetes</literal>ディレクトリが必要で、その下に設定、Helmチャート値、必要な追加のマニフェスト用のサブディレクトリが必要です。
pt_br: Além disso, precisamos adicionar outros componentes para que sejam carregados pelo Kubernetes no momento da inicialização. O diretório do EIB precisa primeiro de um diretório <literal>kubernetes</literal>, com os subdiretórios para configuração, os valores dos gráficos Helm e todos os manifestos adicionais necessários:
zh_cn: 除此之外，还需要添加其他组件，供 Kubernetes 在引导时加载。首先，EIB 目录需要一个 <literal>kubernetes</literal> 目录，其中包含用于保存配置、Helm chart 值和任何其他所需清单的子目录：

source: Let us now set up the (optional) Kubernetes configuration by choosing a CNI (which defaults to Cilium if unselected) and enabling SELinux:
es: Ahora vamos a configurar Kubernetes (opcional) eligiendo una CNI (por defecto es Cilium si no se selecciona ninguna) y habilitando SELinux:
ja: CNIを選択し(選択しない場合はデフォルトでCiliumになります)、SELinuxを有効にして、(オプションの)Kubernetes設定を行いましょう。
pt_br: Agora vamos definir a configuração (opcional) do Kubernetes escolhendo uma CNI (que assume o Cilium como padrão se nada for selecionado) e habilitando o SELinux:
zh_cn: 现在我们来通过选择 CNI（如果未选择，则默认为 Cilium）并启用 SELinux 来设置（可选的）Kubernetes 配置：

source: Now ensure that the NVIDIA RuntimeClass is created on the Kubernetes cluster:
es: Ahora, asegúrese de que se haya creado RuntimeClass de NVIDIA en el clúster de Kubernetes:
ja: 続いて、NVIDIA RuntimeClassがKubernetesクラスタ上に作成されていることを確認します。
pt_br: Agora garanta que o RuntimeClass NVIDIA tenha sido criado no cluster Kubernetes:
zh_cn: 现在确保在 Kubernetes 群集上创建 NVIDIA RuntimeClass：

source: We use the built-in Helm Controller to deploy the NVIDIA Device Plugin through Kubernetes itself. Let’s provide the runtime class in the values file for the chart:
es: Usamos la versión integrada de Helm Controller para desplegar el complemento de dispositivos de NVIDIA a través del propio Kubernetes. Proporcionemos la clase de tiempo de ejecución en el archivo de valores para el chart:
ja: ビルトインHelmコントローラを使用して、Kubernetes自体を使用してNVIDIA Device Pluginをデプロイします。チャートの値ファイルでランタイムクラスを指定しましょう。
pt_br: Usamos o Helm Controller incorporado para implantar o plug-in de dispositivo NVIDIA pelo próprio Kubernetes. Vamos inserir uma classe de runtime no arquivo de valores do gráfico:
zh_cn: 我们将使用内置的 Helm 控制器通过 Kubernetes 本身来部署 NVIDIA Device Plugin。我们需要在 chart 的值文件中提供运行时类：

source: We need to grab the NVIDIA Container Toolkit RPM public key before proceeding:
es: Antes de continuar, debemos obtener la clave pública del RPM de NVIDIA Container Toolkit:
ja: 次に進む前に、NVIDIA Container Toolkit RPMの公開鍵を取得する必要があります。
pt_br: Precisamos obter a chave pública do RPM do NVIDIA Container Toolkit antes de continuar:
zh_cn: 在继续之前，我们需要抓取 NVIDIA Container Toolkit RPM 公共密钥：

source: All the required artifacts, including Kubernetes binary, container images, Helm charts (and any referenced images), will be automatically air-gapped, meaning that the systems at deploy time should require no Internet connectivity by default. Now you need only to grab the SUSE Linux Micro ISO from the <link xl:href="https://www.suse.com/download/sle-micro/">SUSE Downloads Page</link> (and place it in the <literal>base-images</literal> directory), and you can call the Edge Image Builder tool to generate the ISO for you. To complete the example, here is the command that was used to build the image:
es: Todos los artefactos necesarios, incluidos el binario de Kubernetes, las imágenes de contenedores, los charts de Helm (y cualquier imagen referenciada), se aislarán automáticamente, lo que significa que, en el momento del despliegue, los sistemas no deberían requerir conexión a Internet de forma predeterminada. Ahora solo tiene que obtener la imagen ISO de SUSE Linux Micro de la <link xl:href="https://www.suse.com/download/sle-micro/">página de descargas de SUSE</link> (y colocarla en el directorio <literal>base-images</literal>). Puede generar la imagen ISO con Edge Image Builder. Para completar el ejemplo, este es el comando que se utilizó para crear la imagen:
ja: Kubernetesバイナリ、コンテナイメージ、Helmチャート(および参照イメージ)など、必要なアーティファクトがすべて自動的にエアギャップ化されます。つまり、デプロイ時のシステムにはデフォルトでインターネット接続は不要です。ここで必要なのは<link xl:href="https://www.suse.com/download/sle-micro/">SUSEダウンロードページ</link>からSUSE Linux Micro ISOを取得する(そしてそれを<literal>base-images</literal>ディレクトリに配置する)ことだけです。そうすれば、Edge Image Builderツールを呼び出してISOを生成できます。この例を完了するために、イメージの構築に使用したコマンドを次に示します。
pt_br: Todos os artefatos necessários, incluindo o binário do Kubernetes, as imagens do contêiner, os gráficos Helm (e todas as imagens referenciadas), serão automaticamente isolados. Isso significa que, por padrão, o sistema não deve exigir conectividade de Internet no momento da implantação. Agora você precisa apenas obter a ISO do SUSE Linux Micro da <link xl:href="https://www.suse.com/download/sle-micro/">página de downloads da SUSE</link> (e salvá-la no diretório <literal>base-images</literal>) e chamar a ferramenta Edge Image Builder para gerar a ISO para você. Para concluir o exemplo, este é o comando que foi usado para criar a imagem:
zh_cn: 所有必需的制品（包括 Kubernetes 二进制文件、容器映像、Helm chart（以及所有引用的映像））都会自动实现隔离处理，这意味着在部署时，系统默认不需要互联网连接。现在您只需从 <link xl:href="https://www.suse.com/download/sle-micro/">SUSE 下载页面</link>抓取 SUSE Linux Micro ISO（并将其放入 <literal>base-images</literal> 目录），然后调用 Edge Image Builder 工具即可生成 ISO。作为示例补充，以下是用于构建映像的命令：

source: For further instructions, please see the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">documentation</link> for Edge Image Builder.
es: Para obtener instrucciones, consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">documentación</link> de Edge Image Builder.
ja: Edge Image Builderの詳細については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">ドキュメント</link>を参照してください。
zh_cn: 有关更多说明，请参见 Edge Image Builder 的<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">文档</link>。

source: Resolving issues
es: Resolución de problemas
ja: 問題の解決
pt_br: Resolvendo problemas
zh_cn: 解决问题

source: nvidia-smi does not find the GPU
es: nvidia-smi no encuentra la GPU
ja: nvidia-smiでGPUが検出されない
pt_br: nvidia-smi não encontra a GPU
zh_cn: nvidia-smi 找不到 GPU

source: Check the kernel messages using <literal>dmesg</literal>. If this indicates that it cannot allocate <literal>NvKMSKapDevice</literal>, apply the unsupported GPU workaround:
es: Utilice <literal>dmesg</literal> para comprobar los mensajes del kernel. Si se indica que no es posible asignar <literal>NvKMSKapDevice</literal>, aplique la solución alternativa para las GPU no compatibles:
ja: <literal>dmesg</literal>を使用してカーネルメッセージを確認します。<literal>NvKMSKapDevice</literal>を割り当てることができないことを示している場合は、サポート対象外のGPUの回避策を適用します。
pt_br: Verifique as mensagens do kernel usando o <literal>dmesg</literal>. Se isso indicar que não é possível alocar o <literal>NvKMSKapDevice</literal>, adote a solução alternativa para a GPU sem suporte:
zh_cn: 使用 <literal>dmesg</literal> 检查内核消息。如果消息指出无法分配 <literal>NvKMSKapDevice</literal>，请采用“GPU 不受支持”临时解决方法：

source: <emphasis>NOTE</emphasis>: You will need to reload the kernel module, or reboot, if you change the kernel module configuration in the above step for it to take effect.
es: <emphasis>NOTA</emphasis>: para que los cambios surtan efecto, si cambia la configuración del módulo del kernel en el paso anterior, deberá volver a cargar el módulo del kernel o rearrancar el sistema.
ja: <emphasis>メモ</emphasis>: 上記の手順でカーネルモジュールの設定を変更した場合は、変更を有効にするために、カーネルモジュールを再ロードするか、再起動する必要があります。
pt_br: <emphasis>NOTA</emphasis>: Será necessário recarregar, ou reinicializar, o módulo do kernel se você alterar a configuração dele na etapa anterior para que as alterações entrem em vigor.
zh_cn: <emphasis>注意</emphasis>：如果您在上述步骤中更改了内核模块配置，则需要重新加载或重引导内核模块才能使更改生效。

source: Day 2 Operations
es: Operaciones de día 2
ja: Day 2操作
pt_br: Operações de dia 2
zh_cn: Day 2 操作

source: This section explains how administrators can handle different "Day Two" operation tasks both on the management and on the downstream clusters.
es: En esta sección se explica cómo los administradores pueden gestionar diferentes tareas operativas de "día dos" tanto en los clústeres de gestión como en los descendentes.
ja: このセクションでは、管理者がさまざまな「Day 2」操作タスクを管理クラスタとダウンストリームクラスタの両方で処理する方法について説明します。
pt_br: Esta seção explica como os administradores podem realizar as tarefas de operações de "dia 2" nos clusters de gerenciamento e downstream.
zh_cn: 本章介绍管理员如何在管理群集和下游群集上处理不同的“Day 2”操作任务。

source: Edge 3.4 migration
es: Migración a Edge 3.4
ja: Edge 3.4のマイグレーション
zh_cn: Edge 3.4 迁移

source: This section explains how to migrate your <literal>management</literal> and <literal>downstream</literal> clusters from <literal>Edge 3.3</literal> to <literal>Edge 3.4.0</literal>.
es: En esta sección se explica cómo migrar los clústeres de <literal>gestión</literal> y <literal>descendentes</literal> de <literal>Edge 3.3</literal> a <literal>Edge 3.4.0</literal>.
ja: このセクションでは、<literal>管理</literal>クラスタと<literal>ダウンストリーム</literal>クラスタを<literal>Edge 3.3</literal>から<literal>Edge 3.4.0</literal>に移行する方法について説明します。
zh_cn: 本章介绍如何将<literal>管理</literal>群集和<literal>下游</literal>群集从 <literal>Edge 3.3</literal> 迁移到 <literal>Edge 3.4.0</literal>。
