Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: After the node has fully installed, you will see its key listed as <literal>pending</literal> in the <literal>Salt/Keys</literal> section of SUSE Multi-Linux Manager. Once you have accepted the key, the node will automatically be onboarded to SUSE Multi-Liux Manager and show up in the <literal>Systems</literal> list after that process is finished. It will have the system group(s) assigned that you provided in the activation key.
es: Después de que los nodos se hayan instalado por completo, verá su clave como <literal>pendiente</literal> en la sección <literal>Salt/Keys</literal> de SUSE Multi-Linux Manager. Cuando haya aceptado la clave, el nodo se incorporará automáticamente a SUSE Multi-Liux Manager y se mostrará en la lista <literal>Sistemas</literal> después de que finalice el proceso. Tendrá asignados los grupos del sistema que haya proporcionado en la clave de activación.
ja: ノードのインストールが完了すると、SUSE Multi-Linux Managerの［<literal>Salt/キー</literal>］セクションにノードのキーが<literal>保留中</literal>として表示されます。キーを受け入れると、ノードはSUSE Multi-Linux Managerに自動的にオンボードされ、そのプロセスが完了すると［<literal>システム</literal>］リストに表示されます。ノードには、アクティベーションキーで指定したシステムグループが割り当てられます。
zh_cn: 节点完全安装后，您将在 SUSE Multi-Linux Manager 的 <literal>Salt/Keys</literal> 部分看到其密钥状态显示为 <literal>pending</literal>（待处理）。接受该密钥后，节点将自动加入 SUSE Multi-Linux Manager，并会在该过程完成后显示在 <literal>Systems</literal>（系统）列表中。它将被分配到您在激活密钥中提供的系统组。

source: You should then schedule a reboot before applying any additional configuration.
es: A continuación, debe programar un rearranque antes de aplicar cualquier configuración adicional.
ja: その後、追加の設定を適用する前に再起動をスケジュールする必要があります。
zh_cn: 在应用任何额外配置之前，建议您安排一次重引导。

source: Note that accepting the key can be fully automated using whitelists as described <link xl:href="https://docs.saltproject.io/en/latest/topics/tutorials/autoaccept_grains.html">here</link>.
es: La aceptación de la clave se puede automatizar mediantes listas de permitidos, como se describe <link xl:href="https://docs.saltproject.io/en/latest/topics/tutorials/autoaccept_grains.html">aquí</link>.
ja: キーの受け入れは、<link xl:href="https://docs.saltproject.io/en/latest/topics/tutorials/autoaccept_grains.html">こちら</link>で説明されているように、ホワイトリストを使用して完全に自動化できることに注意してください。
zh_cn: 请注意，可按照<link xl:href="https://docs.saltproject.io/en/latest/topics/tutorials/autoaccept_grains.html">此处</link>所述，使用白名单实现密整个密钥接受过程的自动化。

source: Components
es: Componentes
ja: コンポーネント
pt_br: Componentes
zh_cn: 组件

source: List of components for Edge
es: Lista de componentes de Edge
ja: Edgeのコンポーネントのリスト
pt_br: Lista de componentes do Edge
zh_cn: Edge 的组件列表

source: See Rancher documentation at <link xl:href="https://ranchermanager.docs.rancher.com/v2.12">https://ranchermanager.docs.rancher.com/v2.12</link>.
es: Consulte la documentación de Rancher en <link xl:href="https://ranchermanager.docs.rancher.com/v2.12">https://ranchermanager.docs.rancher.com/v2.12</link>.
ja: <link xl:href="https://ranchermanager.docs.rancher.com/v2.12">https://ranchermanager.docs.rancher.com/v2.12</link>にあるRancherのドキュメントを参照してください。
zh_cn: 请参见 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12">https://ranchermanager.docs.rancher.com/v2.12</link> 上的 Rancher 文档。

source: Rancher is a powerful open-source Kubernetes management platform that streamlines the deployment, operations and monitoring of Kubernetes clusters across multiple environments. Whether you manage clusters on premises, in the cloud, or at the edge, Rancher provides a unified and centralized platform for all your Kubernetes needs.
es: Rancher es una potente plataforma de gestión de Kubernetes de código abierto que optimiza el despliegue, las operaciones y la supervisión de clústeres de Kubernetes en múltiples entornos. Tanto si gestiona clústeres en sus instalaciones, en la nube o en el perímetro, Rancher le ofrece una plataforma unificada y centralizada para todas sus necesidades de Kubernetes.
ja: Rancherは、オープンソースの強力なKubernetes管理プラットフォームであり、複数の環境にまたがるKubernetesクラスタのデプロイメント、運用、および監視を効率化します。オンプレミス、クラウド、エッジのいずれのクラスタを管理する場合でも、Rancherは、Kubernetesに関するあらゆるニーズに対応する、統合された中央プラットフォームを提供します。
pt_br: O Rancher é uma plataforma de gerenciamento Kubernetes avançada e de código-fonte aberto que simplifica a implantação, as operações e o monitoramento de clusters Kubernetes em vários ambientes. Se você gerencia clusters no local, na nuvem ou na borda, o Rancher oferece uma plataforma unificada e centralizada para todas as suas necessidades do Kubernetes.
zh_cn: Rancher 是一个功能强大的开源 Kubernetes 管理平台，可以简化跨多个环境的 Kubernetes 群集的部署、操作和监控。无论您是在本地、云中还是边缘管理群集，Rancher 都能提供统一且集中的平台来满足您的所有 Kubernetes 需求。

source: Key Features of Rancher
es: Funciones clave de Rancher
ja: Rancherの主な機能
pt_br: Principais recursos do Rancher
zh_cn: Rancher 的主要功能

source: <emphasis role="strong">Multi-cluster management:</emphasis> Rancher’s intuitive interface lets you manage Kubernetes clusters from anywhere—public clouds, private data centers and edge locations.
es: <emphasis role="strong">Gestión de varios clústeres:</emphasis> la interfaz intuitiva de Rancher permite gestionar clústeres de Kubernetes desde cualquier lugar: nubes públicas, centros de datos privados y ubicaciones periféricas.
ja: <emphasis role="strong">マルチクラスタ管理:</emphasis> Rancherの直感的なインタフェースを使用して、パブリッククラウド、プライベートデータセンター、エッジロケーションのどこからでもKubernetesクラスタを管理できます。
pt_br: <emphasis role="strong">Gerenciamento multicluster:</emphasis> a interface intuitiva do Rancher permite gerenciar cluster Kubernetes de qualquer lugar: nuvens públicas, centro de dados privados e locais de borda.
zh_cn: <emphasis role="strong">多群集管理：</emphasis>Rancher 的直观界面让您可以从任何位置（公有云、专用数据中心和边缘位置）管理 Kubernetes 群集。

source: <emphasis role="strong">Security and compliance:</emphasis> Rancher enforces security policies, role-based access control (RBAC), and compliance standards across your Kubernetes landscape.
es: <emphasis role="strong">Seguridad y conformidad:</emphasis> Rancher aplica políticas de seguridad, control de acceso basado en roles (RBAC) y estándares de cumplimiento en todo su entorno de Kubernetes.
ja: <emphasis role="strong">セキュリティとコンプライアンス:</emphasis> Rancherでは、Kubernetes環境全体にセキュリティポリシー、ロールベースのアクセス制御(RBAC)、およびコンプライアンス標準が適用されます。
pt_br: <emphasis role="strong">Segurança e conformidade:</emphasis> o Rancher impõe políticas de segurança, controle de acesso com base em função (RBAC, Role-Based Access Control) e padrões de conformidade de acordo com o seu cenário do Kubernetes.
zh_cn: <emphasis role="strong">安全性与合规性：</emphasis>Rancher 在您的 Kubernetes 环境中实施安全策略、基于角色的访问控制 (RBAC) 与合规性标准。

source: <emphasis role="strong">Simplified cluster operations:</emphasis> Rancher automates cluster provisioning, upgrades and troubleshooting, simplifying Kubernetes operations for teams of all sizes.
es: <emphasis role="strong">Operaciones simplificadas del clúster:</emphasis> Rancher automatiza el aprovisionamiento, las actualizaciones y la resolución de problemas de los clústeres, lo que simplifica las operaciones de Kubernetes para equipos de todos los tamaños.
ja: <emphasis role="strong">クラスタ操作のシンプル化:</emphasis> Rancherはクラスタのプロビジョニング、アップグレード、トラブルシューティングを自動化し、あらゆる規模のチームでKubernetesの操作をシンプル化します。
pt_br: <emphasis role="strong">Operações de cluster simplificadas:</emphasis> o Rancher automatiza o provisionamento de clusters, faz upgrade e soluciona problemas, simplificando as operações do Kubernetes para equipes de todos os tamanhos.
zh_cn: <emphasis role="strong">简化的群集操作：</emphasis>Rancher 可自动执行群集置备、升级和查错，并为各种规模的团队简化 Kubernetes 操作。

source: <emphasis role="strong">Centralized application catalog:</emphasis> The Rancher application catalog offers a diverse range of Helm charts and Kubernetes Operators, making it easy to deploy and manage containerized applications.
es: <emphasis role="strong">Catálogo de aplicaciones centralizado:</emphasis> el catálogo de aplicaciones de Rancher ofrece una amplia gama de charts de Helm y operadores de Kubernetes, lo que facilita el despliegue y gestión de aplicaciones en contenedores.
ja: <emphasis role="strong">中央型のアプリケーションカタログ:</emphasis> Rancherアプリケーションカタログは、多種多様なHelmチャートとKubernetes Operatorを提供し、コンテナ化アプリケーションのデプロイと管理を容易にします。
pt_br: <emphasis role="strong">Catálogo de aplicativos centralizado:</emphasis> o catálogo de aplicativos do Rancher oferece uma variedade de gráficos Helm e operadores do Kubernetes, o que facilita a implantação e o gerenciamento de aplicativos conteinerizados.
zh_cn: <emphasis role="strong">集中式应用程序目录：</emphasis>Rancher 应用程序目录提供多种 Helm chart 和 Kubernetes 操作器，使容器化应用程序的部署和管理变得简单。

source: <emphasis role="strong">Continuous delivery:</emphasis> Rancher supports GitOps and CI/CD pipelines, enabling automated and streamlined application delivery processes.
es: <emphasis role="strong">Entrega continua:</emphasis> Rancher es compatible con GitOps y los procesos de CI/CD, lo que permite automatizar y optimizar los procesos de entrega de aplicaciones.
ja: <emphasis role="strong">継続的デリバリ:</emphasis> RancherはGitOpsと継続的インテグレーション/継続的デリバリパイプラインをサポートしており、自動化および効率化されたアプリケーションデリバリプロセスを実現します。
pt_br: <emphasis role="strong">Entrega contínua:</emphasis> o Rancher oferece suporte a GitOps e pipelines de CI/CD, o que automatiza e simplifica os processos de entrega dos aplicativos.
zh_cn: <emphasis role="strong">持续交付：</emphasis>Rancher 支持 GitOps 和 CI/CD 管道，可以自动化和简化应用程序交付过程。

source: Rancher’s use in SUSE Edge
es: Uso de Rancher en SUSE Edge
ja: SUSE EdgeでのRancherの使用
pt_br: Uso do Rancher no SUSE Edge
zh_cn: Rancher 在 SUSE Edge 中的使用

source: Rancher provides several core functionalities to the SUSE Edge stack:
es: Rancher proporciona varias funcionalidades básicas a la pila de SUSE Edge:
ja: Rancherは、SUSE Edgeスタックに複数のコア機能を提供します。
pt_br: O Rancher oferece várias funcionalidades importantes para a pilha do SUSE Edge:
zh_cn: Rancher 为 SUSE Edge 堆栈提供多项核心功能：

source: Centralized Kubernetes management
es: Gestión centralizada de Kubernetes
ja: Kubernetesの集中管理
pt_br: Gerenciamento centralizado do Kubernetes
zh_cn: 集中式 Kubernetes 管理

source: In typical edge deployments with numerous distributed clusters, Rancher acts as a central control plane for managing these Kubernetes clusters. It offers a unified interface for provisioning, upgrading, monitoring, and troubleshooting, simplifying operations, and ensuring consistency.
es: En despliegues periféricos típicos con numerosos clústeres distribuidos, Rancher actúa como un plano de control central para gestionar estos clústeres de Kubernetes. Ofrece una interfaz unificada para el aprovisionamiento, la actualización, la supervisión y la resolución de problemas, lo que simplifica las operaciones y garantiza la coherencia.
ja: 大量の分散クラスタが存在する一般的なエッジデプロイメントでは、Rancherは、これらのKubernetesクラスタを管理するための中央コントロールプレーンとして機能します。プロビジョニング、アップグレード、監視、およびトラブルシューティングのための統合インタフェースを提供し、操作をシンプル化し、一貫性を確保します。
pt_br: Nas implantações de borda típicas com vários clusters distribuídos, o Rancher atua como um plano de controle central para gerenciar os clusters Kubernetes. Ele oferece uma interface unificada para provisionamento, upgrade, monitoramento e solução de problemas, simplificando as operações e garantindo a consistência.
zh_cn: 在采用大量分布式群集的典型边缘部署中，Rancher 充当中心控制平面来管理这些 Kubernetes 群集。它提供统一的界面用于置备、升级、监控和查错、简化操作并确保一致性。

source: Simplified cluster deployment
es: Despliegue simplificado de clústeres
ja: クラスタデプロイメントのシンプル化
pt_br: Implantação de clusters simplificada
zh_cn: 简化的群集部署

source: Rancher streamlines Kubernetes cluster creation on the lightweight SUSE Linux Micro operating system, easing the rollout of edge infrastructure with robust Kubernetes capabilities.
es: Rancher optimiza la creación de clústeres de Kubernetes en el sistema operativo ligero SUSE Linux Micro, lo que facilita el despliegue de infraestructura periférica con sólidas capacidades de Kubernetes.
ja: Rancherは、軽量なSUSE Linux Microオペレーティングシステム上でのKubernetesクラスタの作成を効率化し、Kubernetesの堅牢な機能を備えたエッジインフラストラクチャの展開を容易にします。
pt_br: O Rancher simplifica a criação de clusters Kubernetes no sistema operacional leve SUSE Linux Micro, o que facilita a distribuição da infraestrutura de borda com recursos avançados do Kubernetes.
zh_cn: Rancher 简化了轻量级 SUSE Linux Micro 操作系统上的 Kubernetes 群集创建，并通过稳健的 Kubernetes 功能简化了边缘基础架构的部署。

source: Application deployment and management
es: Despliegue y gestión de aplicaciones
ja: アプリケーションのデプロイメントと管理
pt_br: Implantação e gerenciamento de aplicativos
zh_cn: 应用程序部署和管理

source: The integrated Rancher application catalog can simplify deploying and managing containerized applications across SUSE Edge clusters, enabling seamless edge workload deployment.
es: El catálogo integrado de aplicaciones de Rancher puede simplificar el despliegue y la gestión de aplicaciones en contenedores en clústeres de SUSE Edge, lo que permite un despliegue fluido de las cargas de trabajo en el perímetro.
ja: 統合されたRancherアプリケーションカタログは、SUSE Edgeクラスタ全体でのコンテナ化アプリケーションのデプロイと管理をシンプル化し、エッジワークロードのシームレスなデプロイメントを可能にします。
pt_br: O catálogo de aplicativos integrado do Rancher simplifica a implantação e o gerenciamento de aplicativos conteinerizados nos clusters SUSE Edge, facilitando a implantação de cargas de trabalho de borda.
zh_cn: 集成的 Rancher 应用程序目录可以简化跨 SUSE Edge 群集的容器化应用程序的部署和管理，实现无缝的边缘工作负载部署。

source: Security and policy enforcement
es: Seguridad y aplicación de directivas
ja: セキュリティとポリシーの適用
pt_br: Imposição de segurança e políticas
zh_cn: 安全性和策略实施

source: Rancher provides policy-based governance tools, role-based access control (RBAC), and integration with external authentication providers. This helps SUSE Edge deployments maintain security and compliance, critical in distributed environments.
es: Rancher proporciona herramientas de gobernanza basadas en directivas, control de acceso basado en roles (RBAC) e integración con proveedores de autenticación externos. Esto ayuda a mantener la seguridad y el cumplimiento normativo en los despliegues de SUSE Edge, aspectos fundamentales en entornos distribuidos.
ja: Rancherは、ポリシーベースのガバナンスツール、ロールベースのアクセス制御(RBAC)を備えているほか、外部の認証プロバイダと統合できます。これにより、SUSE Edgeのデプロイメントは、分散環境において重要なセキュリティとコンプライアンスを維持できます。
pt_br: O Rancher oferece ferramentas de governança com base em política, controle de acesso com base em função (RBAC, Role-Based Access Control) e integração com provedores de autenticação externos. Isso ajuda a manter a segurança e a conformidade das implantações do SUSE Edge, o que é crítico em ambientes distribuídos.
zh_cn: Rancher 提供基于策略的治理工具、基于角色的访问控制 (RBAC)，以及与外部身份验证提供程序的集成。这有助于 SUSE Edge 部署保持安全且合规，在分布式环境中，这一点至关重要。

source: Best practices
es: Prácticas recomendadas
ja: ベストプラクティス
pt_br: Melhores práticas
zh_cn: 最佳实践

source: Rancher includes Fleet as a built-in component to allow manage cluster configurations and application deployments with code stored in git.
es: Rancher incluye Fleet como un componente integrado para permitir la gestión de configuraciones de clústeres y despliegues de aplicaciones con código almacenado en git.
ja: RancherにはビルトインコンポーネントとしてFleetが含まれており、Gitに保存されたコードでクラスタ設定やアプリケーションのデプロイメントを管理できます。
pt_br: O Rancher inclui o Fleet como componente incorporado que permite gerenciar configurações de clusters e implantações de aplicativos com um código armazenado em git.
zh_cn: Rancher 包含内置组件 Fleet。使用 Fleet 可以通过 git 中存储的代码管理群集配置和应用程序部署。

source: Observability
es: Observabilidad
ja: 可観測性
pt_br: Observabilidade
zh_cn: 可观测性

source: Rancher includes built-in monitoring and logging tools like Prometheus and Grafana for comprehensive insights into your cluster health and performance.
es: Rancher incluye herramientas integradas de supervisión y registro, como Prometheus y Grafana, que proporcionan información detallada sobre el estado y el rendimiento del clúster.
ja: Rancherには、PrometheusやGrafanaなどのビルトインのモニタリングおよびログツールが含まれており、クラスタのヘルスとパフォーマンスについて包括的な洞察を得ることができます。
pt_br: O Rancher inclui ferramentas incorporadas de monitoramento e registro, como Prometheus e Grafana, para insights abrangentes sobre a integridade e o desempenho do seu cluster.
zh_cn: Rancher 包含 Prometheus 和 Grafana 等内置监控和日志记录工具，可提供群集健康状况和性能的综合深入信息。

source: Installing with Edge Image Builder
es: Instalación con Edge Image Builder
ja: Edge Image Builderを使用したインストール
pt_br: Instalando com o Edge Image Builder
zh_cn: 使用 Edge Image Builder 进行安装

source: SUSE Edge is using <xref linkend="components-eib"/> in order to customize base SUSE Linux Micro OS images. Follow <xref linkend="rancher-install"/> for an air-gapped installation of Rancher on top of Kubernetes clusters provisioned by EIB.
es: SUSE Edge usa <xref linkend="components-eib"/> para personalizar las imágenes del sistema operativo base SUSE Linux Micro. Siga las instrucciones de la <xref linkend="rancher-install"/> para realizar una instalación en un entorno aislado de Rancher sobre clústeres de Kubernetes aprovisionados por EIB.
ja: SUSE Edgeは、SUSE Linux Micro OSのゴールデンイメージをカスタマイズするために<xref linkend="components-eib"/>を使用しています。EIBでプロビジョニングしたKubernetesクラスタ上にRancherをエアギャップインストールするには、<xref linkend="rancher-install"/>に従ってください。
pt_br: O SUSE Edge usa o <xref linkend="components-eib"/> para personalizar as imagens base do sistema operacional SUSE Linux Micro. Leia a <xref linkend="rancher-install"/> para instalação air-gapped do Rancher em clusters Kubernetes provisionados pelo EIB.
zh_cn: SUSE Edge 使用<xref linkend="components-eib"/>来自定义基础 SUSE Linux Micro 操作系统映像。请按照<xref linkend="rancher-install"/>中所述，在 EIB 置备的 Kubernetes 群集上进行 Rancher 隔离式安装。

source: Additional Resources
es: Recursos adicionales
ja: 追加リソース
pt_br: Recursos adicionais
zh_cn: 其他资源

source: <link xl:href="https://rancher.com/docs/">Rancher Documentation</link>
es: <link xl:href="https://rancher.com/docs/">Documentación de Rancher</link>
ja: <link xl:href="https://rancher.com/docs/">Rancherのドキュメント</link>
pt_br: <link xl:href="https://rancher.com/docs/">Documentação do Rancher</link>
zh_cn: <link xl:href="https://rancher.com/docs/">Rancher 文档</link>

source: <link xl:href="https://www.rancher.academy/">Rancher Academy</link>
zh_cn: <link xl:href="https://www.rancher.academy/">Rancher 学院</link>

source: <link xl:href="https://rancher.com/community/">Rancher Community</link>
es: <link xl:href="https://rancher.com/community/">Comunidad de Rancher</link>
zh_cn: <link xl:href="https://rancher.com/community/">Rancher 社区</link>

source: <link xl:href="https://helm.sh/">Helm Charts</link>
es: <link xl:href="https://helm.sh/">Charts de Helm</link>
ja: <link xl:href="https://helm.sh/">Helmチャート</link>
pt_br: <link xl:href="https://helm.sh/">Gráficos Helm</link>
zh_cn: <link xl:href="https://helm.sh/">Helm Chart</link>

source: <link xl:href="https://operatorhub.io/">Kubernetes Operators</link>
es: <link xl:href="https://operatorhub.io/">Operadores de Kubernetes</link>
ja: <link xl:href="https://operatorhub.io/">Kubernetes Operator</link>
pt_br: <link xl:href="https://operatorhub.io/">Operadores do Kubernetes</link>
zh_cn: <link xl:href="https://operatorhub.io/">Kubernetes 操作器</link>

source: Rancher Dashboard Extensions
es: Extensiones de panel de control de Rancher
ja: Rancher Dashboard拡張機能
pt_br: Extensões do Rancher Dashboard
zh_cn: Rancher 仪表板扩展

source: Extensions allow users, developers, partners, and customers to extend and enhance the Rancher UI. SUSE Edge provides KubeVirt and Akri dashboard extensions.
es: Las extensiones permiten a los usuarios, desarrolladores, partners y clientes ampliar y mejorar la interfaz de usuario de Rancher. SUSE Edge proporciona extensiones para los paneles de control KubeVirt y Akri.
ja: 拡張機能により、ユーザ、開発者、パートナー、および顧客はRancher UIを拡張および強化できます。SUSE Edgeでは、KubeVirtとAkriのダッシュボード拡張機能を提供しています。
pt_br: As extensões permitem que usuários, desenvolvedores, parceiros e clientes estendam e aprimorem a IU do Rancher. O SUSE Edge oferece as extensões de dashboard KubeVirt e Akri.
zh_cn: 用户、开发人员、合作伙伴及客户可以使用扩展来扩展和增强 Rancher UI。SUSE Edge 提供 KubeVirt 和 Akri 仪表板扩展。

source: See <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions">Rancher documentation</link></literal> for general information about Rancher Dashboard Extensions.
es: Consulte la <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions">documentación de Rancher</link></literal> para obtener información general sobre las extensiones de panel de control de Rancher.
ja: Rancher Dashboard拡張機能の一般的な情報については、<literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions">Rancherのドキュメント</link></literal>を参照してください。
zh_cn: 有关 Rancher 仪表板扩展的一般信息，请参见 <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions">Rancher 文档</link></literal>。

source: Installation
es: Instalación
ja: インストール
pt_br: Instalação
zh_cn: 安装

source: All of the SUSE Edge 3.4 components, including dashboard extensions, are distributed as OCI artifacts. To install SUSE Edge Extensions you can use Rancher Dashboard UI, Helm or Fleet:
es: Todos los componentes de SUSE Edge 3.4, incluidas las extensiones de panel de control, se despliegan como artefactos OCI. Para instalar extensiones de SUSE Edge, puede usar la interfaz del usuario del panel de control de Rancher, Helm o Fleet:
ja: ダッシュボード拡張機能を含むすべてのSUSE Edge 3.4コンポーネントは、OCIアーティファクトとして配布されます。SUSE Edge拡張機能をインストールするには、Rancher Dashboard UI、Helm、またはFleetを使用できます。
zh_cn: SUSE Edge 3.4 的所有组件（包括仪表板扩展）均以 OCI 制品形式分发。您可通过 Rancher 仪表板 UI、Helm 或 Fleet 安装 SUSE Edge 扩展：

source: Installing with Rancher Dashboard UI
es: Instalación con la interfaz de usuario del panel de control de Rancher
ja: Rancher Dashboard UIを使用したインストール
pt_br: Instalando a IU do Rancher Dashboard
zh_cn: 通过 Rancher 仪表板 UI 安装

source: Click <emphasis role="strong">Extensions</emphasis> in the <emphasis role="strong">Configuration</emphasis> section of the navigation sidebar.
es: Haga clic en <emphasis role="strong">Extensions</emphasis> (Extensiones) en la sección <emphasis role="strong">Configuration</emphasis> (Configuración) de la barra lateral de navegación.
ja: ナビゲーションサイドバーの<emphasis role="strong">［ Configuration (設定)］</emphasis>セクションで、<emphasis role="strong">［Extensions (拡張機能)］</emphasis>をクリックします。
pt_br: Clique em <emphasis role="strong">Extensions</emphasis> (Extensões) na seção <emphasis role="strong">Configuration</emphasis> (Configuração) da barra lateral de navegação.
zh_cn: 单击导航侧边栏 <emphasis role="strong">Configuration</emphasis>（配置）部分的 <emphasis role="strong">Extensions</emphasis>（扩展）。

source: On the Extensions page, click the three dot menu at the top right and select <emphasis role="strong">Manage Repositories</emphasis>.
es: En la página Extensions (Extensiones), haga clic en el menú de tres puntos de la parte superior derecha y seleccione <emphasis role="strong">Manage Repositories</emphasis> (Gestionar repositorios).
ja: ［Extensions (拡張機能)］ページで、右上にある3つのドットメニューをクリックし、<emphasis role="strong">［Manage Repositories (リポジトリの管理)］</emphasis>を選択します。
pt_br: Na página de extensões, clique no menu de três pontos na parte superior direita e selecione <emphasis role="strong">Manage Repositories</emphasis> (Gerenciar repositórios).
zh_cn: 在“Extensions”（扩展）页面上，单击右上角的三点菜单，然后选择 <emphasis role="strong">Manage Repositories</emphasis>（管理储存库）。

source: Each extension is distributed via its own OCI artifact. They are available from the SUSE Edge Helm charts repository.
es: Cada extensión se despliega mediante su propio artefacto OCI. Están disponibles en el repositorio de charts de Helm de SUSE Edge.
ja: 各拡張機能は、独自のOCIアーティファクトで配布されます。これらはSUSE Edge Helmチャートリポジトリから入手できます。
pt_br: Cada extensão é distribuída por seu próprio artefato OCI. Elas estão disponíveis no repositório de gráficos Helm do SUSE Edge.
zh_cn: 每个扩展都通过各自的 OCI 制品分发，可通过 SUSE Edge Helm chart 储存库获取。
