Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: This guide initially explains how to deploy the additional virtualization components onto a system that has already been pre-deployed, but follows with a section that describes how to embed this configuration in the initial deployment via Edge Image Builder. If you do not want to run through the basics and set things up manually, skip right ahead to that section.
es: Esta guía explica inicialmente cómo desplegar los componentes de virtualización adicionales en un sistema que ya ha sido predesplegado, pero incluye una sección que describe cómo integrar esta configuración en el despliegue inicial a través de Edge Image Builder. Si no desea repasar los conceptos básicos y configurarlo todo manualmente, pase directamente a esa sección.
ja: このガイドではまず、事前にデプロイ済みのシステムに追加の仮想化コンポーネントをデプロイする方法について説明しますが、その後に続くセクションでは、Edge Image Builderを使用してこの設定を最初のデプロイメントに組み込む方法を説明しています。基本手順を実行して環境を手動で設定する必要がない場合は、そちらのセクションに進んでください。
pt_br: A princípio, este guia explica como implantar os componentes de virtualização adicionais em um sistema que já foi pré-implantado, mas acompanha uma seção que descreve como incorporar essa configuração à implantação inicial usando o Edge Image Builder. Se você não quer ler os conceitos básicos e definir as configurações manualmente, pule direto para essa seção.
zh_cn: 本指南首先介绍如何将其他虚拟化组件部署到已预先部署的系统，然后会在一个章节中介绍如何通过 Edge Image Builder 将此配置嵌入到初始部署中。如果您不想了解基础知识并想要手动完成设置，请直接跳到该章节。

source: KubeVirt overview
es: Descripción general de KubeVirt
ja: KubeVirtの概要
pt_br: Visão geral do KubeVirt
zh_cn: KubeVirt 概述

source: KubeVirt allows for managing Virtual Machines with Kubernetes alongside the rest of your containerized workloads. It does this by running the user space portion of the Linux virtualization stack in a container. This minimizes the requirements on the host system, allowing for easier setup and management.
es: KubeVirt permite gestionar máquinas virtuales con Kubernetes junto con el resto de sus cargas de trabajo en contenedores. Para ello, ejecuta la parte del espacio de usuario de la pila de virtualización de Linux en un contenedor. Esto minimiza los requisitos del sistema host, lo que facilita la configuración y la gestión.
ja: KubeVirtでは、仮想マシンと他のコンテナ化ワークロードを併せてKubernetesで管理できます。これを実現するために、Linux仮想化スタックのユーザスペース部分をコンテナ内で実行します。これにより、ホストシステムの要件が最小限に抑えられ、セットアップと管理が容易になります。
pt_br: O KubeVirt permite o gerenciamento de máquinas virtuais com o Kubernetes junto ao restante de suas cargas de trabalho conteinerizadas. Para fazer isso, ele executa a parte referente ao espaço do usuário da pilha de virtualização do Linux em um contêiner. Isso minimiza os requisitos no sistema host, o que facilita a configuração e o gerenciamento.
zh_cn: KubeVirt 让您可以通过 Kubernetes 管理虚拟机及其他容器化工作负载。它通过在容器中运行 Linux 虚拟化堆栈的用户空间部分来实现此目的。这样可以最大程度地降低对主机系统的要求，从而简化设置和管理。

source: Details about KubeVirt’s architecture can be found in <link xl:href="https://kubevirt.io/user-guide/architecture/">the upstream documentation.</link>
es: Encontrará los detalles sobre la arquitectura de KubeVirt en la <link xl:href="https://kubevirt.io/user-guide/architecture/">documentación original</link>.
ja: KubeVirtのアーキテクチャの詳細については、<link xl:href="https://kubevirt.io/user-guide/architecture/">アップストリームドキュメント</link>を参照してください。
pt_br: Os detalhes sobre a arquitetura do KubeVirt estão disponíveis na <link xl:href="https://kubevirt.io/user-guide/architecture/">documentação upstream</link>.
zh_cn: 有关 KubeVirt 体系结构的详细信息，请参见<link xl:href="https://kubevirt.io/user-guide/architecture/">上游文档</link>。

source: If you are following this guide, we assume you have the following already available:
es: Si está siguiendo esta guía, se da por hecho que ya dispone de lo siguiente:
ja: このガイドに従って操作を進める場合、以下がすでに用意されていることを想定しています。
pt_br: Se você está seguindo este guia, já deve ter os seguintes itens disponíveis:
zh_cn: 如果您要学习本指南，事先需要做好以下准备：

source: At least one physical host with SUSE Linux Micro 6.1 installed, and with virtualization extensions enabled in the BIOS (see <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">here</link> for details).
es: Al menos un host físico con SUSE Linux Micro 6.1 instalado y con las extensiones de virtualización habilitadas en el BIOS (consulte <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">este documento</link> para obtener más detalles).
ja: SUSE Linux Micro 6.1がインストールされ、BIOSで仮想化拡張機能が有効になっている少なくとも1台の物理ホスト(詳細については、<link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">こちら</link>を参照してください)。
pt_br: No mínimo, um host físico com o SUSE Linux Micro 6.1 instalado e com as extensões de virtualização habilitadas no BIOS (consulte <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">aqui</link> para obter detalhes).
zh_cn: 至少有一台装有 SUSE Linux Micro 6.1 的物理主机，并且在 BIOS 中启用了虚拟化扩展（有关详细信息，请参见<link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">此处</link>）。

source: Across your nodes, a K3s/RKE2 Kubernetes cluster already deployed and with an appropriate <literal>kubeconfig</literal> that enables superuser access to the cluster.
es: Un clúster Kubernetes de K3s/RKE2 ya desplegado en todos sus nodos y con una <literal>kubeconfig</literal> adecuada que permita el acceso de superusuario al clúster.
ja: ノード全体で、K3s/RKE2 Kubernetesクラスタがすでにデプロイされており、クラスタへのスーパーユーザアクセスを可能にする適切な<literal>kubeconfig</literal>が設定されている。
pt_br: Em todos os nós, um cluster Kubernetes do K3s/RKE2 já implantado com um <literal>kubeconfig</literal> apropriado que permite o acesso de superusuário ao cluster.
zh_cn: 已在您的节点中部署了 K3s/RKE2 Kubernetes 群集，并提供了相应的 <literal>kubeconfig</literal>，使超级用户能够访问该群集。

source: Access to the root user — these instructions assume you are the root user, and <emphasis>not</emphasis> escalating your privileges via <literal>sudo</literal>.
es: Acceso al usuario root: estas instrucciones dan por sentado que usted es el usuario root y que <emphasis>no</emphasis> está derivando sus privilegios mediante <literal>sudo</literal>.
ja: ルートユーザへのアクセス — 以下の説明では、自身がルートユーザであり、<literal>sudo</literal>を使用して特権を昇格して<emphasis>いない</emphasis>ことを想定しています。
pt_br: Acesso ao usuário root. Nestas instruções, consideramos você como usuário root, <emphasis>sem</emphasis> escalar seus privilégios por meio do <literal>sudo</literal>.
zh_cn: root 用户访问权限 — 本章中的说明假设您是 root 用户，而<emphasis>未</emphasis>通过 <literal>sudo</literal> 提升特权。

source: You have <link xl:href="https://helm.sh/docs/intro/install/">Helm</link> available locally with an adequate network connection to be able to push configurations to your Kubernetes cluster and download the required images.
es: Debe tener <link xl:href="https://helm.sh/docs/intro/install/">Helm</link> disponible localmente con una conexión de red adecuada para poder enviar configuraciones a su clúster de Kubernetes y descargar las imágenes necesarias.
ja: <link xl:href="https://helm.sh/docs/intro/install/">Helm</link>がローカルで利用可能で、適切なネットワーク接続を備えていて、Kubernetesクラスタに設定をプッシュし、必要なイメージをダウンロードできる。
pt_br: Você tem o <link xl:href="https://helm.sh/docs/intro/install/">Helm</link> disponível localmente com uma conexão de rede adequada para poder enviar as configurações ao cluster Kubernetes e fazer download das imagens necessárias.
zh_cn: 已在本地安装 <link xl:href="https://helm.sh/docs/intro/install/">Helm</link> 并建立了速度够快的网络连接，以便可以将配置推送到 Kubernetes 群集和下载所需的映像。

source: Manual installation of Edge Virtualization
es: Instalación manual de Edge Virtualization
ja: Edge Virtualizationの手動インストール
pt_br: Instalação manual do Edge Virtualization
zh_cn: 手动安装 Edge Virtualization

source: This guide will not walk you through the deployment of Kubernetes, but it assumes that you have either installed the SUSE Edge-appropriate version of <link xl:href="https://k3s.io/">K3s</link> or <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> and that you have your kubeconfig configured accordingly so that standard <literal>kubectl</literal> commands can be executed as the superuser. We assume your node forms a single-node cluster, although there are no significant differences expected for multi-node deployments.
es: Esta guía no explica el despliegue de Kubernetes, pero da por sentado que ha instalado la versión de <link xl:href="https://k3s.io/">K3s</link> o <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> adecuada para SUSE Edge y que tiene su kubeconfig configurada adecuadamente para que los comandos estándar <literal>kubectl</literal> se puedan ejecutar como superusuario. También se presupone que su nodo forma un clúster de un solo nodo, aunque no se esperan diferencias significativas para los despliegues de varios nodos.
ja: このガイドでは、Kubernetesのデプロイメント手順については説明しませんが、SUSE Edgeに適したバージョンの<link xl:href="https://k3s.io/">K3s</link>または<link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>がインストールされていること、およびkubeconfigが適切に設定されていて標準の<literal>kubectl</literal>コマンドをスーパーユーザとして実行できることを想定しています。また、シングルノードクラスタを形成することを想定していますが、マルチノードのデプロイメントでも大きな違いはないと考えられます。
pt_br: Este guia não orientará na implantação do Kubernetes, mas ele considera que você já instalou a versão apropriada ao SUSE Edge do <link xl:href="https://k3s.io/">K3s</link> ou do <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> e configurou o kubeconfig de acordo para que os comandos <literal>kubectl</literal> padrão sejam executados como superusuário. Pressupomos que seu nó constitua um cluster de nó único, apesar de não haver diferenças significativas esperadas nas implantações de vários nós.
zh_cn: 本指南不会指导您完成 Kubernetes 的部署过程，而是假设您已安装适用于 SUSE Edge 的 <link xl:href="https://k3s.io/">K3s</link> 或 <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> 版本，并已相应地配置了 kubeconfig，以便能够以超级用户身份执行标准的 <literal>kubectl</literal> 命令。假设您的节点构成了单节点群集，不过，此过程与多节点部署预期不会有太大的差异。

source: SUSE Edge Virtualization is deployed via three separate Helm charts, specifically:
es: SUSE Edge Virtualization se despliega mediante tres charts de Helm distintos, en concreto:
ja: SUSE Edge Virtualizationは、3つの別個のHelmチャートを使用してデプロイします。具体的には次のとおりです。
pt_br: O SUSE Edge Virtualization é implantado por meio de três gráficos Helm separados, especificamente:
zh_cn: 具体而言，将通过以下三个独立的 Helm chart 来部署 SUSE Edge Virtualization：

source: <emphasis role="strong">KubeVirt</emphasis>: The core virtualization components, that is, Kubernetes CRDs, operators and other components required for enabling Kubernetes to deploy and manage virtual machines.
es: <emphasis role="strong">KubeVirt</emphasis>: los componentes básicos de virtualización, es decir, las CRD de Kubernetes, los operadores y otros componentes necesarios para que Kubernetes pueda desplegar y gestionar máquinas virtuales.
ja: <emphasis role="strong">KubeVirt</emphasis>: 中心的な仮想化コンポーネント。つまり、Kubernetesが仮想マシンをデプロイおよび管理できるようにするために必要なKubernetes CRD、オペレータ、およびその他のコンポーネント。
pt_br: <emphasis role="strong">KubeVirt</emphasis>: os componentes de virtualização principais, ou seja, as CRDs do Kubernetes, os operadores e outros componentes necessários para que o Kubernetes possa implantar e gerenciar máquinas virtuais.
zh_cn: <emphasis role="strong">KubeVirt</emphasis>：核心虚拟化组件，即 Kubernetes CRD、操作器，以及使 Kubernetes 能够部署和管理虚拟机的其他组件。

source: <emphasis role="strong">KubeVirt Dashboard Extension</emphasis>: An optional Rancher UI extension that allows basic virtual machine management, for example, starting/stopping of virtual machines as well as accessing the console.
es: <emphasis role="strong">Extensión de panel de control KubeVirt</emphasis>: una extensión opcional de la interfaz de usuario de Rancher que permite la gestión básica de máquinas virtuales; por ejemplo, iniciar/detener máquinas virtuales, así como acceder al panel de control.
ja: <emphasis role="strong">KubeVirtダッシュボード拡張機能</emphasis>: 仮想マシンの起動/停止やコンソールへのアクセスなど、基本的な仮想マシン管理を実行できるオプションのRancher UI拡張機能。
pt_br: <emphasis role="strong">Extensão de dashboard KubeVirt</emphasis>: uma extensão de IU opcional do Rancher que permite o gerenciamento básico de máquinas virtuais, por exemplo, iniciar/parar máquinas virtuais e acessar o console.
zh_cn: <emphasis role="strong">KubeVirt 仪表板扩展</emphasis>：可选的 Rancher UI 扩展，用于实现基本的虚拟机管理，例如启动/停止虚拟机以及访问控制台。

source: <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>: An additional component that enables persistent-storage integration for KubeVirt, providing capabilities for virtual machines to use existing Kubernetes storage back-ends for data, but also allowing users to import or clone data volumes for virtual machines.
es: <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>: un componente adicional que permite la integración del almacenamiento persistente para KubeVirt, proporcionando capacidades para que las máquinas virtuales puedan usar sistemas secundarios de almacenamiento existentes de Kubernetes para los datos, pero también permitiendo a los usuarios importar o clonar volúmenes de datos para máquinas virtuales.
ja: <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>: KubeVirtの永続ストレージの統合を可能にする追加コンポーネント。仮想マシンが既存のKubernetesストレージバックエンドをデータ用に使用する機能を提供するだけでなく、ユーザが仮想マシンのデータボリュームのインポートまたはクローンの作成を行うことも可能にします。
pt_br: <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>: um componente adicional que permite a integração de armazenamento persistente para KubeVirt, oferecendo recursos para as máquinas virtuais usarem os back ends de armazenamento do Kubernetes existentes para dados, mas também permitindo que os usuários importem ou clonem volumes de dados em máquinas virtuais.
zh_cn: <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>：一个附加组件，可为 KubeVirt 实现持久性存储集成，使虚拟机能够使用现有 Kubernetes 存储后端来存储数据，同时使用户能够导入或克隆虚拟机的数据卷。

source: Each of these Helm charts is versioned according to the SUSE Edge release you are currently using. For production/supported usage, employ the artifacts that can be found in the SUSE Registry.
es: Cada uno de estos charts de Helm tiene versiones distintas según la versión de SUSE Edge que esté utilizando actualmente. Para usarlos en entornos de producción o con asistencia, utilice los artefactos que se pueden encontrar en el registro de SUSE.
ja: これらの各Helmチャートは、現在使用しているSUSE Edgeのリリースに従ってバージョン管理されています。運用での使用/サポートされる使用のためには、SUSEレジストリにあるアーティファクトを使用してください。
pt_br: Cada um desses gráficos Helm é versionado de acordo com a versão do SUSE Edge que você usa. Para uso em produção/com suporte, aplique os artefatos disponíveis no SUSE Registry.
zh_cn: 其中的每个 Helm chart 将根据您当前使用的 SUSE Edge 版本进行版本控制。对于生产/支持用途，请采用 SUSE 仓库中提供的制品。

source: First, ensure that your <literal>kubectl</literal> access is working:
es: En primer lugar, asegúrese de que puede acceder correctamente a <literal>kubectl</literal>:
ja: まず、 <literal>kubectl</literal>のアクセスが機能していることを確認します。
pt_br: Primeiro, garanta que o acesso ao <literal>kubectl</literal> esteja funcionando:
zh_cn: 首先，请确保可以正常进行 <literal>kubectl</literal> 访问：

source: This should show something similar to the following:
es: Esto debería mostrar algo similar a lo siguiente:
ja: 次のような画面が表示されます。
pt_br: Esse comando deve retornar algo semelhante ao seguinte:
zh_cn: 此命令应会显示如下所示的输出：

source: Now you can proceed to install the <emphasis role="strong">KubeVirt</emphasis> and <emphasis role="strong">Containerized Data Importer (CDI)</emphasis> Helm charts:
es: Ahora, puede instalar los charts de Helm de <emphasis role="strong">KubeVirt</emphasis> y <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>:
ja: これで、<emphasis role="strong">KubeVirt</emphasis>および<emphasis role="strong">Containerized Data Importer (CDI)</emphasis>のHelmチャートのインストールに進むことができます。
pt_br: Agora você pode instalar os gráficos Helm <emphasis role="strong">KubeVirt</emphasis> e <emphasis role="strong">Containerized Data Importer (CDI)</emphasis>:
zh_cn: 现在您可以继续安装 <emphasis role="strong">KubeVirt</emphasis> 和 <emphasis role="strong">Containerized Data Importer (CDI)</emphasis> Helm chart：

source: In a few minutes, you should have all KubeVirt and CDI components deployed. You can validate this by checking all the deployed resources in the <literal>kubevirt-system</literal> and <literal>cdi-system</literal> namespace.
es: En unos minutos, debería tener todos los componentes de KubeVirt y CDI desplegados. Puede comprobar que todos los recursos se han desplegado en los espacios de nombres <literal>kubevirt-system</literal> y <literal>cdi-system</literal>.
ja: 数分ですべてのKubeVirtおよびCDIコンポーネントがデプロイされるはずです。これを検証するには、<literal>kubevirt-system</literal>および<literal>cdi-system</literal>のネームスペース内にデプロイされたすべてのリソースを確認します。
pt_br: Em alguns minutos, os componentes KubeVirt e CDI estarão implantados. Para validar isso, verifique todos os recursos implantados no namespace <literal>kubevirt-system</literal> e <literal>cdi-system</literal>.
zh_cn: 几分钟后，所有 KubeVirt 和 CDI 组件应会部署完成。您可以通过检查 <literal>kubevirt-system</literal> 和 <literal>cdi-system</literal> 名称空间中部署的所有资源进行验证。

source: Verify KubeVirt resources:
es: Verifique los recursos de KubeVirt:
ja: KubeVirtリソースを確認します。
pt_br: Verifique os recursos do KubeVirt:
zh_cn: 校验 KubeVirt 资源：

source: Verify CDI resources:
es: Verifique los recursos de CDI:
ja: CDIリソースを確認します。
pt_br: Verifique os recursos do CDI:
zh_cn: 校验 CDI 资源：

source: To verify that the <literal>VirtualMachine</literal> custom resource definitions (CRDs) are deployed, you can validate with:
es: Para verificar que las definiciones de recursos personalizados (CRD) de <literal>VirtualMachine</literal> están desplegadas, puede usar:
ja: <literal>VirtualMachine</literal>カスタムリソース定義(CRD)がデプロイされていることを確認するには、次のコマンドで検証できます。
pt_br: Para verificar se as definições de recursos personalizados (CRDs, Custom Resource Definitions) <literal>VirtualMachine</literal> foram implantadas, faça a validação com:
zh_cn: 要校验是否已部署 <literal>VirtualMachine</literal> 自定义资源定义 (CRD)，请使用以下命令：

source: This should print out the definition of the <literal>VirtualMachine</literal> object, which should print as follows:
es: Esto debería dar como resultado la definición del objeto <literal>VirtualMachine</literal>, que debería tener este aspecto:
ja: <literal>VirtualMachine</literal>オブジェクトの定義が出力され、次のような画面が表示されます。
pt_br: Esse comando deve retornar a definição do objeto <literal>VirtualMachine</literal>, com o seguinte conteúdo:
zh_cn: 此命令应会列显 <literal>VirtualMachine</literal> 对象的定义，如下所示：

source: Deploying virtual machines
es: Despliegue de máquinas virtuales
ja: 仮想マシンのデプロイ
pt_br: Implantando máquinas virtuais
zh_cn: 部署虚拟机

source: Now that KubeVirt and CDI are deployed, let us define a simple virtual machine based on <link xl:href="https://get.opensuse.org/tumbleweed/">openSUSE Tumbleweed</link>. This virtual machine has the most simple of configurations, using standard "pod networking" for a networking configuration identical to any other pod. It also employs non-persistent storage, ensuring the storage is ephemeral, just like in any container that does not have a <link xl:href="https://kubernetes.io/docs/concepts/storage/persistent-volumes/">PVC</link>.
es: Ahora que KubeVirt y CDI se han desplegado, vamos a definir una máquina virtual sencilla basada en <link xl:href="https://get.opensuse.org/tumbleweed/">openSUSE Tumbleweed</link>. La configuración de esta máquina virtual es muy sencilla: usa una "conexión de red de pod" idéntica a la de cualquier otro pod. También emplea almacenamiento no persistente, lo que garantiza que el almacenamiento sea efímero, al igual que en cualquier contenedor que no tenga un <link xl:href="https://kubernetes.io/docs/concepts/storage/persistent-volumes/">PVC</link>.
ja: KubeVirtとCDIがデプロイされたので、<link xl:href="https://get.opensuse.org/tumbleweed/">openSUSE Tumbleweed</link>に基づくシンプルな仮想マシンを定義してみましょう。この仮想マシンは最もシンプルな設定であり、標準の「Podネットワーキング」を使用して、他のPodと同じネットワーキング設定を行います。また、非永続ストレージを使用するため、<link xl:href="https://kubernetes.io/docs/concepts/storage/persistent-volumes/">PVC</link>を持たないコンテナと同様に、ストレージは一時的なものになります。
pt_br: Agora que KubeVirt e CDI estão implantados, vamos definir uma máquina virtual simples com base no <link xl:href="https://get.opensuse.org/tumbleweed/">openSUSE Tumbleweed</link>. Essa máquina virtual tem as configurações mais simples, usando a configuração de "rede de pod" padrão idêntica a qualquer outro pod. Ela também utiliza um armazenamento não persistente, o que garante que seja efêmero como em qualquer contêiner que não tenha um <link xl:href="https://kubernetes.io/docs/concepts/storage/persistent-volumes/">PVC</link>.
zh_cn: 部署 KubeVirt 和 CDI 后，我们需要基于 <link xl:href="https://get.opensuse.org/tumbleweed/">openSUSE Tumbleweed</link> 定义一个简单的虚拟机。此虚拟机采用最简单的配置，与任何其他 Pod 一样使用标准的“Pod 网络”进行网络配置。与任何没有 <link xl:href="https://kubernetes.io/docs/concepts/storage/persistent-volumes/">PVC</link> 的容器一样，它也采用非持久性存储空间，因此可确保存储空间是临时性的。

source: This should print that a <literal>VirtualMachine</literal> was created:
es: El resultado debe ser que se ha creado una <literal>VirtualMachine</literal>:
ja: これにより、<literal>VirtualMachine</literal>が作成されたことを示すメッセージが出力されます。
pt_br: A saída deve mostrar que uma <literal>VirtualMachine</literal> foi criada:
zh_cn: 此命令列显的输出应会指出已创建 <literal>VirtualMachine</literal>：
