Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Unless there were no changes, reboot to apply the updates.
es: A menos que no haya habido cambios, reinicie el sistema para aplicar las actualizaciones.
ja: 変更がなければ、再起動して更新を適用します。
pt_br: Reinicialize para aplicar as atualizações (se houver).
zh_cn: 除非未发生任何更改，否则请重引导系统以应用更新。

source: SUSE Multi-Linux Manager is provided via a container that is managed by Podman. The <literal>mgradm</literal> command handles the setup and configuration for you.
es: SUSE Multi-Linux Manager se proporciona a través de un contenedor gestionado por Podman. El comando <literal>mgradm</literal> se encarga de la instalación y la configuración.
ja: SUSE Multi-Linux Managerは、Podmanによって管理されるコンテナを介して提供されます。<literal>mgradm</literal>コマンドがセットアップと設定を自動的に行います。
pt_br: O SUSE Multi-Linux Manager é oferecido por um contêiner gerenciado pelo Podman. O comando <literal>mgradm</literal> cuida da instalação e da configuração para você.
zh_cn: SUSE Multi-Linux Manager 通过由 Podman 管理的容器提供。<literal>mgradm</literal> 命令会为您处理设置和配置工作。

source: It is very important that your SUSE Multi-Linux Manager Server has the hostname configured with a fully qualified domain name ("FQDN") that the edge nodes you want to manage can properly resolve in your network!
es: Es muy importante que el nombre de host configurado en su instancia de SUSE Multi-Linux Manager Server tenga un nombre de dominio completo que los nodos periféricos que desea administrar puedan resolver correctamente en su red.
ja: SUSE Multi-Linux Manager Serverのホスト名が、管理対象のエッジノードがネットワークで適切に解決できる完全修飾ドメイン名(「FQDN」)で設定されていることが非常に重要です。
pt_br: É muito importante configurar o nome de host no SUSE Multi-Linux Manager Server com um nome de domínio completo e qualificado ("FQDN", Fully Qualified Domain Name) que os nós de borda que você deseja gerenciar possam resolver apropriadamente na rede!
zh_cn: 请务必为您的 SUSE Multi-Linux Manager 服务器配置包含完全限定域名（简称“FQDN”）的主机名，并确保您要管理的边缘节点能够在网络中正确解析该主机名！

source: Before you install and configure the SUSE Multi-Linux Manager Server container, you need to prepare the additional block device that you have previously added. For that, you need to know the name the virtual machine has given to the device. For example, if the block device is <literal>/dev/vdb</literal>, you can configure it to be used for SUSE Multi-Linux Manager using the following command:
es: Antes de instalar y configurar el contenedor de SUSE Multi-Linux Manager Server, debe preparar el dispositivo de bloque adicional que ha añadido previamente. Para ello, debe conocer el nombre que la máquina virtual ha asignado al dispositivo. Por ejemplo, si el dispositivo de bloque es <literal>/dev/vdb</literal>, puede configurarlo para que se utilice con SUSE Multi-Linux Manager mediante el siguiente comando:
ja: SUSE Multi-Linux Manager Serverコンテナをインストールして設定する前に、以前に追加した追加のブロックデバイスを準備しておく必要があります。そのためには、仮想マシンがそのデバイスに付けた名前を知っている必要があります。たとえば、ブロックデバイスが <literal>/dev/vdb</literal>の場合、次のコマンドを使用して、SUSE Multi-Linux Managerで使用するように設定できます。
zh_cn: 在安装和配置 SUSE Multi-Linux Manager Server 容器之前，您需要准备好之前添加的额外块设备。为此，您需要知道虚拟机为该设备分配的名称。例如，如果块设备为 <literal>/dev/vdb</literal>，可使用以下命令将其配置为供 SUSE Multi-Linux Manager 使用：

source: Deploy SUSE Multi-Linux Manager:
es: Despliegue SUSE Multi-Linux Manager:
ja: SUSE Multi-Linux Managerをデプロイします。
pt_br: Implante o SUSE Multi-Linux Manager:
zh_cn: 部署 SUSE Multi-Linux Manager：

source: Provide the password for the CA certificate. This password should be different from your login passwords. You usually don’t need to enter it later, but you should note it down.
es: Proporcione la contraseña para el certificado de CA. Esta contraseña debe ser diferente de sus contraseñas de inicio de sesión. Por lo general, no es necesario introducirla más adelante, pero debe anotarla.
ja: CA証明書のパスワードを入力します。このパスワードはログインパスワードとは異なる必要があります。通常は後で入力する必要はありませんが、メモしておいてください。
pt_br: Insira a senha para o certificado de CA. Essa senha deve ser diferente das suas senhas de login. Em geral, você não precisa inseri-la posteriormente, mas é bom anotá-la.
zh_cn: 提供 CA 证书的口令。该口令应与您的登录口令不同。通常情况下，您之后无需输入此口令，但应将其记录下来。

source: Provide the password for the "admin" user. This is the initial user for logging into SUSE Multi-Linux Manager. You can create additional users with full or restricted rights later.
es: Proporcione la contraseña para el usuario "admin". Se trata del usuario inicial para iniciar sesión en SUSE Multi-Linux Manager. Más adelante podrá crear usuarios adicionales con derechos completos o restringidos.
ja: 「admin」ユーザのパスワードを入力します。これは、SUSE Multi-Linux Managerにログインするための初期ユーザです。後で完全な権利または制限された権利を持つ追加のユーザを作成できます。
pt_br: Insira a senha do usuário "admin". Esse é o usuário inicial para fazer login no SUSE Multi-Linux Manager. Você pode criar outros usuários com direitos completos ou restritos no futuro.
zh_cn: 提供“admin”用户的口令。这是登录 SUSE Multi-Linux Manager 的初始用户。您之后可以创建具有完整权限或受限权限的其他用户。

source: Configure SUSE Multi-Linux Manager
es: Configuración de SUSE Multi-Linux Manager
ja: SUSE Multi-Linux Managerの設定
pt_br: Configurar o SUSE Multi-Linux Manager
zh_cn: 配置 SUSE Multi-Linux Manager

source: Once the deployment has finished, you can log into the SUSE Multi-Linux Manager web UI using the host name you provided earlier. The initial user is "admin". Use the password you provided in the previous step.
es: Una vez finalizado el despliegue, puede iniciar sesión en la interfaz de usuario web de SUSE Multi-Linux Manager utilizando el nombre de host que proporcionó anteriormente. El usuario inicial es "admin". Use la contraseña que proporcionó en el paso anterior.
ja: デプロイメントが完了したら、先ほど指定したホスト名を使用して、SUSE Multi-Linux Manager Web UIにログインできます。初期ユーザは「admin」です。前の手順で指定したパスワードを使用します。
pt_br: Após a conclusão da implantação, faça login na IU da web do SUSE Multi-Linux Manager usando o nome de host que você já forneceu. O usuário inicial é "admin". Use a senha informada na etapa anterior.
zh_cn: 部署完成后，您可以使用之前提供的主机名登录 SUSE Multi-Linux Manager Web 用户界面。初始用户为“admin”，请使用上一步设置的口令登录。

source: For the next step you need your Organization Credentials that you can find on the 2nd sub-tab of the "Users" tab of your organization in SUSE Customer Center. With those credentials, SUSE Multi-Linux Manager can synchronize all the products that you have subscriptions for.
es: Para el siguiente paso, necesitará las credenciales de su organización, que encontrará en la segunda subpestaña de la pestaña "Usuarios" de su organización en el Centro de servicios al cliente de SUSE. Con esas credenciales, SUSE Multi-Linux Manager puede sincronizar todos los productos a los que está suscrito.
ja: 次の手順では、SUSE Customer Centerの組織の「ユーザ」タブの2番目のサブタブにある組織の資格情報が必要です。これらの資格情報を使用して、SUSE Multi-Linux Managerはサブスクリプションを持つすべての製品を同期できます。
pt_br: Para a etapa seguinte, você precisa das credenciais da sua organização, que estão na segunda subguia da guia "Usuários" da organização no SUSE Customer Center. Com essas credenciais, o SUSE Multi-Linux Manager pode sincronizar todos os produtos que você assinou.
zh_cn: 下一步需要您的组织身份凭证，这些凭证可在 SUSE Customer Center 中您所在组织的“用户”选项卡的第二个子选项卡中找到。通过这些身份凭证，SUSE Multi-Linux Manager 能够同步您已订阅的所有产品。

source: Select <literal>Admin &gt; Setup Wizard</literal>.
es: Seleccione <literal>Administrador &gt; Asistente de configuración</literal>.
ja: <literal>［管理］ &gt; ［セットアップウィザード］</literal>を選択します。
zh_cn: 选择<literal>管理 &gt; 安装向导</literal>。

source: On the <literal>Organization Credentials</literal> tab create a new credential with your <literal>Username</literal> and <literal>Password</literal> that you found in the SUSE Customer Center.
es: En la pestaña <literal>Organization Credentials</literal> (Credenciales de la organización) cree nuevas credenciales con sus datos de <literal>Username</literal> (Nombre de usuario) y <literal>Password</literal> (Contraseña) que encontró en el Centro de servicios al cliente de SUSE.
ja: <literal>組織の資格情報</literal>タブで、SUSE Customer Centerにある<literal>ユーザ名</literal>と<literal>パスワード</literal>を使用して新しい資格情報を作成します。
pt_br: Na guia <literal>Credenciais da Organização</literal>, crie uma nova credencial com seu <literal>Nome de usuário</literal> e <literal>Senha</literal> que constam no SUSE Customer Center.
zh_cn: 在<literal>组织身份凭证</literal>选项卡中，使用您在 SUSE Customer Center 中找到的<literal>用户名</literal>和<literal>口令</literal>创建新身份凭证。

source: Go to the next tab <literal>SUSE Products</literal>. You need to wait until the first data synchronization with SUSE Customer Center has finished.
es: Diríjase a la pestaña siguiente, <literal>SUSE Products</literal> (Productos SUSE). Debe esperar hasta que finalice la primera sincronización de datos con el Centro de servicios al cliente de SUSE.
ja: 次のタブ［<literal>SUSE製品</literal>］に移動します。SUSE Customer Centerとの最初のデータ同期が完了するまで待つ必要があります。
pt_br: Vá para a guia seguinte <literal>Produtos SUSE</literal>. Aguarde o término da primeira sincronização de dados com o SUSE Customer Center.
zh_cn: 前往下一个选项卡 <literal>SUSE 产品</literal>。您需要等待与 SUSE Customer Center 的首次数据同步完成。

source: Once the list is populated, you use the filter to only show "Micro 6.1". Check the box for SUSE Linux Micro 6.1 for the hardware architecture your edge nodes will run on (<literal>x86_64</literal> or <literal>aarch64</literal>).
es: Cuando la lista se haya rellenado, utilice el filtro para mostrar solo "Micro 6.1". Marque la casilla de SUSE Linux Micro 6.1 para la arquitectura de hardware en la que se ejecutarán sus nodos periféricos (<literal>x86_64</literal> o <literal>aarch64</literal>).
ja: リストが入力されたら、フィルタを使用して「Micro 6.1」のみを表示します。エッジノードが実行されるハードウェアアーキテクチャ(<literal>x86_64</literal>または<literal>aarch64</literal>)に対応するSUSE Linux Micro 6.1のチェックボックスをオンにします。
zh_cn: 列表加载完毕后，使用过滤器仅显示“Micro 6.1”。选中与边缘节点运行的硬件体系结构（<literal>x86_64</literal> 或 <literal>aarch64</literal>）对应的 SUSE Linux Micro 6.1 复选框。

source: Click <literal>Add Products</literal>. This will add the main package repository ("channel") for SUSE Linux Micro and automatically add the channel for the SUSE Manager client tools as a sub-channel.
es: Haga clic en <literal>Add Products</literal> (Añadir productos). Esto añadirá el repositorio de paquetes principal ("canal") para SUSE Linux Micro y añadirá automáticamente el canal para las herramientas cliente de SUSE Manager como un subcanal.
ja: ［<literal>製品の追加</literal>］をクリックします。これにより、SUSE Linux Microのメインパッケージリポジトリ(「チャンネル」)が追加され、SUSE Managerクライアントツールのチャンネルがサブチャンネルとして自動的に追加されます。
pt_br: Clique em <literal>Adicionar produtos</literal> para adicionar o repositório ("canal") de pacotes principal do SUSE Linux Micro e, automaticamente, o canal para as ferramentas do cliente SUSE Manager como um subcanal.
zh_cn: 单击<literal>添加产品</literal>。此操作将会添加 SUSE Linux Micro 的主软件包储存库（即“通道”），并会自动添加 SUSE Manager 客户端工具的通道作为子通道。

source: Depending on your Internet connection, the first synchronization will take a while. You can already start with the next steps:
es: Dependiendo de su conexión a Internet, la primera sincronización tardará un poco. Ya puede empezar con los siguientes pasos:
ja: インターネット接続によっては、最初の同期にしばらく時間がかかります。次の手順からすぐに開始できます。
pt_br: Dependendo da sua conexão com a Internet, a primeira sincronização levará algum tempo. Você já pode iniciar as etapas seguintes:
zh_cn: 首次同步可能需要一段时间才能完成，具体时长取决于您的互联网连接情况。您可以在此期间开始执行后续步骤：

source: Under <literal>Systems &gt; System Groups</literal>, create at least one group that your systems will automatically join when they are onboarded. Groups are an important way of categorizing systems, so you can apply configuration or actions to a whole set of systems at once. They are conceptionally similar to labels in Kubernetes.
es: En <literal>Systems &gt; System Groups</literal> (Sistemas > Grupos de sistemas), cree al menos un grupo al que sus sistemas se unirán automáticamente cuando se incorporen. Los grupos son una forma importante de categorizar los sistemas, ya que permiten aplicar configuraciones o acciones a un conjunto completo de sistemas a la vez. Conceptualmente, son similares a las etiquetas de Kubernetes.
ja: <literal>［システム］ &gt;［システムグループ］</literal>で、システムがオンボード時に自動的に参加するグループを少なくとも1つ作成します。グループはシステムを分類する重要な方法であり、設定やアクションをシステムセット全体に一度に適用できます。概念的には、Kubernetesのラベルに似ています。
pt_br: Em <literal>Sistemas &gt; Grupos do Sistema</literal>, crie pelo menos um grupo em que seus sistemas ingressarão quando forem integrados. Os grupos são importantes para categorizar os sistemas de modo que você possa aplicar uma configuração ou ações a todo o conjunto de sistemas de uma vez. Por concepção, eles são similares aos rótulos no Kubernetes.
zh_cn: 在<literal>“系统”>“系统组”</literal>下，至少创建一个组，以便系统在初始配置时自动加入该组。组是对系统进行分类的重要方式，通过组可以一次性对整组系统应用配置或操作。其概念类似于 Kubernetes 中的标签。

source: Click <literal>+ Create Group</literal>
es: Haga clic en <literal>+ Create Group</literal> (Crear grupo).
ja: ［<literal>+グループの作成</literal>］をクリックします。
pt_br: Clique em <literal>+ Criar Grupo</literal>.
zh_cn: 单击 <literal>+ 创建组</literal>

source: Provide a short name, e.g., "Edge Nodes", and long description.
es: Proporcione un nombre corto, por ejemplo, "Nodos periféricos", y una descripción detallada.
ja: 短い名前(「エッジノード 」など)と長い説明を入力します。
pt_br: Insira um nome abreviado, por exemplo, "Nós de borda", e uma descrição longa.
zh_cn: 提供一个简短名称（例如“边缘节点”）和详细说明。

source: Under <literal>Systems &gt; Activation Keys</literal>, create at least one activation key. Activation keys can be thought of as a configuration profile that is automatically applied to systems when they are onboarded to SUSE Multi-Linux Manager. If you want certain edge nodes to be added to different groups or use different configuration, you can create separate activation keys for them and use them later in Edge Image Builder to create customized installation media.
es: En <literal>Systems &gt; Activation Keys</literal> (Sistemas > Claves de activación), cree al menos una clave de activación. Las claves de activación pueden considerarse como un perfil de configuración que se aplica automáticamente a los sistemas cuando se incorporan a SUSE Multi-Linux Manager. Si desea que determinados nodos periféricos se añadan a diferentes grupos o usen una configuración diferente, puede crear claves de activación independientes para ellos y utilizarlas posteriormente en Edge Image Builder para crear medios de instalación personalizados.
ja: <literal>［システム］ &gt;［アクティベーションキー］</literal>で、少なくとも1つのアクティベーションキーを作成します。アクティベーションキーは、システムが SUSE Multi-Linux Managerにオンボードされたときに自動的に適用される設定プロファイルと考えることができます。特定のエッジノードを異なるグループに追加したり、異なる設定を使用したりする場合は、それら用に個別のアクティベーションキーを作成し、後でEdge Image Builderでカスタマイズしたインストールメディアを作成する際に使用できます。
pt_br: Em <literal>Sistemas &gt; Chaves de ativação</literal>, crie pelo menos uma chave de ativação. Pense nas chaves de ativação como perfis de configuração que são automaticamente aplicados aos sistemas depois de integrados ao SUSE Multi-Linux Manager. Para adicionar determinados nós de borda a grupos diferentes ou usar outra configuração, você pode criar chaves de ativação separadas para eles e usá-las no Edge Image Builder para criar uma mídia de instalação personalizada.
zh_cn: 在<literal>“系统”>“激活密钥”</literal>下，至少创建一个激活密钥。激活密钥可视为一种配置文件，为系统进行 SUSE Multi-Linux Manager 初始配置时会自动应用该配置。如果您希望特定边缘节点加入不同的组或使用不同的配置，可以为它们创建单独的激活密钥，之后在 Edge Image Builder 中使用这些密钥来创建自定义安装媒体。

source: A typical advanced use case for activation keys would be to assign your test clusters to the software channels with the latest updates and your production clusters to software channels that only get those latest updates once you’ve tested them in the test cluster.
es: Un caso de uso avanzado típico de las claves de activación sería asignar los clústeres de prueba a los canales de software con las últimas actualizaciones y los clústeres de producción a los canales de software que solo reciben esas últimas actualizaciones una vez que se han probado en el clúster de prueba.
ja: アクティベーションキーの典型的な高度なユースケースは、テストクラスタを最新の更新を含むソフトウェアチャンネルに割り当て、運用クラスタを、テストクラスタでテストした後にのみ最新の更新を取得するソフトウェアチャンネルに割り当てることです。
pt_br: Um caso de uso avançado comum das chaves de ativação é para atribuir clusters de teste aos canais de software com as atualizações mais recentes, e os clusters de produção aos canais de software que apenas recebem essas atualizações mais recentes depois que você as testou no cluster de teste.
zh_cn: 激活密钥的一个典型高级使用场景是：将测试群集分配到包含最新更新的软件通道，而生产群集则分配到仅会获取已在测试群集中验证过的那些最新更新的软件通道。

source: Click <literal>+ Create Key</literal>
es: Haga clic en <literal>+ Create Key</literal> (Crear clave).
ja: ［<literal>+キーの作成</literal>］をクリックします。
pt_br: Clique em <literal>+ Criar chave</literal>.
zh_cn: 单击 <literal>+ 创建密钥</literal>

source: Choose a short description, e.g., "Edge Nodes". Provide a unique name that identifies the key, e.g., "edge-x86_64" for your edge nodes with AMD64/Intel 64 hardware architecture. A number prefix is automatically added to the key. For the default organization, the number is always "1". If you create additional organizations in SUSE Multi-Linux Manager and create keys for them, that number may differ.
es: Elija una descripción corta, por ejemplo, "Nodos periféricos". Proporcione un nombre único que identifique la clave, por ejemplo, "edge-x86_64" para sus nodos periféricos con arquitectura de hardware AMD64/Intel 64. Se añade automáticamente un prefijo numérico a la clave. Para la organización predeterminada, el número es siempre "1". Si crea organizaciones adicionales en SUSE Multi-Linux Manager y crea claves para ellas, ese número puede ser diferente.
ja: 短い説明を選択します(「エッジノード」など)。キーを識別する一意の名前を指定します(AMD64/Intel 64ハードウェアアーキテクチャを備えたエッジノードの場合は 「edge-x86_64 」など)。番号のプレフィックスが自動的にキーに追加されます。デフォルトの組織の場合、番号は常に「1」です。SUSE Multi-Linux Managerで追加の組織を作成し、これらの組織のキーを作成する場合、この番号は異なる可能性があります。
pt_br: Escolha uma descrição resumida, por exemplo, "Nós de borda". Insira um nome exclusivo que identifique a chave, por exemplo, "edge-x86_64" para os nós de borda com arquitetura de hardware AMD64/Intel 64. Um prefixo de número é automaticamente adicionado à chave. Para a organização padrão, o número é sempre "1". Se você criar mais organizações no SUSE Multi-Linux Manager e gerar chaves para elas, esse número poderá ser diferente.
zh_cn: 输入简短说明（例如“边缘节点”），并提供一个唯一名称来标识该密钥（例如，对于硬件体系结构为 AMD64/Intel 64 的边缘节点，可命名为“edge-x86_64”）。密钥前面会自动添加一个数字，默认组织的前缀始终为“1”；如果在 SUSE Multi-Linux Manager 中创建其他组织并为其创建密钥，前缀数字可能会不同。

source: If you haven’t created any cloned software channels, you can keep the setting for the Base Channel to "SUSE Manager Default". This will automatically assign the correct SUSE update repository for your edge nodes.
es: Si no ha creado ningún canal de software duplicado, puede conservar la configuración del canal base como "SUSE Manager Default" (Predeterminada de SUSE Manager). De este modo, se asignará automáticamente el repositorio de actualizaciones de SUSE adecuado para sus nodos periféricos.
ja: クローンソフトウェアチャンネルを作成していない場合は、ベースチャンネルの設定を「SUSE Managerの既定値」のままにしておくことができます。これにより、エッジノードに正しいSUSE更新リポジトリが自動的に割り当てられます。
pt_br: Se você não criou canais de software clonados, pode manter a configuração do canal base como "padrão do SUSE Manager". Isso atribui automaticamente o repositório de atualização correto do SUSE aos nós de borda.
zh_cn: 如果尚未创建任何克隆的软件通道，可将“基础通道”的设置保留为“SUSE Manager Default”，这会自动为边缘节点分配正确的 SUSE 更新储存库。

source: As "Child Channel", select the "include recommended" slider for the hardware architecture your activation key is used for. This will add the "SUSE-Manager-Tools-For-SL-Micro-6.1" channel.
es: Como "Child Channel" (Canal secundario), seleccione el control deslizante "Include recommended" (Incluir recomendados) para la arquitectura de hardware para la que se utiliza su clave de activación. Esto añadirá el canal "SUSE-Manager-Tools-For-SL-Micro-6.1".
ja: 「子チャンネル」として、アクティベーションキーが使用されているハードウェアアーキテクチャの［推奨を含める］スライダを選択します。これにより、「SUSE-Manager-Tools-For-SL-Micro-6.1」チャンネルが追加されます。
pt_br: Como "canal filho", selecione o controle deslizante para "incluir recomendações" referente à arquitetura de hardware para a qual a chave de ativação é usada. Dessa forma, o "SUSE-Manager-Tools-For-SL-Micro-6.1" será adicionado ao canal.
zh_cn: 在“子通道”中，针对激活密钥适用的硬件体系结构，选择“包括建议项”滑块，这会添加“SUSE-Manager-Tools-For-SL-Micro-6.1”通道。

source: On the "Groups" tab, add the group you’ve created before. All nodes that are onboarded using this activation key will automatically be added to that group.
es: En la pestaña "Groups" (Grupos), añada el grupo que ha creado anteriormente. Todos los nodos que se incorporen utilizando esta clave de activación se añadirán automáticamente a ese grupo.
ja: ［グループ］タブで、以前に作成したグループを追加します。このアクティベーションキーを使用してオンボードされたすべてのノードがそのグループに自動的に追加されます。
pt_br: Na guia "Grupos", adicione o grupo criado. Todos os nós integrados por meio dessa chave de ativação serão automaticamente adicionados a esse grupo.
zh_cn: 在“组”选项卡中，添加之前创建的组。所有使用该激活密钥进行初始配置的节点都将自动添加到该组中。

source: Create a customized installation image with Edge Image Builder
es: Creación de una imagen de instalación personalizada con Edge Image Builder
ja: Edge Image Builderを使用したカスタマイズされたインストールイメージの作成
pt_br: Criar uma imagem de instalação personalizada com o Edge Image Builder
zh_cn: 使用 Edge Image Builder 创建自定义安装映像

source: To use Edge Image Builder, you only need an environment where you can start a Linux-based container with podman.
es: Para usar Edge Image Builder, solo necesita un entorno en el que pueda iniciar un contenedor basado en Linux con Podman.
ja: Edge Image Builderを使用するには、PodmanでLinuxベースのコンテナを起動できる環境のみが必要です。
pt_br: Para usar o Edge Image Builder, você precisa apenas de um ambiente para iniciar o contêiner baseado em Linux com o Podman.
zh_cn: 要使用 Edge Image Builder，您只需要拥有一个可通过 Podman 启动基于 Linux 的容器的环境。

source: For a minimal lab setup, we can actually use the same virtual machine SUSE Multi-Linux Manager Server is running on. Please make sure that you have enough disk space in the virtual machine! This is not a recommended setup for production use. See <xref linkend="id-prerequisites-2"/> for host operating systems we have tested Edge Image Builder with.
es: Para una configuración mínima del laboratorio, es posible usar la misma máquina virtual en la que se ejecuta SUSE Multi-Linux Manager Server. Asegúrese de que dispone de suficiente espacio en disco en la máquina virtual. Esta configuración no es recomendable en entornos de producción. Consulte la <xref linkend="id-prerequisites-2"/> para conocer los sistemas operativos host con los que hemos probado Edge Image Builder.
ja: 最小限のラボのセットアップでは、SUSE Multi-Linux Manager Serverが実行しているのと同じ仮想マシンを実際に使用できます。仮想マシンに十分なディスク容量があることを確認してください。これは運用環境での使用には推奨されないセットアップです。Edge Image Builderをテストしたホストオペレーティングシステムについては、 <xref linkend="id-prerequisites-2"/>を参照してください。
pt_br: Na verdade, para configuração mínima de laboratório, podemos usar a mesma máquina virtual na qual o SUSE Multi-Linux Manager Server está em execução. Verifique se você tem espaço em disco suficiente na máquina virtual! Essa configuração não é recomendada para uso em produção. Consulte a <xref linkend="id-prerequisites-2"/> para saber quais sistemas operacionais host foram testados com o Edge Image Builder.
zh_cn: 在极简实验设置中，我们实际上可以使用运行 SUSE Multi-Linux Manager 服务器的同一台虚拟机。请确保该虚拟机有充足的磁盘空间！但不建议在生产环境中采用这种设置。有关我们已测试过与 Edge Image Builder 兼容的主机操作系统，请参见<xref linkend="id-prerequisites-2"/>。

source: Log into your SUSE Multi-Linux Manager Server host as root.
es: Inicie sesión en su host de SUSE Multi-Linux Manager Server como usuario root.
ja: SUSE Multi-Linux Managerサーバホストにrootとしてログインします。
pt_br: Faça login no host do SUSE Multi-Linux Manager Server como root.
zh_cn: 以 root 身份登录 SUSE Multi-Linux Manager 服务器主机。

source: Pull the Edge Image Builder container:
es: Extraiga el contenedor de Edge Image Builder:
ja: Edge Image Builderコンテナをプルします。
pt_br: Acesse o contêiner do Edge Image Builder:
zh_cn: 提取 Edge Image Builder 容器：
