Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Ironic conductor (from management cluster)
es: Conductor de Ironic (del clúster de gestión)
ja: Ironic Conductor (管理クラスタから)
zh_cn: Ironic 控制器（来自管理群集）

source: Redfish API access (HTTP)
es: Acceso a la API Redfish (HTTP)
ja: Redfish APIアクセス(HTTP)
zh_cn: Redfish API 访问 (HTTP)

source: Redfish API access (HTTPS)
es: Acceso a la API Redfish (HTTPS)
ja: Redfish APIアクセス(HTTPS)
zh_cn: Redfish API 访问 (HTTPS)

source: Once the IPA ramdisk image loaded on the BMC <literal>virtual media</literal> is used to bootup the downstream server image, the hardware inspection phase begins. The following table lists the ports exposed by a running IPA ramdisk image:
es: Una vez que la imagen ramdisk de IPA cargada en el <literal>medio virtual</literal> del BMC se utiliza para arrancar la imagen del servidor descendente, comienza la fase de inspección del hardware. La siguiente tabla muestra los puertos expuestos por una imagen ramdisk de IPA en ejecución:
ja: BMC <literal>仮想メディア</literal> にロードされたIPA ramdiskイメージを使用してダウンストリームサーバイメージを起動すると、ハードウェア検査フェーズが開始されます。以下の表は、実行中のIPA ramdiskイメージによって公開されるポートをリストしています。
zh_cn: 当 BMC <literal>虚拟媒体</literal>中加载的 IPA 内存盘映像用于引导下游服务器映像时，将开始硬件检查阶段。下表列出了运行中的 IPA 内存盘映像所公开的端口：

source: Inbound Network Rules for Downstream Nodes - <literal>Metal<superscript>3</superscript>/Ironic</literal> Provisioning phase
es: Reglas de red entrante para nodos descendentes: fase de aprovisionamiento de <literal>Metal<superscript>3</superscript>/Ironic</literal>
ja: ダウンストリームノードの受信ネットワークルール - <literal>Metal<superscript>3</superscript>/Ironic</literal>プロビジョニングフェーズ
zh_cn: 下游节点的入站网络规则 - <literal>Metal<superscript>3</superscript>/Ironic</literal> 置备阶段

source: Any source that requires SSH access to IPA ramdisk image
es: Cualquier fuente que requiera acceso SSH a la imagen ramdisk de IPA
ja: IPA ramdiskイメージへのSSHアクセスを必要とする任意のソース
zh_cn: 需要通过 SSH 访问 IPA 内存盘映像的任何来源

source: SSH access to a being inspected downstream cluster node
es: Acceso SSH a un nodo de clúster descendente que se esté inspeccionando
ja: 検査対象のダウンストリームクラスタノードへのSSHアクセス
zh_cn: 对正在检查的下游群集节点的 SSH 访问权限

source: Ironic commands towards the running ramdisk image
es: Comandos de Ironic para ejecutar la imagen ramdisk en ejecución
ja: 実行中のramdiskイメージに対するIronicコマンド
zh_cn: 针对运行中内存盘映像的 Ironic 命令

source: Once the baremetal host is properly provisioned and has joined a downstream Kubernetes cluster, it exposes the following ports:
es: Una vez que el host bare metal está correctamente aprovisionado y se ha unido a un clúster descendente de Kubernetes, expone los siguientes puertos:
ja: ベアメタルホストが適切にプロビジョニングされ、ダウンストリームKubernetesクラスタに参加すると、以下のポートが公開されます。
zh_cn: 当裸机主机完成正确置备并加入下游 Kubernetes 群集后，会公开以下端口：

source: Inbound Network Rules for Downstream Nodes
es: Reglas de red entrante para nodos descendentes
ja: ダウンストリームノードの受信ネットワークルール
zh_cn: 下游节点的入站网络规则

source: SSH access to downstream cluster nodes
es: Acceso SSH a los nodos de los clústeres descendentes
ja: ダウンストリームクラスタノードへのSSHアクセス
zh_cn: 对下游群集节点的 SSH 访问权限

source: RKE2 (downstream cluster) server nodes
es: Nodos de servidor RKE2 (clúster descendente)
ja: RKE2 (ダウンストリームクラスタ)サーバノード
zh_cn: RKE2（下游群集）服务器节点

source: Any downstream cluster node; any external (to the downstream cluster) Kubernetes client.
es: Cualquier nodo de clúster descendente; cualquier cliente de Kubernetes externo (al clúster descendente).
ja: 任意のダウンストリームクラスタノード、(ダウンストリームクラスタ)外部の任意のKubernetesクライアント
zh_cn: 任何下游群集节点；任何（下游群集外部的）Kubernetes 客户端。

source: RKE2 server and agent nodes (downstream cluster)
es: Servidor y nodos de agente de RKE2 (clúster descendente)
ja: RKE2サーバおよびエージェントノード(ダウンストリームクラスタ)
zh_cn: RKE2 服务器和代理节点（下游群集）

source: Any downstream cluster node
es: Cualquier nodo de clúster descendente
ja: 任意のダウンストリームクラスタノード
zh_cn: 任何下游群集节点

source: <literal>kubelet</literal> read-only access
es: Acceso de solo lectura a <literal>kubelet</literal>
ja: <literal>kubelet</literal>読み取り専用アクセス
zh_cn: <literal>kubelet</literal> 只读访问权限

source: Any external (to the downstream cluster) source accessing a service exposed on the primary network through a <literal>spec.type: NodePort</literal> or <literal>spec.type: LoadBalancer</literal> <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">Service API object</link>
es: Cualquier fuente externa (al clúster descendente) que acceda a un servicio expuesto en la red principal a través de un <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">objeto API de servicio</link> <literal>spec.type: NodePort</literal> o <literal>spec.type: LoadBalancer</literal>
ja: <literal>spec.type: NodePort</literal>または<literal>spec.type: LoadBalancer</literal> <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">Service APIオブジェクト</link>を介してプライマリネットワークで公開されているサービスにアクセスする、(ダウンストリームクラスタ)外部の任意のソース
zh_cn: 通过 <literal>spec.type: NodePort</literal> 或 <literal>spec.type: LoadBalancer</literal> <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">Service API 对象</link>访问主网络上所公开服务的任何（下游群集外部的）来源

source: CNI specific port requirements
es: Requisitos específicos del puerto de CNI
ja: CNI固有のポート要件
zh_cn: CNI 特有的端口要求

source: Each supported CNI variant comes with its own set of port requirements. For more details, refer <link xl:href="https://docs.rke2.io/install/requirements#cni-specific-inbound-network-rules">CNI Specific Inbound Network Rules</link> in RKE2 documentation.
es: Cada variante de CNI compatible tiene su propio conjunto de requisitos de puerto. Para obtener más información, consulte <link xl:href="https://docs.rke2.io/install/requirements#cni-specific-inbound-network-rules">CNI Specific Inbound Network Rules</link> (Reglas de red entrantes específicas de CNI) en la documentación de RKE2.
ja: サポートされている各CNIバリアントには、独自のポート要件が伴います。詳細については、RKE2ドキュメントの「<link xl:href="https://docs.rke2.io/install/requirements#cni-specific-inbound-network-rules">CNI Specific Inbound Network Rules (CNI固有の受信ネットワークルール)</link>」を参照してください。
zh_cn: 每个受支持的 CNI 变体都有其自身的端口要求集。有关详细信息，请参见 RKE2 文档中的 <link xl:href="https://docs.rke2.io/install/requirements#cni-specific-inbound-network-rules">CNI Specific Inbound Network Rules</link>。

source: When <literal>cilium</literal> is set as default/primary CNI plug-in, following TCP port is additionally exposed when the <literal>cilium-operator</literal> workload is configured to expose metrics outside the Kubernetes cluster on which it is deployed. This ensures that an external <literal>Prometheus</literal> server instance running outside that Kubernetes cluster can still collect these metrics.
es: Si <literal>Cilium</literal> se ha definido como complemento de CNI predeterminado/principal, el puerto TCP siguiente también se expone cuando la carga de trabajo <literal>cilium-operator</literal> se configura para exponer las métricas fuera del clúster de Kubernetes donde se ha desplegado. Esto garantiza que las instancias de servidor <literal>Prometheus</literal> externas que se ejecuten fuera del clúster de Kubernetes puedan seguir recopilando esas métricas.
ja: <literal>cilium</literal>がデフォルト/プライマリCNIプラグインとして設定されている場合、<literal>cilium-operator</literal>ワークロードが、デプロイされるKubernetesクラスタの外部にメトリクスを公開するように設定されると、以下のTCPポートが付加的に公開されます。これにより、そのKubernetesクラスタ外部で実行されている外部<literal>Prometheus</literal>サーバインスタンスが引き続きこれらのメトリクスを収集できるようになります。
zh_cn: 当 <literal>cilium</literal> 设为默认/主 CNI 插件时，如果 <literal>cilium-operator</literal> 工作负载配置为向其部署所在的 Kubernetes 群集外部公开指标，则会额外公开以下 TCP 端口。这可确保在该 Kubernetes 群集外部运行的外部 <literal>Prometheus</literal> 服务器实例仍能收集这些指标。

source: This is the default option when deploying <literal>cilium</literal> via the rke2-cilium Helm chart.
es: Esta es la opción predeterminada al desplegar <literal>Cilium</literal> a través del chart de Helm de rke2-cilium.
ja: これは、rke2-cilium Helmチャートを介して<literal>cilium</literal>をデプロイする際のデフォルトオプションです。
zh_cn: 通过 rke2-cilium Helm chart 部署 <literal>cilium</literal> 时，这是默认选项。

source: Inbound Network Rules for Management/Downstream Nodes - external metrics exposure from <literal>cilium-operator</literal> enabled
es: Reglas de red entrantes para nodos de gestión/descendentes: exposición externa de métricas de <literal>cilium-operator</literal> habilitada
ja: 管理/ダウンストリームノード用の受信ネットワークルール - <literal>cilium-operator</literal>からの外部メトリクス公開が有効
zh_cn: 管理/下游节点的入站网络规则 - 启用 <literal>cilium-operator</literal> 后，外部指标公开

source: External (to the Kubernetes cluster) metrics collector
es: Recopilador de métricas externo (al clúster de Kubernetes)
ja: (Kubernetesクラスタ)外部のメトリクスコレクタ
zh_cn: （Kubernetes 群集外部的）指标收集器

source: cilium-operator metrics exposure
es: Exposición de métricas de cilium-operator
ja: cilium-operatorメトリクス公開
zh_cn: cilium-operator 指标公开

source: Services (DHCP, DNS, etc.)
es: Servicios (DHCP, DNS, etc.)
ja: サービス(DHCP、DNSなど)
pt_br: Serviços (DHCP, DNS etc.)
zh_cn: 服务（DHCP、DNS 等）

source: Some external services like <literal>DHCP</literal>, <literal>DNS</literal>, etc. could be required depending on the kind of environment where they are deployed:
es: Algunos servicios externos como <literal>DHCP</literal>, <literal>DNS</literal>, etc. podrían ser necesarios dependiendo del tipo de entorno en el que se desplieguen:
ja: デプロイ先の環境の種類によっては、<literal>DHCP</literal>、<literal>DNS</literal>などの外部サービスが必要な場合があります。
pt_br: Alguns serviços externos, como <literal>DHCP</literal>, <literal>DNS</literal> etc., podem ser necessários, dependendo do tipo de ambiente em que estão implantados:
zh_cn: 可能需要使用一些外部服务（例如 <literal>DHCP</literal>、<literal>DNS</literal> 等），具体取决于部署环境的类型：

source: <emphasis role="strong">Connected environment</emphasis>: In this case, the nodes will be connected to the Internet (via routing L3 protocols) and the external services will be provided by the customer.
es: <emphasis role="strong">Entorno conectado</emphasis>: en este caso, los nodos estarán conectados a Internet (a través de protocolos de enrutamiento L3) y el cliente proporcionará los servicios externos.
ja: <emphasis role="strong">接続環境</emphasis>: この場合、ノードはインターネットに接続され(L3ルーティングプロトコルを使用)、外部サービスはお客様が提供します。
pt_br: <emphasis role="strong">Ambiente conectado</emphasis>: nesse caso, os nós são conectados à Internet (por protocolos de roteamento L3), e o cliente providencia os serviços externos.
zh_cn: <emphasis role="strong">联网环境</emphasis>：在这种情况下，节点将连接到互联网（通过路由 L3 协议），外部服务将由客户提供。

source: <emphasis role="strong">Disconnected / air-gap environment</emphasis>: In this case, the nodes will not have Internet IP connectivity and additional services will be required to locally mirror content required by the directed network provisioning workflow.
es: <emphasis role="strong">Entorno desconectado/aislado</emphasis>: en este caso, los nodos no tendrán conectividad IP a Internet y se necesitarán servicios adicionales para duplicar localmente el contenido requerido por el flujo de trabajo de aprovisionamiento de red dirigida.
ja: <emphasis role="strong">非接続/エアギャップ環境</emphasis>: この場合、ノードはインターネットにIPで接続されないため、サービスを追加して、ダイレクトネットワークプロビジョニングワークフローに必要なコンテンツをローカルにミラーリングする必要があります。
pt_br: <emphasis role="strong">Ambiente desconectado/air-gapped</emphasis>: nesse caso, os nós não têm conectividade IP de Internet e são exigidos serviços adicionais para espelhar localmente o conteúdo necessário pelo fluxo de trabalho de provisionamento de rede direcionado.
zh_cn: <emphasis role="strong">离线/隔离环境</emphasis>：在这种情况下，节点未建立互联网 IP 连接，因此需要通过其他服务在本地镜像定向网络置备工作流程所需的内容。

source: <emphasis role="strong">File server</emphasis>: A file server is used to store the OS images to be provisioned on the downstream cluster nodes during the directed network provisioning workflow. The <literal>Metal<superscript>3</superscript></literal> Helm chart can deploy a media server to store the OS images — check the following section (<xref linkend="metal3-media-server"/>), but it is also possible to use an existing local webserver.
es: <emphasis role="strong">Servidor de archivos</emphasis>: se utiliza para almacenar las imágenes del sistema operativo que se aprovisionarán en los nodos del clúster descendente durante el flujo de trabajo de aprovisionamiento de red dirigida. El chart de Helm de <literal>Metal<superscript>3</superscript></literal> puede desplegar un servidor multimedia para almacenar las imágenes del sistema operativo, consulte la siguiente sección (<xref linkend="metal3-media-server"/>), pero también es posible utilizar un servidor Web local existente.
ja: <emphasis role="strong">ファイルサーバ</emphasis>: ファイルサーバは、ダイレクトネットワークプロビジョニングワークフローの中で、ダウンストリームクラスタノードにプロビジョニングするOSイメージを保存するために使用されます。<literal>Metal<superscript>3</superscript></literal> HelmチャートでメディアサーバをデプロイしてOSイメージを保存できます。次のセクション(<xref linkend="metal3-media-server"/>)を確認してください。ただし、既存のローカルWebサーバを使用することもできます。
pt_br: <emphasis role="strong">Servidor de arquivos</emphasis>: usado para armazenar as imagens de sistema operacional que são provisionadas nos nós do cluster downstream durante o fluxo de trabalho de provisionamento de rede direcionado. O gráfico Helm do <literal>Metal<superscript>3</superscript></literal> pode implantar um servidor de mídia para armazenar as imagens de sistema operacional. Consulte a seguinte seção (<xref linkend="metal3-media-server"/>), mas também é possível usar um servidor web local existente.
zh_cn: <emphasis role="strong">文件服务器</emphasis>：文件服务器用于在执行定向网络置备工作流程期间存储将在下游群集节点上置备的操作系统映像。<literal>Metal<superscript>3</superscript></literal> Helm chart 可以部署媒体服务器来存储操作系统映像 — 请查看下文内容（<xref linkend="metal3-media-server"/>），但也可以使用现有的本地 Web 服务器。

source: Disabling systemd services
es: Inhabilitación de servicios systemd
ja: systemdサービスの無効化
pt_br: Desabilitando os serviços systemd
zh_cn: 禁用 systemd 服务

source: For Telco workloads, it is important to disable or configure properly some of the services running on the nodes to avoid any impact on the workload performance running on the nodes (latency).
es: Para las cargas de trabajo de telecomunicaciones, es importante inhabilitar o configurar adecuadamente algunos de los servicios que se ejecutan en los nodos para evitar cualquier impacto en el rendimiento de la carga de trabajo que se ejecuta en los nodos (latencia).
ja: 通信ワークロードの場合、ノード上で実行されているワークロードのパフォーマンス(レイテンシ)に影響を及ぼさないように、ノード上で実行されている一部のサービスを無効にしたり、適切に設定することが重要です。
pt_br: Para cargas de trabalho de telecomunicações, é importante desabilitar ou configurar apropriadamente alguns dos serviços executados nos nós para evitar qualquer impacto no desempenho das cargas de trabalho em execução nos nós (latência).
zh_cn: 对于电信工作负载，必须禁用或正确配置节点上运行的一些服务，以免对节点上运行的工作负载的性能产生任何影响（延迟）。

source: <literal>rebootmgr</literal> is a service which allows to configure a strategy for reboot when the system has pending updates. For Telco workloads, it is really important to disable or configure properly the <literal>rebootmgr</literal> service to avoid the reboot of the nodes in case of updates scheduled by the system, to avoid any impact on the services running on the nodes.
es: <literal>rebootmgr</literal> es un servicio que permite configurar una estrategia de rearranque cuando el sistema tenga actualizaciones pendientes. Para las cargas de trabajo de telecomunicaciones, es muy importante inhabilitar o configurar correctamente el servicio <literal>rebootmgr</literal> para evitar el rearranque de los nodos en caso de actualizaciones programadas por el sistema, con el fin de evitar cualquier impacto en los servicios que se ejecutan en los nodos.
ja: <literal>rebootmgr</literal>は、システムに保留中の更新がある場合の再起動方針を設定できるサービスです。通信ワークロードでは、システムによってスケジュールされた更新がある場合、<literal>rebootmgr</literal>サービスを無効にするか正しく設定してノードの再起動を回避し、ノードで実行中のサービスへの影響を避けることが非常に重要です。
pt_br: <literal>rebootmgr</literal> é um serviço que permite configurar uma estratégia de reinicialização quando o sistema tem atualizações pendentes. Para cargas de trabalho de telecomunicações, é realmente importante desabilitar ou configurar apropriadamente o serviço <literal>rebootmgr</literal> para evitar a reinicialização dos nós em caso de atualizações programadas pelo sistema, a fim de evitar qualquer impacto nos serviços executados nos nós.
zh_cn: <literal>rebootmgr</literal> 是当系统中存在未完成的更新时用于配置重引导策略的服务。对于电信工作负载，必须禁用或正确配置 <literal>rebootmgr</literal> 服务，以免在系统安排了更新时重引导节点，从而避免对节点上运行的服务造成任何影响。

source: For more information about <literal>rebootmgr</literal>, see <link xl:href="https://github.com/SUSE/rebootmgr">rebootmgr GitHub repository</link>.
es: Para obtener más información sobre <literal>rebootmgr</literal>, consulte el <link xl:href="https://github.com/SUSE/rebootmgr">repositorio GitHub de rebootmgr</link>.
ja: <literal>rebootmgr</literal>の詳細については、<link xl:href="https://github.com/SUSE/rebootmgr">rebootmgrのGitHubリポジトリ</link>を参照してください。
pt_br: Para obter mais informações sobre o <literal>rebootmgr</literal>, consulte o <link xl:href="https://github.com/SUSE/rebootmgr">repositório rebootmgr do GitHub</link>.
zh_cn: 有关 <literal>rebootmgr</literal> 的详细信息，请参见 <link xl:href="https://github.com/SUSE/rebootmgr">rebootmgr GitHub 代码库</link>。

source: Verify the strategy being used by running:
es: Verifique la estrategia que se está utilizando ejecutando:
ja: 次のコマンドを実行して、使用する方針を検証します。
pt_br: Verifique a estratégia usada executando este comando:
zh_cn: 运行以下命令来校验使用的策略：

source: and you could disable it by running:
es: Puede inhabilitarla ejecutando:
ja: また、次のコマンドを実行すると無効にすることができます。
pt_br: e você pode desabilitá-la executando:
zh_cn: 可以运行以下命令来禁用 rebootmgr：

source: or using the <literal>rebootmgrctl</literal> command:
es: O con el comando <literal>rebootmgrctl</literal>:
ja: または、<literal>rebootmgrctl</literal>コマンドを次のように使用できます。
pt_br: ou usando o comando <literal>rebootmgrctl</literal>:
zh_cn: 也可以使用 <literal>rebootmgrctl</literal> 命令：

source: This configuration to set the <literal>rebootmgr</literal> strategy can be automated using the directed network provisioning workflow. For more information, check the Automated Provisioning documentation (<xref linkend="atip-automated-provisioning"/>).
es: Esta configuración para establecer la estrategia de <literal>rebootmgr</literal> se puede automatizar mediante el flujo de trabajo de aprovisionamiento de red dirigida. Para obtener más información, consulte el capítulo correspondiente (<xref linkend="atip-automated-provisioning"/>).
ja: <literal>rebootmgr</literal>の方針を設定するこの設定は、ダイレクトネットワークプロビジョニングワークフローを使用して自動化できます。詳細については、自動化されたプロビジョニングに関するドキュメント(<xref linkend="atip-automated-provisioning"/>)を確認してください。
pt_br: É possível automatizar essa configuração para definir a estratégia <literal>rebootmgr</literal> usando o fluxo de trabalho de provisionamento de rede direcionado. Para obter mais informações, consulte a documentação sobre provisionamento automatizado (<xref linkend="atip-automated-provisioning"/>).
zh_cn: 可以使用定向网络置备工作流程来自动完成用于设置 <literal>rebootmgr</literal> 策略的此项配置。有关详细信息，请参见自动置备文档（<xref linkend="atip-automated-provisioning"/>）。

source: <literal>transactional-update</literal> is a service that allows automatic updates controlled by the system. For Telco workloads, it is important to disable the automatic updates to avoid any impact on the services running on the nodes.
es: <literal>transactional-update</literal> es un servicio que permite actualizaciones automáticas controladas por el sistema. Para las cargas de trabajo de telecomunicaciones, es importante inhabilitar las actualizaciones automáticas para evitar cualquier impacto en los servicios que se ejecutan en los nodos.
ja: <literal>transactional-update</literal>は、システムによって制御される自動更新を可能にするサービスです。通信ワークロードの場合、ノードで実行中のサービスに影響を及ぼさないように、自動更新を無効にすることが重要です。
pt_br: <literal>transactional-update</literal> é um serviço que permite que o sistema controle as atualizações automáticas. Para cargas de trabalho de telecomunicações, é importante desabilitar as atualizações automáticas para evitar qualquer impacto nos serviços executados nos nós.
zh_cn: <literal>transactional-update</literal> 是一项允许在系统控制下进行自动更新的服务。对于电信工作负载，必须禁用自动更新，以免对节点上运行的服务产生任何影响。

source: To disable the automatic updates, you can run:
es: Para inhabilitar las actualizaciones automáticas, puede ejecutar:
ja: 自動更新を無効にするには、次のコマンドを実行できます。
pt_br: Para desabilitar as atualizações automáticas, execute:
zh_cn: 要禁用自动更新，可以运行：

source: <literal>fstrim</literal> is a service that allows to trim the filesystems automatically every week. For Telco workloads, it is important to disable the automatic trim to avoid any impact on the services running on the nodes.
es: <literal>fstrim</literal> es un servicio que permite recortar los sistemas de archivos automáticamente cada semana. Para las cargas de trabajo de telecomunicaciones, es importante inhabilitar el recorte automático para evitar cualquier impacto en los servicios que se ejecutan en los nodos.
ja: <literal>fstrim</literal>は、ファイルシステムを毎週自動的にトリミングできるサービスです。通信ワークロードでは、ノードで実行中のサービスに影響を及ぼさないように、自動トリミングを無効にすることが重要です。
pt_br: <literal>fstrim</literal> é um serviço que permite cortar os sistemas de arquivos automaticamente toda semana. Para cargas de trabalho de telecomunicações, é importante desabilitar o corte automático para evitar qualquer impacto nos serviços executados nos nós.
zh_cn: <literal>fstrim</literal> 是一种允许每周自动剪裁文件系统的服务。对于电信工作负载，必须禁用自动剪裁，以免对节点上运行的服务产生任何影响。

source: To disable the automatic trim, you can run:
es: Para inhabilitar el recorte automático, puede ejecutar:
ja: 自動トリミングを無効にするには、次のコマンドを実行できます。
pt_br: Para desabilitar o corte automático, execute:
zh_cn: 要禁用自动剪裁，可以运行：

source: Setting up the management cluster
es: Configuración del clúster de gestión
ja: 管理クラスタの設定
pt_br: Configurando o cluster de gerenciamento
zh_cn: 设置管理群集

source: The management cluster is the part of SUSE Telco Cloud that is used to manage the provision and lifecycle of the runtime stacks. From a technical point of view, the management cluster contains the following components:
es: El clúster de gestión es la parte de SUSE Telco Cloud que se emplea para gestionar el aprovisionamiento y el ciclo de vida de las pilas de entorno de ejecución. Desde un punto de vista técnico, el clúster de gestión contiene los componentes siguientes:
ja: 管理クラスタは、SUSE Telco Cloud内でランタイムスタックのプロビジョニングとライフサイクルを管理するために使用されます。技術的観点からは、管理クラスタには次のコンポーネントが含まれています。
zh_cn: 管理群集是 SUSE Telco Cloud 的组成部分，用于管理运行时堆栈置备和生命周期。从技术角度而言，管理群集包含以下组件：

source: <literal>SUSE Linux Micro</literal> as the OS. Depending on the use case, some configurations like networking, storage, users and kernel arguments can be customized.
es: <literal>SUSE Linux Micro</literal> como sistema operativo. Dependiendo del caso práctico, será posible personalizar algunas configuraciones como la red, el almacenamiento, los usuarios y los argumentos del kernel.
ja: <literal>SUSE Linux Micro</literal> (OS)。ユースケースに応じて、ネットワーキング、ストレージ、ユーザ、カーネル引数などの一部の設定をカスタマイズできます。
pt_br: <literal>SUSE Linux Micro</literal> como sistema operacional. Dependendo do caso de uso, é possível personalizar algumas configurações, como rede, armazenamento, usuários e argumentos do kernel.
zh_cn: <literal>SUSE Linux Micro</literal>（操作系统），可以根据使用场景自定义某些配置，例如网络、存储、用户和内核参数。
