Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <xref linkend="components-eib"/> deploys Helm charts by creating a <literal>HelmChart</literal> resource and utilizing the <literal>helm-controller</literal> introduced by the <link xl:href="https://docs.rke2.io/helm">RKE2</link>/<link xl:href="https://docs.k3s.io/helm">K3s</link> Helm integration feature.
es: <xref linkend="components-eib"/> despliega charts de Helm creando un recurso <literal>HelmChart</literal> y usando el <literal>helm-controller</literal> introducido por la función de integración de Helm <link xl:href="https://docs.rke2.io/helm">RKE2</link>/<link xl:href="https://docs.k3s.io/helm">K3s</link>.
ja: <xref linkend="components-eib"/>は、<literal>HelmChart</literal>リソースを作成し、<link xl:href="https://docs.rke2.io/helm">RKE2</link>/<link xl:href="https://docs.k3s.io/helm">K3s</link> Helm統合機能によって導入された<literal>helm-controller</literal>を利用して、Helmチャートをデプロイします。
pt_br: O <xref linkend="components-eib"/> implanta gráficos Helm criando um recurso <literal>HelmChart</literal> e usando o <literal>helm-controller</literal> introduzido pelo recurso de integração do Helm <link xl:href="https://docs.rke2.io/helm">RKE2</link>/<link xl:href="https://docs.k3s.io/helm">K3s</link>.
zh_cn: <xref linkend="components-eib"/> 通过创建 <literal>HelmChart</literal> 资源并利用 <link xl:href="https://docs.rke2.io/helm">RKE2</link>/<link xl:href="https://docs.k3s.io/helm">K3s</link> Helm 集成功能引入的 <literal>helm-controller</literal> 来部署 Helm chart。

source: To ensure that a Helm chart deployed via <literal>EIB</literal> is successfully upgraded, users need to do an upgrade over the respective <literal>HelmChart</literal> resources.
es: Para garantizar que un chart de Helm desplegado mediante <literal>EIB</literal> se actualice correctamente, los usuarios deben realizar una actualización de los recursos <literal>HelmChart</literal> correspondientes.
ja: <literal>EIB</literal>を介してデプロイされたHelmチャートが正常にアップグレードされるようにするには、ユーザは各<literal>HelmChart</literal>リソースに対してアップグレードを実行する必要があります。
pt_br: Para garantir que o upgrade do gráfico Helm implantado pelo <literal>EIB</literal> seja feito com sucesso, os usuários precisam fazer upgrade dos respectivos recursos <literal>HelmChart</literal>.
zh_cn: 为确保通过 <literal>EIB</literal> 部署的 Helm chart 成功升级，用户需要对相应的 <literal>HelmChart</literal> 资源执行升级操作。

source: Below you can find information on:
es: A continuación, encontrará más información:
ja: 以下に関する情報が提供されています。
pt_br: Veja a seguir informações sobre:
zh_cn: 下文提供了以下信息：

source: The general overview (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>) of the upgrade process.
es: La descripción general (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>) del proceso de actualización.
ja: アップグレードプロセスの一般的な概要(<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>)。
pt_br: A visão geral (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>) do processo de upgrade.
zh_cn: 升级过程的一般概述（<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-overview"/>）。

source: The necessary upgrade steps (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>).
es: Los pasos necesarios para la actualización (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>).
ja: 必要なアップグレード手順(<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>)。
pt_br: As etapas de upgrade necessárias (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>).
zh_cn: 必要的升级步骤（<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-steps"/>）。

source: An example (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>) showcasing a <link xl:href="https://longhorn.io">Longhorn</link> chart upgrade using the explained method.
es: Un ejemplo (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>) que muestra la actualización de un chart de <link xl:href="https://longhorn.io">Longhorn</link> con el método explicado.
ja: 説明した方法を使用した<link xl:href="https://longhorn.io">Longhorn</link>チャートアップグレードを示す例(<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>)。
pt_br: Um exemplo (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>) que demonstra o upgrade de um gráfico <link xl:href="https://longhorn.io">Longhorn</link> usando o método explicado.
zh_cn: 展示使用所述方法进行 <link xl:href="https://longhorn.io">Longhorn</link> chart 升级的示例（<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-example"/>）。

source: How to use the upgrade process with a different GitOps tool (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>).
es: Cómo usar el proceso de actualización con una herramienta GitOps diferente (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>).
ja: 異なるGitOpsツールを使用したアップグレードプロセスを使用する方法(<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>)。
pt_br: Como usar o processo de upgrade com uma ferramenta GitOps diferente (<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>).
zh_cn: 如何使用其他 GitOps 工具完成升级过程（<xref linkend="management-day2-fleet-helm-upgrade-procedure-eib-deployed-chart-upgrade-third-party"/>）。

source: Helm charts that are deployed via <literal>EIB</literal> are upgraded through a <literal>fleet</literal> called <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/eib-charts-upgrader">eib-charts-upgrader</link>.
es: Los charts de Helm que se despliegan mediante <literal>EIB</literal> se actualizan usando una <literal>flota</literal> llamada <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/eib-charts-upgrader">eib-charts-upgrader</link>.
ja: <literal>EIB</literal>を介してデプロイされたHelmチャートは、<link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/eib-charts-upgrader">eib-charts-upgrader</link>と呼ばれる<literal>フリート</literal>を通じてアップグレードされます。
zh_cn: 通过 <literal>EIB</literal> 部署的 Helm chart 由名为 <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/eib-charts-upgrader">eib-charts-upgrader</link> 的 <literal>Fleet</literal> 执行升级。

source: This <literal>fleet</literal> processes <emphasis role="strong">user-provided</emphasis> data to <emphasis role="strong">update</emphasis> a specific set of HelmChart resources.
es: Esta <literal>flota</literal> procesa los datos <emphasis role="strong">proporcionados por el usuario</emphasis> para <emphasis role="strong">actualizar</emphasis> un conjunto específico de recursos HelmChart.
ja: この<literal>フリート</literal>は、<emphasis role="strong">ユーザが提供した</emphasis>データを処理し、特定のHelmChartリソースセットを<emphasis role="strong">更新</emphasis>します。
pt_br: Essa instância do <literal>Fleet</literal> processa os dados <emphasis role="strong">fornecidos pelo usuário</emphasis> para <emphasis role="strong">atualizar</emphasis> um conjunto específico de recursos HelmChart.
zh_cn: 该 <literal>Fleet</literal> 会处理<emphasis role="strong">用户提供的</emphasis>数据，以<emphasis role="strong">更新</emphasis>一组特定的 HelmChart 资源。

source: Updating these resources triggers the <link xl:href="https://github.com/k3s-io/helm-controller">helm-controller</link>, which <emphasis role="strong">upgrades</emphasis> the Helm charts associated with the modified <literal>HelmChart</literal> resources.
es: Al actualizar estos recursos se activa <link xl:href="https://github.com/k3s-io/helm-controller">helm-controller</link>, que <emphasis role="strong">actualiza</emphasis> los charts de Helm asociados con los recursos <literal>HelmChart</literal> modificados.
ja: これらのリソースを更新すると、 <link xl:href="https://github.com/k3s-io/helm-controller">helm-controller</link>がトリガされ、変更された<literal>HelmChart</literal>リソースに関連付けられているHelmチャートが<emphasis role="strong">アップグレード</emphasis>されます。
pt_br: A atualização desses recursos aciona o <link xl:href="https://github.com/k3s-io/helm-controller">helm-controller</link>, que faz <emphasis role="strong">upgrade</emphasis> dos gráficos Helm associados aos recursos <literal>HelmChart</literal> modificados.
zh_cn: 更新这些资源会触发 <link xl:href="https://github.com/k3s-io/helm-controller">helm-controller</link>，后者会<emphasis role="strong">升级</emphasis>与修改后的 <literal>HelmChart</literal> 资源相关联的 Helm chart。

source: The user is only expected to:
es: Solo se espera de los usuarios que:
ja: ユーザは以下を行うことのみ求められます。
pt_br: O usuário precisa apenas:
zh_cn: 用户只需执行以下操作：

source: Locally <link xl:href="https://helm.sh/docs/helm/helm_pull/">pull</link> the archives for each Helm chart that needs to be upgraded.
es: <link xl:href="https://helm.sh/docs/helm/helm_pull/">Extraigan</link> localmente los archivos de cada chart de Helm que deba actualizarse.
ja: アップグレードが必要な各Helmチャートのアーカイブをローカルで<link xl:href="https://helm.sh/docs/helm/helm_pull/">プル</link>します。
pt_br: <link xl:href="https://helm.sh/docs/helm/helm_pull/">Obter</link> localmente os arquivos para cada gráfico Helm que precisa de upgrade.
zh_cn: 从本地<link xl:href="https://helm.sh/docs/helm/helm_pull/">提取</link>需要升级的每个 Helm chart 的归档。

source: Pass these archives to the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/generate-chart-upgrade-data.sh">generate-chart-upgrade-data.sh</link> <literal>generate-chart-upgrade-data.sh</literal> script, which will include the data from these archives to the <literal>eib-charts-upgrader</literal> fleet.
es: Pasen estos archivos al guion <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/generate-chart-upgrade-data.sh">generate-chart-upgrade-data.sh</link> <literal>generate-chart-upgrade-data.sh</literal>, que incluirá los datos de estos archivos en la flota <literal>eib-charts-upgrader</literal>.
ja: これらのアーカイブを<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/generate-chart-upgrade-data.sh">generate-chart-upgrade-data.sh</link> <literal>generate-chart-upgrade-data.sh</literal>スクリプトに渡します。これにより、これらのアーカイブのデータが <literal>eib-charts-upgrader</literal>フリートに含められます。
zh_cn: 将这些归档传递给 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/generate-chart-upgrade-data.sh">generate-chart-upgrade-data.sh</link> <literal>generate-chart-upgrade-data.sh</literal> 脚本，该脚本会将这些归档中的数据包含到 <literal>eib-charts-upgrader</literal> Fleet 中。

source: Deploy the <literal>eib-charts-upgrader</literal> fleet to their <literal>management cluster</literal>. This is done through either a <literal>GitRepo</literal> or <literal>Bundle</literal> resource.
es: Desplieguen la flota <literal>eib-charts-upgrader</literal> a su <literal>clúster de gestión</literal>. Esto se hace con un recurso <literal>GitRepo</literal> o <literal>Bundle</literal>.
ja: <literal>eib-charts-upgrader</literal> Fleetを<literal>管理クラスタ</literal>にデプロイします。これは<literal>GitRepo</literal>リソースまたは<literal>バンドル</literal>リソースのいずれか通じて実行されます。
pt_br: Implantar a instância do Fleet <literal>eib-charts-upgrader</literal> no respectivo <literal>cluster de gerenciamento</literal>. Isso é feito por um recurso <literal>GitRepo</literal> ou <literal>Bundle</literal>.
zh_cn: 将 <literal>eib-charts-upgrader</literal> Fleet 部署到<literal>管理群集</literal>。此操作可以通过 <literal>GitRepo</literal> 或<literal>捆绑包</literal>资源来完成。

source: Once deployed, the <literal>eib-charts-upgrader</literal>, with the help of Fleet, will ship its resources to the desired management cluster.
es: Una vez desplegado, <literal>eib-charts-upgrader</literal>, con la ayuda de Fleet, incluirá sus recursos en el clúster de gestión deseado.
ja: デプロイされたら、<literal>eib-charts-upgrader</literal>がFleetのサポートによって、そのリソースを目的の管理クラスタに配布します。
pt_br: Após a implantação, o <literal>eib-charts-upgrader</literal>, com ajuda do Fleet, enviará os recursos para o cluster de gerenciamento desejado.
zh_cn: 部署后，<literal>eib-charts-upgrader</literal> 会借助 Fleet 将其资源分发到目标管理群集。

source: These resources include:
es: Estos recursos incluyen:
ja: これらのリソースには、次のものが含まれます。
pt_br: Esses recursos incluem:
zh_cn: 这些资源包括：

source: A set of <literal>Secrets</literal> holding the <emphasis role="strong">user-provided</emphasis> Helm chart data.
es: Un conjunto de <literal>secretos</literal> que guardan los datos del chart de Helm <emphasis role="strong">proporcionados por el usuario</emphasis>.
ja: <emphasis role="strong">ユーザが提供する</emphasis>Helmチャートデータを保持する<literal>Secret</literal>のセット。
pt_br: Um conjunto de <literal>segredos</literal> com os dados do gráfico Helm <emphasis role="strong">fornecidos pelo usuário</emphasis>.
zh_cn: 一组存储<emphasis role="strong">用户提供的</emphasis> Helm chart 数据的<literal>机密</literal>。

source: A <literal>Kubernetes Job</literal> which will deploy a <literal>Pod</literal> that will mount the previously mentioned <literal>Secrets</literal> and based on them <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_patch/">patch</link> the corresponding HelmChart resources.
es: Un <literal>trabajo de Kubernetes</literal> que desplegará un <literal>pod</literal> que montará los <literal>secretos</literal> mencionados anteriormente y, basándose en ellos, <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_patch/">parcheará</link> los recursos HelmChart correspondientes.
ja: 前述の<literal>Secret</literal>をマウントし、それらに基づいて対応するHelmChartリソースに<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_patch/">パッチを適用する</link> <literal>Pod</literal>をデプロイする<literal>Kubernetes Job</literal>。
pt_br: Um <literal>Kubernetes Job</literal> para implantar o <literal>pod</literal> que vai montar os <literal>segredos</literal> já mencionados e, com base neles, aplicar o <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_patch/">patch</link> aos recursos HelmChart correspondentes.
zh_cn: 一个会部署 <literal>Pod</literal> 的 <literal>Kubernetes 作业</literal>，该 Pod 会挂载前面提到的<literal>机密</literal>，并根据这些机密对相应的 HelmChart 资源进行<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_patch/">修补</link>。

source: As mentioned previously this will trigger the <literal>helm-controller</literal> which will perform the actual Helm chart upgrade.
es: Como se mencionó anteriormente, esto activará <literal>helm-controller</literal>, que llevará a cabo la actualización real del chart de Helm.
ja: 前述のとおり、これにより、<literal>helm-controller</literal>がトリガされ、実際の Helmチャートアップグレードが実行されます。
pt_br: Como já foi mencionado, isso acionará o <literal>helm-controller</literal>, que faz upgrade do gráfico Helm real.
zh_cn: 如前文所述，这会触发 <literal>helm-controller</literal>，进而执行实际的 Helm chart 升级。

source: fleet day2 management helm eib upgrade
es: actualización eib del helm de gestión de día 2 de fleet
ja: fleet day2管理helm eibアップグレード
pt_br: upgrade eib helm gerenciamento dia2 fleet
zh_cn: Fleet Day2 管理 Helm EIB 升级

source: Upgrade Steps
es: Pasos para la actualización
ja: アップグレード手順
pt_br: Etapas de upgrade
zh_cn: 升级步骤

source: Clone the <literal>suse-edge/fleet-examples</literal> repository from the correct release <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">tag</link>.
es: Clone el repositorio <literal>suse-edge/fleet-examples</literal> de la <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">etiqueta</link> de versión correcta.
ja: 正しいリリース <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">タグ</link>から<literal>suse-edge/fleet-examples</literal>リポジトリのクローンを作成します。
zh_cn: 从正确的版本<link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">标记</link>处克隆 <literal>suse-edge/fleet-example</literal> 储存库。

source: Create a directory in which you will store the pulled Helm chart archive(s).
es: Cree un directorio en el que almacenarán los archivos de los charts de Helm extraídos.
ja: 取得したHelmチャートアーカイブを保存するディレクトリを作成します。
pt_br: Crie um diretório para armazenar um ou mais arquivos dos gráficos Helm enviados.
zh_cn: 创建用于存储所提取的 Helm chart 归档的目录。

source: Inside of the newly created archive directory, <link xl:href="https://helm.sh/docs/helm/helm_pull/">pull</link> the archive(s) for the Helm chart(s) you wish to upgrade:
es: En el directorio recién creado, <link xl:href="https://helm.sh/docs/helm/helm_pull/">extraiga</link> los archivos de los charts de Helm que desea actualizar:
ja: 新規に作成されたアーカイブディレクトリ内で、アップグレードするHelmチャートのアーカイブを<link xl:href="https://helm.sh/docs/helm/helm_pull/">プル</link>します。
pt_br: Dentro do diretório do arquivo recém-criado, <link xl:href="https://helm.sh/docs/helm/helm_pull/">extraia</link> os arquivos dos gráficos Helm dos quais você deseja fazer upgrade:
zh_cn: 在新创建的归档目录中，<link xl:href="https://helm.sh/docs/helm/helm_pull/">提取</link>要升级的 Helm chart 的归档：

source: From <emphasis role="strong">Assets</emphasis> of the desired <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">release tag</link>, download the <literal>generate-chart-upgrade-data.sh</literal> script.
es: En la página <emphasis role="strong">Assets</emphasis> (Recursos) de la <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">etiqueta de versión</link> deseada, descargue el guion <literal>generate-chart-upgrade-data.sh</literal>.
ja: 目的の<link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">リリースタグ</link>の<emphasis role="strong">アセット</emphasis>から、<literal>generate-chart-upgrade-data.sh</literal>スクリプトをダウンロードします。
zh_cn: 从目标<link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">版本标记</link>的<emphasis role="strong">资产</emphasis>中下载 <literal>generate-chart-upgrade-data.sh</literal> 脚本。

source: Execute the <literal>generate-chart-upgrade-data.sh</literal> script:
es: Ejecute el guion <literal>generate-chart-upgrade-data.sh</literal>:
ja: <literal>generate-chart-upgrade-data.sh</literal>スクリプトを実行します。
pt_br: Execute o script <literal>generate-chart-upgrade-data.sh</literal>:
zh_cn: 执行 <literal>generate-chart-upgrade-data.sh</literal> 脚本：

source: For each chart archive in the <literal>--archive-dir</literal> directory, the script generates a <literal>Kubernetes Secret YAML</literal> file containing the chart upgrade data and stores it in the <literal>base/secrets</literal> directory of the fleet specified by <literal>--fleet-path</literal>.
es: Para cada archivo de chart del directorio <literal>--archive-dir</literal>, el guion genera un archivo <literal>Kubernetes Secret YAML</literal> que contiene los datos de actualización de chart y lo guardar en el directorio <literal>base/secrets</literal> de la flota especificada por <literal>--fleet-path</literal>.
ja: <literal>--archive-dir</literal>ディレクトリ内のチャートアーカイブごとに、スクリプトにより、チャートアップグレードデータを含む<literal>Kubernetes Secret YAML</literal>ファイルが生成され、<literal>--fleet-path</literal>によって指定されたフリートの<literal>base/secrets</literal>ディレクトリに保存されます。
pt_br: Para cada arquivo de gráfico no diretório <literal>--archive-dir</literal>, o script gera um arquivo <literal>YAML de segredo do Kubernetes</literal> com os dados de upgrade do gráfico e o armazena no diretório <literal>base/secrets</literal> da instância do Fleet especificada por <literal>--fleet-path</literal>.
zh_cn: 对于 <literal>--archive-dir</literal> 目录中的每个 chart 归档，该脚本都会生成一个包含 chart 升级数据的 <literal>Kubernetes 机密 YAML</literal> 文件，并将其存储在 <literal>--fleet-path</literal> 指定的 Fleet 的 <literal>base/secrets</literal> 目录中。

source: The <literal>generate-chart-upgrade-data.sh</literal> script also applies additional modifications to the fleet to ensure the generated <literal>Kubernetes Secret YAML</literal> files are correctly utilized by the workload deployed by the fleet.
es: El guion <literal>generate-chart-upgrade-data.sh</literal> también aplica modificaciones adicionales a la flota para garantizar que la carga de trabajo desplegada por la flota utilice correctamente los archivos <literal>Kubernetes Secret YAML</literal> generados.
ja: <literal>generate-chart-upgrade-data.sh</literal>スクリプトは、フリートに追加の変更も適用し、生成された<literal>Kubernetes Secret YAML</literal>ファイルが、フリートによってデプロイされたワークロードによって正しく利用されるようにします。
pt_br: O script <literal>generate-chart-upgrade-data.sh</literal> também aplica modificações adicionais à instância do Fleet para garantir que os arquivos <literal>YAML de segredo do Kubernetes</literal> gerados sejam corretamente usados pela carga de trabalho implantada pelo Fleet.
zh_cn: <literal>generate-chart-upgrade-data.sh</literal> 脚本还会对 Fleet 进行其他修改，以确保生成的 <literal>Kubernetes 机密 YAML</literal> 文件能被 Fleet 部署的工作负载正确使用。

source: Users should not make any changes over what the <literal>generate-chart-upgrade-data.sh</literal> script generates.
es: Los usuarios no deben cambiar nada de lo que genera el guion <literal>generate-chart-upgrade-data.sh</literal>.
ja: ユーザは、<literal>generate-chart-upgrade-data.sh</literal>スクリプトが生成する内容に変更を加えてはなりません。
pt_br: Os usuários não devem fazer alterações no conteúdo que é gerado pelo script <literal>generate-chart-upgrade-data.sh</literal>.
zh_cn: 用户不应更改 <literal>generate-chart-upgrade-data.sh</literal> 脚本生成的内容。

source: The steps below depend on the environment that you are running:
es: Los pasos siguientes dependen del entorno en el que se esté ejecutando:
ja: 以下の手順は、実行している環境によって異なります。
pt_br: As etapas abaixo dependem do ambiente que está em execução:
zh_cn: 以下步骤因您运行的环境而异：

source: For an environment that supports GitOps (e.g. is non air-gapped, or is air-gapped, but allows for local Git server support):
es: En un entorno que admita GitOps (por ejemplo, que no esté aislado, o que esté aislado pero permita la asistencia de un servidor Git local):
ja: GitOpsをサポートする環境の場合(例: エアギャップされていない、エアギャップされたがローカルGitサーバサポートが可能):
pt_br: Para um ambiente com suporte a GitOps (por exemplo, não air-gapped ou air-gapped, mas com suporte a servidor Git local):
zh_cn: 对于支持 GitOps 的环境（例如：非隔离环境，或虽是隔离环境但支持本地 Git 服务器）：

source: Copy the <literal>fleets/day2/eib-charts-upgrader</literal> Fleet to the repository that you will use for GitOps.
es: Copie la flota <literal>fleets/day2/eib-charts-upgrader</literal> en el repositorio que usará para GitOps.
ja: <literal>fleets/day2/eib-charts-upgrader</literal> Fleetを、GitOpsに使用するリポジトリにコピーします。
pt_br: Copie a instância do Fleet <literal>fleets/day2/eib-charts-upgrader</literal> para o repositório que você vai usar com o GitOps.
zh_cn: 将 <literal>fleets/day2/eib-charts-upgrader</literal> Fleet 复制到将用于 GitOps 的储存库中。

source: Make sure that the Fleet includes the changes that have been made by the <literal>generate-chart-upgrade-data.sh</literal> script.
es: Asegúrese de que la flota incluye los cambios realizados por el guion <literal>generate-chart-upgrade-data.sh</literal>.
ja: Fleetに<literal>generate-chart-upgrade-data.sh</literal>スクリプトによって加えられた変更が含まれていることを確認してください。
pt_br: Garanta que o Fleet inclua as alterações feitas pelo script <literal>generate-chart-upgrade-data.sh</literal>.
zh_cn: 确保该 Fleet 包含 <literal>generate-chart-upgrade-data.sh</literal> 脚本所做的更改。
