Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Inspect build container logs</emphasis>: Review the logs of the failed container for more detailed errors (see above).
es: <emphasis role="strong">Inspeccione los registros del contenedor de creación</emphasis>: revise los registros del contenedor que ha fallado para obtener información más detallada sobre los errores (véase más arriba).
ja: <emphasis role="strong">構築コンテナログの検査</emphasis>: 失敗したコンテナのログで詳細なエラーについて確認します(上記参照)。
pt_br: <emphasis role="strong">Analise os registros do contêiner de build</emphasis>: revise os registros do contêiner com falha para verificar os erros em mais detalhes (veja acima).
zh_cn: <emphasis role="strong">检查构建容器日志</emphasis>：查看失败容器的日志以获取更详细的错误信息（见上文）。

source: <emphasis role="strong">Verify definition file</emphasis>: If you are using a custom Kiwi image definition file, double-check the file for any typos or syntax.
es: <emphasis role="strong">Verifique el archivo de definición</emphasis>: si usa un archivo de definición de imagen de Kiwi personalizado, compruebe que no haya errores ortográficos ni sintácticos en el archivo.
ja: <emphasis role="strong">定義ファイルの確認</emphasis>: カスタムKiwiイメージ定義ファイルを使用している場合、タイポや構文についてファイルを再確認します。
pt_br: <emphasis role="strong">Verifique o arquivo de definição</emphasis>: se você usa um arquivo de definição de imagem do Kiwi personalizado, revise-o para garantir que não haja erros de sintaxe ou ortografia.
zh_cn: <emphasis role="strong">验证定义文件</emphasis>：如果使用自定义 Kiwi 映像定义文件，请仔细检查文件是否有拼写错误或语法问题。

source: Check the <link xl:href="https://documentation.suse.com/appliance/kiwi-9/html/kiwi/troubleshooting.html">Kiwi Troubleshooting Guide</link>.
es: Consulte la <link xl:href="https://documentation.suse.com/appliance/kiwi-9/html/kiwi/troubleshooting.html">guía de resolución de problemas de Kiwi</link>.
ja: <link xl:href="https://documentation.suse.com/appliance/kiwi-9/html/kiwi/troubleshooting.html">Kiwiトラブルシューティングガイド</link>を確認してください。
pt_br: Consulte o <link xl:href="https://documentation.suse.com/appliance/kiwi-9/html/kiwi/troubleshooting.html">Guia de Solução de Problemas do Kiwi</link> (em inglês).
zh_cn: 请参考 <link xl:href="https://documentation.suse.com/appliance/kiwi-9/html/kiwi/troubleshooting.html">Kiwi 查错指南</link>。

source: Troubleshooting Edge Image Builder (EIB)
es: Resolución de problemas de Edge Image Builder (EIB)
ja: Edge Image Builder (EIB)のトラブルシューティング
pt_br: Solucionando problemas no Edge Image Builder (EIB)
zh_cn: Edge Image Builder (EIB) 查错

source: EIB is used to create custom SUSE Edge images.
es: EIB se usa para crear imágenes personalizadas de SUSE Edge.
ja: EIBは、カスタムSUSE Edgeイメージを作成するために使用されます。
pt_br: O EIB é usado para criar imagens personalizadas do SUSE Edge.
zh_cn: EIB 用于创建自定义 SUSE Edge 映像。

source: <emphasis role="strong">Wrong SCC code</emphasis>: Ensure the SCC code used in the EIB definition file matches the SL Micro version and architecture.
es: <emphasis role="strong">Código erróneo del SCC</emphasis>: asegúrese de que el código del Centro de servicios al cliente de SUSE utilizado en el archivo de definición de EIB coincida con la versión y la arquitectura de SL Micro.
ja: <emphasis role="strong">間違ったSCCコード</emphasis>: EIB定義ファイルに使用されているSCCコードがSL Microのバージョンとアーキテクチャに一致していることを確認します。
pt_br: <emphasis role="strong">Código incorreto do SCC</emphasis>: assegure que o código do SCC usado no arquivo de definição do EIB corresponda à versão e arquitetura do SL Micro.
zh_cn: <emphasis role="strong">错误的 SCC 代码</emphasis>：确保 EIB 定义文件中使用的 SCC 代码与 SL Micro 版本和体系结构相匹配。

source: <emphasis role="strong">Missing dependencies</emphasis>: Ensure there are no missing packages or tools within the build environment.
es: <emphasis role="strong">Faltan dependencias</emphasis>: asegúrese de que no falte ningún paquete o herramienta en el entorno de creación.
ja: <emphasis role="strong">依存関係がない</emphasis>: 構築環境内に不足しているパッケージやツールがないか確認します。
pt_br: <emphasis role="strong">Dependências ausentes</emphasis>: garanta que não falte nenhum pacote ou ferramenta no ambiente do build.
zh_cn: <emphasis role="strong">依赖项缺失</emphasis>：确保构建环境中没有缺失的软件包或工具。

source: <emphasis role="strong">Incorrect image size</emphasis>: For raw images, the <literal>diskSize</literal> parameter is required and it depends heavily on the images, RPMs, and other artifacts being included in the image.
es: <emphasis role="strong">Tamaño de imagen incorrecto</emphasis>: para las imágenes raw, se requiere el parámetro <literal>diskSize</literal>, que depende en gran medida de las imágenes, los RPM y otros artefactos incluidos en la imagen.
ja: <emphasis role="strong">不正なイメージサイズ</emphasis>: RAWイメージの場合、<literal>diskSize</literal>パラメータが必要であり、イメージ、RPM、およびイメージに含まれている他のアーティファクトに大きく依存します。
pt_br: <emphasis role="strong">Tamanho da imagem incorreto</emphasis>: para as imagens brutas, o parâmetro <literal>diskSize</literal> é obrigatório e depende significativamente de que as imagens, os RPMs e outros artefatos sejam incluídos na imagem.
zh_cn: <emphasis role="strong">映像大小不正确</emphasis>：对于原始映像，必须指定 <literal>diskSize</literal> 参数，其值很大程度上取决于映像中包含的映像、RPM 及其他制品。

source: <emphasis role="strong">Permissions</emphasis>: If storing a script on the custom/files directory, ensure it has executable permissions as those files are just available at combustion time but no changes are performed by EIB.
es: <emphasis role="strong">Permisos</emphasis>: si almacena un guion en el directorio custom/files, asegúrese de que tenga permisos de ejecución, ya que esos archivos solo están disponibles cuando se ejecuta Combustion, pero EIB no realiza ningún cambio.
ja: <emphasis role="strong">許可</emphasis>: custom/filesディレクトリにスクリプトを保存する場合、スクリプトに実行許可があることを確認します。これらのファイルはCombustion時にのみ利用可能であり、EIBによって変更は実行されないためです。
pt_br: <emphasis role="strong">Permissões</emphasis>: se você armazena um script no diretório personalizado/de arquivos, assegure que ele tenha permissões de execução, já que esses arquivos apenas estão disponíveis no momento da combustão, mas o EIB não faz nenhuma alteração.
zh_cn: <emphasis role="strong">权限</emphasis>：如果在 custom/files 目录中存储脚本，则确保脚本具有可执行权限，因为这些文件仅在 Combustion 阶段可用，EIB 不会对其进行修改。

source: <emphasis role="strong">Operating system group dependencies</emphasis>: When creating an image with custom users and groups, the groups being set as “<literal>primaryGroup</literal>” should be explicitly created.
es: <emphasis role="strong">Dependencias del grupo del sistema operativo</emphasis>: al crear una imagen con usuarios y grupos personalizados, los grupos que se definan como <literal>primaryGroup</literal> deben crearse explícitamente.
ja: <emphasis role="strong">オペレーティングシステムグループの依存関係</emphasis>: カスタムユーザとグループを使用してイメージを作成する場合、「<literal>primaryGroup</literal>」として設定されるグループを明示的に作成する必要があります。
pt_br: <emphasis role="strong">Dependências de grupo do sistema operacional</emphasis>: ao criar uma imagem com usuários e grupos personalizados, os grupos definidos como "<literal>primaryGroup</literal>" devem ser explicitamente criados.
zh_cn: <emphasis role="strong">操作系统组依赖项</emphasis>：创建需要设置自定义用户和组的映像时，应明确预先创建作为“<literal>primaryGroup</literal>”的组。

source: <emphasis role="strong">Operating system user’s sshkeys requires a home folder</emphasis>: When creating an image with users with sshkeys, the home folder needs to be created as well with <literal>createHomeDir=true</literal>.
es: <emphasis role="strong">Las claves SSH de los usuarios del sistema operativo requieren una carpeta de inicio</emphasis>: al crear una imagen con usuarios con claves SSH, también es necesario crear la carpeta de inicio con <literal>createHomeDir=true</literal>.
ja: <emphasis role="strong">オペレーティングシステムユーザのsshkeysにはホームフォルダが必要</emphasis>: sshkeysを持つユーザでイメージを作成する場合、 <literal>createHomeDir=true</literal>を指定してホームフォルダも作成する必要があります。
pt_br: <emphasis role="strong">As chaves SSH dos usuários do sistema operacional requerem uma pasta pessoal</emphasis>: ao criar uma imagem com usuários que têm chaves SSH, também é necessário criar a pasta pessoal com <literal>createHomeDir=true</literal>.
zh_cn: <emphasis role="strong">操作系统用户的 SSH 密钥需要主目录</emphasis>：创建需要设置带 SSH 密钥的用户的映像时，还需使用 <literal>createHomeDir=true</literal> 创建主文件夹。

source: <emphasis role="strong">Combustion issues</emphasis>: EIB relies on combustion for the customization of the OS and deployment of all the other SUSE Edge components. This also includes custom scripts being placed in the custom/scripts folder. Note that the combustion process is being executed at <literal>initrd</literal> time, so the system is not completely booted when the scripts are executed.
es: <emphasis role="strong">Problemas de Combustion</emphasis>: EIB utiliza Combustion para la personalización del sistema operativo y el despliegue de todos los demás componentes de SUSE Edge. Esto también incluye guiones personalizados que se colocan en la carpeta custom/scripts. Tenga en cuenta que el proceso Combustion se ejecuta en el momento de <literal>initrd</literal>, por lo que el sistema no está completamente arrancado cuando se ejecutan los guiones.
ja: <emphasis role="strong">Combustionの問題</emphasis>: EIBは、OSのカスタマイズおよびその他のすべてのSUSE Edgeコンポーネントのデプロイメントに対してCombustionに依存しています。これには、custom/scriptsフォルダに配置されるカスタムスクリプトも含まれます。Combustionプロセスは<literal>initrd</literal>時に実行されるため、スクリプト実行時にシステムが完全に起動していないことに注意してください。
pt_br: <emphasis role="strong">Problemas no Combustion</emphasis>: o EIB usa o Combustion para a personalização do sistema operacional e da implantação de todos os outros componentes do SUSE Edge, o que também inclui os scripts personalizados substituídos na pasta custom/scripts. Observe que o processo do Combustion é executado com o <literal>initrd</literal>, portanto, o sistema não é completamente inicializado quando os scripts são executados.
zh_cn: <emphasis role="strong">Combustion 问题</emphasis>：EIB 依赖 Combustion 来自定义操作系统并部署其他所有 SUSE Edge 组件，包括存放在 custom/scripts 文件夹中的自定义脚本。需要注意的是，Combustion 过程在 <literal>initrd</literal> 阶段执行，因此脚本执行时系统尚未完全引导。

source: <emphasis role="strong">Podman machine size</emphasis>: As explained in the EIB Tips and Tricks section (<xref linkend="tips-and-tricks"/>), verify the podman machine has enough CPU/memory to run the EIB container on non-Linux operating systems.
es: <emphasis role="strong">Tamaño de la máquina de Podman</emphasis>: como se explica en la sección de consejos y trucos de EIB (<xref linkend="tips-and-tricks"/>), compruebe que la máquina de Podman tenga suficiente CPU/memoria para ejecutar el contenedor de EIB en sistemas operativos que no sean Linux.
ja: <emphasis role="strong">Podmanマシンサイズ</emphasis>: EIBの「ヒントとコツ」セクション(<xref linkend="tips-and-tricks"/>)で説明されているように、Linux以外のオペレーティングシステムでEIBコンテナを実行するための十分なCPU/メモリがPodmanマシンにあることを確認します。
pt_br: <emphasis role="strong">Tamanho da máquina podman</emphasis>: conforme explicado na seção de dicas e truques do EIB (<xref linkend="tips-and-tricks"/>), verifique se a máquina podman tem CPU/memória suficiente para executar o contêiner do EIB em sistemas operacionais não Linux.
zh_cn: <emphasis role="strong">Podman 计算机大小</emphasis>：如<xref linkend="tips-and-tricks"/>中所述，在非 Linux 操作系统上，需要验证 Podman 计算机是否有充足的 CPU/内存来运行 EIB 容器。

source: <emphasis role="strong">EIB output</emphasis>: The console output of the <literal>eib build</literal> command is crucial.
es: <emphasis role="strong">Salida de EIB</emphasis>: el resultado del panel de control del comando <literal>eib build</literal> es fundamental.
ja: <emphasis role="strong">EIB出力</emphasis>: <literal>eib build</literal>コマンドのコンソール出力は重要です。
pt_br: <emphasis role="strong">Saída do EIB</emphasis>: a saída do console do comando <literal>eib build</literal> é fundamental.
zh_cn: <emphasis role="strong">EIB 输出</emphasis>：<literal>eib build</literal> 命令的控制台输出可提供极为重要的信息。

source: <emphasis role="strong">Build container logs</emphasis>: Check the logs of the build container. The logs are generated in the directory that was used to store the artifacts. Check <literal>docker logs</literal> or <literal>podman logs</literal> for the necessary information as well.
es: <emphasis role="strong">Registros del contenedor de creación</emphasis>: compruebe los registros del contenedor de creación. Los registros se generan en el directorio que se utilizó para almacenar los artefactos. Compruebe también los registros de <literal>Docker</literal> o <literal>Podman</literal> para obtener la información necesaria.
ja: <emphasis role="strong">構築コンテナのログ</emphasis>: 構築コンテナのログを確認します。ログは、アーティファクトを保存するために使用されたディレクトリに生成されます。必要な情報については<literal>dockerログ</literal>または<literal>podmanログ</literal>も確認してください。
pt_br: <emphasis role="strong">Registros do contêiner de build</emphasis>: consulte os registros do contêiner de build. Eles são gerados no diretório que foi usado para armazenar os artefatos. Consulte também os <literal>docker logs</literal> ou os <literal>podman logs</literal> para obter as informações necessárias.
zh_cn: <emphasis role="strong">构建容器日志</emphasis>：检查构建容器的日志。生成的日志存放在用于存储制品的目录中。也可通过 <literal>docker logs</literal> 或 <literal>podman logs</literal> 获取必要信息。

source: For more information, see <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Debugging</link>.
es: Para obtener más información, consulte la sección <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Debugging</link> (Depuración).
ja: 詳細については、「 <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Debugging (デバッグ)</link>」を参照してください。
pt_br: Para obter mais informações, consulte <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Debugging</link> (Depuração).
zh_cn: 有关详细信息，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">调试</link>。

source: <emphasis role="strong">Temporary build directories</emphasis>: EIB creates temporary directories during the build process. Check these for intermediate logs or artifacts if the main output is insufficient.
es: <emphasis role="strong">Directorios temporales de creación</emphasis>: EIB crea directorios temporales durante el proceso de creación. Compruebe si hay registros intermedios o artefactos en ellos si el resultado principal es insuficiente.
ja: <emphasis role="strong">一時的な構築ディレクトリ</emphasis>: EIBは構築プロセス中に一時ディレクトリを作成します。メイン出力が不十分な場合は、これらのディレクトリで中間ログやアーティファクトを確認します。
pt_br: <emphasis role="strong">Diretórios temporários de build</emphasis>: o EIB cria diretórios temporários durante o processo de build. Consulte-os para acessar os registros ou os artefatos intermediários se a saída principal não for suficiente.
zh_cn: <emphasis role="strong">临时构建目录</emphasis>：EIB 会在构建过程中创建临时目录。如果主要输出的信息不充足，可在这些目录中查看中间日志或制品。

source: <emphasis role="strong">Combustion logs</emphasis>: If the image being built with EIB does not boot for any reason, a root shell is available. Connect to the host console (either physically, via BMC, etc.) and check combustion logs with <literal>journalctl -u combustion</literal> and in general all the operating system logs with <literal>journalctl</literal> to find the root cause of the failure.
es: <emphasis role="strong">Registros de Combustion</emphasis>: si la imagen que se está creando con EIB no arranca por cualquier motivo, hay disponible una shell raíz. Conéctese al panel de control del host (ya sea físicamente, a través de BMC, etc.) y compruebe los registros de Combustion con <literal>journalctl -u combustion</literal> y, en general, todos los registros del sistema operativo con <literal>journalctl</literal> para encontrar la causa raíz del fallo.
ja: <emphasis role="strong">Combustionログ</emphasis>: EIBで構築されているイメージが何らかの理由で起動しない場合、 ルートシェルを利用できます。ホストコンソールに(物理的に、またはBMC経由などで)接続し、<literal>journalctl -u burning</literal>でCombustionログを確認し、通常は<literal>journalctl</literal>ですべてのオペレーティングシステムログを確認して、失敗の根本原因を特定します。
pt_br: <emphasis role="strong">Registros do Combustion</emphasis>: se a imagem que está sendo criada com o EIB não for inicializada por algum motivo, um shell root estará disponível. Conecte-se ao console do host (fisicamente, via BMC etc.) e consulte os registros do Combustion com <literal>journalctl -u combustion</literal> e, em geral, todos os registros do sistema operacional com <literal>journalctl</literal>, para encontrar a causa raiz da falha.
zh_cn: <emphasis role="strong">Combustion 日志</emphasis>：如果使用 EIB 构建的映像因任何原因无法引导，可以使用 root 外壳。连接到主机控制台（物理连接或通过 BMC 等方式），使用 <literal>journalctl -u combustion</literal> 检查 Combustion 日志，或使用 <literal>journalctl</literal> 查看所有操作系统日志，确定失败的根本原因。

source: <emphasis role="strong">Review <literal>eib-build</literal> output</emphasis>: The error message in the console output is usually very indicative.
es: <emphasis role="strong">Revise el resultado de <literal>eib-build</literal></emphasis>: el mensaje de error que aparece en el panel de control suele ser muy explicativo.
ja: <emphasis role="strong"><literal>eib-build</literal>出力の確認</emphasis>: コンソール出力のエラーメッセージは通常、非常にわかりやすいです。
pt_br: <emphasis role="strong">Revise a saída de <literal>eib-build</literal></emphasis>: a mensagem de erro na saída do console costuma ser bem clara.
zh_cn: <emphasis role="strong">查看 <literal>eib-build</literal> 输出</emphasis>：控制台输出中的错误消息通常具有明确指示性。

source: <emphasis role="strong">Check build environment</emphasis>: Ensure all prerequisites for EIB itself (for example, docker/podman, sufficient disk space) are met on the machine running EIB.
es: <emphasis role="strong">Compruebe el entorno de creación</emphasis>: asegúrese de que se cumplen todos los requisitos previos de EIB (por ejemplo, docker/podman, espacio suficiente en disco) en el equipo donde se ejecuta EIB.
ja: <emphasis role="strong">構築環境の確認</emphasis>: EIBを実行しているマシンで、EIB自体のすべての前提条件(docker/podman、十分なディスク容量など)が満たされていることを確認します。
pt_br: <emphasis role="strong">Verifique o ambiente do build</emphasis>: garanta que todos os pré-requisitos para o próprio EIB (por exemplo, docker/podman, espaço em disco suficiente) sejam atendidos na máquina que executa o EIB.
zh_cn: <emphasis role="strong">检查构建环境</emphasis>：确保运行 EIB 的计算机满足 EIB 本身的所有先决条件（例如，docker/podman、充足的磁盘空间）。

source: <emphasis role="strong">Verify <literal>eib</literal> configuration"</emphasis>: Double-check the <literal>eib</literal> configuration file for any typos or incorrect paths to source files or build scripts.
es: <emphasis role="strong">Verifique la configuración de <literal>eib</literal></emphasis>: compruebe bien el archivo de configuración <literal>eib</literal> para detectar posibles errores ortográficos o rutas incorrectas a los archivos de origen o a los guiones de creación.
ja: <emphasis role="strong"><literal>eib</literal>設定の確認</emphasis>: <literal>eib</literal>設定ファイルにタイポがないか、ソースファイルや構築スクリプトへのパスが間違っていないか、再確認します。
pt_br: <emphasis role="strong">Verifique a configuração do <literal>eib</literal></emphasis>: revise o arquivo de configuração do <literal>eib</literal> para verificar se não há erros de ortografia ou caminhos incorretos para os arquivos de origem ou scripts de build.
zh_cn: <emphasis role="strong">验证 <literal>eib</literal> 配置</emphasis>：仔细检查 <literal>eib</literal> 配置文件是否有拼写错误，或者其中的源文件/构建脚本路径是否不正确。

source: <emphasis role="strong">Test components individually</emphasis>: If your EIB build involves custom scripts or stages, run them independently to isolate failures.
es: <emphasis role="strong">Pruebe los componentes individualmente</emphasis>: si su versión EIB incluye guiones o etapas personalizados, ejecútelos de forma independiente para aislar los fallos.
ja: <emphasis role="strong">コンポーネントの個別テスト</emphasis>: EIBビルドにカスタムスクリプトやステージが含まれている場合は、個別に実行して失敗を特定します。
pt_br: <emphasis role="strong">Teste os componentes individualmente</emphasis>: se o build do EIB envolver scripts ou estágios personalizados, execute-os separadamente para isolar falhas.
zh_cn: <emphasis role="strong">单独测试组件</emphasis>：如果 EIB 构建涉及自定义脚本或阶段，单独运行它们以隔离故障。

source: Check <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Edge Image Builder Debugging</link>.
es: Consulte la sección <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Edge Image Builder Debugging</link> (Depuración de Edge Image Builder).
ja: <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Edge Image Builderの「Debugging (デバッグ)」</link>を確認してください。
pt_br: Consulte <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Edge Image Builder Debugging</link> (Depuração do Edge Image Builder).
zh_cn: 请参见 <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/debugging.md">Edge Image Builder 调试</link>。

source: Troubleshooting Edge Networking (NMC)
es: Resolución de problemas de redes periféricas (NMC)
ja: Edgeネットワーキング(NMC)のトラブルシューティング
pt_br: Solução de problemas da rede de borda (NMC)
zh_cn: Edge 网络 (NMC) 查错

source: NMC is injected on SL Micro EIB images to configure the network of the Edge hosts at boot time via combustion. It is also being executed on the Metal3 workflow as part of the inspection process. Issues can happen when the host is being booted for the first time or on the Metal3 inspection process.
es: NMC se inyecta en las imágenes de EIB de SL Micro para configurar la red de los hosts de Edge en el momento del arranque mediante Combustion. También se ejecuta en el flujo de trabajo Metal3 como parte del proceso de inspección. Pueden surgir problemas cuando se arranca el host por primera vez o durante el proceso de inspección de Metal3.
ja: NMCは、SL Micro EIBイメージに挿入され、起動時に、Combustionを介してEdgeホストのネットワークを設定します。また、Metal3ワークフローでは検査プロセスの一環として実行されています。ホストの初回起動時、またはMetal3検査プロセス中に問題が発生する可能性があります。
pt_br: O NMC é injetado nas imagens EIB do SL Micro para configurar a rede dos hosts do Edge no momento da inicialização pelo Combustion. Ele também é executado no fluxo de trabalho do Metal3 como parte do processo de inspeção. Os problemas podem ocorrer quando o host é inicializado pela primeira vez ou no processo de inspeção do Metal3.
zh_cn: SL Micro EIB 映像中注入了 NMC，后者用于在系统引导时通过 Combustion 配置 Edge 主机的网络。在 Metal3 工作流程中，它也会作为检查过程的一部分执行。当主机首次引导时或在 Metal3 检查过程中，可能会发生问题。

source: <emphasis role="strong">Host not being able to boot properly the first time</emphasis>: Malformed network definition files can lead to the combustion phase to fail and then the host drops a root shell.
es: <emphasis role="strong">El host no puede arrancar correctamente la primera vez</emphasis>: los archivos de definición de red que no están bien formados pueden provocar que la fase de Combustion falle y que el host pierda el control de la shell raíz.
ja: <emphasis role="strong">ホストが初回起動時に正常に起動できない</emphasis>: 不正な形式のネットワーク定義ファイルにより、combustionフェーズが失敗し、ホストがルートシェルをドロップする可能性があります。
pt_br: <emphasis role="strong">O host não é inicializado corretamente na primeira vez</emphasis>: arquivos de definição de rede mal elaborados podem provocar falha na fase de combustão e, dessa forma, o host perde o shell root.
zh_cn: <emphasis role="strong">主机首次引导时无法正常引导</emphasis>：格式错误的网络定义文件可能导致 Combustion 阶段失败，进而使主机回退到 root 外壳。
