Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: This <literal>VirtualMachine</literal> definition is minimal, specifying little about the configuration. It simply outlines that it is a machine type "<link xl:href="https://wiki.qemu.org/Features/Q35">q35</link>" with 2 GB of memory that uses a disk image based on an ephemeral <literal><link xl:href="https://kubevirt.io/user-guide/virtual_machines/disks_and_volumes/#containerdisk">containerDisk</link></literal> (that is, a disk image that is stored in a container image from a remote image repository), and specifies a base64 encoded cloudInit disk, which we only use for user creation and password enforcement at boot time (use <literal>base64 -d</literal> to decode it).
es: Esta definición de <literal>VirtualMachine</literal> es mínima y especifica muy poco sobre la configuración. Solo indica que se trata de una máquina de tipo <link xl:href="https://wiki.qemu.org/Features/Q35">q35</link> con 2 GB de memoria que usa una imagen de disco basada en un <literal><link xl:href="https://kubevirt.io/user-guide/virtual_machines/disks_and_volumes/#containerdisk">containerDisk</link></literal> efímero (es decir, una imagen de disco que se almacena en una imagen de contenedor desde un repositorio de imágenes remoto), y especifica un disco cloudInit con cifrado base64, que solo utilizamos para la creación de usuarios y la obligación de usar contraseña en el momento del arranque (utilice <literal>base64 -d</literal> para descifrarlo).
ja: この<literal>VirtualMachine</literal>定義は最小限であり、設定はほとんど指定されていません。この定義は単に、この仮想マシンが、一時的な<literal><link xl:href="https://kubevirt.io/user-guide/virtual_machines/disks_and_volumes/#containerdisk">containerDisk</link></literal>に基づくディスクイメージ(つまり、リモートイメージリポジトリからのコンテナイメージに保存されるディスクイメージ)を使用する、2GBのメモリを備えたマシンタイプ「<link xl:href="https://wiki.qemu.org/Features/Q35">q35</link>」であることを示しています。また、base64でエンコードされたcloudInitディスクを指定しており、このディスクはブート時にユーザを作成してパスワードを適用する目的にのみ使用します(デコードには<literal>base64 -d</literal>を使用します)。
pt_br: Essa definição da <literal>VirtualMachine</literal> é mínima e especifica pouco da configuração. Ela simplesmente descreve que se trata de uma máquina do tipo "<link xl:href="https://wiki.qemu.org/Features/Q35">q35</link>" com 2 GB de memória, que usa uma imagem de disco baseada em um <literal><link xl:href="https://kubevirt.io/user-guide/virtual_machines/disks_and_volumes/#containerdisk">containerDisk</link></literal> efêmero (ou seja, uma imagem de disco armazenada na imagem de contêiner de um repositório de imagens remoto), e especifica um disco cloudInit codificado com base64, que usamos apenas para criação de usuários e imposição de senha no momento da inicialização (usamos <literal>base64 -d</literal> para decodificá-lo).
zh_cn: 此 <literal>VirtualMachine</literal> 定义极其简洁，几乎未指定配置信息。它只是概括性地指明，此计算机的类型为“<link xl:href="https://wiki.qemu.org/Features/Q35">q35</link>”，具有 2 GB 内存，使用基于临时 <literal><link xl:href="https://kubevirt.io/user-guide/virtual_machines/disks_and_volumes/#containerdisk">containerDisk</link></literal> 的磁盘映像（即，存储在远程映像储存库中某个容器映像内的磁盘映像）。此定义还指定了一个 base64 编码的 cloudInit 磁盘，该磁盘仅用于在引导时创建用户和执行口令（可使用 <literal>base64-d</literal> 对其进行解码）。

source: This virtual machine image is only for testing. The image is not officially supported and is only meant as a documentation example.
es: Esta imagen de máquina virtual sirve solo para realizar pruebas. La imagen no cuenta con asistencia oficial y solo se ofrece como ejemplo para fines de documentación.
ja: この仮想マシンイメージはテスト専用です。このイメージは公式にサポートされておらず、ドキュメントの例としてのみ使用されています。
pt_br: Essa imagem da máquina virtual é somente para teste. Ela não tem suporte oficial e serve apenas como exemplo para documentação.
zh_cn: 此虚拟机映像仅用于测试。该映像不受官方支持，仅用作文档示例。

source: This machine takes a few minutes to boot as it needs to download the openSUSE Tumbleweed disk image, but once it has done so, you can view further details about the virtual machine by checking the virtual machine information:
es: Esta máquina tarda unos minutos en arrancar, ya que necesita descargar la imagen de disco de openSUSE Tumbleweed, pero una vez que lo haya hecho, podrá ver más detalles sobre ella:
ja: このマシンは、openSUSE Tumbleweedのディスクイメージをダウンロードする必要があるためブートに数分かかりますが、ブートが完了したら、次のコマンドで仮想マシンの情報をチェックして、仮想マシンの詳細を確認できます。
pt_br: A inicialização da máquina leva alguns minutos porque ela precisa fazer download da imagem de disco do openSUSE Tumbleweed. Depois disso, você poderá consultar as informações para ver mais detalhes sobre a máquina virtual:
zh_cn: 此虚拟机需要几分钟时间才能完成引导，因为它需要下载 openSUSE Tumbleweed 磁盘映像，但一旦完成此过程，您可以通过检查虚拟机信息来查看有关该虚拟机的更多细节：

source: This should print the node that the virtual machine was started on, and the IP address of the virtual machine. Remember, since it uses pod networking, the reported IP address will be just like any other pod, and routable as such:
es: Esto debería dar como resultado el nodo en el que se inició la máquina virtual y la dirección IP de la máquina virtual. Recuerde que, dado que utiliza conexión de red de pod, la dirección IP indicada será igual que la de cualquier otro pod y, por lo tanto, enrutable:
ja: これにより、仮想マシンが起動されたノードと、仮想マシンのIPアドレスが出力されます。Podネットワーキングを使用しているため、報告されるIPアドレスは他のPodと同様であり、ルーティング可能であることに注意してください。
pt_br: Esse comando deve mostrar o nó em que a máquina virtual foi iniciada e o endereço IP dela. Como ela usa a rede de pod, lembre-se de que o endereço IP relatado será exatamente igual ao de qualquer outro pod e, dessa forma, roteável:
zh_cn: 此命令应会列显启动虚拟机的节点以及虚拟机的 IP 地址。请记住，由于它使用 Pod 网络，因此报告的 IP 地址与任何其他 Pod 一样并且可路由：

source: When running these commands on the Kubernetes cluster nodes themselves, with a CNI that routes traffic directly to pods (for example, Cilium), you should be able to <literal>ssh</literal> directly to the machine itself. Substitute the following IP address with the one that was assigned to your virtual machine:
es: Al ejecutar estos comandos en los propios nodos del clúster de Kubernetes, con una CNI que enruta el tráfico directamente a los pods (por ejemplo, Cilium), debería poder conectarse directamente por <literal>ssh</literal> a la máquina. Sustituya la siguiente dirección IP por la que se le haya asignado a su máquina virtual:
ja: これらのコマンドをKubernetesクラスタノード自体で実行する場合は、トラフィックをPodに直接ルーティングするCNI (Ciliumなど)を使用して、マシン自体に直接<literal>ssh</literal>で接続できるはずです。次のIPアドレスを、仮想マシンに割り当てられているIPアドレスに置き換えます。
pt_br: Ao executar esses comandos nos próprios nós do cluster Kubernetes, com uma CNI para rotear o tráfego diretamente aos pods (por exemplo, Cilium), você pode executar <literal>ssh</literal> diretamente na máquina. Substitua o seguinte endereço IP pelo que foi atribuído à sua máquina virtual:
zh_cn: 在使用 CNI（例如 Cilium）将流量直接路由到 Pod 的情况下，在 Kubernetes 群集节点本身上运行这些命令时，您应该可以通过 <literal>ssh</literal> 直接连接到该虚拟机本身。请将下面的 IP 地址替换为分配给您的虚拟机的 IP 地址：

source: Once you are in this virtual machine, you can play around, but remember that it is limited in terms of resources, and only has 1 GB disk space. When you are finished, <literal>Ctrl-D</literal> or <literal>exit</literal> to disconnect from the SSH session.
es: Cuando se encuentre en esta máquina virtual, puede practicar un poco, pero recuerde que tiene recursos limitados y solo cuenta con 1 GB de espacio en disco. Cuando termine, pulse <literal>Ctrl+D</literal> o <literal>exit</literal> para desconectarse de la sesión SSH.
ja: この仮想マシンに接続すると、さまざまな操作を試すことができますが、リソースの点で制限があり、ディスク容量は1GBしかないことに注意してください。終了したら、<literal>Ctrl-D</literal>または<literal>exit</literal>でSSHセッションを切断します。
pt_br: Depois que você estiver nessa máquina virtual, poderá explorá-la, mas lembre-se de que ela tem recursos limitados e apenas 1 GB de espaço em disco. Quando concluir, use <literal>Ctrl-D</literal> ou <literal>exit</literal> para se desconectar da sessão SSH.
zh_cn: 进入此虚拟机后，可对其进行任意操作，但请记住，它的资源有限，磁盘空间只有 1 GB。完成后，请按 <literal>Ctrl-D</literal> 或输入 <literal>exit</literal> 与 SSH 会话断开连接。

source: The virtual machine process is still wrapped in a standard Kubernetes pod. The <literal>VirtualMachine</literal> CRD is a representation of the desired virtual machine, but the process in which the virtual machine is actually started is via the <literal><link xl:href="https://github.com/kubevirt/kubevirt/blob/main/docs/components.md#virt-launcher">virt-launcher</link></literal> pod, a standard Kubernetes pod, just like any other application. For every virtual machine started, you can see there is a <literal>virt-launcher</literal> pod:
es: El proceso de la máquina virtual sigue estando envuelto en un pod estándar de Kubernetes. La CRD <literal>VirtualMachine</literal> es una representación de la máquina virtual deseada, pero el proceso en el que se inicia realmente la máquina virtual es a través del pod <literal><link xl:href="https://github.com/kubevirt/kubevirt/blob/main/docs/components.md#virt-launcher">virt-launcher</link></literal>, un pod estándar de Kubernetes, igual que cualquier otra aplicación. Por cada máquina virtual iniciada, se puede ver que hay un pod <literal>virt-launcher</literal>:
ja: 仮想マシンプロセスは、依然として標準のKubernetes Podでラップされています。<literal>VirtualMachine</literal> CRDは目的の仮想マシンを表していますが、仮想マシンが実際に起動されるプロセスは、他のアプリケーションと同様に、標準のKubernetes Podである<literal><link xl:href="https://github.com/kubevirt/kubevirt/blob/main/docs/components.md#virt-launcher">virt-launcher</link></literal> Podを介して行われます。起動されたすべての仮想マシンに対して、<literal>virt-launcher</literal> Podが存在することがわかります。
pt_br: O processo da máquina virtual ainda é agrupado em um pod padrão do Kubernetes. A CRD <literal>VirtualMachine</literal> é uma representação da máquina virtual desejada, mas o processo em que a máquina virtual foi realmente iniciada é realizado pelo pod <literal><link xl:href="https://github.com/kubevirt/kubevirt/blob/main/docs/components.md#virt-launcher">virt-launcher</link></literal>, um pod padrão do Kubernetes, assim como com qualquer outro aplicativo. Para cada máquina virtual iniciada, você vê que existe um pod <literal>virt-launcher</literal>:
zh_cn: 虚拟机进程仍封装在标准 Kubernetes Pod 中。<literal>VirtualMachine</literal> CRD 代表期望的虚拟机，但与任何其他应用程序一样，实际启动虚拟机的过程是通过 <literal><link xl:href="https://github.com/kubevirt/kubevirt/blob/main/docs/components.md#virt-launcher">virt-launcher</link></literal> Pod（标准 Kubernetes Pod）进行的。启动的每个虚拟机都有一个对应的 <literal>virt-launcher</literal> Pod：

source: This should then show the one <literal>virt-launcher</literal> pod for the Tumbleweed machine that we have defined:
es: Esto debería mostrar el único pod <literal>virt-launcher</literal> para la máquina Tumbleweed que hemos definido:
ja: 次に、定義したTumbleweedマシンの1つの<literal>virt-launcher</literal> Podが表示されます。
pt_br: Em seguida, o pod <literal>virt-launcher</literal> deve aparecer para a máquina Tumbleweed que definimos:
zh_cn: 此命令应会针对我们定义的 Tumbleweed 虚拟机显示一个 <literal>virt-launcher</literal> Pod：

source: If we take a look into this <literal>virt-launcher</literal> pod, you see it is executing <literal>libvirt</literal> and <literal>qemu-kvm</literal> processes. We can enter the pod itself and have a look under the covers, noting that you need to adapt the following command for your pod name:
es: Si echamos un vistazo a este pod <literal>virt-launcher</literal>, veremos que está ejecutando los procesos <literal>libvirt</literal> y <literal>qemu-kvm</literal>. Podemos entrar en el propio pod y echar un vistazo, pero tenga en cuenta que es necesario adaptar el siguiente comando al nombre de su pod:
ja: この<literal>virt-launcher</literal> Podを調べてみると、<literal>libvirt</literal>プロセスと<literal>qemu-kvm</literal>プロセスを実行していることがわかります。このPod自体を起動して詳細を確認できます。次のコマンドは、使用しているPodの名前に合わせて調整する必要があることに注意してください。
pt_br: Se você observar o pod <literal>virt-launcher</literal>, verá que ele está executando os processos <literal>libvirt</literal> e <literal>qemu-kvm</literal>. É possível entrar e analisar o conteúdo do pod, levando em conta que você precisa adaptar o seguinte comando com o nome do seu pod:
zh_cn: 如果深入查看这个 <literal>virt-launcher</literal> Pod，您会看到它正在执行 <literal>libvirt</literal> 和 <literal>qemu-kvm</literal> 进程。我们可以进入该 Pod 本身并查看其内部工作。请注意您需要根据自己的 Pod 名称修改以下命令：

source: Once you are in the pod, try running <literal>virsh</literal> commands along with looking at the processes. You will see the <literal>qemu-system-x86_64</literal> binary running, along with certain processes for monitoring the virtual machine. You will also see the location of the disk image and how the networking is plugged (as a tap device):
es: Una vez en el pod, pruebe a ejecutar comandos <literal>virsh</literal> y observe los procesos. Comprobará que se está ejecutando el binario <literal>qemu-system-x86_64</literal>, junto con ciertos procesos para supervisar la máquina virtual. También verá la ubicación de la imagen de disco y cómo está conectada la red (como un dispositivo tap):
ja: Podが起動したら、<literal>virsh</literal>コマンドを実行するのと併せて、プロセスを確認してみます。<literal>qemu-system-x86_64</literal>バイナリに加え、仮想マシンを監視するための特定のプロセスも実行されていることがわかります。また、ディスクイメージの場所と、ネットワーキングが(タップデバイスとして)どのように接続されているかもわかります。
pt_br: Depois que você estiver no pod, execute os comandos <literal>virsh</literal> enquanto observa os processos. Você verá o binário <literal>qemu-system-x86_64</literal> em execução, junto com alguns processos para monitorar a máquina virtual, e também o local da imagem de disco e como a rede está conectada (como um dispositivo TAP):
zh_cn: 进入 Pod 后，尝试运行 <literal>virsh</literal> 命令并查看进程。您会看到 <literal>qemu-system-x86_64</literal> 二进制文件正在运行，还会看到用于监控虚拟机的某些进程，以及磁盘映像的位置及网络（作为 tap 设备）的插接方式：

source: Finally, let us delete this virtual machine to clean up:
es: Por último, eliminemos esta máquina virtual:
ja: 最後に、この仮称マシンを削除して、クリーンアップしましょう。
pt_br: Por fim, vamos excluir a máquina virtual para limpeza:
zh_cn: 最后，我们需要删除此虚拟机以清理资源：

source: Using virtctl
es: Uso de virtctl
ja: virtctlの使用
pt_br: Usando o virtctl
zh_cn: 使用 virtctl

source: Along with the standard Kubernetes CLI tooling, that is, <literal>kubectl</literal>, KubeVirt comes with an accompanying CLI utility that allows you to interface with your cluster in a way that bridges some gaps between the virtualization world and the world that Kubernetes was designed for. For example, the <literal>virtctl</literal> tool provides the capability of managing the lifecycle of virtual machines (starting, stopping, restarting, etc.), providing access to the virtual consoles, uploading virtual machine images, as well as interfacing with Kubernetes constructs such as services, without using the API or CRDs directly.
es: Además de la estándar de Kubernetes (<literal>kubectl</literal>), KubeVirt incluye una interfaz de línea de comandos adicional que permite interactuar con el clúster de una forma que obvia ciertas diferencias entre los entornos de virtualización y los usos para los que se diseñó Kubernetes. Por ejemplo, la herramienta <literal>virtctl</literal> permite gestionar el ciclo de vida de las máquinas virtuales (iniciar, detener, reiniciar, etc.), proporciona acceso a los paneles de control virtuales, permite cargar imágenes de máquinas virtuales e interactuar con construcciones de Kubernetes como servicios, sin utilizar directamente la API o las CRD.
ja: KubeVirtには、標準のKubernetes CLIツールである<literal>kubectl</literal>とともに、仮想化の世界とKubernetesが設計された世界との間のギャップを埋める方法でクラスタとのインタフェースを可能にするCLIユーティリティが付属しています。たとえば、 <literal>virtctl</literal>ツールは、APIやCRDを直接使用することなく、仮想マシンのライフサイクル(起動、停止、再起動など)の管理、仮想コンソールへのアクセスの提供、仮想マシンイメージのアップロード、サービスなどのKubernetesコンストラクトとのインタフェースを行う機能を提供します。
pt_br: Junto com a ferramenta CLI padrão do Kubernetes, ou seja, <literal>kubectl</literal>, o KubeVirt integra um utilitário CLI complementar que permite estabelecer interface com seu cluster para suprir algumas lacunas entre o cenário da virtualização e o cenário para o qual o Kubernetes foi projetado. Por exemplo, a ferramenta <literal>virtctl</literal> permite gerenciar o ciclo de vida das máquinas virtuais (início, parada, reinicialização etc.), concedendo acesso aos consoles virtuais, fazendo upload das imagens de máquina virtual e estabelecendo interface com as estruturas do Kubernetes, como serviços, sem usar diretamente a API ou as CRDs.
zh_cn: 除了标准的 Kubernetes 命令行工具（即 <literal>kubectl</literal>）之外，KubeVirt 还附带了一个配套的命令行实用程序，它能让你与群集进行交互，从而填补虚拟化领域与 Kubernetes 设计初衷所面向的领域之间的一些空白。例如，<literal>virtctl</literal> 工具提供了管理虚拟机生命周期（启动、停止、重启等）、访问虚拟控制台、上载虚拟机映像以及与 Kubernetes 结构（如服务）交互的功能，且无需直接使用 API 或 CRD。

source: Let us download the latest stable version of the <literal>virtctl</literal> tool:
es: Vamos a descargar la última versión estable de la herramienta <literal>virtctl</literal>:
ja: <literal>virtctl</literal>ツールの最新の安定バージョンをダウンロードしましょう。
pt_br: Vamos fazer download da versão estável mais recente da ferramenta <literal>virtctl</literal>:
zh_cn: 我们来下载最新的稳定版 <literal>virtctl</literal> 工具：

source: If you are using a different architecture or a non-Linux machine, you can find other releases <link xl:href="https://github.com/kubevirt/kubevirt/releases">here</link>. You need to make this executable before proceeding, and it may be useful to move it to a location within your <literal>$PATH</literal>:
es: Si utiliza una arquitectura diferente o una máquina que no sea Linux, encontrará otras versiones <link xl:href="https://github.com/kubevirt/kubevirt/releases">aquí</link>. Debe hacer que este archivo sea ejecutable antes de continuar, y puede ser útil moverlo a una ubicación dentro de <literal>$PATH</literal>:
ja: 別のアーキテクチャまたはLinux以外のマシンを使用している場合は、他のリリースを<link xl:href="https://github.com/kubevirt/kubevirt/releases">こちら</link>で見つけることができます。続行する前に、この実行可能ファイルを作成する必要があります。また、実行可能ファイルを<literal>$PATH</literal>内の特定の場所に移動すると便利な場合があります。
pt_br: Se você usa uma arquitetura diferente ou uma máquina não Linux, pode encontrar outras versões <link xl:href="https://github.com/kubevirt/kubevirt/releases">aqui</link>. Antes de continuar, você precisa torná-la executável, o que pode ser útil para movê-la até um local em seu <literal>$PATH</literal>:
zh_cn: 如果您使用的是其他体系结构或非 Linux 计算机，可在<link xl:href="https://github.com/kubevirt/kubevirt/releases">此处</link>找到其他版本。需要先将其转换为可执行文件才能继续，将其移动到 <literal>$PATH</literal> 中的某个位置可能会有帮助：

source: You can then use the <literal>virtctl</literal> command-line tool to create virtual machines. Let us replicate our previous virtual machine, noting that we are piping the output directly into <literal>kubectl apply</literal>:
es: A continuación, puede utilizar la herramienta de línea de comandos <literal>virtctl</literal> para crear máquinas virtuales. Vamos a replicar nuestra máquina virtual anterior, teniendo en cuenta que estamos canalizando la salida directamente a <literal>kubectl apply</literal>:
ja: その後、<literal>virtctl</literal>コマンドラインツールを使用して、仮想マシンを作成できます。出力を<literal>kubectl apply</literal>に直接パイプしていることに注意して、前の仮想マシンを複製してみましょう。
pt_br: Na sequência, use a ferramenta de linha de comando <literal>virtctl</literal> para criar máquinas virtuais. Vamos replicar nossa máquina virtual anterior, observando que estamos fazendo pipe da saída diretamente em <literal>kubectl apply</literal>:
zh_cn: 然后，可以使用 <literal>virtctl</literal> 命令行工具创建虚拟机。我们来复制前面创建的虚拟机，请注意我们会通过管道将输出直接传入 <literal>kubectl apply</literal>：

source: This should then show the virtual machine running (it should start a lot quicker this time given that the container image will be cached):
es: Esto debería mostrar la máquina virtual en ejecución (esta vez debería iniciarse mucho más rápido, ya que la imagen del contenedor estará almacenada en caché):
ja: これで、仮想マシンが実行されているのがわかります(コンテナイメージがキャッシュされるため、今回はかなり早く起動するはずです)。
pt_br: Isso deve mostrar a máquina virtual em execução (desta vez, ela deve ser iniciada de forma bem mais rápida, já que a imagem de contêiner estará armazenada em cache):
zh_cn: 此命令应会显示虚拟机正在运行（由于容器映像将被缓存，因此这一次虚拟机的启动速度更快一些）：

source: Now we can use <literal>virtctl</literal> to connect directly to the virtual machine:
es: Ahora, podemos usar <literal>virtctl</literal> para conectarnos directamente a la máquina virtual:
ja: これで、 <literal>virtctl</literal>を使用して仮想マシンに直接接続できるようになりました。
pt_br: Vamos usar <literal>virtctl</literal> para conexão direta com a máquina virtual:
zh_cn: 现在我们可以使用 <literal>virtctl</literal> 直接连接到该虚拟机：

source: There are plenty of other commands that can be used by <literal>virtctl</literal>. For example, <literal>virtctl console</literal> can give you access to the serial console if networking is not working, and you can use <literal>virtctl guestosinfo</literal> to get comprehensive OS information, subject to the guest having the <literal>qemu-guest-agent</literal> installed and running.
es: Se pueden utilizar muchos otros comandos con <literal>virtctl</literal>. Por ejemplo, <literal>virtctl console</literal> permite acceder al panel de control serie si la red no funciona, y puede utilizar <literal>virtctl guestosinfo</literal> para obtener información completa sobre el sistema operativo, siempre que el invitado tenga instalado y en ejecución <literal>qemu-guest-agent</literal>.
ja: <literal>virtctl</literal>で使用可能なコマンドはほかにも多数あります。たとえば、 <literal>virtctl console</literal>を使用すると、ネットワーキングが機能していない場合にシリアルコンソールにアクセスでき、<literal>virtctl guestosinfo</literal>を使用すると、ゲストに<literal>qemu-guest-agent</literal>がインストールされていて実行されていれば、包括的なOS情報を取得できます。
pt_br: Há vários outros comandos que o <literal>virtctl</literal> pode usar. Por exemplo, o <literal>virtctl console</literal> concede a você acesso ao console serial quando a rede não está funcionando, e você pode usar o <literal>virtctl guestosinfo</literal> para obter as informações completas do sistema operacional, desde que o convidado tenha o <literal>qemu-guest-agent</literal> instalado e em execução.
zh_cn: <literal>virtctl</literal> 还可以使用其他许多命令。例如，如果网络出现故障，您可以使用 <literal>virtctl console</literal> 访问串行控制台；可以使用 <literal>virtctl guestosinfo</literal> 获取详细的操作系统信息，前提是已在 Guest 上安装并运行 <literal>qemu-guest-agent</literal>。

source: Finally, let us pause and resume the virtual machine:
es: Por último, hagamos una pausa y reiniciemos la máquina virtual:
ja: 最後に、仮想マシンを一時停止し、再開してみましょう。
pt_br: Por fim, vamos pausar e retomar a máquina virtual:
zh_cn: 最后，我们来暂停再恢复该虚拟机：

source: You find that the <literal>VirtualMachine</literal> object shows as <emphasis role="strong">Paused</emphasis> and the <literal>VirtualMachineInstance</literal> object shows as <emphasis role="strong">Running</emphasis> but <emphasis role="strong">READY=False</emphasis>:
es: Verá que el objeto <literal>VirtualMachine</literal> aparece como <emphasis role="strong">Paused</emphasis> (En pausa) y el objeto <literal>VirtualMachineInstance</literal> aparece como <emphasis role="strong">Running</emphasis> (En ejecución), pero como <emphasis role="strong">READY=False</emphasis>:
ja: <literal>VirtualMachine</literal>オブジェクトが「<emphasis role="strong">Paused</emphasis>」と表示され、<literal>VirtualMachineInstance</literal>オブジェクトは「<emphasis role="strong">Running</emphasis>」ですが「<emphasis role="strong">READY=False</emphasis>」と表示されているのがわかります。
pt_br: Observe que o objeto <literal>VirtualMachine</literal> aparece como <emphasis role="strong">Paused</emphasis> (Pausado), e o objeto <literal>VirtualMachineInstance</literal> como <emphasis role="strong">Running</emphasis> (Em execução), mas <emphasis role="strong">READY=False</emphasis> (PRONTO=Falso):
zh_cn: 您会发现，<literal>VirtualMachine</literal> 对象显示为 <emphasis role="strong">Paused</emphasis>，而 <literal>VirtualMachineInstance</literal> 对象则显示为 <emphasis role="strong">Running</emphasis>，但同时显示了 <emphasis role="strong">READY=False</emphasis>：

source: You also find that you can no longer connect to the virtual machine:
es: También comprobará que ya no puede conectarse a la máquina virtual:
ja: また、仮想マシンに接続できなくなっていることもわかります。
pt_br: Veja também que não é mais possível se conectar à máquina virtual:
zh_cn: 您还会发现不再可以连接到该虚拟机：

source: Let us resume the virtual machine and try again:
es: Reiniciemos la máquina virtual y volvamos a intentarlo:
ja: 仮想マシンを再開して、もう一度試してみましょう。
pt_br: Vamos retomar a máquina virtual e tentar novamente:
zh_cn: 我们来恢复该虚拟机并重试：
