Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The <literal>custom/files</literal> folder contains the following files:
es: La carpeta <literal>custom/files</literal> contiene los siguientes archivos:
ja: <literal>custom/files</literal>フォルダには、次のファイルが含まれます。
pt_br: A pasta <literal>custom/files</literal> contém os seguintes arquivos:
zh_cn: <literal>custom/files</literal> 文件夹包含以下文件：

source: <literal>basic-setup.sh</literal>: contains configuration parameters for <literal>Metal<superscript>3</superscript></literal>, <literal>Rancher</literal> and <literal>MetalLB</literal>. Only modify this file if you want to change the namespaces to be used.
es: <literal>basic-setup.sh</literal>: contiene los parámetros de configuración para <literal>Metal<superscript>3</superscript></literal>, <literal>Rancher</literal> y <literal>MetalLB</literal>. Solo debe modificar este archivo si desea cambiar los espacios de nombres que se van a utilizar.
ja: <literal>basic-setup.sh</literal>: <literal>Metal<superscript>3</superscript></literal>、<literal>Rancher</literal>、<literal>MetalLB</literal>の設定パラメータが含まれます。このファイルを変更するのは、使用するネームスペースを変更する場合のみにしてください。
pt_br: <literal>basic-setup.sh</literal>: inclui os parâmetros de configuração para <literal>Metal<superscript>3</superscript></literal>, <literal>Rancher</literal> e <literal>MetalLB</literal>. Modifique esse arquivo apenas para alterar os namespaces usados.
zh_cn: <literal>basic-setup.sh</literal>：包含 <literal>Metal<superscript>3</superscript></literal>、<literal>Rancher</literal> 和 <literal>MetalLB</literal> 的配置参数。仅当您要更改要使用的名称空间时，才需修改此文件。

source: <literal>metal3.sh</literal>: contains the configuration for the <literal>Metal<superscript>3</superscript></literal> component to be used (no modifications needed). In future versions, this script will be replaced to use instead <literal>Rancher Turtles</literal> to make it easy.
es: <literal>metal3.sh</literal>: contiene la configuración del componente <literal>Metal<superscript>3</superscript></literal> que se va a utilizar (no es necesario modificarlo). En futuras versiones, este guion se sustituirá por <literal>Rancher Turtles</literal> para facilitar su uso.
ja: <literal>metal3.sh</literal>: 使用する<literal>Metal<superscript>3</superscript></literal>コンポーネントの設定が含まれます(変更不要)。今後のバージョンでは、このスクリプトは代わりに<literal>Rancher Turtles</literal>を使用するように置き換えられて、使いやすくなる予定です。
pt_br: <literal>metal3.sh</literal>: inclui a configuração para o componente <literal>Metal<superscript>3</superscript></literal> usado (sem necessidade de modificação). Em versões futuras, esse script será usado no lugar do <literal>Rancher Turtles</literal> para facilitar o uso.
zh_cn: <literal>metal3.sh</literal>：包含要使用的 <literal>Metal<superscript>3</superscript></literal> 组件的配置（无需修改）。在将来的版本中将替换此脚本，以改用 <literal>Rancher Turtles</literal> 来简化配置。

source: <literal>rancher.sh</literal>: contains the configuration for the <literal>Rancher</literal> component to be used (no modifications needed).
es: <literal>rancher.sh</literal>: contiene la configuración del componente <literal>Rancher</literal> que se va a utilizar (no es necesario modificarlo).
ja: <literal>rancher.sh</literal>: 使用する<literal>Rancher</literal>コンポーネントの設定が含まれます(変更不要)。
pt_br: <literal>rancher.sh</literal>: inclui a configuração para o componente <literal>Rancher</literal> usado (sem necessidade de modificação).
zh_cn: <literal>rancher.sh</literal>：包含要使用的 <literal>Rancher</literal> 组件的配置（无需修改）。

source: <literal>mgmt-stack-setup.service</literal>: contains the configuration to create the systemd service to run the scripts during the first boot (no modifications needed).
es: <literal>mgmt-stack-setup.service</literal>: contiene la configuración para crear el servicio systemd que ejecutará los guiones durante el primer arranque (no es necesario modificarlo).
ja: <literal>mgmt-stack-setup.service</literal>: systemdサービスを作成して初回ブート時にスクリプトを実行するための設定が含まれます(変更不要)。
pt_br: <literal>mgmt-stack-setup.service</literal>: contém a configuração para criar o serviço systemd para executar os scripts durante a primeira inicialização (nenhuma modificação é necessária).
zh_cn: <literal>mgmt-stack-setup.service</literal>：包含用于创建 systemd 服务，以便在首次引导期间运行脚本的配置（无需修改）。

source: The <literal>custom/scripts</literal> folder contains the following files:
es: La carpeta <literal>custom/scripts</literal> contiene los siguientes archivos:
ja: <literal>custom/scripts</literal>フォルダには次のファイルが含まれます。
pt_br: A pasta <literal>custom/scripts</literal> contém os seguintes arquivos:
zh_cn: <literal>custom/scripts</literal> 文件夹包含以下文件：

source: <literal>99-alias.sh</literal> script: contains the alias to be used by the management cluster to load the kubeconfig file at first boot (no modifications needed).
es: Guion <literal>99-alias.sh</literal>: contiene el alias que usará el clúster de gestión para cargar el archivo kubeconfig en el primer arranque (no es necesario modificarlo).
ja: <literal>99-alias.sh</literal>スクリプト: 管理クラスタが初回ブート時にkubeconfigファイルを読み込むために使用するエイリアスが含まれます(変更不要)。
pt_br: Script <literal>99-alias.sh</literal>: contém o álias que o cluster de gerenciamento usa para carregar o arquivo kubeconfig na primeira inicialização (sem necessidade de modificação).
zh_cn: <literal>99-alias.sh</literal> 脚本：包含管理群集在首次引导时用来加载 kubeconfig 文件的别名（无需修改）。

source: <literal>99-mgmt-setup.sh</literal> script: contains the configuration to copy the scripts during the first boot (no modifications needed).
es: Guion <literal>99-mgmt-setup.sh</literal>: contiene la configuración para copiar los guiones durante el primer arranque (no es necesario modificarlo).
ja: <literal>99-mgmt-setup.sh</literal>スクリプト: 初回ブート時にスクリプトをコピーするための設定が含まれます(変更不要)。
pt_br: Script <literal>99-mgmt-setup.sh</literal>: contém a configuração para copiar os scripts durante a primeira inicialização (sem necessidade de modificação).
zh_cn: <literal>99-mgmt-setup.sh</literal> 脚本：包含首次引导期间用于复制脚本的配置（无需修改）。

source: <literal>99-register.sh</literal> script: contains the configuration to register the system using the SCC registration code. The <literal>${SCC_ACCOUNT_EMAIL}</literal> and <literal>${SCC_REGISTRATION_CODE}</literal> have to be set properly to register the system with your account.
es: Guion <literal>99-register.sh</literal>: contiene la configuración para registrar el sistema usando el código de registro del Centro de servicios al cliente de SUSE. Los elementos <literal>${SCC_ACCOUNT_EMAIL}</literal> y <literal>${SCC_REGISTRATION_CODE}</literal> deben configurarse correctamente para registrar el sistema con su cuenta.
ja: <literal>99-register.sh</literal>スクリプト: SCC登録コードを使用してシステムを登録するための設定が含まれます。アカウントにシステムを登録するには、<literal>${SCC_ACCOUNT_EMAIL}</literal>および<literal>${SCC_REGISTRATION_CODE}</literal>が正しく設定されている必要があります。
pt_br: Script <literal>99-register.sh</literal>: contém a configuração para registrar o sistema usando o código de registro do SCC. O <literal>${SCC_ACCOUNT_EMAIL}</literal> e o <literal>${SCC_REGISTRATION_CODE}</literal> devem ser devidamente definidos para registrar o sistema com a sua conta.
zh_cn: <literal>99-register.sh</literal> 脚本：包含用于通过 SCC 注册代码注册系统的配置。必须正确设置 <literal>${SCC_ACCOUNT_EMAIL}</literal> 和 <literal>${SCC_REGISTRATION_CODE}</literal> 才能使用您的帐户注册系统。

source: Kubernetes folder
es: Carpeta kubernetes
ja: Kubernetesフォルダ
pt_br: Pasta kubernetes
zh_cn: Kubernetes 文件夹

source: The <literal>kubernetes</literal> folder contains the following subfolders:
es: La carpeta <literal>kubernetes</literal> contiene las siguientes subcarpetas:
ja: <literal>kubernetes</literal>フォルダには次のサブフォルダが含まれます。
pt_br: A pasta <literal>kubernetes</literal> contém as seguintes subpastas:
zh_cn: <literal>kubernetes</literal> 文件夹包含以下子文件夹：

source: The <literal>kubernetes/config</literal> folder contains the following files:
es: La carpeta <literal>kubernetes/config</literal> contiene los siguientes archivos:
ja: <literal>kubernetes/config</literal>フォルダには次のファイルが含まれます。
pt_br: A pasta <literal>kubernetes/config</literal> contém os seguintes arquivos:
zh_cn: <literal>kubernetes/config</literal> 文件夹包含以下文件：

source: <literal>server.yaml</literal>: By default, the <literal>CNI</literal> plug-in installed by default is <literal>Cilium</literal>, so you do not need to create this folder and file. Just in case you need to customize the <literal>CNI</literal> plug-in, you can use the <literal>server.yaml</literal> file under the <literal>kubernetes/config</literal> folder. It contains the following information:
es: <literal>server.yaml</literal>: de forma predeterminada, el complemento de <literal>CNI</literal> instalado por defecto es <literal>Cilium</literal>, por lo que no es necesario crear esta carpeta ni este archivo. En caso de que necesite personalizar el complemento de <literal>CNI</literal>, puede usar el archivo <literal>server.yaml</literal> que se encuentra en la carpeta <literal>kubernetes/config</literal>. Contiene la siguiente información:
ja: <literal>server.yaml</literal>: デフォルトでは、デフォルトでインストールされている<literal>CNI</literal>プラグインは<literal>Cilium</literal>であるため、このフォルダとファイルを作成する必要はありません。<literal>CNI</literal>プラグインをカスタマイズする必要がある場合に備えて、<literal>kubernetes/config</literal>フォルダにある<literal>server.yaml</literal>ファイルを使用できます。このファイルには次の情報が含まれます。
pt_br: <literal>server.yaml</literal>: por padrão, o plug-in de <literal>CNI</literal> instalado é o <literal>Cilium</literal>, portanto, você não precisa criar a pasta nem o arquivo. Caso seja necessário personalizar o plug-in de <literal>CNI</literal>, use o arquivo <literal>server.yaml</literal> na pasta <literal>kubernetes/config</literal>, que contém as seguintes informações:
zh_cn: <literal>server.yaml</literal>：默认安装的 <literal>CNI</literal> 插件是 <literal>Cilium</literal>，因此不需要创建此文件夹和文件。如果您需要自定义 <literal>CNI</literal> 插件，可以使用 <literal>kubernetes/config</literal> 文件夹中的 <literal>server.yaml</literal> 文件。该文件包含以下信息：

source: This is an optional file to define certain Kubernetes customization, like the CNI plug-ins to be used or many options you can check in the <link xl:href="https://docs.rke2.io/install/configuration">official documentation</link>.
es: Se trata de un archivo opcional para definir ciertas personalizaciones de Kubernetes, como los complementos de CNI que se utilizarán o muchas opciones que puede consultar en la <link xl:href="https://docs.rke2.io/install/configuration">documentación oficial</link>.
ja: これは、使用するCNIプラグインなどの特定のKubernetesカスタマイズを定義する任意のファイルです。さまざまなオプションについては、<link xl:href="https://docs.rke2.io/install/configuration">公式ドキュメント</link>で確認できます。
pt_br: Esse é um arquivo opcional para definir personalizações do Kubernetes, como os plug-ins de CNI usados ou várias opções que você pode conferir na <link xl:href="https://docs.rke2.io/install/configuration">documentação oficial</link>.
zh_cn: 这是一个可选文件，用于定义某些 Kubernetes 自定义设置，例如要使用的 CNI 插件，或<link xl:href="https://docs.rke2.io/install/configuration">官方文档</link>中所述的许多选项。

source: The <literal>os-files/var/lib/rancher/rke2/server/manifests</literal> folder contains the following file:
es: La carpeta <literal>os-files/var/lib/rancher/rke2/server/manifests</literal> contiene el archivo siguiente:
ja: <literal>os-files/var/lib/rancher/rke2/server/manifests</literal>フォルダには次のファイルが含まれます。
zh_cn: <literal>os-files/var/lib/rancher/rke2/server/manifests</literal> 文件夹包含以下文件：

source: <literal>rke2-ingress-config.yaml</literal>: contains the configuration to create the <literal>Ingress</literal> service for the management cluster (no modifications needed).
es: <literal>rke2-ingress-config.yaml</literal>: contiene la configuración para crear el servicio <literal>Ingress</literal> para el clúster de gestión (no es necesario modificarlo).
ja: <literal>rke2-ingress-config.yaml</literal>: 管理クラスタ用の<literal>Ingress</literal>サービスを作成するための設定が含まれます(変更不要)。
pt_br: <literal>rke2-ingress-config.yaml</literal>: contém a configuração para criar o serviço <literal>Ingress</literal> para o cluster de gerenciamento (sem necessidade de modificação).
zh_cn: <literal>rke2-ingress-config.yaml</literal>：包含用于为管理群集创建<literal>入口</literal>服务的配置（无需修改）。

source: The <literal>HelmChartConfig</literal> must be included via <literal>os-files</literal> to the <literal>/var/lib/rancher/rke2/server/manifests</literal> directory, not via <literal>kubernetes/manifests</literal> as described in previous releases.
es: Se debe incluir <literal>HelmChartConfig</literal> mediante <literal>os-files</literal> en el directorio <literal>/var/lib/rancher/rke2/server/manifests</literal>, no mediante <literal>kubernetes/manifests</literal> como se describe en las versiones anteriores.
ja: <literal>HelmChartConfig</literal>は、以前のリリースで説明している<literal>kubernetes/manifests</literal>経由ではなく、<literal>os-files</literal>経由で<literal>/var/lib/rancher/rke2/server/manifests</literal>ディレクトリに含める必要があります。
zh_cn: 必须通过 <literal>os-files</literal> 将 <literal>HelmChartConfig</literal> 放入 <literal>/var/lib/rancher/rke2/server/manifests</literal> 目录，而非像之前版本中所述通过 <literal>kubernetes/manifests</literal> 放入。

source: The <literal>kubernetes/manifests</literal> folder contains the following files:
es: La carpeta <literal>kubernetes/manifests</literal> contiene los siguientes archivos:
ja: <literal>kubernetes/manifests</literal>フォルダには次のファイルが含まれます。
pt_br: A pasta <literal>kubernetes/manifests</literal> contém os seguintes arquivos:
zh_cn: <literal>kubernetes/manifests</literal> 文件夹包含以下文件：

source: <literal>neuvector-namespace.yaml</literal>: contains the configuration to create the <literal>NeuVector</literal> namespace (no modifications needed).
es: <literal>neuvector-namespace.yaml</literal>: contiene la configuración para crear el espacio de nombres <literal>NeuVector</literal> (no es necesario modificarlo).
ja: <literal>neuvector-namespace.yaml</literal>: <literal>NeuVector</literal>ネームスペースを作成するための設定が含まれます(変更不要)。
pt_br: <literal>neuvector-namespace.yaml</literal>: contém a configuração para criar o namespace <literal>NeuVector</literal> (sem necessidade de modificação).
zh_cn: <literal>neuvector-namespace.yaml</literal>：包含用于创建 <literal>NeuVector</literal> 名称空间的配置（无需修改）。

source: <literal>ingress-l2-adv.yaml</literal>: contains the configuration to create the <literal>L2Advertisement</literal> for the <literal>MetalLB</literal> component (no modifications needed).
es: <literal>ingress-l2-adv.yaml</literal>: contiene la configuración para crear el <literal>L2Advertisement</literal> para el componente <literal>MetalLB</literal> (no es necesario modificarlo).
ja: <literal>ingress-l2-adv.yaml</literal>: <literal>MetalLB</literal>コンポーネントの<literal>L2Advertisement</literal>を作成するための設定が含まれます(変更不要)。
pt_br: <literal>ingress-l2-adv.yaml</literal>: contém a configuração para criar o <literal>L2Advertisement</literal> para o componente <literal>MetalLB</literal> (sem necessidade de modificação).
zh_cn: <literal>ingress-l2-adv.yaml</literal>：包含用于为 <literal>MetalLB</literal> 组件创建 <literal>L2Advertisement</literal> 的配置（无需修改）。

source: <literal>ingress-ippool.yaml</literal>: contains the configuration to create the <literal>IPAddressPool</literal> for the <literal>rke2-ingress-nginx</literal> component. The <literal>${INGRESS_VIP}</literal> has to be set properly to define the IP address reserved to be used by the <literal>rke2-ingress-nginx</literal> component.
es: <literal>ingress-ippool.yaml</literal>: contiene la configuración para crear el <literal>IPAddressPool</literal> para el componente <literal>rke2-ingress-nginx</literal>. <literal>${INGRESS_VIP}</literal> debe configurarse correctamente para definir la dirección IP reservada para usarse por el componente <literal>rke2-ingress-nginx</literal>.
ja: <literal>ingress-ippool.yaml</literal>: <literal>rke2-ingress-nginx</literal>コンポーネントの<literal>IPAddressPool</literal>を作成するための設定が含まれます。<literal>${INGRESS_VIP}</literal>を正しく設定し、<literal>rke2-ingress-nginx</literal>コンポーネントで使用するために予約するIPアドレスを定義する必要があります。
pt_br: <literal>ingress-ippool.yaml</literal>: contém a configuração para criar o <literal>IPAddressPool</literal> para o componente <literal>rke2-ingress-nginx</literal>. O <literal>${INGRESS_VIP}</literal> deve ser definido apropriadamente para especificar o endereço IP reservado que o componente <literal>rke2-ingress-nginx</literal> usará.
zh_cn: <literal>ingress-ippool.yaml</literal>：包含用于为 <literal>rke2-ingress-nginx</literal> 组件创建 <literal>IPAddressPool</literal> 的配置。必须正确设置 <literal>${INGRESS_VIP}</literal>，以定义预留给 <literal>rke2-ingress-nginx</literal> 组件使用的 IP 地址。

source: The <literal>kubernetes/helm/values</literal> folder contains the following files:
es: La carpeta <literal>kubernetes/helm/values</literal> contiene los siguientes archivos:
ja: <literal>kubernetes/helm/values</literal>フォルダには次のファイルが含まれます。
pt_br: A pasta <literal>kubernetes/helm/values</literal> contém os seguintes arquivos:
zh_cn: <literal>kubernetes/helm/values</literal> 文件夹包含以下文件：

source: <literal>rancher.yaml</literal>: contains the configuration to create the <literal>Rancher</literal> component. The <literal>${INGRESS_VIP}</literal> must be set properly to define the IP address to be consumed by the <literal>Rancher</literal> component. The URL to access the <literal>Rancher</literal> component will be <literal>https://rancher-${INGRESS_VIP}.sslip.io</literal>.
es: <literal>rancher.yaml</literal>: contiene la configuración para crear el componente <literal>Rancher</literal>. <literal>${INGRESS_VIP}</literal> debe configurarse correctamente para definir la dirección IP que utilizará el componente <literal>Rancher</literal>. La URL para acceder al componente <literal>Rancher</literal> será <literal>https://rancher-${INGRESS_VIP}.sslip.io</literal>.
ja: <literal>rancher.yaml</literal>: <literal>Rancher</literal>コンポーネントを作成する設定が含まれます。<literal>${INGRESS_VIP}</literal>を正しく設定して、<literal>Rancher</literal>コンポーネントで使用するIPアドレスを定義する必要があります。<literal>Rancher</literal>コンポーネントにアクセスするURLは、<literal>https://rancher-${INGRESS_VIP}.sslip.io</literal>です。
pt_br: <literal>rancher.yaml</literal>: contém a configuração para criar o componente <literal>Rancher</literal>. É necessário definir apropriadamente o <literal>${INGRESS_VIP}</literal> para especificar o endereço IP que o componente <literal>Rancher</literal> consumirá. O URL para acessar o componente <literal>Rancher</literal> será <literal>https://rancher-${INGRESS_VIP}.sslip.io</literal>.
zh_cn: <literal>rancher.yaml</literal>：包含用于创建 <literal>Rancher</literal> 组件的配置。必须正确设置 <literal>${INGRESS_VIP}</literal>，以定义 <literal>Rancher</literal> 组件要使用的 IP 地址。用于访问 <literal>Rancher</literal> 组件的 URL 为 <literal>https://rancher-${INGRESS_VIP}.sslip.io</literal>。

source: <literal>neuvector.yaml</literal>: contains the configuration to create the <literal>NeuVector</literal> component (no modifications needed).
es: <literal>neuvector.yaml</literal>: contiene la configuración para crear el componente <literal>NeuVector</literal> (no es necesario modificarlo).
ja: <literal>neuvector.yaml</literal>: <literal>NeuVector</literal>コンポーネントを作成するための設定が含まれます(変更不要)。
pt_br: <literal>neuvector.yaml</literal>: contém a configuração para criar o componente <literal>NeuVector</literal> (sem necessidade de modificação).
zh_cn: <literal>neuvector.yaml</literal>：包含用于创建 <literal>NeuVector</literal> 组件的配置（无需修改）。

source: <literal>longhorn.yaml</literal>: contains the configuration to create the <literal>Longhorn</literal> component (no modifications needed).
es: <literal>longhorn.yaml</literal>: contiene la configuración para crear el componente <literal>Longhorn</literal> (no se necesitan modificaciones).
ja: <literal>longhorn.yaml</literal>: <literal>Longhorn</literal>コンポーネントを作成するための設定が含まれます(変更不要)。
zh_cn: <literal>longhorn.yaml</literal>：包含用于创建 <literal>Longhorn</literal> 组件的配置（无需修改）。

source: <literal>metal3.yaml</literal>: contains the configuration to create the <literal>Metal<superscript>3</superscript></literal> component. The <literal>${METAL3_VIP}</literal> must be set properly to define the IP address to be consumed by the <literal>Metal<superscript>3</superscript></literal> component.
es: <literal>metal3.yaml</literal>: contiene la configuración para crear el componente <literal>Metal<superscript>3</superscript></literal>. <literal>${METAL3_VIP}</literal> debe configurarse correctamente para definir la dirección IP que utilizará el componente <literal>Metal<superscript>3</superscript></literal>.
ja: <literal>metal3.yaml</literal>: <literal>Metal<superscript>3</superscript></literal>コンポーネントを作成するための設定が含まれます。<literal>${METAL3_VIP}</literal>を正しく設定して、<literal>Metal<superscript>3</superscript></literal>コンポーネントで使用するIPアドレスを定義する必要があります。
pt_br: <literal>metal3.yaml</literal>: contém a configuração para criar o componente <literal>Metal<superscript>3</superscript></literal>. É necessário definir apropriadamente o <literal>${METAL3_VIP}</literal> para especificar o endereço IP que o componente <literal>Metal<superscript>3</superscript></literal> consumirá.
zh_cn: <literal>metal3.yaml</literal>：包含用于创建 <literal>Metal<superscript>3</superscript></literal> 组件的配置。必须正确设置 <literal>${METAL3_VIP}</literal>，以定义 <literal>Metal<superscript>3</superscript></literal> 组件要使用的 IP 地址。

source: The Media Server is an optional feature included in Metal<superscript>3</superscript> (by default is disabled). To use the Metal3 feature, you need to configure it on the previous manifest. To use the Metal<superscript>3</superscript> media server, specify the following variable:
es: El servidor de medios es una función opcional incluida en Metal<superscript>3</superscript> (inhabilitada de forma predeterminada). Para utilizar esta función de Metal3, es necesario configurarla en el manifiesto anterior. Para utilizar el servidor de medios de Metal<superscript>3</superscript>, especifique la siguiente variable:
ja: メディアサーバは、Metal<superscript>3</superscript>に含まれるオプションの機能です(デフォルトでは無効になっています)。このMetal3の機能を使用するには、以前のマニフェストで設定する必要があります。Metal<superscript>3</superscript>メディアサーバを使用するには、次の変数を指定します。
pt_br: O servidor de mídia é um recurso opcional incluído no Metal<superscript>3</superscript> (que está desabilitado por padrão). Para usar o recurso Metal3, configure-o no manifesto anterior. Para usar o servidor de mídia Metal<superscript>3</superscript>, especifique a seguinte variável:
zh_cn: 媒体服务器是 Metal<superscript>3</superscript> 中包含的可选功能（默认处于禁用状态）。要使用该 Metal3 功能，需要在前面所述的清单中配置该功能。要使用 Metal<superscript>3</superscript> 媒体服务器，请指定以下变量：

source: add the <literal>enable_metal3_media_server</literal> to <literal>true</literal> to enable the media server feature in the global section.
es: Defina <literal>enable_metal3_media_server</literal> como <literal>true</literal> para habilitar la función de servidor de medios en la sección global.
ja: メディアサーバ機能を有効にするために、globalセクションに<literal>enable_metal3_media_server</literal>を追加して<literal>true</literal>に設定します。
pt_br: adicione <literal>enable_metal3_media_server</literal> a <literal>true</literal> para habilitar o recurso de servidor de mídia na seção global.
zh_cn: 在 global 部分，将 <literal>enable_metal3_media_server</literal> 设置为 <literal>true</literal> 以启用媒体服务器功能。

source: include the following configuration about the media server where ${MEDIA_VOLUME_PATH} is the path to the media volume in the media (e.g <literal>/home/metal3/bmh-image-cache</literal>)
es: Incluya la siguiente configuración sobre el servidor de medios, donde ${MEDIA_VOLUME_PATH} es la ruta al volumen de medios en el medio (por ejemplo, <literal>/home/metal3/bmh-image-cache</literal>).
ja: メディアサーバ設定に次の内容を含めます。${MEDIA_VOLUME_PATH}はメディア内のメディアボリュームのパスです(例: <literal>/home/metal3/bmh-image-cache</literal>)。
pt_br: inclua a seguinte configuração sobre o servidor de mídia, em que ${MEDIA_VOLUME_PATH} é o caminho para o volume da mídia (por exemplo, <literal>/home/metal3/bmh-image-cache</literal>).
zh_cn: 包含有关媒体服务器的以下配置，其中 ${MEDIA_VOLUME_PATH} 是媒体卷在媒体中的路径（例如 <literal>/home/metal3/bmh-image-cache</literal>）
