Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <literal>-f</literal> requires the file name of the configuration file to use; <literal>/etc/ptp4l-G.8275.1.conf</literal> in this case
es: <literal>-f</literal> requiere el nombre del archivo de configuración que se va a utilizar; en este caso, <literal>/etc/ptp4l-G.8275.1.conf</literal>.
ja: <literal>-f</literal>には、使用する設定ファイルのファイル名が必要です。この場合は<literal>/etc/ptp4l-G.8275.1.conf</literal>。
pt_br: <literal>-f</literal> requer o nome do arquivo de configuração que será usado; neste caso, <literal>/etc/ptp4l-G.8275.1.conf</literal>.
zh_cn: <literal>-f</literal> 指定要使用的配置文件名称（此处为 <literal>/etc/ptp4l-G.8275.1.conf</literal>）。

source: <literal>-i</literal> requires the name of the interface to use, replace <literal>$IFNAME</literal> with a real interface name.
es: <literal>-i</literal> requiere el nombre de la interfaz que se va a utilizar. Sustituya <literal>$IFNAME</literal> por el nombre real de la interfaz.
ja: <literal>-i</literal>には、使用するインタフェースの名前が必要です。<literal>$IFNAME</literal>を実際のインタフェース名に置き換えます。
pt_br: <literal>-i</literal> requer o nome da interface que será usada. Substitua <literal>$IFNAME</literal> pelo nome da interface real.
zh_cn: <literal>-i</literal> 指定要使用的接口名称，请将 <literal>$IFNAME</literal> 替换为实际接口名称。

source: <literal>--message_tag</literal> allows to better identify the ptp4l output in the system logs and is optional.
es: <literal>--message_tag</literal> permite identificar mejor la salida de ptp4l en los registros del sistema y es opcional.
ja: <literal>--message_tag</literal>は、システムログ内のptp4l出力を適切に特定できるようにし、オプションです。
pt_br: <literal>--message_tag</literal> permite identificar melhor a saída de ptp4l nos registros do sistema e é opcional.
zh_cn: <literal>--message_tag</literal> 可用于在系统日志中更好地识别 ptp4l 输出，这是可选参数。

source: Once the steps above are complete, the <literal>ptp4l</literal> daemon must be (re)started:
es: Una vez completados los pasos anteriores, se debe (re)iniciar el daemon <literal>ptp4l</literal>:
ja: 上記の手順が完了したら、<literal>ptp4l</literal>デーモンを(再)起動する必要があります。
pt_br: Após a conclusão das etapas acima, o daemon <literal>ptp4l</literal> deverá ser (re)iniciado:
zh_cn: 完成上述步骤后，必须（重新）启动 <literal>ptp4l</literal> 守护程序：

source: Check the synchronization status by observing the logs with:
es: Compruebe el estado de sincronización observando los registros con:
ja: 次のコマンドを使用してログを調べ、同期ステータスを確認します。
pt_br: Verifique o status da sincronização observando os registros com:
zh_cn: 运行以下命令，通过观察日志来检查同步状态：

source: PTP profile ITU-T G.8275.2
es: Perfil ITU-T G.8275.2 de PTP
ja: PTPプロファイルITU-T G.8275.2
pt_br: Perfil de PTP ITU-T G.8275.2
zh_cn: PTP 配置文件 ITU-T G.8275.2

source: The G.8275.2 profile has the following specifics:
es: El perfil G.8275.2 tiene las siguientes especificaciones:
ja: G.8275.2プロファイルには、次の特徴があります。
pt_br: O perfil G.8275.2 tem as seguintes especificações:
zh_cn: G.8275.2 配置文件具有以下特点：

source: Runs on IP and does not require full network support (adjacent nodes/switches may not support PTP).
es: Funciona con IP y no requiere soporte de red completo (los nodos/conmutadores adyacentes pueden no ser compatibles con PTP).
ja: IP上で実行し、完全なネットワークサポートは不要です(隣接するノード/スイッチはPTPをサポートしていない場合があります)。
pt_br: Executado em IP e não requer suporte total à rede (nós/comutadores adjacentes podem não dar suporte a PTP).
zh_cn: 运行在 IP 上，不需要完整的网络支持（相邻节点/交换机可以不支持 PTP）。

source: The default domain setting is 44.
es: La configuración predeterminada del dominio es 44.
ja: デフォルトのドメイン設定は44です。
pt_br: A configuração de domínio padrão é 44.
zh_cn: 默认域设置为 44。

source: Copy the following content to a file named <literal>/etc/ptp4l-G.8275.2.conf</literal>:
es: Copie el siguiente contenido en un archivo llamado <literal>/etc/ptp4l-G.8275.2.conf</literal>:
ja: 次のコンテンツを<literal>/etc/ptp4l-G.8275.2.conf</literal>という名前のファイルにコピーします。
pt_br: Copie o seguinte conteúdo para o arquivo chamado <literal>/etc/ptp4l-G.8275.2.conf</literal>:
zh_cn: 将以下内容复制到名为 <literal>/etc/ptp4l-G.8275.2.conf</literal> 的文件中：

source: Make sure to replace the following placeholders:
es: Asegúrese de sustituir los siguientes marcadores de posición:
ja: 次のプレースホルダーを必ず置き換えます。
pt_br: Substitua os seguintes espaços reservados:
zh_cn: 请确保替换以下占位符：

source: <literal>$PEER_IP_ADDRESS</literal> - the IP address of the next PTP node to communicate with, such as the master or boundary clock that will provide synchronization.
es: <literal>$PEER_IP_ADDRESS</literal>: la dirección IP del siguiente nodo PTP con el que se va a comunicar, como el reloj maestro o el reloj fronterizo que proporcionará la sincronización.
ja: <literal>$PEER_IP_ADDRESS</literal> - 同期を提供するマスタまたは境界クロックなど、通信する次のPTPノードのIPアドレス。
pt_br: <literal>$PEER_IP_ADDRESS</literal>: o endereço IP do nó PTP seguinte com o qual se comunicar, como o relógio mestre ou de limite que fornecerá a sincronização.
zh_cn: <literal>$PEER_IP_ADDRESS</literal> - 要与之通信的下一个 PTP 节点的 IP 地址，例如提供同步的主时钟或边界时钟。

source: <literal>$IFNAME</literal> - tells <literal>ptp4l</literal> what interface to use for PTP.
es: <literal>$IFNAME</literal>: indica a <literal>ptp4l</literal> qué interfaz debe utilizar para PTP.
ja: <literal>$IFNAME</literal> - <literal>ptp4l</literal>にPTPに使用するインタフェースを示します。
pt_br: <literal>$IFNAME</literal>: instrui o <literal>ptp4l</literal> sobre qual interface usar para PTP.
zh_cn: <literal>$IFNAME</literal> - 告知 <literal>ptp4l</literal> 使用哪个接口进行 PTP。

source: Once the file has been created, it must be referenced, along with the name of the interface to use for PTP, in <literal>/etc/sysconfig/ptp4l</literal> for the daemon to start correctly. This can be done by changing the <literal>OPTIONS=</literal> line to:
es: Una vez creado el archivo, debe referenciarse en <literal>/etc/sysconfig/ptp4l</literal> junto con el nombre de la interfaz que se utilizará para PTP para que el daemon se inicie correctamente. Puede hacerlo cambiando la línea <literal>OPTIONS=</literal> por:
ja: ファイルが作成されると、デーモンが正常に起動するように、PTPに使用するインタフェースの名前とともに、<literal>/etc/sysconfig/ptp4l</literal>で参照される必要があります。これを行うには、<literal>OPTIONS=</literal>行を次のように変更します。
pt_br: Após a criação do arquivo, faça referência a ele, junto com o nome da interface para PTP, em <literal>/etc/sysconfig/ptp4l</literal> para que o daemon seja iniciado corretamente. Para fazer isso, altere a linha <literal>OPTIONS=</literal> para:
zh_cn: 创建好文件后，必须在 <literal>/etc/sysconfig/ptp4l</literal> 中引用该文件以及 PTP 所用接口的名称，才能使守护程序正确启动。可通过将 <literal>OPTIONS=</literal> 行更改为以下内容实现：

source: <literal>-f</literal> requires the file name of the configuration file to use. In this case, it is <literal>/etc/ptp4l-G.8275.2.conf</literal>.
es: <literal>-f</literal> requiere el nombre del archivo de configuración que se va a utilizar. En este caso, es <literal>/etc/ptp4l-G.8275.2.conf</literal>.
ja: <literal>-f</literal>には、使用する設定ファイルのファイル名が必要です。この場合は、<literal>/etc/ptp4l-G.8275.2.conf</literal>です。
pt_br: <literal>-f</literal> requer o nome do arquivo de configuração que será usado; neste caso, <literal>/etc/ptp4l-G.8275.2.conf</literal>.
zh_cn: <literal>-f</literal> 指定要使用的配置文件名称（此处为 <literal>/etc/ptp4l-G.8275.2.conf</literal>）。

source: Configuration of phc2sys
es: Configuración de phc2sys
ja: phc2sysの設定
pt_br: Configuração do phc2sys
zh_cn: phc2sys 的配置

source: Although not required, it is recommended that you fully complete the configuration of <literal>ptp4l</literal> before moving to <literal>phc2sys</literal>. <literal>phc2sys</literal> does not require a configuration file and its execution parameters can be solely controlled through the <literal>OPTIONS=</literal> variable present in <literal>/etc/sysconfig/ptp4l</literal>, in a similar fashion to <literal>ptp4l</literal>:
es: Aunque no es obligatorio, se recomienda completar totalmente la configuración de <literal>ptp4l</literal> antes de pasar a <literal>phc2sys</literal>. <literal>phc2sys</literal> no requiere un archivo de configuración y sus parámetros de ejecución se pueden controlar únicamente a través de la variable <literal>OPTIONS=</literal> presente en <literal>/etc/sysconfig/ptp4l</literal>, de forma similar a <literal>ptp4l</literal>:
ja: 必須ではありませんが、<literal>phc2sys</literal>に移る前に、<literal>ptp4l</literal>の設定を完全に完了しておくことをお勧めします。<literal>phc2sys</literal>は設定ファイルを必要とせず、その実行パラメータは<literal>ptp4l</literal>と同様に、<literal>/etc/sysconfig/ptp4l</literal>に存在する<literal>OPTIONS=</literal>変数を通じてのみ制御できます。
pt_br: Embora não seja obrigatório, é recomendado completar toda a configuração de <literal>ptp4l</literal> antes de passar para o <literal>phc2sys</literal>. O <literal>phc2sys</literal> não requer um arquivo de configuração, e seus parâmetros de execução podem ser controlados unicamente pela variável <literal>OPTIONS=</literal> presente em <literal>/etc/sysconfig/ptp4l</literal>, de maneira similar a <literal>ptp4l</literal>:
zh_cn: 建议在配置 <literal>phc2sys</literal> 之前先完成 <literal>ptp4l</literal> 的全部配置，不过这不是强制要求。<literal>phc2sys</literal> 不需要配置文件，其执行参数可通过 <literal>/etc/sysconfig/ptp4l</literal> 中的 <literal>OPTIONS=</literal> 变量单独控制，方式与 <literal>ptp4l</literal> 类似：

source: Where <literal>$IFNAME</literal> is the name of the interface already set up in ptp4l that will be used as the source for the system clock. This is used to identify the source PHC.
es: Donde <literal>$IFNAME</literal> es el nombre de la interfaz ya configurada en ptp4l que se utilizará como fuente para el reloj del sistema. Esto se utiliza para identificar la fuente de PHC.
ja: ここで、<literal>$IFNAME</literal>はシステムクロックのソースとして使用される、ptp4lですでに設定されているインタフェースの名前です。これはソースPHCを識別するために使用されます。
pt_br: Em que <literal>$IFNAME</literal> é o nome da interface já configurada em ptp4l, que será usada como fonte para o relógio do sistema. Isso é usado para identificar o PHC de origem.
zh_cn: 其中，<literal>$IFNAME</literal> 是已在 ptp4l 中设置的接口名称，将用作系统时钟的同步源。此参数用于识别源 PHC。

source: Cluster API integration
es: Integración de Cluster API
ja: Cluster APIの統合
pt_br: Integração da Cluster API
zh_cn: Cluster API 集成

source: Whenever a cluster is deployed through a management cluster and directed network provisioning, both the configuration file and the two configuration variables in <literal>/etc/sysconfig</literal> can be deployed on the host at provisioning time. Below is an excerpt from a cluster definition, focusing on a modified <literal>RKE2ControlPlane</literal> object that deploys the same G.8275.1 configuration file on all hosts:
es: Cada vez que se despliega un clúster mediante un clúster de gestión y un aprovisionamiento de red dirigido, tanto el archivo de configuración como las dos variables de configuración de <literal>/etc/sysconfig</literal> se pueden desplegar en el host en el momento del aprovisionamiento. A continuación, se muestra un extracto de una definición de clúster, centrado en un objeto <literal>RKE2ControlPlane</literal> modificado que despliega el mismo archivo de configuración G.8275.1 en todos los hosts:
ja: クラスタが管理クラスタおよびダイレクトネットワークプロビジョニングを通じてデプロイされるときは常に、プロビジョニング時に設定ファイルと<literal>/etc/sysconfig</literal>内の2つの設定変数の両方をホスト上にデプロイできます。以下は、同じG.8275.1設定ファイルをすべてのホスト上にデプロイする、変更された<literal>RKE2ControlPlane</literal>オブジェクトに焦点を当てたクラスタ定義の抜粋です。
zh_cn: 当通过管理群集和定向网络置备部署群集时，可在置备时将配置文件和 <literal>/etc/sysconfig</literal> 中的两个配置变量都部署到主机上。以下是群集定义的片段，重点展示经过修改的 <literal>RKE2ControlPlane</literal> 对象，该对象会在所有主机上部署相同的 G.8275.1 配置文件：

source: Besides other variables, the above definition must be completed with the interface name and with the other Cluster API objects, as described in <xref linkend="atip-automated-provisioning"/>.
es: Además de otras variables, la definición anterior debe completarse con el nombre de la interfaz y con los demás objetos de Cluster API, como se describe en el <xref linkend="atip-automated-provisioning"/>.
ja: 上記の定義は、他の変数に加え、<xref linkend="atip-automated-provisioning"/>で説明されているように、インタフェース名と他のCluster APIオブジェクトで補完する必要があります。
pt_br: Além de outras variáveis, é necessário preencher a definição acima com o nome da interface e os outros objetos da Cluster API, conforme descrito no <xref linkend="atip-automated-provisioning"/>.
zh_cn: 除了其他变量外，必须为上述定义补全接口名称及其他 Cluster API 对象（如<xref linkend="atip-automated-provisioning"/>中所述）。

source: This approach is convenient only if the hardware in the cluster is uniform and the same configuration is needed on all hosts, interface name included.
es: Este enfoque solo resulta útil si el hardware del clúster es uniforme y se necesita la misma configuración en todos los hosts, incluido el nombre de la interfaz.
ja: このアプローチは、クラスタのハードウェアが均一であり、インタフェース名を含め、すべてのホスト上で同じ設定が必要な場合にのみ便利です。
pt_br: Essa é uma abordagem prática apenas quando o hardware no cluster é uniforme e a mesma configuração é necessária em todos os hosts, inclusive o nome da interface.
zh_cn: 仅当群集中的硬件保持统一且所有主机都需要采用相同配置（包括接口名称）时，这种方法才适用。

source: Alternative approaches are possible and will be covered in future releases.
es: Existen enfoques alternativos que se tratarán en futuras versiones.
ja: 代替アプローチが可能であり、今後のリリースで取り上げる予定です。
pt_br: Há outras abordagens possíveis que serão explicadas em versões futuras.
zh_cn: 也可以使用其他方法，未来版本中将会介绍相关内容。

source: At this point, your hosts should have a working and running PTP stack and will start negotiating their PTP role.
es: En este punto, los hosts deberían tener una pila PTP operativa y en ejecución, y comenzarán a negociar su función PTP.
ja: この時点で、ホストには機能していて実行中のPTPスタックがあり、PTP役割のネゴシエーションを開始するはずです。
pt_br: Neste ponto, os hosts devem ter uma pilha PTP em funcionamento e começarão a negociar sua função de PTP.
zh_cn: 至此，您的主机应已具备可正常运行的 PTP 堆栈，并将开始协商其 PTP 角色。

source: Fully automated directed network provisioning
es: Aprovisionamiento de red dirigida totalmente automatizado
ja: 完全に自動化されたダイレクトネットワークプロビジョニング
pt_br: Provisionamento de rede direcionado totalmente automatizado
zh_cn: 全自动定向网络置备

source: Directed network provisioning is a feature that allows you to automate the provisioning of downstream clusters. This feature is useful when you have many downstream clusters to provision, and you want to automate the process.
es: El aprovisionamiento de red dirigida es una función que permite automatizar el aprovisionamiento de clústeres descendentes. Esta función resulta útil cuando hay muchos clústeres descendentes que aprovisionar y se desea automatizar el proceso.
ja: ダイレクトネットワークプロビジョニングは、ダウンストリームクラスタのプロビジョニングを自動化できる機能です。この機能は、プロビジョニングするダウンストリームクラスタが多数あり、そのプロセスを自動化したい場合に便利です。
pt_br: O provisionamento de rede direcionado é um recurso que permite automatizar o provisionamento de clusters downstream. Ele é útil quando você tem que provisionar muitos clusters downstream e deseja automatizar o processo.
zh_cn: 定向网络置备是用于自动置备下游群集的功能。如果您有许多下游群集需要置备并希望自动完成该过程，此功能将非常有用。

source: A management cluster (<xref linkend="atip-management-cluster"/>) automates deployment of the following components:
es: Un clúster de gestión (<xref linkend="atip-management-cluster"/>) automatiza el despliegue de los siguientes componentes:
ja: 管理クラスタ(<xref linkend="atip-management-cluster"/>)は、次のコンポーネントのデプロイメントを自動化します。
pt_br: Um cluster de gerenciamento (<xref linkend="atip-management-cluster"/>) automatiza a implantação dos seguintes componentes:
zh_cn: 管理群集（<xref linkend="atip-management-cluster"/>）会自动部署以下组件：

source: <literal>SUSE Linux Micro RT</literal> as the OS. Depending on the use case, configurations like networking, storage, users and kernel arguments can be customized.
es: <literal>SUSE Linux Micro RT</literal> como sistema operativo. Dependiendo del caso de uso, se pueden personalizar ajustes como las redes, el almacenamiento, los usuarios y los argumentos del kernel.
ja: <literal>SUSE Linux Micro RT</literal> (OS)。ユースケースに応じて、ネットワーキング、ストレージ、ユーザ、カーネル引数などの設定をカスタマイズできます。
pt_br: <literal>SUSE Linux Micro RT</literal> como sistema operacional. Dependendo do caso de uso, é possível personalizar configurações como rede, armazenamento, usuários e argumentos do kernel.
zh_cn: <literal>SUSE Linux Micro RT</literal>（操作系统），可以根据使用场景自定义网络、存储、用户和内核参数等配置。

source: <literal>RKE2</literal> as the Kubernetes cluster. The default <literal>CNI</literal> plug-in is <literal>Cilium</literal>. Depending on the use case, certain <literal>CNI</literal> plug-ins can be used, such as <literal>Cilium+Multus</literal>.
es: <literal>RKE2</literal> como clúster de Kubernetes. El complemento de <literal>CNI</literal> predeterminado es <literal>Cilium</literal>. Dependiendo del caso práctico, se pueden usar determinados complementos de <literal>CNI</literal>, como <literal>Cilium+Multus</literal>.
ja: <literal>RKE2</literal> (Kubernetesクラスタ)。デフォルトの<literal>CNI</literal>プラグインは<literal>Cilium</literal>です。ユースケースに応じて、特定の<literal>CNI</literal>プラグイン(<literal>Cilium+Multus</literal>など)を使用できます。
pt_br: <literal>RKE2</literal> como cluster Kubernetes. O plug-in de <literal>CNI</literal> padrão é <literal>Cilium</literal>. Dependendo do caso de uso, é possível usar determinados plug-ins de <literal>CNI</literal>, como <literal>Cilium+Multus</literal>.
zh_cn: <literal>RKE2</literal>（Kubernetes 群集），默认的 <literal>CNI</literal> 插件为 <literal>Cilium</literal>。根据具体的应用场景，可以使用某些 <literal>CNI</literal> 插件，例如 <literal>Cilium+Multus</literal>。

source: <literal>MetalLB</literal> can be used as the load balancer for highly available multi-node clusters.
es: <literal>MetalLB</literal> se puede usar como equilibrador de carga para clústeres de varios nodos de alta disponibilidad.
ja: <literal>MetalLB</literal>。高可用性マルチノードクラスタのロードバランサとして使用できます。
pt_br: É possível usar o <literal>MetalLB</literal> como balanceador de carga para clusters de vários nós altamente disponíveis.
zh_cn: <literal>MetalLB</literal> 可用作高可用性多节点群集的负载平衡器。

source: For more information about <literal>SUSE Linux Micro</literal>, see <xref linkend="components-slmicro"/> For more information about <literal>RKE2</literal>, see <xref linkend="components-rke2"/> For more information about <literal>SUSE Storage</literal>, see <xref linkend="components-suse-storage"/> For more information about <literal>SUSE Security</literal>, see <xref linkend="components-suse-security"/>
es: Para obtener más información sobre <literal>SUSE Linux Micro</literal>, consulte el <xref linkend="components-slmicro"/>. Para obtener más información sobre <literal>RKE2</literal>, consulte el <xref linkend="components-rke2"/>. Para obtener más información sobre <literal>SUSE Storage</literal>, consulte el <xref linkend="components-suse-storage"/>. Para obtener más información sobre <literal>SUSE Security</literal>, consulte el <xref linkend="components-suse-security"/>.
ja: <literal>SUSE Linux Micro</literal>の詳細については、<xref linkend="components-slmicro"/>を参照してください。<literal>RKE2</literal>の詳細については、<xref linkend="components-rke2"/>を参照してください。<literal>SUSE Storage</literal>の詳細については、<xref linkend="components-suse-storage"/>を参照してください。<literal>SUSE Security</literal>の詳細については、<xref linkend="components-suse-security"/>を参照してください。
pt_br: Para obter mais informações sobre o <literal>SUSE Linux Micro</literal>, consulte o <xref linkend="components-slmicro"/>. Para obter mais informações sobre o <literal>RKE2</literal>, consulte o <xref linkend="components-rke2"/>. Para obter mais informações sobre o <literal>SUSE Storage</literal>, consulte o <xref linkend="components-suse-storage"/>. Para obter mais informações sobre o <literal>SUSE Security</literal>, consulte o <xref linkend="components-suse-security"/>.
zh_cn: 有关 <literal>SUSE Linux Micro</literal> 的详细信息，请参见<xref linkend="components-slmicro"/>。有关 <literal>RKE2</literal> 的详细信息，请参见<xref linkend="components-rke2"/>。有关 <literal>SUSE Storage</literal> 的详细信息，请参见<xref linkend="components-suse-storage"/>。有关 <literal>SUSE Security</literal> 的详细信息，请参见<xref linkend="components-suse-security"/>。

source: The following sections describe the different directed network provisioning workflows and some additional features that can be added to the provisioning process:
es: Las siguientes secciones describen los diferentes flujos de trabajo de aprovisionamiento de red dirigida y algunas características adicionales que se pueden añadir al proceso de aprovisionamiento:
ja: 以降のセクションでは、さまざまなダイレクトネットワークプロビジョニングワークフローと、プロビジョニングプロセスに追加できる機能について説明します。
pt_br: As seguintes seções descrevem os diferentes fluxos de trabalho de provisionamento de rede direcionado e alguns recursos adicionais que podem ser incluídos no processo de provisionamento:
zh_cn: 以下章节介绍了不同的定向网络置备工作流程，以及可添加到置备过程的一些附加功能：

source: The following sections show how to prepare the different scenarios for the directed network provisioning workflow using SUSE Telco Cloud. For examples of the different configurations options for deployment (incl. air-gapped environments, DHCP and DHCP-less networks, private container registries, etc.), see the <link xl:href="https://github.com/suse-edge/atip/tree/release-3.4/telco-examples/edge-clusters">SUSE Telco Cloud repository</link>.
es: Las siguientes secciones muestran cómo preparar los diferentes escenarios para el flujo de trabajo de aprovisionamiento de red dirigida utilizando SUSE Telco Cloud. Para ver ejemplos de las diferentes opciones de configuración para el despliegue (incluidos entornos aislados, redes con DHCP y sin DHCP, registros de contenedores privados, etc.), consulte el <link xl:href="https://github.com/suse-edge/atip/tree/release-3.4/telco-examples/edge-clusters">repositorio de SUSE Telco Cloud</link>.
ja: 次のセクションでは、SUSE Telco Cloudを使用してダイレクトネットワークプロビジョニングワークフローの異なるシナリオを準備する方法について説明します。デプロイメントの異なる設定オプション(エアギャップ環境、DHCPおよびDHCPなしのネットワーク、プライベートコンテナレジストリなどを含む)の例については<link xl:href="https://github.com/suse-edge/atip/tree/release-3.4/telco-examples/edge-clusters">SUSE Telco Cloudリポジトリ</link>を参照してください。
zh_cn: 以下几节介绍如何使用 SUSE Telco Cloud 为不同的定向网络置备工作流程场景做好准备工作。有关不同的部署配置选项示例（包括隔离式环境、DHCP 和无 DHCP 网络、专用容器仓库等），请参见 <link xl:href="https://github.com/suse-edge/atip/tree/release-3.4/telco-examples/edge-clusters">SUSE Telco Cloud 代码库</link>。

source: Prepare downstream cluster image for connected scenarios
es: Preparación de la imagen del clúster descendente para entornos conectados
ja: 接続シナリオのダウンストリームクラスタイメージの準備
pt_br: Preparar uma imagem de cluster downstream para cenários conectados
zh_cn: 为联网场景准备下游群集映像

source: Edge Image Builder (<xref linkend="components-eib"/>) is used to prepare a modified SLEMicro base image which is provisioned on downstream cluster hosts.
es: Edge Image Builder (<xref linkend="components-eib"/>) se utiliza para preparar una imagen base de SLEMicro modificada que se aprovisiona en los hosts del clúster descendente.
ja: Edge Image Builder (<xref linkend="components-eib"/>)を使用して、ダウンストリームクラスタホスト上にプロビジョニングされる、変更されたSLEMicroゴールデンイメージを準備します。
pt_br: O Edge Image Builder (<xref linkend="components-eib"/>) é usado para preparar uma imagem base do SLEMicro modificada que será provisionada aos hosts de cluster downstream.
zh_cn: Edge Image Builder（<xref linkend="components-eib"/>）用于准备经过修改、将置备到下游群集主机上的 SLEMicro 基础映像。

source: Much of the configuration via Edge Image Builder is possible, but in this guide, we cover the minimal configurations necessary to set up the downstream cluster.
es: Gran parte de la configuración se puede realizar con Edge Image Builder, pero en esta guía cubrimos las configuraciones mínimas necesarias para configurar el clúster descendente.
ja: ほとんどの設定はEdge Image Builderを使用して行うことができますが、このガイドではダウンストリームクラスタをセットアップするために必要な最小限の設定について説明します。
pt_br: Grande parte da configuração é possível pelo Edge Image Builder, mas neste guia, abordamos as configurações mínimas necessárias para preparar o cluster downstream.
zh_cn: 可以通过 Edge Image Builder 完成大部分配置，但本指南仅介绍设置下游群集所需的最低限度配置。

source: Prerequisites for connected scenarios
es: Requisitos previos para entornos conectados
ja: 接続シナリオの前提条件
pt_br: Pré-requisitos para cenários conectados
zh_cn: 联网场景的先决条件
