Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Management Cluster Provision (<xref linkend="mgmt-cluster-provision"/>)</emphasis>: This step covers the provisioning of the management cluster using the image created in the previous step (for both, connected and air-gap scenarios). This step can be done using a laptop, server, VM or any other AMD64/Intel 64 system with a USB port.
es: <emphasis role="strong">Aprovisionamiento del clúster de gestión (<xref linkend="mgmt-cluster-provision"/>)</emphasis>. Este paso abarca el aprovisionamiento del clúster de gestión que usa la imagen creada en el paso anterior (tanto para entornos conectados como aislados). Este paso se puede realizar con un ordenador portátil, un servidor, una máquina virtual o cualquier otro sistema AMD64/Intel 64 con un puerto USB.
ja: <emphasis role="strong">管理クラスタのプロビジョニング(<xref linkend="mgmt-cluster-provision"/>)</emphasis>: この手順では、前の手順で作成したイメージを使用して管理クラスタをプロビジョニングする方法について説明します(接続シナリオとエアギャップシナリオの両方が対象です)。この手順は、ラップトップ、サーバ、VM、またはUSBポートを搭載した他の任意のAMD64/Intel 64システムを使用して実行できます。
pt_br: <emphasis role="strong">Provisionamento do cluster de gerenciamento (<xref linkend="mgmt-cluster-provision"/>)</emphasis>: esta etapa aborda o provisionamento do cluster de gerenciamento usando a imagem criada na etapa anterior (para os cenários tanto conectados quanto air-gapped). Para executá-la, é possível usar um laptop, um servidor, uma VM ou qualquer outro sistema AMD64/Intel 64 com uma porta USB.
zh_cn: <emphasis role="strong">置备管理群集（<xref linkend="mgmt-cluster-provision"/>）</emphasis>：此步骤使用上一步中创建的映像来置备管理群集（适用于联网场景和隔离场景）。可以使用便携式计算机、服务器、VM 或任何其他带有 USB 端口的 AMD64/Intel 64 系统来执行此步骤。

source: For more information about Edge Image Builder, see Edge Image Builder (<xref linkend="components-eib"/>) and Edge Image Builder Quick Start (<xref linkend="quickstart-eib"/>).
es: Para obtener más información, consulte la sección sobre Edge Image Builder (<xref linkend="components-eib"/>) y la guía de inicio rápido de Edge Image Builder (<xref linkend="quickstart-eib"/>).
ja: Edge Image Builderの詳細については、「Edge Image Builder」(<xref linkend="components-eib"/>)およびEdge Image Builderのクイックスタート(<xref linkend="quickstart-eib"/>)を参照してください。
pt_br: Para obter mais informações sobre o Edge Image Builder, consulte o respectivo guia (<xref linkend="components-eib"/>) e o Guia de Início Rápido (<xref linkend="quickstart-eib"/>).
zh_cn: 有关 Edge Image Builder 的详细信息，请参见 Edge Image Builder（<xref linkend="components-eib"/>）和 Edge Image Builder 快速入门（<xref linkend="quickstart-eib"/>）。

source: Image preparation for connected environments
es: Preparación de la imagen para entornos conectados
ja: 接続環境用のイメージの準備
pt_br: Preparação da imagem para ambientes conectados
zh_cn: 为联网环境准备映像

source: Edge Image Builder is used to create the image for the management cluster, in this document we cover the minimal configuration necessary to set up the management cluster.
es: Edge Image Builder se utiliza para crear la imagen del clúster de gestión. En este documento se describe la configuración mínima necesaria para configurar el clúster de gestión.
ja: Edge Image Builderは、管理クラスタのイメージを作成するために使用されます。このドキュメントでは、管理クラスタのセットアップに必要な最小設定について説明します。
pt_br: O Edge Image Builder é usado para criar a imagem do cluster de gerenciamento. Neste documento, explicamos a configuração mínima necessária para configurar o cluster de gerenciamento.
zh_cn: Edge Image Builder 用于为管理群集创建映像，在本文档中，我们将介绍设置管理群集所需的最低配置。

source: Edge Image Builder runs inside a container, so a container runtime is required such as <link xl:href="https://podman.io">Podman</link> or <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>. For this guide, we assume podman is available.
es: Edge Image Builder se ejecuta dentro de un contenedor, por lo que se requiere un entorno de ejecución de contenedores como <link xl:href="https://podman.io">Podman</link> o <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>. En esta guía, se entiende que Podman está disponible.
ja: Edge Image Builderは、コンテナ内で実行されるため、<link xl:href="https://podman.io">Podman</link>や<link xl:href="https://rancherdesktop.io">Rancher Desktop</link>などのコンテナランタイムが必要です。このガイドでは、Podmanが使用できることを前提としています。
pt_br: O Edge Image Builder é executado dentro de um contêiner, portanto, um tempo de execução do contêiner é necessário, como <link xl:href="https://podman.io">Podman</link> ou <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>. Neste guia, consideramos que o podman esteja disponível.
zh_cn: Edge Image Builder 在容器内运行，因此需要 <link xl:href="https://podman.io">Podman</link> 或 <link xl:href="https://rancherdesktop.io">Rancher Desktop</link> 等容器运行时。在本指南中，我们假设 Podman 可用。

source: Also, as a prerequisite to deploy a highly available management cluster, you need to reserve three IPs in your network:
es: Además, como requisito previo para desplegar un clúster de gestión de alta disponibilidad, es necesario reservar tres direcciones IP en la red:
ja: また、高可用性管理クラスタをデプロイするための前提条件として、ネットワークで次の3つのIPを予約する必要があります。
pt_br: Também como pré-requisito para implantar um cluster de gerenciamento altamente disponível, você precisa reservar três IPs na sua rede:
zh_cn: 此外，作为部署高可用性管理群集的先决条件，您需要在网络中预留三个 IP 地址：

source: <literal>apiVIP</literal> for the API VIP Address (used to access the Kubernetes API server).
es: <literal>apiVIP</literal> para la dirección IP virtual de API (utilizada para acceder al servidor API de Kubernetes).
ja: <literal>apiVIP</literal> (API VIPアドレス用(Kubernetes APIサーバへのアクセスに使用))。
pt_br: <literal>apiVIP</literal> para o endereço VIP da API (usado para acessar o servidor da API Kubernetes).
zh_cn: <literal>apiVIP</literal>，表示 API VIP 地址（用于访问 Kubernetes API 服务器）。

source: <literal>ingressVIP</literal> for the Ingress VIP Address (consumed, for example, by the Rancher UI).
es: <literal>ingressVIP</literal> para la dirección IP virtual de Ingress (utilizada, por ejemplo, por la interfaz de usuario de Rancher).
ja: <literal>ingressVIP</literal> (Ingress VIPアドレス(Rancher UIなどで使用))。
pt_br: <literal>ingressVIP</literal> para o endereço VIP de entrada (consumido pela IU do Rancher, por exemplo).
zh_cn: <literal>ingressVIP</literal>，表示入口 VIP 地址（例如，供 Rancher UI 使用）。

source: <literal>metal3VIP</literal> for the Metal3 VIP Address.
es: <literal>metal3VIP</literal> para la dirección IP virtual de Metal3.
ja: <literal>metal3VIP</literal> (Metal3 VIPアドレス用)。
pt_br: <literal>metal3VIP</literal> para o endereço VIP do Metal3.
zh_cn: <literal>metal3VIP</literal>，表示 Metal3 VIP 地址。

source: Directory structure
es: Estructura del directorio
ja: ディレクトリ構造
pt_br: Estrutura de diretórios
zh_cn: 目录结构

source: When running EIB, a directory is mounted from the host, so the first thing to do is to create a directory structure to be used by EIB to store the configuration files and the image itself. This directory has the following structure:
es: Al ejecutar EIB, se monta un directorio desde el host, por lo que lo primero que hay que hacer es crear una estructura de directorios que EIB utilizará para almacenar los archivos de configuración y la propia imagen. Este directorio tiene la siguiente estructura:
ja: EIBを実行する場合、ディレクトリはホストからマウントされます。したがって、最初に実行する手順は、EIBが設定ファイルとイメージ自体を保存するために使用するディレクトリ構造を作成することです。このディレクトリの構造は次のとおりです。
pt_br: Ao executar o EIB, um diretório é montado do host, portanto, a primeira etapa é criar uma estrutura de diretórios para o EIB usar para armazenar os arquivos de configuração e a própria imagem. Esse diretório tem a seguinte estrutura:
zh_cn: 运行 EIB 时，将从主机挂载一个目录，因此首先需要创建一个目录结构，供 EIB 用来存储配置文件和映像本身。此目录的结构如下：

source: The image <literal>SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso</literal> must be downloaded from the <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> or the <link xl:href="https://www.suse.com/download/sle-micro/">SUSE Download page</link>, and it must be located under the <literal>base-images</literal> folder.
es: La imagen <literal>SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso</literal> debe descargarse desde el <link xl:href="https://scc.suse.com/">Centro de servicios al cliente de SUSE</link> o desde la <link xl:href="https://www.suse.com/download/sle-micro/">página de descargas de SUSE</link>, y debe estar ubicada en la carpeta <literal>base-images</literal>.
ja: <literal>SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso</literal>イメージは、<link xl:href="https://scc.suse.com/">SUSE Customer Center</link>または<link xl:href="https://www.suse.com/download/sle-micro/">SUSEダウンロードページ</link>からダウンロードする必要があり、また、<literal>base-images</literal>フォルダの下に配置されている必要があります。
pt_br: É necessário fazer download da imagem <literal>SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso</literal> do <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> ou da <link xl:href="https://www.suse.com/download/sle-micro/">página de downloads da SUSE</link> e salvá-la na pasta <literal>base-images</literal>.
zh_cn: 必须从 <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> 或 <link xl:href="https://www.suse.com/download/sle-micro/">SUSE 下载页面</link>下载 <literal>SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso</literal> 映像，并且必须将其存放在 <literal>base-images</literal> 文件夹下。

source: You should check the SHA256 checksum of the image to ensure it has not been tampered with. The checksum can be found in the same location where the image was downloaded.
es: Debe comprobar la suma de comprobación SHA256 de la imagen para asegurarse de que no ha sido manipulada. La suma de comprobación se encuentra en la misma ubicación en la que se descargó la imagen.
ja: イメージのSHA256チェックサムを確認し、イメージが改ざんされていないことを確認する必要があります。このチェックサムは、イメージをダウンロードした場所と同じ場所にあります。
pt_br: Confira o checksum SHA256 da imagem para garantir que ela não tenha sido adulterada. O checksum está no mesmo local em que a imagem foi baixada.
zh_cn: 应检查该映像的 SHA256 校验和，确保它未遭篡改。可以在映像所下载到的位置找到校验和。

source: An example of the directory structure can be found in the <link xl:href="https://github.com/suse-edge/atip">SUSE Edge GitHub repository under the "telco-examples" folder</link>.
es: Un ejemplo de estructura del directorios se puede encontrar en el <link xl:href="https://github.com/suse-edge/atip">repositorio GitHub de SUSE Edge, en la carpeta "telco-examples"</link>.
ja: ディレクトリ構造の例は、 <link xl:href="https://github.com/suse-edge/atip">SUSE Edge GitHubリポジトリの「telco-examples」フォルダ</link>にあります。
pt_br: Há um exemplo da estrutura de diretórios disponível no <link xl:href="https://github.com/suse-edge/atip">repositório SUSE Edge do GitHub na pasta "telco-examples"</link>.
zh_cn: 可以在 <link xl:href="https://github.com/suse-edge/atip">SUSE Edge GitHub 代码库中的“telco-examples”文件夹下</link>找到目录结构的示例。

source: Management cluster definition file
es: Archivo de definición del clúster de gestión
ja: 管理クラスタ定義ファイル
pt_br: Arquivo de definição do cluster de gerenciamento
zh_cn: 管理群集定义文件

source: The <literal>mgmt-cluster.yaml</literal> file is the main definition file for the management cluster. It contains the following information:
es: El archivo de definición principal del clúster de gestión es <literal>mgmt-cluster.yaml</literal>. Contiene la siguiente información:
ja: <literal>mgmt-cluster.yaml</literal>ファイルは管理クラスタのメイン定義ファイルで、次の情報が含まれます。
pt_br: O <literal>mgmt-cluster.yaml</literal> é o principal arquivo de definição do cluster de gerenciamento. Ele contém as seguintes informações:
zh_cn: <literal>mgmt-cluster.yaml</literal> 文件是管理群集的主定义文件。其中包含以下信息：

source: To explain the fields and values in the <literal>mgmt-cluster.yaml</literal> definition file, we have divided it into the following sections.
es: Para explicar los campos y valores del archivo de definición <literal>mgmt-cluster.yaml</literal>, lo hemos dividido en las siguientes secciones.
ja: <literal>mgmt-cluster.yaml</literal>定義ファイルのフィールドと値について説明するために、ここではこのファイルを次のセクションに分割しています。
pt_br: Para explicar os campos e os valores no arquivo de definição <literal>mgmt-cluster.yaml</literal>, dividimos esse arquivo nas seções a seguir.
zh_cn: 为了解释 <literal>mgmt-cluster.yaml</literal> 定义文件中的字段和值，我们将此文件划分成了以下几个部分。

source: Image section (definition file):
es: Sección de imagen (archivo de definición):
ja: イメージセクション(定義ファイル):
pt_br: Seção da imagem (arquivo de definição):
zh_cn: 映像部分（定义文件）：

source: where the <literal>baseImage</literal> is the original image you downloaded from the SUSE Customer Center or the SUSE Download page. <literal>outputImageName</literal> is the name of the new image that will be used to provision the management cluster.
es: Donde <literal>baseImage</literal> es la imagen original que descargó del Centro de servicios al cliente de SUSE o de la página de descargas de SUSE. <literal>outputImageName</literal> es el nombre de la nueva imagen que se utilizará para aprovisionar el clúster de gestión.
ja: ここで、<literal>baseImage</literal>は、SUSE Customer CenterまたはSUSEダウンロードページからダウンロードした元のイメージです。<literal>outputImageName</literal>は、管理クラスタのプロビジョニングに使用する新しいイメージの名前です。
pt_br: em que <literal>baseImage</literal> é a imagem original que você baixou do SUSE Customer Center ou da página de downloads da SUSE. <literal>outputImageName</literal> é o nome da nova imagem que será usada para provisionar o cluster de gerenciamento.
zh_cn: 其中 <literal>baseImage</literal> 是从 SUSE Customer Center 或 SUSE 下载页面下载的原始映像。<literal>outputImageName</literal> 是将用于置备管理群集的新映像的名称。

source: Operating system section (definition file):
es: Sección de sistema operativo (archivo de definición):
ja: オペレーティングシステムセクション(定義ファイル):
pt_br: Seção do sistema operacional (arquivo de definição):
zh_cn: 操作系统部分（定义文件）：

source: where the <literal>installDevice</literal> is the device to be used to install the operating system, the <literal>username</literal> and <literal>encryptedPassword</literal> are the credentials to be used to access the system, the <literal>packageList</literal> is the list of packages to be installed (<literal>jq</literal> is required internally during the installation process), and the <literal>sccRegistrationCode</literal> is the registration code used to get the packages and dependencies at build time and can be obtained from the SUSE Customer Center. The encrypted password can be generated using the <literal>openssl</literal> command as follows:
es: Donde <literal>installDevice</literal> es el dispositivo que se utilizará para instalar el sistema operativo, <literal>username</literal> y <literal>encryptedPassword</literal> son las credenciales que se utilizarán para acceder al sistema, <literal>packageList</literal> es la lista de paquetes que se instalarán (<literal>jq</literal> es necesario internamente durante el proceso de instalación), y <literal>sccRegistrationCode</literal> es el código de registro utilizado para obtener los paquetes y las dependencias en el momento de la creación, que se pueden obtener en el Centro de servicios al cliente de SUSE. La contraseña cifrada se puede generar utilizando el comando <literal>openssl</literal> de la siguiente manera:
ja: ここで、<literal>installDevice</literal>はオペレーティングシステムのインストールに使用するデバイス、<literal>username</literal>および<literal>encryptedPassword</literal>はシステムへのアクセスに使用する資格情報、<literal>packageList</literal>はインストールするパッケージのリスト(<literal>jq</literal>はインストールプロセス中に内部的に必要)です。<literal>sccRegistrationCode</literal>は構築時にパッケージと依存関係を取得するために使用する登録コードで、SUSE Customer Centerから取得できます。暗号化パスワードは次のように<literal>openssl</literal>コマンドを使用して生成できます。
pt_br: em que <literal>installDevice</literal> é o dispositivo usado para instalar o sistema operacional, <literal>username</literal> e <literal>encryptedPassword</literal> são as credenciais usadas para acessar o sistema, <literal>packageList</literal> é a lista dos pacotes que devem ser instalados (<literal>jq</literal> é obrigatório internamente durante o processo de instalação) e <literal>sccRegistrationCode</literal> é o código de registro usado para obter os pacotes e as dependências no momento da criação e pode ser recuperado do SUSE Customer Center. É possível gerar a senha criptografada usando o comando <literal>openssl</literal> da seguinte maneira:
zh_cn: 其中 <literal>installDevice</literal> 是用于安装操作系统的设备，<literal>username</literal> 和 <literal>encryptedPassword</literal> 是用于访问系统的身份凭证，<literal>packageList</literal> 是要安装的软件包列表（在安装过程中，需要在内部使用 <literal>jq</literal>），<literal>sccRegistrationCode</literal> 是在构建时用于获取软件包和依赖项的注册代码，可从 SUSE Customer Center 获取。可以如下所示使用 <literal>openssl</literal> 命令生成加密的口令：

source: This outputs something similar to:
es: El resultado es algo similar a esto:
ja: この出力は次のようになります。
pt_br: A saída é similar a esta:
zh_cn: 此命令会输出如下所示的内容：

source: Kubernetes section (definition file):
es: Sección de Kubernetes (archivo de definición):
ja: Kubernetesセクション(定義ファイル):
pt_br: Seção do Kubernetes (arquivo de definição):
zh_cn: Kubernetes 部分（定义文件）：

source: The <literal>helm</literal> section contains the list of Helm charts to be installed, the repositories to be used, and the version configuration for all of them.
es: La sección <literal>helm</literal> contiene la lista de charts de Helm que se instalarán, los repositorios que se utilizarán y la configuración de la versión de todos ellos.
ja: <literal>helm</literal>セクションには、インストールするHelmチャートのリスト、使用するリポジトリ、およびこれらすべてのバージョン設定が含まれます。
pt_br: A seção <literal>helm</literal> contém a lista de gráficos Helm para instalação, os repositórios que serão usados e a configuração da versão de todos eles.
zh_cn: <literal>helm</literal> 部分包含要安装的 Helm chart 列表、要使用的储存库，以及所有 chart 和储存库的版本配置。

source: The <literal>network</literal> section contains the configuration for the network, like the <literal>apiHost</literal> and <literal>apiVIP</literal> to be used by the <literal>RKE2</literal> component. The <literal>apiVIP</literal> should be an IP address that is not used in the network and should not be part of the DHCP pool (in case we use DHCP). Also, when we use the <literal>apiVIP</literal> in a multi-node cluster, it is used to access the Kubernetes API server. The <literal>apiHost</literal> is the name resolution to <literal>apiVIP</literal> to be used by the <literal>RKE2</literal> component.
es: La sección <literal>network</literal> contiene la configuración de la red, como <literal>apiHost</literal> y <literal>apiVIP</literal>, que utilizará el componente <literal>RKE2</literal>. <literal>apiVIP</literal> debe ser una dirección IP que no se use en la red y no debe formar parte del pool DHCP (en caso de que se utilice DHCP). Además, si se usa <literal>apiVIP</literal> en un clúster de varios nodos, se hace para acceder al servidor de API de Kubernetes. <literal>apiHost</literal> es la resolución de nombres para <literal>apiVIP</literal> que utilizará el componente <literal>RKE2</literal>.
ja: <literal>network</literal>セクションには、<literal>RKE2</literal>コンポーネントが使用する<literal>apiHost</literal>や<literal>apiVIP</literal>などのネットワーク設定が含まれます。<literal>apiVIP</literal>は、ネットワーク内で使用されていないIPアドレスにし、DHCPを使用する場合はDHCPプールから除外してください。マルチノードクラスタでは、<literal>apiVIP</literal>がKubernetes APIサーバへのアクセスに使用されます。<literal>apiHost</literal>は、<literal>RKE2</literal>コンポーネントが使用する<literal>apiVIP</literal>への名前解決として機能します。
pt_br: A seção <literal>network</literal> contém a configuração da rede, como o <literal>apiHost</literal> e o <literal>apiVIP</literal> que o componente <literal>RKE2</literal> usará. O <literal>apiVIP</literal> deve ser um endereço IP não usado na rede e que não faça parte do pool DHCP (se DHCP for usado). Além disso, quando usamos o <literal>apiVIP</literal> em um cluster de vários nós, ele é usado para acessar o servidor da API Kubernetes. O <literal>apiHost</literal> é a resolução de nome para o <literal>apiVIP</literal> que o componente <literal>RKE2</literal> usará.
zh_cn: <literal>network</literal> 部分包含 <literal>RKE2</literal> 组件要使用的网络配置，例如 <literal>apiHost</literal> 和 <literal>apiVIP</literal>。<literal>apiVIP</literal> 必须是网络中未使用的 IP 地址，并且不属于 DHCP 池（如果使用 DHCP）。此外，如果我们在多节点群集中使用 <literal>apiVIP</literal>，apiVIP 将用于访问 Kubernetes API 服务器。<literal>apiHost</literal> 是 <literal>RKE2</literal> 组件要使用的 <literal>apiVIP</literal> 的名称解析。

source: The <literal>nodes</literal> section contains the list of nodes to be used in the cluster. In this example, a single-node cluster is being used, but it can be extended to a multi-node cluster by adding more nodes to the list (by uncommenting the lines).
es: La sección <literal>nodes</literal> contiene la lista de nodos que se usarán en el clúster. En este ejemplo, se usa un clúster de un solo nodo, pero se puede extender a un clúster de varios nodos añadiendo más nodos a la lista (descomentando las líneas).
ja: <literal>nodes</literal>セクションには、クラスタで使用するノードのリストが含まれています。この例では、シングルノードクラスタを使用していますが、リストにノードを追加する(行のコメントを解除する)ことによってマルチノードクラスタに拡張できます。
zh_cn: <literal>nodes</literal> 部分包含群集中要使用的节点列表。本示例使用的是单节点群集，但可通过在列表中添加更多节点（取消注释相应行）将其扩展为多节点群集。

source: The names of the nodes must be unique in the cluster.
es: Los nombres de los nodos deben ser únicos en el clúster.
ja: ノードの名前はクラスタ内で固有である必要があります。
pt_br: Os nomes dos nós devem ser exclusivos no cluster.
zh_cn: 节点名称在群集中必须保持唯一。

source: Optionally, use the <literal>initializer</literal> field to specify the bootstrap host, otherwise it will be the first node in the list.
es: Si lo desea, puede usar el campo <literal>initializer</literal> para especificar el host de arranque. Si no lo hace, será el primer nodo de la lista.
ja: オプションで、<literal>initializer</literal>フィールドを使用してブートストラップ ホストを指定します。これを指定しない場合、リストの最初のノードになります。
pt_br: Se preferir, use o campo <literal>initializer</literal> para especificar o host de inicialização; do contrário, ele será o primeiro nó da lista.
zh_cn: 可以选择使用 <literal>initializer</literal> 字段指定引导主机，如果不指定，列表中的第一个节点将会是引导主机。

source: The names of the nodes must be the same as the host names defined in the Network Folder (<xref linkend="mgmt-cluster-network-folder"/>) when network configuration is required.
es: Si se requiere una configuración de red, los nombres de los nodos deben ser los mismos que los nombres de host definidos en la carpeta network (<xref linkend="mgmt-cluster-network-folder"/>).
ja: ネットワーク設定が必要な場合、ノードの名前はネットワークフォルダ(<xref linkend="mgmt-cluster-network-folder"/>)で定義されたホスト名と同じである必要があります。
pt_br: Os nomes dos nós devem ser iguais aos nomes de host definidos na pasta de rede (<xref linkend="mgmt-cluster-network-folder"/>) quando a configuração de rede é obrigatória.
zh_cn: 需要网络配置时，节点名称必须与“Network”文件夹（<xref linkend="mgmt-cluster-network-folder"/>）中定义的主机名相同。

source: Custom folder
es: Carpeta custom
ja: Customフォルダ
pt_br: Pasta custom
zh_cn: Custom 文件夹

source: The <literal>custom</literal> folder contains the following subfolders:
es: La carpeta <literal>custom</literal> contiene las siguientes subcarpetas:
ja: <literal>custom</literal>フォルダには次のサブフォルダが含まれます。
pt_br: A pasta <literal>custom</literal> contém as seguintes subpastas:
zh_cn: <literal>custom</literal> 文件夹包含以下子文件夹：

source: The <literal>custom/files</literal> folder contains the configuration files to be used by the management cluster.
es: La carpeta <literal>custom/files</literal> contiene los archivos de configuración que utilizará el clúster de gestión.
ja: <literal>custom/files</literal>フォルダには、管理クラスタが使用する設定ファイルが含まれます。
pt_br: A pasta <literal>custom/files</literal> contém os arquivos de configuração usados pelo cluster de gerenciamento.
zh_cn: <literal>custom/files</literal> 文件夹包含管理群集要使用的配置文件。

source: The <literal>custom/scripts</literal> folder contains the scripts to be used by the management cluster.
es: La carpeta <literal>custom/scripts</literal> contiene los guiones que utilizará el clúster de gestión.
ja: <literal>custom/scripts</literal>フォルダには、管理クラスタが使用するスクリプトが含まれます。
pt_br: A pasta <literal>custom/scripts</literal> contém os scripts usados pelo cluster de gerenciamento.
zh_cn: <literal>custom/scripts</literal> 文件夹包含管理群集要使用的脚本。
