Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Based on these plans, SUC proceeds to create workloads on each node of the cluster that perform the actual OS upgrade.
es: Basándose en estos planes, SUC crea cargas de trabajo en cada nodo del clúster que realizan la actualización real del sistema operativo.
ja: これらのプランに基づいて、SUCは、実際のOSアップグレードを実行するクラスタの各ノードにワークロードを作成します。
pt_br: Com base nesses planos, o SUC cria as cargas de trabalho em cada nó do cluster que faz o upgrade real do sistema operacional.
zh_cn: SUC 会根据这些计划，继续在执行实际操作系统升级的群集的每个节点上创建工作负载。

source: Depending on the <literal>ReleaseManifest</literal>, the OS upgrade may include:
es: Dependiendo del recurso <literal>ReleaseManifest</literal>, la actualización del sistema operativo puede incluir:
ja: <literal>ReleaseManifest</literal>によって、OSアップグレードには次のものが含まれる場合があります。
pt_br: Dependendo do <literal>ReleaseManifest</literal>, o upgrade de sistema operacional pode incluir:
zh_cn: 根据 <literal>ReleaseManifest</literal>，操作系统升级可能包括：

source: Package only updates - for use-cases where the OS version does not change between Edge releases.
es: Solo actualizaciones de paquetes: para casos en los que la versión del sistema operativo no cambie entre las versiones de Edge.
ja: Package only updates (パッケージのみの更新) - OSバージョンがEdgeリリース間で変更されないユースケース用。
pt_br: Atualizações somente de pacotes: para casos de uso em que a versão do sistema operacional não é alterada entre os lançamentos do Edge.
zh_cn: 仅软件包更新 - 适用于操作系统版本不随 Edge 版本变动的使用场景。

source: Full OS migration - for use-cases where the OS version changes between Edge releases.
es: Migración completa del sistema operativo: para casos en los que la versión del sistema operativo cambie entre versiones de Edge.
ja: Full OS migration (完全なOSマイグレーション) - OSバージョンがEdgeリリース間で変更されるユースケース用。
pt_br: Migração completa do sistema operacional: para casos de uso em que a versão do sistema operacional é alterada entre os lançamentos do Edge.
zh_cn: 完整操作系统迁移 - 适用于操作系统版本随 Edge 版本变动的使用场景。

source: The upgrade is executed <emphasis role="strong">one</emphasis> node at a time starting with the control plane nodes first. Only if the control-plane node upgrade finishes will the worker nodes begin to be upgraded.
es: La actualización se ejecuta <emphasis role="strong">nodo</emphasis> a nodo, comenzando por los nodos de plano de control. Solo cuando finalice la actualización del nodo de plano de control, se empezarán a actualizar los nodos de trabajador.
ja: アップグレードは、コントロールプレーンノードから順に一度に<emphasis role="strong">1台</emphasis>のノードが実行されます。コントロールプレーンノードのアップグレードが終了した場合にのみ、ワーカーノードのアップグレードが開始されます。
pt_br: O upgrade é feito <emphasis role="strong">um</emphasis> nó de cada vez, começando primeiro pelos nós do plano de controle. Apenas quando o upgrade do nó do plano de controle é concluído que o upgrade dos nós do worker é iniciado.
zh_cn: 升级首先从控制平面节点开始，一次执行<emphasis role="strong">一个</emphasis>节点的升级。只有在控制平面节点的升级完成后，工作节点才会开始升级。

source: The Upgrade Controller configures the OS SUC Plans to do perform a <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drain</link> of the cluster nodes if the cluster has more than <emphasis role="strong">one</emphasis> node of the specified type.
es: Upgrade Controller configura los planes de SUC del sistema operativo para realizar un <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drenaje</link> de los nodos del clúster si este tiene más de <emphasis role="strong">un</emphasis> nodo del tipo especificado.
ja: クラスタに特定のタイプの<emphasis role="strong">1台</emphasis>を超えるノードがある場合、 Upgrade Controllerは、クラスタノードの<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drain</link>を実行するようにOS SUC Planを設定します。
pt_br: O Controller de upgrade configura os planos do SUC de sistema operacional para fazer uma <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drenagem</link> dos nós do cluster, se o cluster tiver mais de um <emphasis role="strong">um</emphasis> nó do tipo especificado.
zh_cn: 如果群集有<emphasis role="strong">多个</emphasis>指定类型的节点，升级控制器会配置操作系统 SUC 计划来<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">清空</link>群集节点。

source: For clusters where the control plane nodes are <emphasis role="strong">greater than</emphasis> one and there is <emphasis role="strong">only one</emphasis> worker node, a drain will be performed only for the control plane nodes and vice versa.
es: En los clústeres en los que hay <emphasis role="strong">más de un</emphasis> nodo de plano de control y hay <emphasis role="strong">un único</emphasis> nodo de trabajador, el drenaje se realizará solo para los nodos de plano de control, y viceversa.
ja: コントロールノードが1台を<emphasis role="strong">超え</emphasis> 、 <emphasis role="strong">1台のみ</emphasis>ワーカーノードがあるクラスタでは、コントロールプレーンノードに対してのみdrainが実行されます。その逆も同様です。
pt_br: Para os clusters em que os nós do plano de controle são <emphasis role="strong">mais de</emphasis> um, e existe <emphasis role="strong">apenas um</emphasis> nó do worker, a drenagem será realizada somente para os nós do plano de controle e vice-versa.
zh_cn: 对于控制平面节点<emphasis role="strong">有多个</emphasis>而工作节点<emphasis role="strong">只有一个</emphasis>的群集，只会清空控制平面节点，反之亦然。

source: For information on how to disable node drains altogether, see the UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>) section.
es: Para obtener información sobre cómo inhabilitar el drenaje de nodos, consulte la sección sobre UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>).
ja: ノードのdrainを完全に無効にする方法については、「UpgradePlan」(<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>)のセクションを参照してください。
pt_br: Para obter informações sobre como desabilitar completamente as drenagens de nós, consulte a seção UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>).
zh_cn: 有关如何完全禁用节点清空的信息，请参见“UpgradePlan”（<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>）一节。

source: Kubernetes upgrade
es: Actualización de Kubernetes
ja: Kubernetesのアップグレード
pt_br: Upgrade do Kubernetes
zh_cn: Kubernetes 升级

source: To upgrade the Kubernetes distribution of a cluster, the Upgrade Controller creates SUC (<xref linkend="components-system-upgrade-controller"/>) Plans that have the following naming template:
es: Para actualizar la distribución de Kubernetes de un clúster, Upgrade Controller crea planes de SUC (<xref linkend="components-system-upgrade-controller"/>) con el siguiente formato de nombre:
ja: クラスタのKubernetesディストリビューションをアップグレードするため、Upgrade Controllerは、次の命名テンプレートを持つSUC (<xref linkend="components-system-upgrade-controller"/>) Planを作成します。
pt_br: Para fazer upgrade da distribuição Kubernetes de um cluster, o Controller de upgrade cria planos do SUC (<xref linkend="components-system-upgrade-controller"/>) com o seguinte gabarito de nomenclatura:
zh_cn: 升级群集的 Kubernetes 发行版时，升级控制器会创建具有以下命名模板的 SUC（<xref linkend="components-system-upgrade-controller"/>）计划：

source: For SUC Plans related to control plane node Kubernetes upgrades - <literal>control-plane-&lt;k8s-version&gt;-&lt;suffix&gt;</literal>.
es: Para planes de SUC relacionados con actualizaciones de Kubernetes en nodos de plano de control: <literal>control-plane-&lt;versión-k8s&gt;-&lt;sufijo&gt;</literal>.
ja: コントロールプレーンノードのKubernetesアップグレードに関連するSUC Planの場合 - <literal>control-plane-&lt;k8s-version&gt;-&lt;suffix&gt;</literal>。
pt_br: Para os planos do SUC relacionados a ugrades do Kubernetes em nós do plano de controle: <literal>control-plane-&lt;versão-do-k8s&gt;-&lt;sufixo&gt;</literal>.
zh_cn: 对于与控制平面节点 Kubernetes 升级相关的 SUC 计划 - <literal>control-plane-&lt;k8s-version&gt;-&lt;suffix&gt;</literal>。

source: For SUC Plans related to worker node Kubernetes upgrades - <literal>workers-&lt;k8s-version&gt;-&lt;suffix&gt;</literal>.
es: Para planes de SUC relacionados con actualizaciones de Kubernetes en nodos de trabajador: <literal>workers-&lt;versión-k8s&gt;-&lt;sufijo&gt;</literal>.
ja: ワーカーノードのKubernetesアップグレードに関連するSUC Planの場合 - <literal>workers-&lt;k8s-version&gt;-&lt;suffix&gt;</literal>。
pt_br: Para os planos do SUC relacionados a upgrades do Kubernetes em nós do worker: <literal>workers-&lt;versão-do-k8s&gt;-&lt;sufixo&gt;</literal>.
zh_cn: 对于与工作节点 Kubernetes 升级相关的 SUC 计划 - <literal>workers-&lt;k8s-version&gt;-&lt;suffix&gt;</literal>。

source: Based on these plans, SUC proceeds to create workloads on each node of the cluster that perform the actual Kubernetes upgrade.
es: Basándose en estos planes, SUC crea cargas de trabajo en cada nodo del clúster que realizan la actualización real de Kubernetes.
ja: これらのプランに基づいて、SUCは、実際のKubernetesアップグレードを実行するクラスタの各ノードにワークロードを作成します。
pt_br: Com base nesses planos, o SUC cria as cargas de trabalho em cada nó do cluster que faz o upgrade real do Kubernetes.
zh_cn: SUC 会根据这些计划，继续在执行实际 Kubernetes 升级的群集的每个节点上创建工作负载。

source: The Kubernetes upgrade will happen <emphasis role="strong">one</emphasis> node at a time starting with the control plane nodes first. Only if the control plane node upgrade finishes will the worker nodes begin to be upgraded.
es: La actualización de Kubernetes se realizará <emphasis role="strong">nodo a nodo</emphasis>, comenzando por los nodos de plano de control. Solo cuando finalice la actualización de los nodos de plano de control se empezarán a actualizar los nodos de trabajador.
ja: Kubernetesアップグレードは、コントロールプレーンノードから順に一度に<emphasis role="strong">1台</emphasis>のノードが実行されます。コントロールプレーンノードのアップグレードが終了した場合にのみ、ワーカーノードのアップグレードが開始されます。
pt_br: O upgrade do Kubernetes é feito <emphasis role="strong">um</emphasis> nó de cada vez, começando primeiro pelos nós do plano de controle. Apenas quando o upgrade do nó do plano de controle é concluído que o upgrade dos nós do worker é iniciado.
zh_cn: Kubernetes 升级将从控制平面节点开始，一次升级<emphasis role="strong">一个</emphasis>节点。只有在控制平面节点的升级完成后，工作节点才会开始升级。

source: The Upgrade Controller configures the Kubernetes SUC Plans to perform a <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drain</link> of the cluster nodes if the cluster has more than <emphasis role="strong">one</emphasis> node of the specified type.
es: Upgrade Controller configura los planes de SUC de Kubernetes para realizar un <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drenaje</link> de los nodos del clúster si este tiene más de <emphasis role="strong">un nodo</emphasis> del tipo especificado.
ja: クラスタに特定のタイプの<emphasis role="strong">1台</emphasis>を超えるノードがある場合、 Upgrade Controllerは、クラスタノードの<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drain</link>を実行するようにKubernetes SUC Planを設定します。
pt_br: O Controller de upgrade configura os planos do SUC do Kubernetes para fazer uma <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drenagem</link> dos nós do cluster, se o cluster tiver mais de um <emphasis role="strong">um</emphasis> nó do tipo especificado.
zh_cn: 如果群集有<emphasis role="strong">多个</emphasis>指定类型的节点，升级控制器会配置 Kubernetes SUC 计划来<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">清空</link>群集节点。

source: For information on how to disable node drains altogether, see <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
es: Para obtener información sobre cómo inhabilitar el drenaje de nodos, consulte la <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
ja: ノードのdrainを完全に無効にする方法については、<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>を参照してください。
pt_br: Para obter informações sobre como desabilitar completamente as drenagens de nós, consulte a <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
zh_cn: 有关如何完全禁用节点清空的信息，请参见<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>。

source: Additional components upgrades
es: Actualización de componentes adicionales
ja: 追加のコンポーネントのアップグレード
pt_br: Upgrades de componentes adicionais
zh_cn: 其他组件的升级

source: Currently, all additional components are installed via Helm charts. For a full list of the components for a specific release, refer to the Release Notes (<xref linkend="release-notes"/>).
es: Actualmente, todos los componentes adicionales se instalan mediante charts de Helm. Para obtener una lista completa de los componentes de una versión específica, consulte las Notas de la versión (<xref linkend="release-notes"/>).
ja: 現在、追加のコンポーネントはすべてHelmチャートを介してインストールされます。特定のリリースのコンポーネントの全リストについては、リリースノート(<xref linkend="release-notes"/>)を参照してください。
pt_br: Atualmente, todos os componentes adicionais são instalados por gráficos Helm. Para ver a lista completa dos componentes de uma versão específica, consulte as Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: 目前，所有其他组件都是通过 Helm chart 安装的。有关特定版本各组件的完整列表，请参见发行说明（<xref linkend="release-notes"/>）。

source: For Helm charts deployed through EIB (<xref linkend="components-eib"/>), the Upgrade Controller updates the existing <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link> of each component.
es: Para los charts de Helm desplegados a través de EIB (<xref linkend="components-eib"/>), Upgrade Controller actualiza la <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">CR de HelmChart</link> existente de cada componente.
ja: EIB (<xref linkend="components-eib"/>)を通じてデプロイされたHelmチャートの場合、Upgrade Controllerは各コンポーネントの既存の<link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link>を更新します。
pt_br: Para gráficos Helm implantados pelo EIB (<xref linkend="components-eib"/>), o Controller de upgrade atualiza o <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link> existente de cada componente.
zh_cn: 对于通过 EIB（<xref linkend="components-eib"/>）部署的 Helm chart，升级控制器会更新每个组件的现有 <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link>。

source: For Helm charts deployed outside of EIB, the Upgrade Controller creates a <literal>HelmChart</literal> resource for each component.
es: Para los charts de Helm desplegados fuera de EIB, Upgrade Controller crea un recurso <literal>HelmChart</literal> para cada componente.
ja: EIB以外でデプロイされたHelmチャートの場合、Upgrade Controllerは、コンポーネントごとに<literal>HelmChart</literal>リソースを作成します。
pt_br: Para gráficos Helm implantados fora do EIB, o Controller de upgrade cria um recurso <literal>HelmChart</literal> para cada componente.
zh_cn: 对于在 EIB 之外部署的 Helm chart，升级控制器会为每个组件创建一个 <literal>HelmChart</literal> 资源。

source: After the creation/update of the <literal>HelmChart</literal> resource, the Upgrade Controller relies on the <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link> to pick up this change and proceed with the actual component upgrade.
es: Tras la creación/actualización del recurso <literal>HelmChart</literal>, Upgrade Controller se basa en <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link> para detectar este cambio y proceder con la actualización real del componente.
ja: <literal>HelmChart</literal>リソースの作成/更新後、 Upgrade Controllerは、<link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link>に依存してこの変更を取得し、実際のコンポーネントのアップグレードを続行します。
pt_br: Após a criação/atualização do recurso <literal>HelmChart</literal>, o Controller de upgrade se baseia no <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link> para detectar essa alteração e prosseguir com o upgrade real do componente.
zh_cn: 在创建/更新 <literal>HelmChart</literal> 资源后，升级控制器会依赖 <link xl:href="https://github.com/k3s-io/helm-controller/">helm-controller</link> 来拾取此更改并继续执行实际的组件升级。

source: Charts will be upgraded sequentially based on their order in the <literal>ReleaseManifest</literal>. Additional values can also be passed through the <literal>UpgradePlan</literal>. If a chart’s version remains unchanged in the new SUSE Edge release, it will not be upgraded. For more information about this, refer to <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
es: Los charts se actualizan secuencialmente según su orden en <literal>ReleaseManifest</literal>. También se pueden pasar valores adicionales a través de <literal>UpgradePlan</literal>. Si la versión de un chart permanece sin cambios en la nueva versión de SUSE Edge, no se actualizará. Para obtener más información al respecto, consulte la <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
ja: チャートは<literal>ReleaseManifest</literal>の順序に基づいて順次アップグレードされます。追加の値は<literal>UpgradePlan</literal>を通じて渡すこともできます。新しいSUSE Edgeリリースでチャートのバージョンが変更されない場合、アップグレードされません。これに関する詳細については、<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>を参照してください。
pt_br: O upgrade dos gráficos será feito em sequência de acordo com a ordem apresentada no <literal>ReleaseManifest</literal>. É possível também especificar mais valores no <literal>UpgradePlan</literal>. Se uma versão de gráfico permanecer inalterada no novo lançamento do SUSE Edge, o upgrade dele não será feito. Para obter mais informações sobre isso, consulte a <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
zh_cn: Chart 将按照 <literal>ReleaseManifest</literal> 中的顺序依次升级。您还可通过 <literal>UpgradePlan</literal> 传递其他值。如果在新 SUSE Edge 版本中某个 chart 的版本保持不变，则不会将其升级。有关这方面的详细信息，请参见<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>。

source: Kubernetes API extensions
es: Extensiones de la API de Kubernetes
ja: Kubernetes API拡張機能
pt_br: Extensões de API Kubernetes
zh_cn: Kubernetes API 扩展

source: Extensions to the Kubernetes API introduced by the Upgrade Controller.
es: Extensiones a la API de Kubernetes introducidas por Upgrade Controller.
ja: Upgrade Controllerによって導入されたKubernetes APIの拡張機能。
pt_br: Extensões para a API Kubernetes lançadas pelo Controller de upgrade.
zh_cn: 升级控制器引入的 Kubernetes API 的扩展。

source: The Upgrade Controller introduces a new Kubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">custom resource</link> called an <literal>UpgradePlan</literal>.
es: Upgrade Controller introduce un nuevo <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recurso personalizado</link> de Kubernetes llamado <literal>UpgradePlan</literal>.
ja: Upgrade Controllerは、<literal>UpgradePlan</literal>と呼ばれる新たなKubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">カスタムリソース</link>を導入しました。
pt_br: O Controller de upgrade lança um novo <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recurso personalizado</link> do Kubernetes chamado <literal>UpgradePlan</literal>.
zh_cn: 升级控制器引入了一个名为 <literal>UpgradePlan</literal> 的新 Kubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">自定义资源</link>。

source: The <literal>UpgradePlan</literal> serves as an instruction mechanism for the Upgrade Controller and it supports the following configurations:
es: <literal>UpgradePlan</literal> sirve como mecanismo de instrucción para Upgrade Controller y admite las siguientes configuraciones:
ja: <literal>UpgradePlan</literal>は、Upgrade Controllerの指示メカニズムとして機能し、次の設定をサポートします。
pt_br: O <literal>UpgradePlan</literal> atua como um mecanismo de instrução para o Controller de upgrade e oferece suporte às seguintes configurações:
zh_cn: <literal>UpgradePlan</literal> 是升级控制器的指令机制，支持以下配置：

source: <literal>releaseVersion</literal> - Edge release version to which the cluster should be upgraded to. The release version must follow <link xl:href="https://semver.org">semantic</link> versioning and should be retrieved from the Release Notes (<xref linkend="release-notes"/>).
es: <literal>releaseVersion</literal>: versión de Edge a la que se va a actualizar el clúster. La versión debe seguir el sistema <link xl:href="https://semver.org">semántico</link> de versiones y debe obtenerse de las Notas de la versión (<xref linkend="release-notes"/>).
ja: <literal>releaseVersion</literal> - クラスタをアップグレースする必要があるEdgeリリースバージョン。リリースバージョンは、<link xl:href="https://semver.org">セマンティック</link>バージョン管理に従う必要があり、リリースノート(<xref linkend="release-notes"/>)から取得する必要があります。
pt_br: <literal>releaseVersion</literal>: a versão de lançamento do Edge para a qual o upgrade do cluster deve ser feito. Ela deve seguir o controle de versão <link xl:href="https://semver.org">semântico</link> e ser recuperada das Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: <literal>releaseVersion</literal> - 群集应升级到的 Edge 版本。版本必须遵循<link xl:href="https://semver.org">语义</link>版本规范，并且应从发行说明（<xref linkend="release-notes"/>）中检索。

source: <literal>disableDrain</literal> - <emphasis role="strong">Optional</emphasis>; instructs the Upgrade Controller on whether to disable node <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drains</link>. Useful for when you have workloads with <link xl:href="https://kubernetes.io/docs/tasks/run-application/configure-pdb/">Disruption Budgets</link>.
es: <literal>disableDrain</literal>: (<emphasis role="strong">opcional</emphasis>) indica a Upgrade Controller si debe inhabilitar el <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drenaje</link> de nodos. Resulta útil cuando se tienen cargas de trabajo con <link xl:href="https://kubernetes.io/docs/tasks/run-application/configure-pdb/">presupuestos de interrupción</link>.
ja: <literal>disableDrain</literal> - <emphasis role="strong">オプション</emphasis>。Upgrade Controllerにノードの<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drains</link>を無効にするかどうかを指示します。<link xl:href="https://kubernetes.io/docs/tasks/run-application/configure-pdb/">Disruption Budgets</link>を含むワークロードがある場合に役立ちます。
pt_br: <literal>disableDrain</literal> (<emphasis role="strong">opcional</emphasis>): indica se o Controller de upgrade deve ou não desabilitar as <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">drenagens</link> de nós. Útil quando você tem cargas de trabalho com <link xl:href="https://kubernetes.io/docs/tasks/run-application/configure-pdb/">orçamentos de interrupção</link>.
zh_cn: <literal>disableDrain</literal> - <emphasis role="strong">可选</emphasis>；指示升级控制器是否禁用节点<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_drain/">清空</link>。当您有具有<link xl:href="https://kubernetes.io/docs/tasks/run-application/configure-pdb/">干扰预算</link>的工作负载时，可以用到。

source: Example for control plane node drain disablement:
es: Ejemplo de inhabilitación del drenaje del nodo de plano de control:
ja: コントロールプレーンノードのdrain無効化の例:
pt_br: Exemplo de desabilitação de drenagem de nó do plano de controle:
zh_cn: 禁用控制平面节点清空的示例：

source: Example for control plane and worker node drain disablement:
es: Ejemplo de inhabilitación del drenaje del nodo de plano de control y del nodo de trabajador:
ja: コントロールプレーンとワーカーノードのdrain無効化の例:
pt_br: Exemplo de desabilitação de drenagem de nó do plano de controle e do worker:
zh_cn: 禁用控制平面和工作节点清空的示例：

source: <literal>helm</literal> - <emphasis role="strong">Optional</emphasis>; specifies additional values for components installed via Helm.
es: <literal>helm</literal>: (<emphasis role="strong">opcional</emphasis>) especifica valores adicionales para los componentes instalados a través de Helm.
ja: <literal>helm</literal> - <emphasis role="strong">オプション</emphasis>。Helmを介してインストールされたコンポーネントの追加の値を指定します。
pt_br: <literal>helm</literal> (<emphasis role="strong">opcional</emphasis>): especifica valores adicionais para componentes instalados pelo Helm.
zh_cn: <literal>helm</literal> - <emphasis role="strong">可选</emphasis>；为通过 Helm 安装的组件指定其他值。
