Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The following is a "Day 2" workflow that should be followed when upgrading a downstream cluster to a specific Edge release.
es: A continuación, se describe el flujo de trabajo de "día 2" que se debe seguir al actualizar un clúster descendente a una versión específica de Edge.
ja: 以下に、ダウンストリームクラスタを特定のEdgeリリースにアップグレードする際に従う必要のある「Day 2」ワークフローを示します。
pt_br: Veja abaixo o fluxo de trabalho de "dia 2" que deve ser seguido para fazer upgrading de um cluster downstream para uma versão específica do Edge.
zh_cn: 下面是在将下游群集升级到特定 Edge 版本时应遵循的“Day 2”工作流程。

source: OS upgrade (<xref linkend="downstream-day2-fleet-os-upgrade"/>)
es: Actualización del sistema operativo (<xref linkend="downstream-day2-fleet-os-upgrade"/>)
ja: OSアップグレード(<xref linkend="downstream-day2-fleet-os-upgrade"/>)
pt_br: Upgrade de sistema operacional (<xref linkend="downstream-day2-fleet-os-upgrade"/>)
zh_cn: 操作系统升级（<xref linkend="downstream-day2-fleet-os-upgrade"/>）

source: Kubernetes version upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade"/>)
es: Actualización de la versión de Kubernetes (<xref linkend="downstream-day2-fleet-k8s-upgrade"/>)
ja: Kubernetesバージョンアップグレード(<xref linkend="downstream-day2-fleet-k8s-upgrade"/>)
pt_br: Upgrade de versão do Kubernetes (<xref linkend="downstream-day2-fleet-k8s-upgrade"/>)
zh_cn: Kubernetes 版本升级（<xref linkend="downstream-day2-fleet-k8s-upgrade"/>）

source: Helm chart upgrade (<xref linkend="downstream-day2-fleet-helm-upgrade"/>)
es: Actualización del chart de Helm (<xref linkend="downstream-day2-fleet-helm-upgrade"/>)
ja: Helmチャートアップグレード(<xref linkend="downstream-day2-fleet-helm-upgrade"/>)
pt_br: Upgrade de gráfico Helm (<xref linkend="downstream-day2-fleet-helm-upgrade"/>)
zh_cn: Helm chart 升级（<xref linkend="downstream-day2-fleet-helm-upgrade"/>）

source: <xref linkend="downstream-day2-fleet-os-upgrade-components"/> - additional components used by the upgrade process.
es: <xref linkend="downstream-day2-fleet-os-upgrade-components"/>: componentes adicionales usados por el proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-os-upgrade-components"/> - アップグレードプロセスによって使用される追加のコンポーネント。
pt_br: <xref linkend="downstream-day2-fleet-os-upgrade-components"/>: componentes adicionais usados pelo processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-os-upgrade-components"/> - 升级过程使用的其他组件。

source: <xref linkend="downstream-day2-fleet-os-upgrade-overview"/> - overview of the upgrade process.
es: <xref linkend="downstream-day2-fleet-os-upgrade-overview"/>: descripción general del proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-os-upgrade-overview"/> - アップグレードプロセスの概要。
pt_br: <xref linkend="downstream-day2-fleet-os-upgrade-overview"/>: visão geral do processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-os-upgrade-overview"/> - 升级过程概述。

source: <xref linkend="downstream-day2-fleet-os-upgrade-requirements"/> - requirements of the upgrade process.
es: <xref linkend="downstream-day2-fleet-os-upgrade-requirements"/>: requisitos del proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-os-upgrade-requirements"/> - アップグレードプロセスの要件。
pt_br: <xref linkend="downstream-day2-fleet-os-upgrade-requirements"/>: requisitos do processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-os-upgrade-requirements"/> - 升级过程的要求。

source: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment"/> - information on how to deploy <literal>SUC plans</literal>, responsible for triggering the upgrade process.
es: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment"/>: información sobre cómo desplegar <literal>planes de SUC</literal>, responsables de iniciar el proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment"/> - アップグレードプロセスのトリガを担当する、<literal>SUC Plan</literal>をデプロイする方法に関する情報。
pt_br: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment"/>: informações de como implantar os <literal>planos do SUC</literal>, responsáveis por acionar o processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment"/> - 关于如何部署负责触发升级过程的 <literal>SUC 计划</literal>的信息。

source: This section covers the custom components that the <literal>OS upgrade</literal> process uses over the default "Day 2" components (<xref linkend="downstream-day2-fleet-components"/>).
es: Esta sección trata sobre los componentes personalizados que el proceso de <literal>actualización del sistema operativo</literal> usa en lugar de los componentes predeterminados de "día 2" (<xref linkend="downstream-day2-fleet-components"/>).
ja: このセクションでは、<literal>OSアップグレード</literal>プロセスがデフォルトの「Day 2」コンポーネント(<xref linkend="downstream-day2-fleet-components"/>)よりも使用するカスタムコンポーネントについて説明します。
pt_br: Esta seção aborda os componentes personalizados que o processo de <literal>upgrade de sistema operacional</literal> usa com os componentes de "dia 2" padrão (<xref linkend="downstream-day2-fleet-components"/>).
zh_cn: 本节介绍<literal>操作系统升级</literal>过程中使用的自定义组件，这些组件与默认“Day 2”组件（<xref linkend="downstream-day2-fleet-components"/>）不同。

source: The services mentioned above are shipped on each node through a <literal>SUC plan</literal> which must be located on the downstream cluster that is in need of an OS upgrade.
es: Los servicios mencionados se incluyen a cada nodo mediante un <literal>plan de SUC</literal> que debe estar ubicado en el clúster descendente que necesita una actualización del sistema operativo.
ja: 上記サービスは、OSアップグレードが必要なダウンストリームクラスタ上に配置する必要がある<literal>SUC Plan</literal>を通じて各ノードに配布されます。
pt_br: Os serviços mencionados acima são distribuídos para cada nó por meio do <literal>plano do SUC</literal>, que deve estar localizado no cluster downstream que precisa do upgrade de sistema operacional.
zh_cn: 上述服务通过 <literal>SUC 计划</literal>部署到每个节点，该计划必须位于需要升级操作系统的下游群集上。

source: The upgrade of the operating system for downstream cluster nodes is done by utilizing <literal>Fleet</literal> and the <literal>System Upgrade Controller (SUC)</literal>.
es: La actualización del sistema operativo para los nodos del clúster descendente se realiza con <literal>Fleet</literal> y <literal>System Upgrade Controller (SUC)</literal>.
ja: ダウンストリームクラスタノードのオペレーティングシステムのアップグレードは、<literal>Fleet</literal>と<literal>System Upgrade Controller (SUC)</literal>を利用して実行されます。
pt_br: O upgrade do sistema operacional para nós de cluster downstream é feito pelo <literal>Fleet</literal> e pelo <literal>System Upgrade Controller (SUC)</literal>.
zh_cn: 通过 <literal>Fleet</literal> 和<literal>系统升级控制器 (SUC)</literal> 来为下游群集节点升级操作系统。

source: <literal>GitRepo/Bundle</literal> resources are always deployed on the <literal>management cluster</literal>. Whether to use a <literal>GitRepo</literal> or <literal>Bundle</literal> resource depends on your use-case, check <xref linkend="downstream-day2-fleet-determine-use-case"/> for more information.
es: Los recursos <literal>GitRepo/Bundle</literal> siempre se despliegan en el <literal>clúster de gestión</literal>. Que se use un recurso <literal>GitRepo</literal> o <literal>Bundle</literal> depende del caso de uso. Consulte la <xref linkend="downstream-day2-fleet-determine-use-case"/> para obtener más información.
ja: <literal>GitRepo/バンドル</literal>リソースは常に、<literal>管理クラスタ</literal>上にデプロイされます。<literal>GitRepo</literal>リソースを使用するか<literal>バンドル</literal>リソースを使用するかは、ユースケースによって異なります。詳細については、<xref linkend="downstream-day2-fleet-determine-use-case"/>をご確認ください。
pt_br: Os recursos <literal>GitRepo/Bundle</literal> sempre são implantados no <literal>cluster de gerenciamento</literal>. O uso do recurso <literal>GitRepo</literal> ou <literal>Bundle</literal> depende do seu caso de uso. Consulte a <xref linkend="downstream-day2-fleet-determine-use-case"/> para obter mais informações.
zh_cn: <literal>GitRepo/捆绑包</literal>资源始终部署在<literal>管理群集</literal>上。使用 <literal>GitRepo</literal> 还是<literal>捆绑包</literal>资源取决于具体应用场景，有关详细信息，请参见<xref linkend="downstream-day2-fleet-determine-use-case"/>。

source: The <literal>Kubernetes Job</literal> creates a systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>) for either package upgrade, or OS migration.
es: El <literal>trabajo de Kubernetes</literal> crea un servicio systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>) para la actualización de paquetes o para la migración del sistema operativo.
ja: <literal>Kubernetes Job</literal>は、パッケージのアップグレードまたはOSマイグレーションのためにsystemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>)を作成します。
pt_br: O <literal>Kubernetes Job</literal> cria um systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>) para upgrade de pacote ou migração de sistema operacional.
zh_cn: <literal>Kubernetes 作业</literal>创建一个 systemd.service（<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>），用于执行软件包升级或操作系统迁移。

source: fleet day2 downstream os upgrade
es: actualización del sistema operativo descendente día 2 fleet
ja: fleet day2ダウンストリームosアップグレード
pt_br: upgrade so downstream dia2 fleet
zh_cn: Fleet Day2 下游操作系统升级

source: <emphasis role="strong">SCC registered machine</emphasis> - All downstream cluster nodes should be registered to <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal> which is needed so that the respective <literal>systemd.service</literal> can successfully connect to the desired RPM repository.
es: <emphasis role="strong">Equipo registrado en el Centro de servicios al cliente de SUSE</emphasis>: todos los nodos del clúster descendentes deben estar registrados en <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal>. Es necesario para que el servicio <literal>systemd.service</literal> respectivo pueda conectarse correctamente al repositorio RPM deseado.
ja: <emphasis role="strong">SCC登録マシン</emphasis> - すべてのダウンストリームクラスタノードを<literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal>に登録する必要があります。これは、各<literal>systemd.service</literal>が目的のRPMリポジトリに正常に接続できるようにするために必要です。
pt_br: <emphasis role="strong">Máquina registrada no SCC</emphasis>: todos os nós do cluster downstream devem ser registrados no <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal> para que o respectivo <literal>systemd.service</literal> possa se conectar com sucesso ao repositório RPM desejado.
zh_cn: <emphasis role="strong">已在 SCC 中注册的计算机</emphasis> - 所有下游群集节点都应已注册到 <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal>。只有这样，<literal>systemd.service</literal> 才能成功连接到所需的 RPM 储存库。

source: <literal>Remove any previously deployed SUC Plans related to older Edge release versions from the downstream cluster</literal> - can be done by removing the desired cluster from the existing <literal>GitRepo/Bundle</literal> <link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">target configuration</link>, or removing the <literal>GitRepo/Bundle</literal> resource altogether.
es: <literal>Elimine cualquier plan de SUC desplegado anteriormente relacionado con versiones anteriores de Edge del clúster descendente</literal>. Esto se puede hacer eliminando el clúster deseado de la <link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">configuración de destino</link> de <literal>GitRepo/Bundle</literal> existente o eliminando por completo el recurso <literal>GitRepo/Bundle</literal>.
ja: <literal>ダウンストリームクラスタから古いEdgeリリースバージョンに関連する以前にデプロイしたSUC Planを削除する</literal> - これは、既存の<literal>GitRepo/バンドル</literal><link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">ターゲット設定</link>から目的のクラスタを削除するか、<literal>GitRepo/バンドル</literal>リソースを完全に削除することで、実行できます。
pt_br: <literal>Remover os planos do SUC que já foram implantados relacionados a versões de lançamento mais antigas do Edge do cluster downstream</literal>: para fazer isso, remova o cluster desejado da <link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">configuração de destino</link> do <literal>GitRepo/Bundle</literal> existente ou remova o recurso <literal>GitRepo/Bundle</literal> completamente.
zh_cn: <literal>从下游群集中去除任何先前部署且与旧版 Edge 相关的 SUC 计划</literal> - 方法是从现有的 <literal>GitRepo/捆绑包</literal><link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">目标配置</link>中去除相应群集，或完全去除 <literal>GitRepo/捆绑包</literal>资源。

source: If users attempt to upgrade, while there are existing <literal>SUC Plans</literal> on the downstream cluster, they will see the following fleet error:
es: Si los usuarios intentan actualizar, mientras haya <literal>planes de SUC</literal> existentes en el clúster descendente, verán el siguiente error de Fleet:
ja: ユーザがアップグレードを試す場合、ダウンストリームクラスタに既存の<literal>SUC Plan</literal>がある場合は、次のフリートエラーが表示されます。
pt_br: Se os usuários tentarem fazer upgrade e já houver <literal>planos do SUC</literal> no cluster downstream, eles verão o seguinte erro no Fleet:
zh_cn: 如果用户尝试升级，而下游群集上存在现有的 <literal>SUC 计划</literal>，他们将看到以下 Fleet 错误：

source: As mentioned in <xref linkend="downstream-day2-fleet-os-upgrade-overview"/>, OS upgrades are done by shipping <literal>SUC plans</literal> to the desired cluster through one of the following ways:
es: Como se menciona en la <xref linkend="downstream-day2-fleet-os-upgrade-overview"/>, las actualizaciones del sistema operativo se realizan incluyendo <literal>planes de SUC</literal> en el clúster deseado de las siguientes formas:
ja: <xref linkend="downstream-day2-fleet-os-upgrade-overview"/>で説明したように、OSアップグレードは、次の方法のいずれかの方法を使用して、<literal>SUC Plan</literal>を目的のクラスタに配布することで実行されます。
pt_br: Conforme mencionado na <xref linkend="downstream-day2-fleet-os-upgrade-overview"/>, os upgrades de sistema operacional são feitos enviando os <literal>planos do SUC</literal> ao cluster desejado de uma destas maneiras:
zh_cn: 如<xref linkend="downstream-day2-fleet-os-upgrade-overview"/>中所述，可以通过以下任意一种方式将 <literal>SUC 计划</literal>分发到目标群集来完成操作系统升级：

source: Fleet <literal>GitRepo</literal> resource - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>.
es: Recurso <literal>GitRepo</literal> de Fleet: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>.
ja: Fleet <literal>GitRepo</literal>リソース - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>。
pt_br: Recurso <literal>GitRepo</literal> do Fleet: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>.
zh_cn: Fleet <literal>GitRepo</literal> 资源 - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>。

source: Fleet <literal>Bundle</literal> resource - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle"/>.
es: Recurso <literal>Bundle</literal> de Fleet: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle"/>.
ja: Fleet <literal>バンドル</literal>リソース - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle"/>。
pt_br: Recurso <literal>Bundle</literal> do Fleet: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle"/>.
zh_cn: Fleet <literal>捆绑包</literal>资源 - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle"/>。

source: To determine which resource you should use, refer to <xref linkend="downstream-day2-fleet-determine-use-case"/>.
es: Para determinar qué recurso se debe usar, consulte la <xref linkend="downstream-day2-fleet-determine-use-case"/>.
ja: どのリソースを使用すべきかを判断するには、<xref linkend="downstream-day2-fleet-determine-use-case"/>を参照してください。
pt_br: Para determinar o recurso que você deve usar, consulte a <xref linkend="downstream-day2-fleet-determine-use-case"/>.
zh_cn: 要确定使用哪个资源，请参见<xref linkend="downstream-day2-fleet-determine-use-case"/>。

source: For use-cases where you wish to deploy the <literal>OS SUC plans</literal> from a third-party GitOps tool, refer to <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-third-party"/>
es: Si desea desplegar los <literal>planes de SUC de sistema operativo</literal> desde una herramienta GitOps de terceros, consulte la <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-third-party"/>.
ja: <literal>OS SUC Plan </literal>をサードパーティのGitOpsツールからデプロイするユースケースの場合は、<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-third-party"/>を参照してください。
pt_br: Para casos de uso de implantação dos <literal>planos do SUC de sistema operacional</literal> de uma ferramenta GitOps de terceiros, consulte a <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-third-party"/>.
zh_cn: 对于希望通过第三方 GitOps 工具部署<literal>操作系统 SUC 计划</literal>的使用场景，请参见<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-third-party"/>。

source: Through the <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/>を通じて(<literal>Rancher</literal>が使用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>）到<literal>管理群集</literal>。

source: Edit the <emphasis role="strong">GitRepo</emphasis> configuration, under <literal>spec.targets</literal> specify your desired target list. By default the <literal>GitRepo</literal> resources from the <literal>suse-edge/fleet-examples</literal> are <emphasis role="strong">NOT</emphasis> mapped to any downstream clusters.
es: Edite la configuración de <emphasis role="strong">GitRepo</emphasis>. En <literal>spec.targets</literal>, especifique la lista de destinos que desee. De forma predeterminada, los recursos <literal>GitRepo</literal> de <literal>suse-edge/fleet-examples</literal> <emphasis role="strong">NO</emphasis> están asignados a ningún clúster descendente.
ja: <emphasis role="strong">GitRepo</emphasis>設定を編集し、<literal>spec.targets</literal>で目的のターゲットリストを指定します。デフォルトでは、<literal>suse-edge/fleet-examples</literal>の<literal>GitRepo</literal>リソースはどのダウンストリームクラスタにもマップ<emphasis role="strong">されません</emphasis>。
pt_br: Edite a configuração do <emphasis role="strong">GitRepo</emphasis> e especifique a lista de destinos desejados em <literal>spec.targets</literal>. Por padrão, os recursos <literal>GitRepo</literal> de <literal>suse-edge/fleet-examples</literal> <emphasis role="strong">NÃO</emphasis> são mapeados para clusters downstream.
zh_cn: 编辑 <emphasis role="strong">GitRepo</emphasis> 配置，在 <literal>spec.targets</literal> 下指定所需的目标列表。默认情况下，<literal>suse-edge/fleet-examples</literal> 中的 <literal>GitRepo</literal> 资源<emphasis role="strong">不会</emphasis>映射到任何下游群集。

source: To match all clusters change the default <literal>GitRepo</literal> <emphasis role="strong">target</emphasis> to:
es: Para que coincidan todos los clústeres, cambie el <emphasis role="strong">destino</emphasis> predeterminado de <literal>GitRepo</literal> a:
ja: すべてのクラスタ変更に一致させるには、デフォルトの<literal>GitRepo</literal><emphasis role="strong">ターゲット</emphasis>を次のように変更します。
pt_br: Para corresponder todos os clusters, altere o <emphasis role="strong">destino</emphasis> do <literal>GitRepo</literal> padrão para:
zh_cn: 为了匹配所有群集，请将默认的 <literal>GitRepo</literal> <emphasis role="strong">目标</emphasis>更改为：

source: Alternatively, if you want a more granular cluster selection see <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link>
es: Como alternativa, si desea una selección de clústeres más detallada, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Asignación a clústeres descendentes).
ja: または、クラスタをより細かく選択したい場合は、「<link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Cluster (ダウンストリームクラスタへのマッピング)</link>」を参照してください。
pt_br: Se preferir uma seleção mais granular de clusters, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Mapeando para clusters downstream).
zh_cn: 或者，如果您要更细致地选择群集，请参见<link xl:href="https://fleet.rancher.io/gitrepo-targets">映射到下游群集</link>

source: View the created <emphasis role="strong">GitRepo</emphasis> resource under the <literal>fleet-default</literal> namespace:
es: Consulte el recurso <emphasis role="strong">GitRepo</emphasis> creado en el espacio de nombres <literal>fleet-default</literal>:
ja: <literal>fleet-default</literal>ネームスペースで、作成した<emphasis role="strong">GitRepo</emphasis>リソースを表示します。
pt_br: Visualize o recurso <emphasis role="strong">GitRepo</emphasis> criado no namespace <literal>fleet-default</literal>:
zh_cn: 查看 <literal>fleet-default</literal> 名称空间下创建的 <emphasis role="strong">GitRepo</emphasis> 资源：

source: Through the <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/>を通じて(<literal>Rancher</literal>が使用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="downstream-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>）到<literal>管理群集</literal>。
