Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The System Upgrade Controller (SUC) aims to provide a general-purpose, Kubernetes-native upgrade controller (for nodes). It introduces a new CRD, the Plan, for defining any and all of your upgrade policies/requirements. A Plan is an outstanding intent to mutate nodes in your cluster.
es: System Upgrade Controller (SUC) proporciona un controlador de actualización de uso general y nativo de Kubernetes (para nodos). Introduce una nueva CRD, llamada "plan", para definir todas sus políticas y requisitos de actualización. Un plan es una intención pendiente de mutar nodos en su clúster.
ja: System Upgrade Controller (SUC)は、汎用のKubernetesネイティブアップグレードコントローラ(ノード用)を提供することを目的としています。あらゆるアップグレードポリシー/要件を定義するための新しいCRDであるPlanが導入されています。Planは、クラスタ内のノードを変更する明確な意図です。
pt_br: O System Upgrade Controller (SUC) tem como objetivo oferecer um controlador de upgrade nativo do Kubernetes genérico (para nós). Ele introduz uma nova CRD, o plano, para definir todas as suas políticas/requisitos de upgrade. O plano é uma intenção evidente de mudar nós no cluster.
zh_cn: 系统升级控制器 (SUC) 旨在提供一个针对节点的 Kubernetes 原生通用升级控制器。它引入了一个新的 CRD，即计划，用于定义您的各种升级策略/要求。计划的主要意图是改变群集中的节点。

source: How does SUSE Edge use System Upgrade Controller?
es: ¿Cómo se usa System Upgrade Controller en SUSE Edge?
ja: SUSE EdgeでのSystem Upgrade Controllerの用途
pt_br: Como o SUSE Edge usa o System Upgrade Controller?
zh_cn: SUSE Edge 如何使用系统升级控制器？

source: SUSE Edge uses <literal>SUC</literal> to facilitate various "Day 2" operations related to OS and Kubernetes version upgrades on management and downstream clusters.
es: SUSE Edge usa <literal>SUC</literal> para facilitar diversas operaciones de "día 2" relacionadas con las actualizaciones de la versión del sistema operativo y Kubernetes en los clústeres de gestión y descendentes.
ja: SUSE Edgeでは、<literal>SUC</literal>を使用して、管理クラスタとダウンストリームクラスタでのOSとKubernetesのバージョンアップグレードに関連するさまざまな「Day 2」操作を容易にします。
pt_br: O SUSE Edge usa o <literal>SUC</literal> para facilitar diversas operações de "dia 2" relacionadas a upgrades de versão de sistema operacional e Kubernetes em clusters de gerenciamento e downstream.
zh_cn: SUSE Edge 使用 <literal>SUC</literal> 来协助完成管理群集和下游群集中与操作系统及 Kubernetes 版本升级相关的各类“Day 2”操作。

source: "Day 2" operations are defined through <literal>SUC Plans</literal>. Based on these plans, <literal>SUC</literal> deploys workloads on each node to execute the respective "Day 2" operation.
es: Las operaciones de "día 2" se definen mediante <literal>planes de SUC</literal>. Según esos planes, <literal>SUC</literal> despliega las cargas de trabajo en cada nodo para ejecutar la operación correspondiente de "día 2".
ja: 「Day 2」操作は、<literal>SUC Plan</literal>によって定義されます。これらのプランに基づき、<literal>SUC</literal>は各ノードにワークロードをデプロイし、それぞれの「Day 2」操作を実行します。
pt_br: As operações de "dia 2" são definidas em <literal>planos do SUC</literal>. Com base nesses planos, o <literal>SUC</literal> implanta as cargas de trabalho em cada nó para executar a respectiva operação de "dia 2".
zh_cn: “Day 2”操作通过 <literal>SUC 计划</literal>来定义。<literal>SUC</literal> 会根据这些计划在每个节点上部署工作负载，以执行相应的“Day 2”操作。

source: <literal>SUC</literal> is also used within the <xref linkend="components-upgrade-controller"/>. To learn more about the key differences between SUC and the Upgrade Controller, see <xref linkend="components-upgrade-controller-uc-vs-suc"/>.
es: <literal>SUC</literal> también se utiliza en <xref linkend="components-upgrade-controller"/>. Para obtener más información sobre las diferencias clave entre SUC y Upgrade Controller, consulte la <xref linkend="components-upgrade-controller-uc-vs-suc"/>.
ja: <literal>SUC</literal>は、<xref linkend="components-upgrade-controller"/>内でも使用されます。SUCとUpgrade Controllerの主な違いに関する詳細については、 <xref linkend="components-upgrade-controller-uc-vs-suc"/>を参照してください。
pt_br: O <literal>SUC</literal> também é usado no <xref linkend="components-upgrade-controller"/>. Para saber mais sobre as principais diferenças entre o SUC e o Controller de upgrade, consulte a <xref linkend="components-upgrade-controller-uc-vs-suc"/>.
zh_cn: <xref linkend="components-upgrade-controller"/>中也会使用 <literal>SUC</literal>。要了解 SUC 与升级控制器之间的主要区别，请参见<xref linkend="components-upgrade-controller-uc-vs-suc"/>。

source: Installing the System Upgrade Controller
es: Instalación de System Upgrade Controller
ja: System Upgrade Controllerのインストール
pt_br: Instalando o System Upgrade Controller
zh_cn: 安装系统升级控制器

source: Starting with Rancher <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.10.0">v2.10.0</link>, the <literal>System Upgrade Controller</literal> is installed automatically.
es: A partir de la versión <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.10.0">2.10.0</link> de Rancher, <literal>System Upgrade Controller</literal> se instala automáticamente.
ja: Rancher <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.10.0">v2.10.0</link>以降、<literal>System Upgrade Controller</literal>は自動的にインストールされます。
pt_br: A partir do Rancher <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.10.0">v2.10.0</link>, o <literal>System Upgrade Controller</literal> é instalado automaticamente.
zh_cn: 从 Rancher <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.10.0">2.10.0</link> 版本开始，会自动安装<literal>系统升级控制器</literal>。

source: Follow the steps below <emphasis role="strong">only</emphasis> if your environment is <emphasis role="strong">not</emphasis> managed by Rancher, or if your Rancher version is lesser than <literal>v2.10.0</literal>.
es: Siga los pasos siguientes <emphasis role="strong">solo</emphasis> si su entorno <emphasis role="strong">no</emphasis> está gestionado por Rancher, o si su versión de Rancher es anterior a la <literal>2.10.0</literal>.
ja: ご使用の環境がRancherによって管理<emphasis role="strong">されていない</emphasis>場合、またはRancherのバージョンが<literal>v2.10.0</literal>より前の場合に<emphasis role="strong">のみ</emphasis>、以下の手順に従ってください。
pt_br: Siga as etapas abaixo <emphasis role="strong">apenas</emphasis> se o seu ambiente <emphasis role="strong">não</emphasis> é gerenciado pelo Rancher, ou se a versão do Rancher é inferior a <literal>v2.10.0</literal>.
zh_cn: <emphasis role="strong">仅当</emphasis>您的环境<emphasis role="strong">未</emphasis>由 Rancher 管理，或者您的 Rancher 版本低于 <literal>2.10.0</literal> 时，才需要执行以下步骤。

source: We recommend that you install SUC through Fleet (<xref linkend="components-fleet"/>) located in the <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> repository.
es: Se recomienda instalar SUC mediante Fleet (<xref linkend="components-fleet"/>), situado en el repositorio <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>.
ja: <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>リポジトリにあるFleet (<xref linkend="components-fleet"/>)からSUCをインストールすることをお勧めします。
pt_br: Recomendamos a instalação do SUC pelo Fleet (<xref linkend="components-fleet"/>), localizado no repositório <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>.
zh_cn: 建议您通过位于 <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> 储存库中的 Fleet（<xref linkend="components-fleet"/>）安装 SUC。

source: The resources offered by the <literal>suse-edge/fleet-examples</literal> repository <emphasis role="strong">must</emphasis> always be used from a valid <link xl:href="https://github.com/suse-edge/fleet-examples/releases">fleet-examples release</link>. To determine which release you need to use, refer to the Release Notes (<xref linkend="release-notes"/>).
es: Los recursos ofrecidos por el repositorio <literal>suse-edge/fleet-examples</literal> <emphasis role="strong">deben</emphasis> utilizarse siempre desde una versión válida de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">fleet-examples</link>. Para determinar qué versión debe utilizar, consulte las Notas de la versión (<xref linkend="release-notes"/>).
ja: <literal>suse-edge/fleet-examples</literal>リポジトリで提供されるリソースは常に有効な<link xl:href="https://github.com/suse-edge/fleet-examples/releases">fleet-examples release</link>から使用される<emphasis role="strong">必要があります</emphasis>。使用する必要のあるリリースを確認するには、リリースノート(<xref linkend="release-notes"/>)を参照してください。
pt_br: Os recursos disponíveis no repositório <literal>suse-edge/fleet-examples</literal> sempre <emphasis role="strong">devem</emphasis> ser usados de uma versão válida de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">fleet-examples</link>. Para determinar a versão que você precisa usar, consulte as Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: <literal>suse-edge/fleet-examples</literal> 储存库提供的资源<emphasis role="strong">必须</emphasis>始终在有效的 <link xl:href="https://github.com/suse-edge/fleet-examples/releases">fleet-examples 版本</link>中使用。要确定需使用哪个版本，请参见发行说明（<xref linkend="release-notes"/>）。

source: If you are unable to use Fleet for the installation of SUC, you can install it through Rancher’s Helm chart repository, or incorporate the Rancher’s Helm chart in your own third-party GitOps workflow.
es: Si no puede utilizar Fleet para la instalación de SUC, puede instalarlo mediante el repositorio de charts de Helm de Rancher o incorporar el chart de Helm de Rancher en su propio flujo de trabajo de GitOps de terceros.
ja: SUCのインストールにFleetを使用できない場合は、RancherのHelmチャートリポジトリからインストールするか、独自のサードパーティGitOpsワークフローにRancherのHelmチャートを組み込むことができます。
pt_br: Se não for possível usar o Fleet para instalação do SUC, instale-o por meio do repositório de gráficos Helm do Rancher ou incorpore o gráfico Helm do Rancher ao seu próprio fluxo de trabalho do GitOps de terceiros.
zh_cn: 如果无法使用 Fleet 安装 SUC，可以通过 Rancher 的 Helm chart 储存库进行安装，或者将 Rancher 的 Helm chart 整合到您自己的第三方 GitOps 工作流程中。

source: This section covers:
es: En esta sección se trata lo siguiente:
ja: このセクションでは以下の内容を取り上げます。
pt_br: Esta seção aborda o seguinte:
zh_cn: 本节介绍如下内容：

source: Fleet installation (<xref linkend="components-system-upgrade-controller-fleet"/>)
es: Instalación con Fleet (<xref linkend="components-system-upgrade-controller-fleet"/>)
ja: Fleetのインストール(<xref linkend="components-system-upgrade-controller-fleet"/>)
pt_br: Instalação do Fleet (<xref linkend="components-system-upgrade-controller-fleet"/>)
zh_cn: Fleet 安装（<xref linkend="components-system-upgrade-controller-fleet"/>）

source: Helm installation (<xref linkend="components-system-upgrade-controller-helm"/>)
es: Instalación con Helm (<xref linkend="components-system-upgrade-controller-helm"/>)
ja: Helmのインストール(<xref linkend="components-system-upgrade-controller-helm"/>)
pt_br: Instalação do Helm (<xref linkend="components-system-upgrade-controller-helm"/>)
zh_cn: Helm 安装（<xref linkend="components-system-upgrade-controller-helm"/>）

source: System Upgrade Controller Fleet installation
es: Instalación de System Upgrade Controller con Fleet
ja: System Upgrade Controller Fleetのインストール
pt_br: Instalação do System Upgrade Controller pelo Fleet
zh_cn: 系统升级控制器 Fleet 安装

source: Using Fleet, there are two possible resources that can be used to deploy SUC:
es: Hay dos posibles recursos que se pueden usar para desplegar SUC mediante Fleet:
ja: Fleetを使用して、SUCをデプロイするために使用できるリソースは2つあります。
pt_br: Com o Fleet, há dois recursos possíveis para serem usados na implantação do SUC:
zh_cn: 使用 Fleet 时，可以通过两种资源来部署 SUC：

source: <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link> resource - for use cases where an external/local Git server is available. For installation instructions, see System Upgrade Controller installation - GitRepo (<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>).
es: Recurso <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link>: para casos de uso en los que se dispone de un servidor Git externo/local. Para obtener instrucciones de instalación, consulte la sección Instalación de System Upgrade Controller - GitRepo (<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>).
ja: <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link>リソース - 外部/ローカルGitサーバが利用できるユースケース用。インストール手順については、「System Upgrade Controllerのインストール – GitRepo」(<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>)を参照してください。
pt_br: <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link>: para casos de uso em que um servidor Git externo/local está disponível. Para obter instruções de instalação, consulte Instalação do System Upgrade Controller – GitRepo (<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>).
zh_cn: <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link> 资源 - 适用于有外部/本地 Git 服务器可用的使用场景。有关安装说明，请参见<xref linkend="components-system-upgrade-controller-fleet-gitrepo"/>。

source: <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> resource - for air-gapped use cases that do not support a local Git server option. For installation instructions, see System Upgrade Controller installation - Bundle (<xref linkend="components-system-upgrade-controller-fleet-bundle"/>).
es: Recurso <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link>: para casos de uso en entornos aislados que no admiten la opción de servidor Git local. Para obtener instrucciones de instalación, consulte la sección Instalación de System Upgrade Controller - Bundle (<xref linkend="components-system-upgrade-controller-fleet-bundle"/>).
ja: <link xl:href="https://fleet.rancher.io/bundle-add">バンドル</link>リソース - ローカルGitサーバオプションをサポートしないエアギャップ環境のユースケース用。インストール手順については、「System Upgrade Controllerのインストール - バンドル」(<xref linkend="components-system-upgrade-controller-fleet-bundle"/>)を参照してください。
pt_br: <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link>: para casos de uso air-gapped que não oferecem suporte à opção de servidor Git local. Para obter instruções de instalação, consulte Instalação do System Upgrade Controller – Bundle (<xref linkend="components-system-upgrade-controller-fleet-bundle"/>).
zh_cn: <link xl:href="https://fleet.rancher.io/bundle-add">捆绑包</link>资源 - 适用于不支持本地 Git 服务器选项的隔离使用场景。有关安装说明，请参见<xref linkend="components-system-upgrade-controller-fleet-bundle"/>。

source: System Upgrade Controller installation - GitRepo
es: Instalación de System Upgrade Controller - GitRepo
ja: System Upgrade Controllerのインストール - GitRepo
pt_br: Instalação do System Upgrade Controller – GitRepo
zh_cn: 系统升级控制器安装 - GitRepo

source: This process can also be done through the Rancher UI, if such is available. For more information, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link>.
es: Este proceso también se puede realizar a través de la interfaz de usuario de Rancher, si está disponible. Para obtener más información, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link> (Acceso a Fleet en la interfaz de Rancher).
ja: このプロセスは、使用できる場合はRancher UIから実行することもできます。詳細については、「<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Rancher UIでのFleetへのアクセス</link>」を参照してください。
zh_cn: 如果有可用的 Rancher UI，也可通过该界面完成此过程。有关详细信息，请参见<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">在 Rancher UI 中访问 Fleet</link>。

source: In your <emphasis role="strong">management</emphasis> cluster:
es: En el clúster de <emphasis role="strong">gestión</emphasis>:
ja: <emphasis role="strong">管理</emphasis>クラスタで、次の操作を実行します。
pt_br: Em seu cluster de <emphasis role="strong">gerenciamento</emphasis>:
zh_cn: 在您的<emphasis role="strong">管理</emphasis>群集中：

source: Determine on which clusters you want to deploy SUC. This is done by deploying a SUC <literal>GitRepo</literal> resource in the correct Fleet workspace on your <emphasis role="strong">management</emphasis> cluster. By default, Fleet has two workspaces:
es: Determine en qué clústeres desea desplegar SUC. Para ello, despliegue un recurso <literal>GitRepo</literal> de SUC en el espacio de trabajo correcto de Fleet de su clúster de <emphasis role="strong">gestión</emphasis>. De forma predeterminada, Fleet tiene dos espacios de trabajo:
ja: SUCをデプロイするクラスタを決定します。これは、<emphasis role="strong">管理</emphasis>クラスタ内の適切なFleetワークスペースにSUC <literal>GitRepo</literal>リソースをデプロイすることで実行されます。デフォルトでは、Fleetには2つのワークスペースがあります。
pt_br: Determine os clusters em que deseja implantar o SUC. Para fazer isso, implante um recurso <literal>GitRepo</literal> do SUC no espaço de trabalho correto do Fleet em seu cluster de <emphasis role="strong">gerenciamento</emphasis>. Por padrão, o Fleet tem dois espaços de trabalho:
zh_cn: 确定要在哪些群集上部署 SUC，方法是在<emphasis role="strong">管理</emphasis>群集内的适当 Fleet 工作空间中部署 SUC <literal>GitRepo</literal>。默认情况下，Fleet 有两个工作空间：

source: <literal>fleet-local</literal> - for resources that need to be deployed on the <emphasis role="strong">management</emphasis> cluster.
es: <literal>fleet-local</literal>: para recursos que deben desplegarse en el clúster de <emphasis role="strong">gestión</emphasis>.
ja: <literal>fleet-local</literal> - <emphasis role="strong">管理</emphasis>クラスタにデプロイする必要があるリソース用。
pt_br: <literal>fleet-local</literal>: para recursos que precisam ser implantados no cluster de <emphasis role="strong">gerenciamento</emphasis>.
zh_cn: <literal>fleet-local</literal> - 用于需要部署在<emphasis role="strong">管理</emphasis>群集上的资源。

source: <literal>fleet-default</literal> - for resources that need to be deployed on <emphasis role="strong">downstream</emphasis> clusters.
es: <literal>fleet-default</literal>: para recursos que deben desplegarse en clústeres <emphasis role="strong">descendentes</emphasis>.
ja: <literal>fleet-default</literal> - <emphasis role="strong">ダウンストリーム</emphasis>クラスタにデプロイする必要があるリソース用。
pt_br: <literal>fleet-default</literal>: para recursos que precisam ser implantados em clusters <emphasis role="strong">downstream</emphasis>.
zh_cn: <literal>fleet-default</literal> - 用于需要部署在<emphasis role="strong">下游</emphasis>群集上的资源。

source: For more information on Fleet workspaces, see the <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">upstream</link> documentation.
es: Para obtener más información sobre los espacios de trabajo de Fleet, consulte la <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">documentación original</link>.
ja: Fleetワークスペースの詳細については、<link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">アップストリーム</link>ドキュメントを参照してください。
pt_br: Para obter mais informações sobre espaços de trabalho do Fleet, consulte a documentação <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">upstream</link>.
zh_cn: 有关 Fleet 工作空间的详细信息，请参见<link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">上游</link>文档。

source: Deploy the <literal>GitRepo</literal> resource:
es: Despliegue el recurso <literal>GitRepo</literal>:
ja: <literal>GitRepo</literal>リソースをデプロイします。
pt_br: Implante o recurso <literal>GitRepo</literal> :
zh_cn: 部署 <literal>GitRepo</literal> 资源：

source: To deploy SUC on your management cluster:
es: Para desplegar SUC en el clúster de gestión:
ja: 管理クラスタにSUCをデプロイするには:
pt_br: Para implantar o SUC no cluster de gerenciamento:
zh_cn: 要在管理群集上部署 SUC，请使用：

source: To deploy SUC on your downstream clusters:
es: Para desplegar SUC en los clústeres descendentes:
ja: ダウンストリームクラスタにSUCをデプロイするには:
pt_br: Para implantar o SUC em clusters downstream:
zh_cn: 要在下游群集上部署 SUC，请使用：

source: Before deploying the resource below, you <emphasis role="strong">must</emphasis> provide a valid <literal>targets</literal> configuration, so that Fleet knows on which downstream clusters to deploy your resource. For information on how to map to downstream clusters, see <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link>.
es: Antes de desplegar el recurso que se indica a continuación, <emphasis role="strong">debe</emphasis> proporcionar una configuración válida para <literal>targets</literal>, de modo que Fleet sepa en qué clústeres descendentes debe desplegar su recurso. Para obtener más información sobre cómo realizar la asignación a clústeres descendentes, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Asignación a clústeres descendentes).
ja: 以下のリソースをデプロイする前に、有効な<literal>ターゲット</literal>設定を提供する<emphasis role="strong">必要があります</emphasis>。Fleetがリソースをデプロイするダウンストリームクラスタを認識できるようにするためです。ダウンストリームクラスタへのマッピング方法については、「 <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters (ダウンストリームクラスタへのマッピング) </link>」を参照してください。
pt_br: Antes de implantar o recurso a seguir, você <emphasis role="strong">deve</emphasis> especificar uma configuração válida de <literal>targets</literal>, para que o Fleet saiba em quais clusters downstream implantar seu recurso. Para obter informações de como mapear para clusters downstream, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Mapeando para clusters downstream).
zh_cn: 在部署下方资源之前，您<emphasis role="strong">必须</emphasis>提供有效的<literal>目标</literal>配置，以便 Fleet 了解资源要部署至哪些下游群集。有关如何映射到下游群集的信息，请参见<link xl:href="https://fleet.rancher.io/gitrepo-targets">映射到下游群集</link>。

source: Validate that the <literal>GitRepo</literal> resource is deployed:
es: Compruebe que el recurso <literal>GitRepo</literal> se ha desplegado:
ja: <literal>GitRepo</literal>リソースがデプロイされていることを検証します。
pt_br: Valide que o recurso <literal>GitRepo</literal> foi implantado:
zh_cn: 验证 <literal>GitRepo</literal> 资源是否已部署：

source: Validate the System Upgrade Controller deployment:
es: Compruebe que System Upgrade Controller se ha desplegado:
ja: System Upgrade Controllerのデプロイメントを検証します。
pt_br: Valide a implantação do System Upgrade Controller:
zh_cn: 验证系统升级控制器部署：

source: System Upgrade Controller installation - Bundle
es: Instalación de System Upgrade Controller - Bundle
ja: System Upgrade Controllerのインストール - バンドル
pt_br: Instalação do System Upgrade Controller – Bundle
zh_cn: 系统升级控制器安装 - 捆绑包

source: This section illustrates how to build and deploy a <literal>Bundle</literal> resource from a standard Fleet configuration using the <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
es: Esta sección muestra cómo crear y desplegar un recurso <literal>Bundle</literal> a partir de una configuración estándar de Fleet utilizando <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
ja: このセクションでは、<link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>を使用して、標準のFleet設定から<literal>バンドル</literal>リソースをビルドしてデプロイする方法を説明します。
pt_br: Esta seção ilustra como criar e implantar um recurso <literal>Bundle</literal> de uma configuração padrão do Fleet usando <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
zh_cn: 本节说明如何使用 <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link> 在标准 Fleet 配置下构建并部署<literal>捆绑包</literal>资源。

source: On a machine with network access download the <literal>fleet-cli</literal>:
es: En un equipo con acceso de red, descargue <literal>fleet-cli</literal>:
ja: ネットワークにアクセスできるマシンで、<literal>fleet-cli</literal>をダウンロードします。
pt_br: Em uma máquina com acesso à rede, faça download de <literal>fleet-cli</literal>:
zh_cn: 在连接网络的计算机上下载 <literal>fleet-cli</literal>：
