Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Change the <emphasis role="strong">target</emphasis> clusters for the <literal>Bundle</literal>:
es: Cambie los clústeres de <emphasis role="strong">destino</emphasis> para el <literal>Bundle</literal>:
ja: <literal>バンドル</literal>の<emphasis role="strong">ターゲット</emphasis>クラスタを次のように変更します。
pt_br: Altere os clusters de <emphasis role="strong">destino</emphasis> para o <literal>Bundle</literal>:
zh_cn: 更改<literal>捆绑包</literal>的<emphasis role="strong">目标</emphasis>群集：

source: To match all downstream clusters change the default Bundle <literal>.spec.targets</literal> to:
es: Para que coincidan todos los clústeres descendentes, cambie el valor <literal>.spec.targets</literal> predeterminado del Bundle a:
ja: すべてのダウンストリームクラスタに一致させるには、デフォルトのバンドル<literal>.spec.targets</literal>を次のように変更します。
pt_br: Para corresponder todos os clusters downstream, altere o bundle padrão <literal>.spec.targets</literal> para:
zh_cn: 为了匹配所有下游群集，请将默认的捆绑包 <literal>.spec.targets</literal> 更改为：

source: For a more granular downstream cluster mappings, see <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link>.
es: Para obtener asignaciones de clústeres descendentes más detalladas, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Asignación a clústeres descendentes).
ja: より細かくダウンストリームクラスタにマッピングするには、「<link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters (ダウンストリームクラスタへのマッピング)</link>」を参照してください。
pt_br: Para mapeamentos mais granulares de clusters downstream, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Mapeando para clusters downstream).
zh_cn: 有关更精细的下游群集映射，请参见<link xl:href="https://fleet.rancher.io/gitrepo-targets">映射到下游群集</link>。

source: Edit the <literal>Bundle</literal> <emphasis role="strong">target</emphasis> configurations, under <literal>spec.targets</literal> provide your desired target list. By default the <literal>Bundle</literal> resources from the <literal>suse-edge/fleet-examples</literal> are <emphasis role="strong">NOT</emphasis> mapped to any downstream clusters.
es: Edite las configuraciones de <emphasis role="strong">destino</emphasis> del <literal>Bundle</literal>. En <literal>spec.targets</literal>, proporcione la lista de objetivos que desee. De forma predeterminada, los recursos <literal>Bundle</literal> de <literal>suse-edge/fleet-examples</literal> <emphasis role="strong">NO</emphasis> están asignados a ningún clúster descendente.
ja: <literal>バンドル</literal>の<emphasis role="strong">ターゲット</emphasis>設定を編集し、<literal>spec.targets</literal>に目的のターゲットリストを指定します。デフォルトでは、<literal>suse-edge/fleet-examples</literal>の<literal>バンドル</literal>リソースは、どのダウンストリームクラスタにもマップ<emphasis role="strong">されません</emphasis>。
pt_br: Edite as configurações de <emphasis role="strong">destino</emphasis> do <literal>Bundle</literal>. Em <literal>spec.targets</literal>, insira a lista de destinos desejada. Por padrão, os recursos <literal>Bundle</literal> de <literal>suse-edge/fleet-examples</literal> <emphasis role="strong">NÃO</emphasis> são mapeados para clusters downstream.
zh_cn: 编辑<literal>捆绑包</literal><emphasis role="strong">目标</emphasis>配置，在 <literal>spec.targets</literal> 下提供所需的目标列表。默认情况下，<literal>suse-edge/fleet-examples</literal> 中的<literal>捆绑包</literal>资源<emphasis role="strong">不会</emphasis>映射到任何下游群集。

source: To match all clusters change the default <literal>Bundle</literal> <emphasis role="strong">target</emphasis> to:
es: Para que coincidan con todos los clústeres descendentes, cambie el valor de <emphasis role="strong">destino</emphasis> predeterminado del <literal>Bundle</literal> a:
ja: すべてのクラスタに一致させるには、デフォルトの<literal>バンドル</literal>の<emphasis role="strong">ターゲット</emphasis>を次のように変更します。
pt_br: Para corresponder todos os clusters, altere o <emphasis role="strong">destino</emphasis> do <literal>Bundle</literal> padrão para:
zh_cn: 为了匹配所有群集，请将默认的<literal>捆绑包</literal><emphasis role="strong">目标</emphasis>更改为：

source: View the created <emphasis role="strong">Bundle</emphasis> resource under the <literal>fleet-default</literal> namespace:
es: Consulte el recurso <emphasis role="strong">Bundle</emphasis> creado en el espacio de nombres <literal>fleet-default</literal>:
ja: <literal>fleet-default</literal>ネームスペースで、作成した<emphasis role="strong">バンドル</emphasis>リソースを表示します。
pt_br: Visualize o recurso <emphasis role="strong">Bundle</emphasis> criado no namespace <literal>fleet-default</literal>:
zh_cn: 查看 <literal>fleet-default</literal> 名称空间下创建的<emphasis role="strong">捆绑包</emphasis>资源：

source: <literal>secret.yaml</literal> is a Secret that contains the <literal>upgrade.sh</literal> script, which is responsible for creating the systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>).
es: <literal>secret.yaml</literal> es un secreto que contiene el guion <literal>upgrade.sh</literal>, que se encarga de crear el servicio systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>).
ja: <literal>secret.yaml</literal>は、systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>)の作成を担当する、<literal>upgrade.sh</literal>スクリプトを含むSecretです。
pt_br: <literal>secret.yaml</literal> é um segredo que contém o script <literal>upgrade.sh</literal>, responsável por criar o systemd.service (<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>).
zh_cn: <literal>secret.yaml</literal> 是一个包含 <literal>upgrade.sh</literal> 脚本的机密，该脚本负责创建 systemd.service（<xref linkend="downstream-day2-fleet-os-upgrade-components-systemd-service"/>）。

source: To better understand how your GitOps workflow can be used to deploy the <emphasis role="strong">SUC Plans</emphasis> for OS upgrade, it can be beneficial to take a look at overview (<xref linkend="downstream-day2-fleet-os-upgrade-overview"/>).
es: Para comprender mejor cómo usar su flujo de trabajo de GitOps para desplegar los <emphasis role="strong">planes de SUC</emphasis> para actualizar el sistema operativo, puede resultar útil echar un vistazo a la descripción general (<xref linkend="downstream-day2-fleet-os-upgrade-overview"/>).
ja: GitOpsワークフローをOSアップグレードの<emphasis role="strong">SUC Plan</emphasis>をデプロイするために使用する方法をよりよく理解するために、概要(<xref linkend="downstream-day2-fleet-os-upgrade-overview"/>)を確認すると役立つ場合があります。
pt_br: Para entender melhor como usar o fluxo de trabalho do GitOps para implantar os <emphasis role="strong">planos do SUC</emphasis> para upgrade de sistema operacional, consulte a visão geral (<xref linkend="downstream-day2-fleet-os-upgrade-overview"/>).
zh_cn: 为了更好地了解如何使用 GitOps 工作流程来部署操作系统升级的 <emphasis role="strong">SUC 计划</emphasis>，建议查看<xref linkend="downstream-day2-fleet-os-upgrade-overview"/>。

source: This section covers Kubernetes upgrades for downstream clusters that have <emphasis role="strong">NOT</emphasis> been created through a Rancher (<xref linkend="components-rancher"/>) instance. For information on how to upgrade the Kubernetes version of <literal>Rancher</literal> created clusters, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/upgrade-and-roll-back-kubernetes#upgrading-the-kubernetes-version">Upgrading and Rolling Back Kubernetes</link>.
es: Esta sección trata sobre las actualizaciones de Kubernetes para clústeres descendentes que <emphasis role="strong">NO</emphasis> se hayan creado mediante una instancia de Rancher (<xref linkend="components-rancher"/>). Para obtener información sobre cómo actualizar la versión de Kubernetes de los clústeres creados con <literal>Rancher</literal>, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/upgrade-and-roll-back-kubernetes#upgrading-the-kubernetes-version">Upgrading and Rolling Back Kubernetes</link> (Actualización y reversión de Kubernetes).
ja: このセクションでは、Rancher (<xref linkend="components-rancher"/>)インスタンスを使用して作成されて<emphasis role="strong">いない</emphasis>ダウンストリームクラスタのKubernetesアップグレードについて説明します。<literal>Rancher</literal>で作成したクラスタのKubernetesバージョンをアップグレードする方法については、「<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/upgrade-and-roll-back-kubernetes#upgrading-the-kubernetes-version">Upgrading and Rolling Back Kubernetes (Kubernetesのアップグレードとロールバック)</link>」を参照してください。
zh_cn: 本节介绍<emphasis role="strong">并非</emphasis>通过 Rancher（<xref linkend="components-rancher"/>）实例创建的下游群集的 Kubernetes 升级过程。有关如何对通过 <literal>Rancher</literal> 创建的群集进行 Kubernetes 版本升级的信息，请参见 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/upgrade-and-roll-back-kubernetes#upgrading-the-kubernetes-version">Upgrading and Rolling Back Kubernetes</link>。

source: <xref linkend="downstream-day2-fleet-k8s-upgrade-components"/> - additional components used by the upgrade process.
es: <xref linkend="downstream-day2-fleet-k8s-upgrade-components"/>: componentes adicionales usados por el proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-k8s-upgrade-components"/> - アップグレードプロセスで使用される追加のコンポーネント。
pt_br: <xref linkend="downstream-day2-fleet-k8s-upgrade-components"/>: componentes adicionais usados pelo processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-k8s-upgrade-components"/> - 升级过程使用的其他组件。

source: <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/> - overview of the upgrade process.
es: <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>: descripción general del proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/> - アップグレードプロセスの概要。
pt_br: <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>: visão geral do processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/> - 升级过程概述。

source: <xref linkend="downstream-day2-fleet-k8s-upgrade-requirements"/> - requirements of the upgrade process.
es: <xref linkend="downstream-day2-fleet-k8s-upgrade-requirements"/>: requisitos del proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-k8s-upgrade-requirements"/> - アップグレードプロセスの要件。
pt_br: <xref linkend="downstream-day2-fleet-k8s-upgrade-requirements"/>: requisitos do processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-k8s-upgrade-requirements"/> - 升级过程的要求。

source: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment"/> - information on how to deploy <literal>SUC plans</literal>, responsible for triggering the upgrade process.
es: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment"/>: información sobre cómo desplegar <literal>planes de SUC</literal>, responsables de iniciar el proceso de actualización.
ja: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment"/> - アップグレードプロセスのトリガを担当する、 <literal>SUC Plan</literal>をデプロイする方法に関する情報。
pt_br: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment"/>: informações de como implantar os <literal>planos do SUC</literal>, responsáveis por acionar o processo de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment"/> - 关于如何部署负责触发升级过程的 <literal>SUC 计划</literal>的信息。

source: This section covers the custom components that the <literal>K8s upgrade</literal> process uses over the default "Day 2" components (<xref linkend="downstream-day2-fleet-components"/>).
es: Esta sección trata sobre los componentes personalizados que el proceso de <literal>actualización de K8s</literal> usa en lugar de los componentes predeterminados de "día 2" (<xref linkend="downstream-day2-fleet-components"/>).
ja: このセクションでは、 <literal>K8sアップグレード</literal>プロセスがデフォルトの「Day 2」コンポーネント(<xref linkend="downstream-day2-fleet-components"/>)よりも使用するカスタムコンポーネントについて説明します。
pt_br: Esta seção aborda os componentes personalizados que o processo de <literal>upgrade do K8s</literal> usa com os componentes de "dia 2" padrão (<xref linkend="downstream-day2-fleet-components"/>).
zh_cn: 本节介绍 <literal>K8s 升级</literal>过程中使用的自定义组件，这些组件与默认“Day 2”组件（<xref linkend="downstream-day2-fleet-components"/>）不同。

source: The Kubernetes distribution upgrade for downstream cluster nodes is done by utilizing <literal>Fleet</literal> and the <literal>System Upgrade Controller (SUC)</literal>.
es: La actualización de la distribución de Kubernetes para los nodos del clúster descendentes se realiza con <literal>Fleet</literal> y <literal>System Upgrade Controller (SUC)</literal>.
ja: ダウンストリームクラスタのKubernetesディストリビューションアップグレードは、<literal>Fleet</literal>と<literal>System Upgrade Controller (SUC)</literal>を利用して実行されます。
pt_br: O upgrade de distribuições Kubernetes para nós de cluster downstream é feito pelo <literal>Fleet</literal> e pelo <literal>System Upgrade Controller (SUC)</literal>.
zh_cn: 通过 <literal>Fleet</literal> 和<literal>系统升级控制器 (SUC)</literal> 来为下游群集节点升级 Kubernetes 发行版。

source: Depending on the Kubernetes distribution, the Job will create a Pod that runs either the rke2-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>) or the k3s-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>) container image.
es: Dependiendo de la distribución de Kubernetes, el trabajo creará un pod que ejecutará la imagen de contenedor rke2-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>) o k3s-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>).
ja: Kubernetesディストリビューションによって、Jobはrke2-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>)またはk3s-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>)のコンテナイメージを実行するPodを作成します。
pt_br: Dependendo da distribuição Kubernetes, o job cria um pod que executa a imagem de contêiner do rke2-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>) ou do k3s-upgrade (<xref linkend="downstream-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>).
zh_cn: 根据 Kubernetes 发行版的不同，该作业将创建一个运行 rke2-upgrade（<xref linkend="downstream-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>）或 k3s-upgrade（<xref linkend="downstream-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>）容器映像的 Pod。

source: fleet day2 downstream k8s upgrade
es: actualización k8s descendente de día 2 con fleet
ja: fleet day2ダウンストリームk8sアップグレード
pt_br: upgrade k8s downstream dia2 fleet
zh_cn: Fleet Day2 下游 k8s 升级

source: As mentioned in <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>, Kubernetes upgrades are done by shipping <literal>SUC plans</literal> to the desired cluster through one of the following ways:
es: Como se menciona en la <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>, las actualizaciones de Kubernetes se realizan incluyendo <literal>planes de SUC</literal> en el clúster deseado de las siguientes formas:
ja: <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>で説明したように、Kubernetesアップグレードは、次のいずれかの方法を使用して<literal>SUC Plan</literal>を目的のクラスタに配布することで実行されます。
pt_br: Conforme mencionado na <xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>, os upgrades do Kubernetes são feitos enviando os <literal>planos do SUC</literal> ao cluster desejado de uma destas maneiras:
zh_cn: 如<xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>中所述，可以通过以下任意一种方式将 <literal>SUC 计划</literal>分发到目标群集来完成 Kubernetes 升级：

source: Fleet GitRepo resource (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
es: Recurso GitRepo de Fleet (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
ja: Fleet GitRepoリソース(<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
pt_br: Recurso GitRepo do Fleet (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
zh_cn: Fleet GitRepo 资源（<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>）

source: Fleet Bundle resource (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
es: Recurso Bundle de Fleet (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
ja: Fleetバンドルリソース(<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
pt_br: Recurso Bundle do Fleet (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
zh_cn: Fleet 捆绑包资源（<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>）

source: For use-cases where you wish to deploy the <literal>K8s SUC plans</literal> from a third-party GitOps tool, refer to <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>
es: Si desea desplegar los <literal>planes de SUC de K8s</literal> desde una herramienta GitOps de terceros, consulte la <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>.
ja: <literal>K8s SUC Plan</literal>をサードパーティのGitOpsツールからデプロイするユースケースの場合は、<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>を参照してください。
pt_br: Para casos de uso de implantação dos <literal>planos do SUC do K8s</literal> de uma ferramenta GitOps de terceiros, consulte a <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>.
zh_cn: 对于希望通过第三方 GitOps 工具部署 <literal>K8s SUC 计划</literal>的使用场景，请参见<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>。

source: Through the <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/>を通じて(<literal>Rancher</literal>が利用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>）到<literal>管理群集</literal>。

source: Through the <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/>を通じて(<literal>Rancher</literal>が利用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="downstream-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>）到<literal>管理群集</literal>。

source: To better understand how your GitOps workflow can be used to deploy the <emphasis role="strong">SUC Plans</emphasis> for Kubernetes version upgrade, it can be beneficial to take a look at the overview (<xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>) of the update procedure using <literal>Fleet</literal>.
es: Para comprender mejor cómo usar su flujo de trabajo de GitOps para desplegar los <emphasis role="strong">planes de SUC</emphasis> para actualizar la versión de Kubernetes, puede resultar útil echar un vistazo a la descripción general (<xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>) del procedimiento de actualización utilizando <literal>Fleet</literal>.
ja: GitOpsワークフローをKubernetesバージョンアップグレードの<emphasis role="strong">SUC Plan</emphasis>をデプロイするために使用する方法をよりよく理解するために、<literal>Fleet</literal>を使用する更新手順の概要(<xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>)を確認すると役立つ場合があります。
pt_br: Para entender melhor como usar o fluxo de trabalho do GitOps para implantar os <emphasis role="strong">planos do SUC</emphasis> para upgrade de versão do Kubernetes, consulte a visão geral (<xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>) do procedimento de atualização com o <literal>Fleet</literal>.
zh_cn: 为了更好地了解如何使用 GitOps 工作流程来部署 Kubernetes 版本升级的 <emphasis role="strong">SUC 计划</emphasis>，建议查看使用 <literal>Fleet</literal> 进行更新的过程概述（<xref linkend="downstream-day2-fleet-k8s-upgrade-overview"/>）。

source: <xref linkend="downstream-day2-fleet-helm-upgrade-air-gap"/> - holds information on how to ship Edge related OCI charts and images to your private registry.
es: <xref linkend="downstream-day2-fleet-helm-upgrade-air-gap"/>: contiene información sobre cómo incluir charts e imágenes OCI relacionados con Edge en su registro privado.
ja: <xref linkend="downstream-day2-fleet-helm-upgrade-air-gap"/> - Edgeに関連するOCIチャートとイメージをプライベートレジストリに配布する方法に関する情報を保持します。
pt_br: <xref linkend="downstream-day2-fleet-helm-upgrade-air-gap"/>: armazena informações sobre como enviar gráficos e imagens OCI relacionados ao Edge para seu registro particular.
zh_cn: <xref linkend="downstream-day2-fleet-helm-upgrade-air-gap"/> - 包含有关如何将与 Edge 相关的 OCI chart 和映像分发到您的专用仓库的信息。

source: <xref linkend="downstream-day2-fleet-helm-upgrade-procedure"/> - holds information on different Helm chart upgrade use-cases and their upgrade procedure.
es: <xref linkend="downstream-day2-fleet-helm-upgrade-procedure"/>: contiene información sobre diferentes casos de actualización de charts de Helm y su procedimiento de actualización.
ja: <xref linkend="downstream-day2-fleet-helm-upgrade-procedure"/> - 異なるHelmチャートアップグレードのユースケースとそのアップグレード手順に関する情報を保持します。
pt_br: <xref linkend="downstream-day2-fleet-helm-upgrade-procedure"/>: armazena informações sobre diversos casos de uso de upgrade de gráficos Helm e o respectivo procedimento de upgrade.
zh_cn: <xref linkend="downstream-day2-fleet-helm-upgrade-procedure"/> - 包含有关不同 Helm chart 升级情形及其升级过程的信息。
