Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: A container runtime such as <link xl:href="https://podman.io">Podman</link> or <link xl:href="https://rancherdesktop.io">Rancher Desktop</link> is required to run Edge Image Builder.
es: Se requiere un entorno de ejecución de contenedores como <link xl:href="https://podman.io">Podman</link> o <link xl:href="https://rancherdesktop.io">Rancher Desktop</link> para ejecutar Edge Image Builder.
ja: Edge Image Builderを実行するには、<link xl:href="https://podman.io">Podman</link>や<link xl:href="https://rancherdesktop.io">Rancher Desktop</link>などのコンテナランタイムが必要です。
pt_br: É necessário um tempo de execução do contêiner, como <link xl:href="https://podman.io">Podman</link> ou <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>, para executar o Edge Image Builder.
zh_cn: 需要安装 <link xl:href="https://podman.io">Podman</link> 或 <link xl:href="https://rancherdesktop.io">Rancher Desktop</link> 等容器运行时，以便能够运行 Edge Image Builder。

source: The base image will be built using the following guide <xref linkend="guides-kiwi-builder-images"/> with the profile <literal>Base-SelfInstall</literal> (or <literal>Base-RT-SelfInstall</literal> for the Real-Time kernel). The process is the same for both architectures (x86-64 and aarch64).
es: La imagen base se creará con las instrucciones del <xref linkend="guides-kiwi-builder-images"/> y el perfil <literal>Base-SelfInstall</literal> (o <literal>Base-RT-SelfInstall</literal> para el kernel en tiempo real). El proceso es el mismo para ambas arquitecturas (x86-64 y aarch64).
ja: ゴールデンイメージは、プロファイル<literal>Base-SelfInstall</literal> (リアルタイムカーネルには<literal>Base-RT-SelfInstall</literal>)を使用し、次のガイド<xref linkend="guides-kiwi-builder-images"/>に従って構築されます。このプロセスは両方のアーキテクチャ(x86-64とaarch64)で同じです。
pt_br: A imagem base será criada conforme este guia <xref linkend="guides-kiwi-builder-images"/> com o perfil <literal>Base-SelfInstall</literal> (ou <literal>Base-RT-SelfInstall</literal> para o kernel Real-Time). O processo é o mesmo para as duas arquiteturas (x86-64 e aarch64).
zh_cn: 基础映像将按照<xref linkend="guides-kiwi-builder-images"/>所述通过 <literal>Base-SelfInstall</literal> 配置文件（对于实时内核，会使用 <literal>Base-RT-SelfInstall</literal> 配置文件）构建。为 x86-64 和 aarch64 这两种体系结构构建基础映像的过程是相同的。

source: It is required to use a build host with the same architecture of the images being built. In other words, to build an <literal>aarch64</literal> image, it is required to use an <literal>aarch64</literal> build host, and vice-versa for <literal>x86-64</literal> (cross-builds are not supported at this time).
es: Es necesario utilizar un host de creación con la misma arquitectura que las imágenes que se están creando. En otras palabras, para crear una imagen <literal>aarch64</literal>, es necesario utilizar un host de creación <literal>aarch64</literal>, y lo mismo ocurre para <literal>x86-64</literal> (actualmente, no se admiten creaciones con arquitecturas cruzadas).
ja: 構築するイメージと同じアーキテクチャの構築ホストを使用する必要があります。つまり、<literal>aarch64</literal>のイメージを構築するには<literal>aarch64</literal>の構築ホストを使用する必要があり、<literal>x86-64</literal>の場合も同様です(クロス構築は現在のところサポートされていません)。
pt_br: É necessário usar um host de build com a mesma arquitetura das imagens que estão sendo criadas. Em outras palavras, para criar uma imagem <literal>aarch64</literal>, é necessário usar um host de build <literal>aarch64</literal>, e vice-versa para <literal>x86-64</literal> (não há suporte para builds cruzados no momento).
zh_cn: 构建主机的体系结构必须与待构建映像的体系结构一致。也就是说，要构建 <literal>aarch64</literal> 体系结构的映像，必须使用 <literal>aarch64</literal> 体系结构的构建主机；<literal>x86-64</literal> 体系结构同样如此 - 目前不支持跨体系结构构建。

source: Image configuration for connected scenarios
es: Configuración de la imagen para entornos conectados
ja: 接続シナリオのイメージの設定
pt_br: Configuração da imagem para cenários conectados
zh_cn: 联网场景的映像配置

source: The base image folder will contain the output raw image generated following the guide <xref linkend="guides-kiwi-builder-images"/> with the profile <literal>Base-SelfInstall</literal> (or <literal>Base-RT-SelfInstall</literal> for the Real-Time kernel) must be copied/moved under the <literal>base-images</literal> folder.
es: La carpeta de imágenes base contendrá la imagen raw generada al seguir las instrucciones del <xref linkend="guides-kiwi-builder-images"/> con el perfil <literal>Base-SelfInstall</literal> (o <literal>Base-RT-SelfInstall</literal> para el kernel en tiempo real) y deberá copiarse/moverse a la carpeta <literal>base-images</literal>.
ja: ゴールデンイメージフォルダには、ガイド<xref linkend="guides-kiwi-builder-images"/>に従って生成された出力RAWイメージが含まれます。プロファイル<literal>Base-SelfInstall</literal> (または、リアルタイムカーネルの場合は<literal>Base-RT-SelfInstall</literal>)は、<literal>base-images</literal>フォルダにコピー/移動する必要があります。
pt_br: A pasta da imagem base inclui a imagem bruta de saída gerada conforme o guia <xref linkend="guides-kiwi-builder-images"/> com o perfil <literal>Base-SelfInstall</literal> (ou <literal>Base-RT-SelfInstall</literal> para o kernel Real-Time) e deve ser copiada/movida para a pasta <literal>base-images</literal>.
zh_cn: 基础映像文件夹将包含按照<xref linkend="guides-kiwi-builder-images"/>所述使用 <literal>Base-SelfInstall</literal> 配置文件（对于实时内核，会使用 <literal>Base-RT-SelfInstall</literal> 配置文件）生成的输出原始映像。必须将该映像复制/移动到 <literal>base-images</literal> 文件夹下。

source: The <literal>network</literal> folder is optional, see <xref linkend="add-network-eib"/> for more details.
es: La carpeta <literal>network</literal> es opcional. Para obtener más información, consulte la <xref linkend="add-network-eib"/>.
ja: <literal>network</literal>フォルダはオプションです。詳細については、<xref linkend="add-network-eib"/>を参照してください。
pt_br: A pasta <literal>network</literal> é opcional. Consulte a <xref linkend="add-network-eib"/> para obter mais detalhes.
zh_cn: <literal>network</literal> 文件夹是可选的，有关详细信息，请参见<xref linkend="add-network-eib"/>。

source: The <literal>custom/scripts</literal> directory contains scripts to be run on first-boot:
es: El directorio <literal>custom/scripts</literal> contiene guiones que se deben ejecutar en el primer arranque:
ja: <literal>custom/scripts</literal>ディレクトリには初回ブート時に実行するスクリプトが含まれます。
pt_br: O diretório <literal>custom/scripts</literal> contém scripts para execução na primeira inicialização:
zh_cn: <literal>custom/scripts</literal> 目录包含要在首次引导时运行的脚本：

source: <literal>01-fix-growfs.sh</literal> script is required to resize the OS root partition on deployment
es: El guion <literal>01-fix-growfs.sh</literal> es necesario para cambiar el tamaño de la partición raíz del sistema operativo durante el despliegue.
ja: <literal>01-fix-growfs.sh</literal>スクリプトは、デプロイメント時にOSルートパーティションをサイズ変更するために必要です。
pt_br: O script <literal>01-fix-growfs.sh</literal> é necessário para redimensionar a partição raiz do sistema operacional na implantação.
zh_cn: <literal>01-fix-growfs.sh</literal> 脚本，用于在部署时调整操作系统根分区的大小

source: <literal>02-performance.sh</literal> script is optional and can be used to configure the system for performance tuning.
es: El guion <literal>02-performance.sh</literal> es opcional y se puede usar para configurar el sistema con el fin de optimizar su rendimiento.
ja: <literal>02-performance.sh</literal>スクリプトはオプションであり、パフォーマンス調整用にシステムを設定するために使用できます。
pt_br: O script <literal>02-performance.sh</literal> é opcional e pode ser usado para configurar o sistema para ajuste de desempenho.
zh_cn: <literal>02-performance.sh</literal> 脚本（可选），用于配置系统以调优性能。

source: <literal>03-sriov.sh</literal> script is optional and can be used to configure the system for SR-IOV.
es: El guion <literal>03-sriov.sh</literal> es opcional y se puede usar para configurar el sistema para SR-IOV.
ja: <literal>03-sriov.sh</literal>スクリプトはオプションであり、SR-IOV用にシステムを設定するために使用できます。
pt_br: O script <literal>03-sriov.sh</literal> é opcional e pode ser usado para configurar o sistema para SR-IOV.
zh_cn: <literal>03-sriov.sh</literal> 脚本（可选），用于为 SR-IOV 配置系统。

source: The <literal>custom/files</literal> directory contains the <literal>performance-settings.sh</literal> and <literal>sriov-auto-filler.sh</literal> files to be copied to the image during the image creation process.
es: El directorio <literal>custom/files</literal> contiene los archivos <literal>performance-settings.sh</literal> y <literal>sriov-auto-filler.sh</literal> que se copiarán en la imagen durante el proceso de creación de la imagen.
ja: <literal>custom/files</literal>ディレクトリには、イメージ作成プロセス中にイメージにコピーされる<literal>performance-settings.sh</literal>および<literal>sriov-auto-filler.sh</literal>ファイルが含まれます。
pt_br: O diretório <literal>custom/files</literal> contém os arquivos <literal>performance-settings.sh</literal> e <literal>sriov-auto-filler.sh</literal> para copiar na imagem durante o processo de criação da imagem.
zh_cn: <literal>custom/files</literal> 目录包含映像创建过程中要复制到该映像的 <literal>performance-settings.sh</literal> 和 <literal>sriov-auto-filler.sh</literal> 文件。

source: Where <literal>$SCC_REGISTRATION_CODE</literal> is the registration code copied from <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, and the package list contains <literal>jq</literal> which is required.
es: Donde <literal>$SCC_REGISTRATION_CODE</literal> es el código de registro copiado del <link xl:href="https://scc.suse.com/">Centro de servicios al cliente de SUSE</link>, y la lista de paquetes contiene <literal>jq</literal>, que es necesario.
ja: ここで、<literal>$SCC_REGISTRATION_CODE</literal>は <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>からコピーした登録コードで、パッケージリストには必要な<literal>jq</literal>が含まれています。
pt_br: Em que <literal>$SCC_REGISTRATION_CODE</literal> é o código de registro copiado do <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, e a lista de pacotes inclui o <literal>jq</literal>, que é obrigatório.
zh_cn: 其中，<literal>$SCC_REGISTRATION_CODE</literal> 是从 <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> 中复制的注册代码，并且软件包列表包含必需的 <literal>jq</literal>。

source: <literal>arch: x86_64</literal> is the architecture of the image. For arm64 architecture, use <literal>arch: aarch64</literal>.
es: <literal>arch: x86_64</literal> es la arquitectura de la imagen. Para la arquitectura arm64, utilice <literal>arch: aarch64</literal>.
ja: <literal>arch: x86_64</literal>は、イメージのアーキテクチャです。arm64アーキテクチャの場合は、<literal>arch: aarch64</literal>を使用します。
pt_br: <literal>arch: x86_64</literal> é a arquitetura da imagem. Para arm64, use <literal>arch: aarch64</literal>.
zh_cn: <literal>arch: x86_64</literal> 为映像的体系结构。对于 arm64 体系结构，请使用 <literal>arch: aarch64</literal>。

source: This matches the default configuration for the metal3 chart, but the setting must match the configured chart <literal>predictableNicNames</literal> value.
es: Esto coincide con la configuración predeterminada para el chart de metal3, pero el ajuste debe coincidir con el valor de <literal>predictableNicNames</literal> configurado en el chart.
ja: これはmetal3チャートのデフォルト設定と一致しますが、この設定は、設定されたチャートの<literal>predictableNicNames</literal>の値と一致する必要があります。
pt_br: Isso corresponde à configuração padrão para o gráfico metal3, mas a configuração deve corresponder ao valor <literal>predictableNicNames</literal> do gráfico configurado.
zh_cn: 这与 metal3 chart 的默认配置相匹配，但设置必须与配置的 chart <literal>predictableNicNames</literal> 值相匹配。

source: Also note <literal>ignition.platform.id=openstack</literal> is mandatory, without this argument SLEMicro configuration via ignition will fail in the Metal<superscript>3</superscript> automated flow.
es: Tenga en cuenta también que <literal>ignition.platform.id=openstack</literal> es obligatorio. Sin este argumento, la configuración de SLEMicro mediante Ignition fallará en el flujo automatizado de Metal<superscript>3</superscript>.
ja: また、<literal>ignition.platform.id=openstack</literal>は必須であり、この引数がないと、Metal<superscript>3</superscript>の自動化フローでIgnitionによるSLEMicroの設定が失敗することにも注意してください。
pt_br: Veja também que o <literal>ignition.platform.id=openstack</literal> é obrigatório. Sem esse argumento, a configuração do SLEMicro pelo ignition vai falhar no fluxo automatizado do Metal<superscript>3</superscript>.
zh_cn: 另请注意，<literal>ignition.platform.id=openstack</literal> 是必需的，如果不指定此参数，在 Metal<superscript>3</superscript> 自动化流程中通过 ignition 配置 SLEMicro 时将会失败。

source: Performance script
es: Guion performance
ja: パフォーマンススクリプト
pt_br: Script de desempenho
zh_cn: 性能脚本

source: The following optional script (<literal>custom/scripts/02-performance.sh</literal>) can be used to configure the system for performance tuning:
es: El siguiente guion opcional (<literal>custom/scripts/02-performance.sh</literal>) se puede usar para configurar el sistema a fin de optimizar su rendimiento:
ja: 次のオプションのスクリプト(<literal>custom/scripts/02-performance.sh</literal>)は、パフォーマンス調整用にシステムを設定するために使用できます。
pt_br: O seguinte script opcional (<literal>custom/scripts/02-performance.sh</literal>) pode ser usado para configurar o sistema para ajuste de desempenho:
zh_cn: 以下可选脚本（<literal>custom/scripts/02-performance.sh</literal>）可用于配置系统以调优性能：

source: The content of <literal>custom/files/performance-settings.sh</literal> is a script that can be used to configure the system for performance tuning and can be downloaded from the following <link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/performance-settings.sh">link</link>.
es: El contenido de <literal>custom/files/performance-settings. sh</literal> es un guion que se puede usar para configurar el sistema con el fin de optimizar su rendimiento, y se puede descargar desde el siguiente <link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/performance-settings.sh">enlace</link>.
ja: <literal>custom/files/performance-settings.sh</literal>のコンテンツは、パフォーマンス調整用にシステムを設定するために使用可能なスクリプトであり、次の<link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/performance-settings.sh">リンク</link>からダウンロードできます。
zh_cn: <literal>custom/files/performance-settings.sh</literal> 是可用于配置系统以调优性能的脚本，可从以下<link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/performance-settings.sh">链接</link>下载。

source: SR-IOV script
es: Guion SR-IOV
ja: SR-IOVスクリプト
pt_br: Script SR-IOV
zh_cn: SR-IOV 脚本

source: The following optional script (<literal>custom/scripts/03-sriov.sh</literal>) can be used to configure the system for SR-IOV:
es: El siguiente guion opcional (<literal>custom/scripts/03-sriov.sh</literal>) se puede usar para configurar el sistema para SR-IOV:
ja: 次のオプションスクリプト(<literal>custom/scripts/03-sriov.sh</literal>)はSR-IOV用にシステムを設定するために使用できます。
pt_br: O seguinte script opcional (<literal>custom/scripts/03-sriov.sh</literal>) pode ser usado para configurar o sistema para SR-IOV:
zh_cn: 以下可选脚本 (<literal>custom/scripts/03-sriov.sh</literal>) 可用于为 SR-IOV 配置系统：

source: The content of <literal>custom/files/sriov-auto-filler.sh</literal> is a script that can be used to configure the system for SR-IOV and can be downloaded from the following <link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/sriov-auto-filler.sh">link</link>.
es: El contenido de <literal>custom/files/ sriov-auto-filler.sh</literal> es un guion que se puede usar para configurar el sistema para SR-IOV, y se puede descargar desde el siguiente <link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/sriov-auto-filler.sh">enlace</link>.
ja: <literal>custom/files/sriov-auto-filler.sh</literal>のコンテンツは、SR-IOV用にシステムを設定するために使用可能なスクリプトであり、次の<link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/sriov-auto-filler.sh">リンク</link>からダウンロードできます。
zh_cn: <literal>custom/files/sriov-auto-filler.sh</literal> 是可用于为 SR-IOV 配置系统的脚本，可从以下<link xl:href="https://github.com/suse-edge/atip/blob/release-3.4/telco-examples/edge-clusters/dhcp/eib/custom/files/sriov-auto-filler.sh">链接</link>下载。

source: Additional configuration for Telco workloads
es: Configuración adicional para cargas de trabajo de telecomunicaciones
ja: 通信ワークロードの追加設定
pt_br: Configuração adicional para cargas de trabalho de telecomunicações
zh_cn: 电信工作负载的附加配置

source: To enable Telco features like <literal>dpdk</literal>, <literal>sr-iov</literal> or <literal>FEC</literal>, additional packages may be required as shown in the following example.
es: Para habilitar funciones de telecomunicaciones como <literal>dpdk</literal>, <literal>sr-iov</literal> o <literal>FEC</literal>, es posible que se requieran paquetes adicionales, como se muestra en el siguiente ejemplo.
ja: <literal>dpdk</literal>、<literal>sr-iov</literal>、<literal>FEC</literal>などの通信機能を有効にするには、次の例に示すように追加のパッケージが必要な場合があります。
pt_br: Para habilitar recursos de telecomunicações, como <literal>dpdk</literal>, <literal>sr-iov</literal> ou <literal>FEC</literal>, podem ser necessários pacotes adicionais, conforme mostrado no exemplo a seguir.
zh_cn: 要启用 <literal>dpdk</literal>、<literal>sr-iov</literal> 或 <literal>FEC</literal> 等电信功能，可能需要提供附加软件包，如以下示例中所示。

source: Where <literal>$SCC_REGISTRATION_CODE</literal> is the registration code copied from <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, and the package list contains the minimum packages to be used for the Telco profiles.
es: Donde <literal>$SCC_REGISTRATION_CODE</literal> es el código de registro copiado del <link xl:href="https://scc.suse.com/">Centro de servicios al cliente de SUSE</link>, y la lista de paquetes contiene los paquetes mínimos que se utilizarán para los perfiles de telecomunicaciones.
ja: ここで、<literal>$SCC_REGISTRATION_CODE</literal>は<link xl:href="https://scc.suse.com/">SUSE Customer Center</link>からコピーした登録コードです。また、パッケージリストには通信事業者プロファイル用の最小限のパッケージが含まれています。
pt_br: Em que <literal>$SCC_REGISTRATION_CODE</literal> é o código de registro copiado do <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, e a lista de pacotes inclui os pacotes mínimos usados nos perfis de telecomunicações.
zh_cn: 其中，<literal>$SCC_REGISTRATION_CODE</literal> 是从 <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> 中复制的注册代码，并且软件包列表包含要用于 Telco 配置文件的最低限度的软件包。

source: Additional script for Advanced Network Configuration
es: Guion adicional para la configuración avanzada de red
ja: 高度なネットワーク設定のための追加スクリプト
pt_br: Script adicional para configuração de rede avançada
zh_cn: 高级网络配置的附加脚本

source: If you need to configure static IPs or more advanced networking scenarios as described in <xref linkend="advanced-network-configuration"/>, the following additional configuration is required.
es: Si necesita configurar direcciones IP estáticas o escenarios de red más avanzados, como se describe en la <xref linkend="advanced-network-configuration"/>, se requiere la siguiente configuración adicional.
ja: <xref linkend="advanced-network-configuration"/>で説明されている静的IPや、より高度なネットワーキングシナリオを設定する必要がある場合、次の追加設定が必要です。
pt_br: Se você precisa configurar IPs estáticos ou cenários de rede mais avançados, conforme descrito na <xref linkend="advanced-network-configuration"/>, a configuração adicional abaixo é necessária.
zh_cn: 如果您需要配置静态 IP 或<xref linkend="advanced-network-configuration"/>中所述的更高级网络方案，则需要提供以下附加配置。

source: In the <literal>network</literal> folder, create the following <literal>configure-network.sh</literal> file - this consumes configuration drive data on first-boot, and configures the host networking using the <link xl:href="https://github.com/suse-edge/nm-configurator">NM Configurator tool</link>.
es: En la carpeta <literal>network</literal>, cree el siguiente archivo <literal>configure-network.sh</literal>. Este archivo consume los datos de la unidad de configuración durante el primer arranque y configura la red del host utilizando la <link xl:href="https://github.com/suse-edge/nm-configurator">herramienta NM Configurator</link>.
ja: <literal>network</literal>フォルダに、次の<literal>configure-network.sh</literal>ファイルを作成します。このファイルは、初回ブート時に設定ドライブデータを使用し、<link xl:href="https://github.com/suse-edge/nm-configurator">NM Configuratorツール</link>を使用してホストネットワーキングを設定します。
pt_br: Na pasta <literal>network</literal>, crie o seguinte arquivo <literal>configure-network.sh</literal>, que consome os dados da unidade de configuração na primeira inicialização e configura a rede do host usando a <link xl:href="https://github.com/suse-edge/nm-configurator">ferramenta NM Configurator</link>.
zh_cn: 在 <literal>network</literal> 文件夹中创建以下 <literal>configure-network.sh</literal> 文件 - 这会在首次引导时使用配置驱动器数据，并使用 <link xl:href="https://github.com/suse-edge/nm-configurator">NM Configurator 工具</link>来配置主机网络。

source: This creates the output ISO image file named <literal>eibimage-output-telco.raw</literal>, based on the definition described above.
es: Esto crea el archivo de imagen ISO de salida denominado <literal>eibimage-output-telco.raw</literal>, basado en la definición descrita anteriormente.
ja: これにより、上記の定義に基づいた、<literal>eibimage-output-telco.raw</literal>という名前の出力ISOイメージファイルが作成されます。
pt_br: Esse procedimento cria o arquivo da imagem ISO de saída chamado <literal>eibimage-output-telco.raw</literal>, com base na definição descrita acima.
zh_cn: 这会根据上述定义创建名为 <literal>eibimage-output-telco.raw</literal> 的输出 ISO 映像文件。

source: The output image must then be made available via a webserver, either the media-server container enabled via the Management Cluster Documentation (<xref linkend="metal3-media-server"/>) or some other locally accessible server. In the examples below, we refer to this server as <literal>imagecache.local:8080</literal>
es: La imagen resultante debe estar disponible a través de un servidor Web, ya sea el contenedor del servidor de medios habilitado en los pasos descritos en la sección sobre el clúster de gestión (<xref linkend="metal3-media-server"/>) o algún otro servidor al que se puede acceder localmente. En los ejemplos siguientes, nos referimos a este servidor como <literal>imagecache.local:8080</literal>.
ja: その後、この出力イメージをWebサーバ経由で利用できるようにする必要があります。その際、管理クラスタのドキュメントを使用して有効にしたメディアサーバコンテナ(<xref linkend="metal3-media-server"/>)か、ローカルにアクセス可能な他のサーバのいずれかを使用します。以下の例では、このサーバを<literal>imagecache.local:8080</literal>として参照します。
pt_br: Em seguida, disponibilize a imagem de saída por um servidor web, ou o contêiner de servidor de mídia habilitado de acordo com as instruções na documentação sobre o cluster de gerenciamento (<xref linkend="metal3-media-server"/>) ou algum outro servidor acessível localmente. Nos exemplos abaixo, esse servidor é mencionado como <literal>imagecache.local:8080</literal>.
zh_cn: 然后必须通过 Web 服务器提供输出映像，该服务器可以是根据管理群集文档（<xref linkend="metal3-media-server"/>）启用的媒体服务器容器，也可以是其他某个本地可访问的服务器。在下面的示例中，此服务器是 <literal>imagecache.local:8080</literal>

source: Prepare downstream cluster image for air-gap scenarios
es: Preparación de la imagen del clúster descendente para entornos aislados
ja: エアギャップシナリオ用のダウンストリームクラスタイメージの準備
pt_br: Preparar uma imagem de cluster downstream para cenários air-gapped
zh_cn: 为隔离场景准备下游群集映像

source: Much of the configuration is possible with Edge Image Builder, but in this guide, we cover the minimal configurations necessary to set up the downstream cluster for air-gap scenarios.
es: Gran parte de la configuración se puede realizar con Edge Image Builder, pero en esta guía tratamos las configuraciones mínimas necesarias para configurar el clúster descendente en entornos aislados.
ja: 設定の多くはEdge Image Builderを使用して行うことができますが、このガイドではエアギャップシナリオ用のダウンストリームクラスタの設定に必要な最小限の設定について説明します。
pt_br: Grande parte da configuração é possível com o Edge Image Builder, mas neste guia, abordamos as configurações mínimas necessárias para preparar o cluster downstream em cenários air-gapped.
zh_cn: 可以通过 Edge Image Builder 完成大部分配置，但本指南仅介绍为隔离场景设置下游群集所需的最低限度配置。
