Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Create the directory <literal>/opt/eib</literal> and a sub-directory <literal>base-images</literal>:
es: Cree el directorio <literal>/opt/eib</literal> y un subdirectorio <literal>base-images</literal>:
ja: ディレクトリ<literal>/opt/eib</literal>とサブディレクトリ<literal>base-images</literal>を作成します。
pt_br: Crie o diretório <literal>/opt/eib</literal> e o subdiretório <literal>base-images</literal>:
zh_cn: 创建目录 <literal>/opt/eib</literal> 及其子目录 <literal>base-images</literal>：

source: In this quickstart we’re using the "self-install" flavor of the SUSE Linux Micro image. That image can later be written to a physical USB thumb drive that you can use to install on physical servers. If your server has the option of remote attachment of installation ISOs via a BMC (Baseboard Management Controller), you can also use that approach. Finally that image can also be used with most virtualization tools.
es: En esta guía de inicio rápido se usa la versión "autoinstalable" de la imagen de SUSE Linux Micro. Esa imagen se puede grabar posteriormente en una unidad USB física y utilizarse para la instalación en servidores físicos. Si su servidor tiene la opción de conexión remota de imágenes ISO de instalación a través de un BMC (Baseboard Management Controller), también puede utilizar ese método. Por último, esa imagen también se puede utilizar con la mayoría de las herramientas de virtualización.
ja: このクイックスタートでは、SUSE Linux Microイメージの「セルフインストール」フレーバーを使用しています。このイメージは、後で物理USBメモリに書き込んで、物理サーバにインストールするために使用できます。ご使用のサーバにBMC (ベースボード管理コントローラ)経由でインストールISOをリモートアタッチするオプションがある場合は、その方法も使用できます。また、このイメージはほとんどの仮想化ツールでも使用できます。
pt_br: Neste início rápido, usamos a variante de "autoinstalação" da imagem do SUSE Linux Micro. Posteriormente, essa imagem poderá ser gravada em uma unidade removível USB física que você pode usar para instalação em servidores físicos. Se o servidor tem a opção de anexar remotamente as ISOs de instalação por um BMC (Baseboard Management Controller), você também pode adotar essa abordagem. Por fim, também é possível usar essa imagem com grande parte das ferramentas de virtualização.
zh_cn: 在本快速入门中，我们使用的是 SUSE Linux Micro 映像的“自安装”版本。该映像之后可写入物理 USB 闪存盘，用于在物理服务器上安装系统。如果服务器支持通过 BMC（基板管理控制器）远程挂接安装 ISO，也可采用这种方式。此外，该映像还可与大多数虚拟化工具结合使用。

source: If you either want to preload the image directly to a physical node or directly start it from a VM, you can also use the "raw" image flavor.
es: Si desea precargar la imagen directamente en un nodo físico o iniciarla directamente desde una máquina virtual, también puede utilizar el tipo de imagen "raw".
ja: イメージを物理ノードに直接プリロードする場合、またはVMから直接起動する場合は、「生」イメージフレーバーを使用することもできます。
pt_br: Para pré-carregar a imagem diretamente em um nó físico ou iniciá-la de uma VM, você também pode usar a variante de imagem "bruta".
zh_cn: 如果需要将映像直接预加载到物理节点，或直接从虚拟机 (VM) 启动，也可使用“原始”版本的映像。

source: You can find those images in the SUSE Customer Center or on <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro/</link>
es: Encontrará esas imágenes en el Centro de servicios al cliente de SUSE o en <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro/</link>.
ja: これらのイメージはSUSE Customer Centerまたは<link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro/</link>にあります。
pt_br: Você encontra essas imagens no SUSE Customer Center ou em <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro/</link>
zh_cn: 您可以在 SUSE Customer Center 或 <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro/</link> 上找到这些映像。

source: Download or copy the image <literal>SL-Micro.x86_64-6.1-Default-SelfInstall-GM.install.iso</literal> to the <literal>base-images</literal> directoy and name it "slemicro.iso".
es: Descargue o copie la imagen <literal>SL-Micro.x86_64-6.1-Default-SelfInstall-GM.install.iso</literal> en el directorio <literal>base-images</literal> y asígnele el nombre "slemicro.iso".
ja: イメージ <literal>SL-Micro.x86_64-6.1-Default-SelfInstall-GM.install.iso</literal>を<literal>base-images</literal>ディレクトリにダウンロードまたはコピーして、「slemicro.iso」という名前を付けます。
pt_br: Faça download ou copie a imagem <literal>SL-Micro.x86_64-6.1-Default-SelfInstall-GM.install.iso</literal> no diretório <literal>base-images</literal> e dê o nome "slemicro.iso" a ela.
zh_cn: 将映像 <literal>SL-Micro.x86_64-6.1-Default-SelfInstall-GM.install.iso</literal> 下载或复制到 <literal>base-images</literal> 目录，并将其命名为“slemicro.iso”。

source: Building AArch64 images on an Arm-based build host is a technology preview in SUSE Edge 3.4. It will most likely work, but isn’t supported yet. If you want to try it out, you need to be running Podman on a 64-bit Arm machine, and you need to replace "x86_64" in all the examples and code snippets with "aarch64".
es: La creación de imágenes AArch64 en un host de creación basado en ARM es una tecnología en fase preliminar en SUSE Edge 3.4. Es muy probable que funcione, pero aún no es compatible. Si desea probarlo, debe ejecutar Podman en un equipo ARM de 64 bits y sustituir "x86_64" por "aarch64" en todos los ejemplos y fragmentos de código.
ja: Armベースの構築ホスト上でのAArch64イメージの構築は、SUSE Edge 3.4の技術プレビュー対象です。おそらく動作しますが、まだサポートされていません。お試しいただく場合は、64ビットのArmマシンでPodmanを実行し、すべての例とコードスニペットの「x86_64」を「aarch64」に置き換える必要があります。
zh_cn: 在基于 Arm 的构建主机上构建 AArch64 映像属于 SUSE Edge 3.4 的技术预览功能。该功能很可能可以正常运行，但目前尚未提供支持。如果您想尝试该功能，则需要在 64 位 Arm 计算机上运行 Podman，并且需要将所有示例和代码段中的“x86_64”替换为“aarch64”。

source: In <literal>/opt/eib</literal>, create a file called <literal>iso-definition.yaml</literal>. This is your build definition for Edge Image Builder.
es: En <literal>/opt/eib</literal>, cree un archivo llamado <literal>iso-definition.yaml</literal>. Esta es tu definición de creación para Edge Image Builder.
ja: <literal>/opt/eib</literal>に、<literal>iso-definition.yaml</literal>というファイルを作成します。これはEdge Image Builderのビルド定義です。
pt_br: Em <literal>/opt/eib</literal>, crie um arquivo chamado <literal>iso-definition.yaml</literal>. Essa é a definição do seu build para o Edge Image Builder.
zh_cn: 在 <literal>/opt/eib</literal> 中，创建一个名为 <literal>iso-definition.yaml</literal> 的文件。这是用于 Edge Image Builder 的构建定义文件。

source: Here is a simple example that installs SL Micro 6.1, sets a root password and the keymap, starts the Cockpit graphical UI and registers your node to SUSE Multi-Linux Manager:
es: En este sencillo ejemplo se instala SL Micro 6.1, se establece una contraseña raíz y el mapa de teclas, se inicia la interfaz gráfica Cockpit y se registra el nodo en SUSE Multi-Linux Manager:
ja: ここでは、SL Micro 6.1をインストールし、ルートパスワードとキーマップを設定して、CockpitグラフィカルUIを起動し、ノードをSUSE Multi-Linux Managerに登録するシンプルな例を示します。
pt_br: Este é um exemplo simples para instalar o SL Micro 6.1, definir uma senha de root e o mapa do teclado, iniciar a IU gráfica do Cockpit e registrar o nó no SUSE Multi-Linux Manager:
zh_cn: 下面的简单示例将会安装 SL Micro 6.1、设置 root 口令和键盘映射、启动 Cockpit 图形界面，并将节点注册到 SUSE Multi-Linux Manager：

source: Edge Image Builder can also configure the network, automatically install Kubernetes on the node, and even deploy applications via Helm charts. See <xref linkend="quickstart-eib"/> for more comprehensive examples.
es: Edge Image Builder también puede configurar la red, instalar automáticamente Kubernetes en el nodo e, incluso, desplegar aplicaciones a través de charts de Helm. Consulte el <xref linkend="quickstart-eib"/> para obtener ejemplos más completos.
ja: Edge Image Builderは、ネットワークを設定し、ノードにKubernetesを自動的にインストールして、Helmチャート経由でアプリケーションをデプロイすることもできます。より包括的な例については、<xref linkend="quickstart-eib"/>を参照してください。
pt_br: O Edge Image Builder também configura a rede, instala automaticamente o Kubernetes no nó e até implanta aplicativos por gráficos Helm. Consulte o <xref linkend="quickstart-eib"/> para ver exemplos mais completos.
zh_cn: Edge Image Builder 还可以配置网络、在节点上自动安装 Kubernetes，甚至通过 Helm chart 部署应用程序。如需更详尽的示例，请参见<xref linkend="quickstart-eib"/>。

source: For <literal>baseImage</literal>, specify the actual name of the ISO in the <literal>base-images</literal> directory that you want to use.
es: Para <literal>baseImage</literal>, especifique el nombre real de la ISO en el directorio <literal>base-images</literal> que desea utilizar.
ja: <literal>baseImage</literal>には、使用する<literal>base-images</literal>ディレクトリ内のISOの実際の名前を指定します。
pt_br: Para <literal>baseImage</literal>, especifique o nome real da ISO no diretório <literal>base-images</literal> que deseja usar.
zh_cn: 对于 <literal>baseImage</literal>，请指定要使用的 <literal>base-images</literal> 目录中 ISO 的实际名称。

source: In this example, the root password would be "root". See <xref linkend="id-configuring-os-users"/> for creating password hashes for the secure password you want to use.
es: En este ejemplo, la contraseña raíz sería "root". Consulte la <xref linkend="id-configuring-os-users"/> para crear hashes para la contraseña segura que desea utilizar.
ja: この例では、ルートパスワードは「root」になります。使用する安全なパスワードのパスワードハッシュを作成する方法については、<xref linkend="id-configuring-os-users"/>を参照してください。
pt_br: Neste exemplo, a senha de root é "root". Consulte a <xref linkend="id-configuring-os-users"/> para criar um hash para a senha segura que deseja usar.
zh_cn: 在此示例中，root 口令为“root”。请参见<xref linkend="id-configuring-os-users"/>了解如何为要使用的安全口令创建口令哈希。

source: Set the keymap to the actual keyboard layout you want the system to have after installation.
es: Defina el mapa de teclas de la disposición de teclado actual que desee que tenga el sistema después de la instalación.
ja: キーマップを、インストール後にシステムが使用する実際のキーボードレイアウトに設定します。
pt_br: Defina o mapa do teclado com o layout desejado para o sistema após a instalação.
zh_cn: 将键盘映射设置为安装系统后所需的实际键盘布局。

source: We use the option <literal>noGPGCheck: true</literal> because we aren’t going to provide a GPG key to check RPM packages. A comprehensive guide with a more secure setup that we recommend for production use can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">upstream installing packages guide</link>.
es: Utilizamos la opción <literal>noGPGCheck: true</literal> porque no vamos a proporcionar una clave GPG para comprobar los paquetes RPM. En la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">guía original sobre instalación de paquetes</link> encontrará instrucciones completas para realizar una configuración más segura, que se recomienda en entornos de producción.
ja: SUSEではRPMパッケージのチェックにGPGキーを提供しないため、オプション<literal>noGPGCheck: true</literal>を使用しています。運用環境での使用に推奨するより安全なセットアップに関する包括的なガイドについては、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">アップストリームのパッケージインストールガイド</link>を参照してください。
zh_cn: 我们使用 <literal>noGPGCheck: true</literal> 选项，因为我们不打算提供用于检查 RPM 软件包的 GPG 密钥。请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/installing-packages.md">上游软件包安装指南</link>，获取我们建议用于生产环境的更安全设置的综合指南。

source: As mentioned several times, your SUSE Multi-Linux Manager host requires a fully qualified hostname that can be resolved in the network your edge nodes will boot into.
es: Como se ha mencionado en varias ocasiones, el host de SUSE Multi-Linux Manager requiere un nombre de host completo que pueda resolverse en la red en la que se iniciarán los nodos periféricos.
ja: 何度か言及したように、SUSE Multi-Linux Managerホストには、エッジノードがブートするネットワークで解決できる完全修飾ホスト名が必要です。
pt_br: Como já foi mencionado várias vezes, o host do SUSE Multi-Linux Manager exige um nome de host completo e qualificado que possa ser resolvido na rede em que os nós de borda serão inicializados.
zh_cn: 如前文所述， SUSE Multi-Linux Manager 主机需要一个完全限定的主机名，且在边缘节点引导至的网络中能够解析该主机名。

source: The value for <literal>activationKey</literal> needs to match the key you created in SUSE Multi-Linux Manager.
es: El valor de <literal>activationKey</literal> debe coincidir con la clave que ha creado en SUSE Multi-Linux Manager.
ja: <literal>activationKey</literal>の値は、SUSE Multi-Linux Managerで作成したキーと一致する必要があります。
pt_br: O valor de <literal>activationKey</literal> precisa corresponder à chave que você criou no SUSE Multi-Linux Manager.
zh_cn: <literal>activationKey</literal> 的值应与您在 SUSE Multi-Linux Manager 中创建的密钥一致。

source: To build an installation image that automatically registers your edge nodes to SUSE Multi-Linux Manager after installation, you also need to prepare two artifacts:
es: Para crear una imagen de instalación que registre automáticamente sus nodos periféricos en SUSE Multi-Linux Manager después de la instalación, también debe preparar dos artefactos:
ja: インストール後にエッジノードをSUSE Multi-Linux Managerに自動的に登録するインストールイメージを構築するには、次の2つのアーティファクトを準備する必要もあります。
pt_br: Para criar uma imagem de instalação que registre automaticamente os nós de borda no SUSE Multi-Linux Manager após a instalação, você também precisa preparar dois artefatos:
zh_cn: 要构建在安装后能自动将边缘节点注册到 SUSE Multi-Linux Manager 的安装映像，您还需要准备两个制品：

source: the Salt minion package that installs the management agent for SUSE Multi-Linux Manager
es: El paquete minion de Salt que instala el agente de gestión para SUSE Multi-Linux Manager
ja: SUSE Multi-Linux Managerの管理エージェントをインストールするSalt minionパッケージ
pt_br: pacote Salt minion para instalar o agente de gerenciamento para o SUSE Multi-Linux Manager
zh_cn: 用于安装 SUSE Multi-Linux Manager 管理代理的 Salt 受控端软件包

source: the CA certificate of your SUSE Multi-Linux Manager server
es: El certificado de CA de su instancia de SUSE Multi-Linux Manager Server
ja: SUSE Multi-Linux ManagerサーバのCA証明書
pt_br: certificado de CA do servidor SUSE Multi-Linux Manager
zh_cn: SUSE Multi-Linux Manager 服务器的 CA 证书

source: Download the venv-salt-minion package
es: Descarga del paquete venv-salt-minion
ja: venv-salt-minionパッケージのダウンロード
pt_br: Fazer download do pacote venv-salt-minion
zh_cn: 下载 venv-salt-minion 软件包

source: In <literal>/opt/eib</literal>, create a subdirectory <literal>rpms</literal>.
es: En <literal>/opt/eib</literal>, cree un subdirectorio <literal>rpms</literal>.
ja: <literal>/opt/eib</literal>に、サブディレクトリ<literal>rpms</literal>を作成します。
pt_br: Em <literal>/opt/eib</literal>, crie o subdiretório <literal>rpms</literal>.
zh_cn: 在 <literal>/opt/eib</literal> 中创建子目录 <literal>rpms</literal>。

source: Download the package <literal>venv-salt-minion</literal> from your SUSE Multi-Linux Manager server into that directory. You can either get it via the web UI by finding the package under <literal>Software &gt; Channel List</literal> and downloading it from the SUSE-Manager-Tools …​ channel or download it from the SUSE Multi-Linux Manager "bootstrap repo" with a tool like curl:
es: Descargue el paquete <literal>venv-salt-minion</literal> desde su instancia de SUSE Multi-Linux Manager Server en ese directorio. Puede obtenerlo a través de la interfaz de usuario web buscando el paquete en <literal>Software &gt; Channel List</literal> (Software > Lista de canales) y descargándolo desde el canal SUSE-Manager-Tools​, o bien descargarlo desde el repositorio de arranque de SUSE Multi-Linux Manager con una herramienta como curl:
ja: SUSE Multi-Linux Managerサーバからそのディレクトリにパッケージ<literal>venv-salt-minion</literal>をダウンロードします。Web UIから取得する場合は、<literal>［ソフトウェア］ &gt;［チャンネル一覧］</literal>にあるパッケージを見つけてSUSE-Manager-Tools …​チャンネルからダウンロードするか、SUSE Multi-Linux Managerの「ブートストラップリポジトリ」からcurlなどのツールを使用してダウンロードします。
pt_br: Faça download do pacote <literal>venv-salt-minion</literal> do seu servidor SUSE Multi-Linux Manager para esse diretório. Você pode obtê-lo pela IU da web localizando o pacote em <literal>Software &gt; Lista de canais</literal> e fazendo download dele do canal SUSE-Manager-Tools, ou fazer download dele do "repositório de inicialização" do SUSE Multi-Linux Manager com uma ferramenta como curl:
zh_cn: 从 SUSE Multi-Linux Manager 服务器将 <literal>venv-salt-minion</literal> 软件包下载到该目录。可以通过 Web UI 获取（在<literal>“软件”>“通道列表”</literal>中找到该软件包，并从 SUSE-Manager-Tools … 通道下载），或者使用 curl 等工具从 SUSE Multi-Linux Manager 的“引导储存库”下载：

source: The actual package name may differ if a newer release has already been released. If there are multiple packages to choose from, always pick the latest.
es: El nombre real del paquete puede variar si ya se ha lanzado una versión más reciente. Si hay varios paquetes entre los que elegir, elija siempre el más reciente.
ja: 実際のパッケージ名は、新しいリリースがすでにリリースされている場合は異なる場合があります。複数のパッケージから選択できる場合は、必ず最新のパッケージを選択してください。
pt_br: O nome do pacote real pode ser diferente se uma nova versão já foi lançada. Se houver vários pacotes para seleção, escolha sempre o mais recente.
zh_cn: 如果已有更新的版本发布，实际软件包名称可能会有所不同。如果有多个软件包可供选择，请始终选择最新版本。

source: To work around an issue documented in the <link xl:href="https://www.suse.com/releasenotes/x86_64/multi-linux-manager/5.1/index.html#_bootstrapping_sl_micro_6_1_clients">release notes</link> for SUSE Multi-Linux Manager, you also need to put the latest version of the build key package into the <literal>rpms</literal> directory (<literal>suse-build-key-12.0-slfo.1.1_3.1.noarch.rpm</literal> at the time this documentation was created). You can find it in the <literal>Software</literal> section of SUSE Multi-Linux Manager via the <literal>Packages</literal> tab of the Pool channel of SL Micro. There is a <literal>Download</literal> button in the <literal>Details</literal> view.
es: Como solución a un problema documentado en las <link xl:href="https://www.suse.com/releasenotes/x86_64/multi-linux-manager/5.1/index.html#_bootstrapping_sl_micro_6_1_clients">notas de la versión</link> de SUSE Multi-Linux Manager, también debe colocar la versión más reciente del paquete de clave de versión en el directorio <literal>rpms</literal> (<literal>suse-build-key-12.0-slfo.1.1_3.1.noarch.rpm</literal> cuando se creó esta documentación). La encontrará en la sección <literal>Software</literal> de SUSE Multi-Linux Manager, en la pestaña <literal>Paquetes</literal> del canal Grupo de SL Micro. Hay un botón <literal>Descargar</literal> en la vista <literal>Detalles</literal>.
ja: SUSE Multi-Linux Managerの<link xl:href="https://www.suse.com/releasenotes/x86_64/multi-linux-manager/5.1/index.html#_bootstrapping_sl_micro_6_1_clients">リリースノート</link>に記載されている問題を回避するには、最新バージョンのビルドキーパッケージを<literal>rpms</literal>ディレクトリ(このドキュメントの作成時点では<literal>suse-build-key-12.0-slfo.1.1_3.1.noarch.rpm</literal>)に配置する必要があります。このパッケージは、SL MicroのPoolチャンネルの<literal>Packages</literal>タブ経由で、SUSE Multi-Linux Managerの［<literal>ソフトウェア</literal>］セクションにあります。［<literal>詳細</literal>］ビューには［<literal>ダウンロード</literal>］ボタンがあります。
zh_cn: 为解决 SUSE Multi-Linux Manager <link xl:href="https://www.suse.com/releasenotes/x86_64/multi-linux-manager/5.1/index.html#_bootstrapping_sl_micro_6_1_clients">发行说明</link>中记录的问题，您还需要将最新版构建密钥软件包（本文档创建时为 <literal>suse-build-key-12.0-slfo.1.1_3.1.noarch.rpm</literal>）放入 <literal>rpms</literal> 目录。您可通过 SL Micro 池通道的 <literal>Packages</literal>（软件包）选项卡，在 SUSE Multi-Linux Manager 的 <literal>Software</literal>（软件）部分找到该软件包。<literal>Details</literal>（详细信息）视图中提供了 <literal>Download</literal>（下载）按钮。

source: Download the SUSE Multi-Linux Manager CA certificate
es: Descarga del certificado de CA de SUSE Multi-Linux Manager
ja: SUSE Multi-Linux Manager CA証明書のダウンロード
pt_br: Fazer download do certificado de CA do SUSE Multi-Linux Manager
zh_cn: 下载 SUSE Multi-Linux Manager CA 证书

source: In <literal>/opt/eib</literal>, create a subdirectory <literal>certificates</literal>
es: En <literal>/opt/eib</literal>, cree un subdirectorio <literal>certificates</literal>.
ja: <literal>/opt/eib</literal>に、サブディレクトリ<literal>certificates</literal>を作成します。
pt_br: Em <literal>/opt/eib</literal>, crie o subdiretório <literal>certificates</literal>.
zh_cn: 在 <literal>/opt/eib</literal> 中创建子目录 <literal>certificates</literal>

source: Download the CA certificate from SUSE Multi-Linux Manager into that directory:
es: Descargue el certificado de CA de SUSE Multi-Linux Manager en ese directorio:
ja: SUSE Multi-Linux ManagerからそのディレクトリにCA証明書をダウンロードします。
pt_br: Faça download do certificado de CA do SUSE Multi-Linux Manager para esse diretório:
zh_cn: 从 SUSE Multi-Linux Manager 将 CA 证书下载到该目录：

source: You have to rename the certificate to <literal>RHN-ORG-TRUSTED-SSL-CERT.crt</literal>. Edge Image Builder will then make sure that the certificate is installed and activated on the edge node during installation.
es: Debe cambiar el nombre del certificado a <literal>RHN-ORG-TRUSTED-SSL-CERT.crt</literal>. Edge Image Builder se asegurará de que el certificado se instale y se active en el nodo periférico durante la instalación.
ja: 証明書の名前を<literal>RHN-ORG-TRUSTED-SSL-CERT.crt</literal>に変更する必要があります。その後、Edge Image Builderは、インストール時に証明書がエッジノードにインストールされ、アクティブ化されていることを確認します。
pt_br: Você deve renomear o certificado para <literal>RHN-ORG-TRUSTED-SSL-CERT.crt</literal>. Depois disso, o Edge Image Builder garantirá que ele seja instalado e ativado no nó de borda durante a instalação.
zh_cn: 必须将证书重命名为 <literal>RHN-ORG-TRUSTED-SSL-CERT.crt</literal>。这样，Edge Image Builder 将在安装过程中确保在边缘节点上安装并激活该证书。

source: Now you can run Edge Image Builder:
es: Ahora puede ejecutar Edge Image Builder:
ja: これでEdge Image Builderを実行できます。
pt_br: Agora execute o Edge Image Builder:
zh_cn: 现在，您可以运行 Edge Image Builder：

source: If you have used a different name for your YAML definition file or want to use a different version of Edge Image Builder, you need to adapt the command accordingly.
es: Si ha usado un nombre diferente para su archivo de definición YAML o desea utilizar una versión diferente de Edge Image Builder, deberá adaptar el comando en consecuencia.
ja: YAML定義ファイルに別の名前を使用している場合や別のバージョンのEdge Image Builderを使用する場合は、それに応じてコマンドを調整する必要があります。
pt_br: Se você usou outro nome para o arquivo de definição YAML e quer usar uma versão diferente do Edge Image Builder, precisa adaptar o comando de acordo.
zh_cn: 如果您为 YAML 定义文件使用了不同的名称，或者想使用其他版本的 Edge Image Builder，则需要相应地调整命令。

source: After the build is finished, you’ll find the installation ISO in the <literal>/opt/eib</literal> directory as <literal>eib-image.iso</literal>.
es: Una vez finalizada la creación, encontrará la imagen ISO de instalación en el directorio <literal>/opt/eib</literal> con el nombre <literal>eib-image.iso</literal>.
ja: ビルドが完了したら、 <literal>/opt/eib</literal>ディレクトリにインストールISOが<literal>eib-image.iso</literal>として保存されます。
pt_br: Após o término da criação, a ISO de instalação estará no diretório <literal>/opt/eib</literal> como <literal>eib-image.iso</literal>.
zh_cn: 构建完成后，您可在 <literal>/opt/eib</literal> 目录中找到名为 <literal>eib-image.iso</literal> 的安装 ISO。

source: That image can now be used to deploy nodes that will try to register with SUSE Multi-Linux Manager.
es: Esa imagen se puede usar ahora para desplegar nodos que intentarán registrarse con SUSE Multi-Linux Manager.
ja: このイメージは、SUSE Multi-Linux Managerに登録しようとするノードをデプロイするために使用できます。
zh_cn: 现在，您便可使用该映像部署节点，这些节点将尝试向 SUSE Multi-Linux Manager 注册。
