Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The SUSE Edge team also welcomes community feedback, where issues can be raised within the respective code repository within <link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>.
es: El equipo de SUSE Edge también agradece los comentarios de la comunidad, que pueden plantear sus cuestiones dentro del repositorio de código correspondiente en <link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>.
ja: SUSE Edgeチームはコミュニティからのフィードバックも歓迎しており、<link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>の各コードリポジトリ内で問題を報告できます。
pt_br: A equipe do SUSE Edge também agradece o feedback da comunidade, em que é possível relatar problemas dentro do respectivo repositório de códigos em <link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>.
zh_cn: SUSE Edge 团队也欢迎社区提出反馈，相关问题可在 <link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link> 中的相应代码储存库内提出。

source: Obtaining source code
es: Obtención del código fuente
ja: ソースコードの取得
pt_br: Obtendo o código-fonte
zh_cn: 获取源代码

source: This SUSE product includes materials licensed to SUSE under the GNU General Public License (GPL) and various other open source licenses. The GPL requires SUSE to provide the source code that corresponds to the GPL-licensed material, and SUSE conforms to all other open-source license requirements. As such, SUSE makes all source code available, and can generally be found in the SUSE Edge GitHub repository (<link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>), the SUSE Rancher GitHub repository (<link xl:href="https://www.github.com/rancher">https://www.github.com/rancher</link>) for dependent components, and specifically for SUSE Linux Micro, the source code is available for download at <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro</link> on "Medium 2".
es: Este producto de SUSE incluye materiales licenciados a SUSE bajo la Licencia Pública General de GNU (GPL) y otras licencias de código abierto. La GPL exige a SUSE que proporcione el código fuente correspondiente al material licenciado bajo la GPL, y SUSE cumple con todos los demás requisitos de las licencias de código abierto. Por lo tanto, SUSE pone a disposición todo el código fuente, que generalmente se puede encontrar en el repositorio GitHub de SUSE Edge (<link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>), el repositorio GitHub de SUSE Rancher (<link xl:href="https://www.github.com/rancher">https://www.github.com/rancher</link>) para los componentes dependientes y, específicamente para SUSE Linux Micro, el código fuente está disponible para su descarga en <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro</link> en "Medium 2".
ja: このSUSE製品には、GNU General Public License (GPL)やその他のさまざまなオープンソースライセンスの下でSUSEにライセンスされた素材が含まれます。SUSEはGPLに従ってGPLでライセンスされた素材に対応するソースコードを提供する必要があるほか、その他すべてのオープンソースライセンスの要件にも準拠します。よって、SUSEはすべてのソースコードを利用可能にしており、一般的にSUSE Edge GitHubリポジトリ(<link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>)にあります。また、依存コンポーネントについてはSUSE Rancher GitHubリポジトリ(<link xl:href="https://www.github.com/rancher">https://www.github.com/rancher</link>)にあり、特にSUSE Linux Microについては<link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro</link>の「Medium 2」でソースコードをダウンロードできます。
pt_br: Este produto SUSE inclui materiais licenciados à SUSE de acordo com a Licença Pública Geral (GPL, General Public License) GNU e várias outras licenças de código aberto. A GPL exige que a SUSE providencie o código-fonte em conformidade com o material licenciado sob a GPL, e a SUSE cumpre todos os outros requisitos de licença de código aberto. Sendo assim, a SUSE disponibiliza todo o código-fonte que, de modo geral, está armazenado no repositório SUSE Edge do GitHub (<link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>), no repositório SUSE Rancher do GitHub (<link xl:href="https://www.github.com/rancher">https://www.github.com/rancher</link>) para componentes dependentes, e especificamente para o SUSE Linux Micro, o código-fonte está disponível para download em <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro</link> na "mídia 2".
zh_cn: 本 SUSE 产品包含根据 GNU 通用公共许可证 (GPL) 和其他各种开源许可证授权给 SUSE 的组件。根据 GPL 要求，SUSE 必须提供与 GPL 授权组件对应的源代码，此外还须严格遵守其他所有开源许可要求。因此，SUSE 会公开所有源代码，这些源代码通常可在 SUSE Edge GitHub 代码库 (<link xl:href="https://www.github.com/suse-edge">https://www.github.com/suse-edge</link>)、依赖组件的 SUSE Rancher GitHub 代码库 (<link xl:href="https://www.github.com/rancher">https://www.github.com/rancher</link>) 中找到；具体到 SUSE Linux Micro，其源代码可在 <link xl:href="https://www.suse.com/download/sle-micro/">https://www.suse.com/download/sle-micro</link> 的“Medium 2”处下载。

source: Legal notices
es: Información legal
ja: 法的通知
pt_br: Avisos legais
zh_cn: 法律声明

source: SUSE makes no representations or warranties with regard to the contents or use of this documentation, and specifically disclaims any express or implied warranties of merchantability or fitness for any particular purpose. Further, SUSE reserves the right to revise this publication and to make changes to its content, at any time, without the obligation to notify any person or entity of such revisions or changes.
es: SUSE no ofrece ninguna garantía con respecto al contenido o al uso de esta documentación, y renuncia específicamente a cualquier garantía expresa o implícita de comerciabilidad o idoneidad para un fin determinado. Además, SUSE se reserva el derecho de revisar esta publicación y de realizar cambios en su contenido en cualquier momento, sin la obligación de notificar a ninguna persona o entidad dichas revisiones o cambios.
ja: SUSEは、この文書の内容や使用に関していかなる表明や保証も行いません。特に、商品性または特定目的への適合性に関する明示的または暗黙的な保証は一切行いません。さらに、SUSEは本書を改訂し、その内容に随時変更を加える権利を留保しますが、いかなる個人または団体に対しても当該の改訂または変更を通知する義務を負いません。
pt_br: A SUSE não faz representações ou garantias no que se refere ao conteúdo ou ao uso desta documentação e, especificamente, isenta-se de quaisquer garantias expressas ou implícitas de comercialização ou adequação para uma finalidade específica. Além disso, a SUSE reserva o direito de revisar esta publicação e fazer alterações em seu conteúdo, a qualquer momento, sem a obrigação de notificar qualquer pessoa ou entidade de tais revisões ou alterações.
zh_cn: SUSE 不对本文档的内容或其使用作出任何陈述或保证，并明确否认对适销性或任何特定用途的适用性作出任何明示或暗示保证。此外，SUSE 保留随时修订本出版物和更改其内容的权利，且无义务将此类修订或更改通知任何个人或实体。

source: Further, SUSE makes no representations or warranties with regard to any software, and specifically disclaims any express or implied warranties of merchantability or fitness for any particular purpose. Further, SUSE reserves the right to make changes to any and all parts of SUSE software, at any time, without any obligation to notify any person or entity of such changes.
es: Además, SUSE no ofrece ninguna garantía con respecto a ningún software y, en concreto, rechaza cualquier garantía expresa o implícita de comerciabilidad o idoneidad para un fin determinado. Asimismo, SUSE se reserva el derecho a realizar cambios en cualquier parte del software de SUSE, en cualquier momento, sin obligación alguna de notificar dichos cambios a ninguna persona o entidad.
ja: SUSEは、いかなるソフトウェアに関しても、いかなる表明や保証も行いません。特に、商品性または特定目的への適合性に関する明示的または暗黙的な保証は一切行いません。さらに、SUSEはSUSEソフトウェアのあらゆる部分に随時変更を加える権利を留保しますが、いかなる個人または団体に対しても当該の変更を通知する義務を負いません。
pt_br: A SUSE não faz representações ou garantias em relação a nenhum software e, especificamente, isenta-se de quaisquer garantias expressas ou implícitas de comercialização ou adequação a uma finalidade específica. Além disso, a SUSE reserva o direito de fazer alterações em qualquer parte do software SUSE, a qualquer momento, sem a obrigação de notificar qualquer pessoa ou entidade de tais alterações.
zh_cn: 此外，SUSE 不对任何软件作出任何陈述或保证，并明确否认对适销性或任何特定用途的适用性作出任何明示或暗示保证。此外，SUSE 保留随时更改 SUSE 软件任何或所有部分的权利，且无义务将此类更改通知任何个人或实体。

source: Any products or technical information provided under this Agreement may be subject to U.S. export controls and the trade laws of other countries. You agree to comply with all export control regulations and to obtain any required licenses or classifications to export, re-export, or import deliverables. You agree not to export or re-export to entities on the current U.S. export exclusion lists or to any embargoed or terrorist countries as specified in U.S. export laws. You agree to not use deliverables for prohibited nuclear, missile, or chemical/biological weaponry end uses. Refer to <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link> for more information on exporting SUSE software. SUSE assumes no responsibility for your failure to obtain any necessary export approvals.
es: Cualquier producto o información técnica proporcionada en virtud del presente Acuerdo puede estar sujeto a los controles de exportación de los Estados Unidos y a las leyes comerciales de otros países. Usted se compromete a cumplir con todas las regulaciones de control de exportaciones y a obtener las licencias o clasificaciones necesarias para exportar, reexportar o importar los productos que se entregan. Usted se compromete a no exportar ni reexportar a entidades que figuren en las listas actuales de exclusión de exportaciones de los Estados Unidos ni a ningún país sujeto a embargo o considerado terrorista, tal y como se especifica en las leyes de exportación de los Estados Unidos. Usted acepta no utilizar los productos que se entregan para usos finales prohibidos relacionados con armas nucleares, misiles o armas químicas/biológicas. Consulte <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link> para obtener más información sobre la exportación de software de SUSE. SUSE no asume ninguna responsabilidad por su incumplimiento en la obtención de las autorizaciones de exportación necesarias.
ja: 本契約の下で提供されるいかなる製品または技術情報も、米国の輸出管理法規および他国の貿易法の対象となる場合があります。お客様はすべての輸出管理規制を遵守し、成果物の輸出、再輸出、または輸入のために必要なライセンスまたは分類を取得することに同意します。お客様は、現行の米国輸出禁止リストに記載されている団体や米国輸出法に規定された禁輸国やテロ支援国への輸出や再輸出を行わないことに同意します。また、成果物を禁止されている核、ミサイル、または化学/生物兵器の最終用途に使用しないことにも同意します。SUSEソフトウェアの輸出に関する詳細情報については、<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>を参照してください。SUSEは、必要な輸出許可の取得を怠ったことに対する責任を一切負いません。
pt_br: Os produtos ou as informações técnicas constantes neste Contrato podem estar sujeitos aos controles de exportação dos EUA e à legislação comercial de outros países. Você concorda em cumprir todas as normas de controle de exportação e obter as licenças ou as classificações necessárias para exportar, reexportar ou importar produtos entregáveis. Você concorda em não exportar ou reexportar para entidades que façam parte das listas atuais de exclusão de exportação dos EUA nem para países embargados ou terroristas, conforme especificado nas leis de exportação dos EUA. Você concorda em não usar os produtos entregáveis para fins proibidos como armas nucleares, mísseis ou armamento químico/biológico. Visite <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link> para obter mais informações sobre exportação do software SUSE. A SUSE não assumirá nenhuma responsabilidade se você não obtiver as aprovações de exportação necessárias.
zh_cn: 根据本协议提供的任何产品或技术信息可能受到美国出口管制和其他国家/地区贸易法的约束。您同意遵守所有出口管制法规，并在出口、再出口或进口可交付产品之前取得所有必要的许可证或分类证书。您同意不向当前美国出口排除清单上的实体，或美国出口法中规定的任何禁运国家/地区或支持恐怖主义的国家/地区出口或再出口。您同意不将可交付产品用于受禁核武器、导弹或生化武器的最终用途。有关出口 SUSE 软件的详细信息，请访问 <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>。如果您未能取得任何必要的出口许可，SUSE 对此不承担任何责任。

source: <emphasis role="strong">Copyright © 2024 SUSE LLC.</emphasis>
zh_cn: <emphasis role="strong">版权所有 © 2024 SUSE LLC。</emphasis>

source: This release notes document is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License (CC-BY-ND-4.0). You should have received a copy of the license along with this document. If not, see <link xl:href="https://creativecommons.org/licenses/by-nd/4.0/">https://creativecommons.org/licenses/by-nd/4.0/</link>.
es: Este documento de notas de la versión está protegido por una licencia Creative Commons Attribution-NoDerivatives 4.0 International License (CC-BY-ND-4.0). Debería haber recibido una copia de la licencia junto con este documento. Si no es así, consulte <link xl:href="https://creativecommons.org/licenses/by-nd/4.0/">https://creativecommons.org/licenses/by-nd/4.0/</link>.
ja: このリリースノート文書は、Creative Commons Attribution-NoDerivatives 4.0 International License (CC-BY-ND-4.0)の下でライセンスされています。お客様は、この文書と併せてライセンスのコピーを受け取っている必要があります。受け取っていない場合は、<link xl:href="https://creativecommons.org/licenses/by-nd/4.0/">https://creativecommons.org/licenses/by-nd/4.0/</link>を参照してください。
pt_br: Este documento de Notas de lançamento é protegido por uma licença Creative Commons Atribuição-NãoComercial-SemDerivações 4.0 Internacional (CC-BY-ND-4.0). Você deve ter recebido uma cópia da licença junto com este documento. Do contrário, acesse <link xl:href="https://creativecommons.org/licenses/by-nd/4.0/">https://creativecommons.org/licenses/by-nd/4.0/</link>.
zh_cn: 本发行说明文档根据 Creative Commons Attribution-NoDerivatives 4.0 国际许可证 (CC-BY-ND-4.0) 授权。您应已随本文档收到了一份许可证。如果没有，请访问 <link xl:href="https://creativecommons.org/licenses/by-nd/4.0/">https://creativecommons.org/licenses/by-nd/4.0/</link>。

source: SUSE has intellectual property rights relating to technology embodied in the product that is described in this document. In particular, and without limitation, these intellectual property rights may include one or more of the U.S. patents listed at <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link> and one or more additional patents or pending patent applications in the U.S. and other countries.
es: SUSE posee los derechos de propiedad intelectual relacionados con la tecnología incorporada en el producto que se describe en este documento. En particular, y sin limitación, estos derechos de propiedad intelectual pueden incluir una o más de las patentes estadounidenses listadas en <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link> y una o más patentes adicionales o solicitudes de patente pendientes en los Estados Unidos y otros países.
ja: SUSEは、本書で説明されている製品に組み込まれた技術に関連する知的財産権を有しています。これらの知的財産権には、特に、<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>に記載されている1つまたは複数の米国特許、ならびに米国およびその他の国における1つまたは複数のその他の特許または出願中の特許申請が含まれていることがありますが、これらに限定されません。
pt_br: A SUSE tem direitos de propriedade intelectual pertinentes à tecnologia incorporada ao produto descrito neste documento. Em particular, e sem limitação, esses direitos de propriedade intelectual podem incluir uma ou mais patentes nos EUA, relacionadas em <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>, e uma ou mais patentes adicionais ou solicitações de patentes pendentes nos EUA e em outros países.
zh_cn: SUSE 拥有与本文档所述产品中体现的技术相关的知识产权。具体而言，这些知识产权可能包括但不限于 <link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link> 中列出的一项或多项美国专利，以及美国和其他国家/地区的一项或多项其他专利或正在申请的专利。

source: For SUSE trademarks, see the SUSE Trademark and Service Mark list (<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>). All third-party trademarks are the property of their respective owners. For SUSE brand information and usage requirements, please see the guidelines published at <link xl:href="https://brand.suse.com/">https://brand.suse.com/</link>.
es: Para obtener información sobre las marcas comerciales de SUSE, consulte la lista de marcas comerciales y marcas de servicio de SUSE (<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>). Todas las marcas comerciales de terceros son propiedad de sus respectivos propietarios. Para obtener información sobre la marca SUSE y los requisitos de uso, consulte las directrices publicadas en <link xl:href="https://brand.suse.com/">https://brand.suse.com/</link>.
ja: SUSEの商標については、SUSEの商標とサービスマークのリスト(<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>)を参照してください。第三者のすべての商標は各所有者の財産です。SUSEのブランド情報と使用要件については、<link xl:href="https://brand.suse.com/">https://brand.suse.com/</link>で公開されているガイドラインを参照してください。
pt_br: Para conhecer as marcas registradas da SUSE, consulte a lista de marcas registradas e marcas de serviço da SUSE (<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>). Todas as marcas registradas de terceiros pertencem aos respectivos proprietários. Para saber as informações e os requisitos de uso da marca SUSE, consulte as diretrizes publicadas em <link xl:href="https://brand.suse.com/">https://brand.suse.com/</link>.
zh_cn: 有关 SUSE 商标，请参见 SUSE 商标和服务标记列表 (<link xl:href="https://www.suse.com/company/legal/">https://www.suse.com/company/legal/</link>)。所有第三方商标均是其各自所有者的财产。有关 SUSE 品牌信息和使用要求，请参见 <link xl:href="https://brand.suse.com/">https://brand.suse.com/</link> 上发布的准则。

source: 16 GB RAM
es: 16 GB de RAM
pt_br: 16 GB de RAM

source: <link xl:href="https://cluster-api.sigs.k8s.io/">Cluster API Book</link>
es: <link xl:href="https://cluster-api.sigs.k8s.io/">Manual de Cluster API</link>
ja: <link xl:href="https://cluster-api.sigs.k8s.io/">Cluster APIのドキュメント</link>
pt_br: <link xl:href="https://cluster-api.sigs.k8s.io/">Manual da Cluster API</link>

source: Ironic API
es: API de Ironic

source: Kubernetes API
es: API de Kubernetes

source: Bond CNI
es: CNI de vinculación

source: Host Device
es: Dispositivo host
ja: ホストデバイス

source: <emphasis role="strong">NetworkAttachmentDefinition bond</emphasis>
es: <emphasis role="strong">Vinculación NetworkAttachmentDefinition</emphasis>

source: <emphasis role="strong">Elemental operator pod</emphasis>: <literal>kubectl logs -n cattle-elemental-system -l app=elemental-operator</literal>
es: <emphasis role="strong">Pod del operador de Elemental</emphasis>: <literal>kubectl logs -n cattle-elemental-system -l app=elemental-operator</literal>
ja: <emphasis role="strong">ElementalオペレータPod</emphasis>: <literal>kubectl logs -n cattle-elemental-system -l app=elemental-operator</literal>
pt_br: <emphasis role="strong">Pod do operador Elemental</emphasis>: <literal>kubectl logs -n cattle-elemental-system -l app=elemental-operator</literal>

source: SUSE Edge 3.3.1 Documentation
pt_br: Documentação do SUSE Edge 3.3.1

source: A lightweight, container-optimized, hardened Linux operating system with SUSE Linux Micro (<xref linkend="components-slmicro"/>), providing an immutable and highly resilient OS for running containers and virtual machines at the edge. SUSE Linux Micro is available for both AArch64 and AMD64/Intel 64 architectures, and it also supports <literal>Real-Time Kernel</literal> for latency sentitive applications (e.g. telco use-cases).
pt_br: Um sistema operacional Linux leve, otimizado para contêiner e protegido com o SUSE Linux Micro (<xref linkend="components-slmicro"/>), que oferece um sistema operacional imutável e altamente resiliente para execução de contêineres e máquinas virtuais na borda. O SUSE Linux Micro está disponível para as arquiteturas AArch64 e AMD64/Intel 64 e também suporta o <literal>kernel Real-Time</literal> para aplicativos sensíveis à latência (por exemplo, os casos de uso de telecomunicações).

source: It’s recommended that multiple management clusters are implemented to accommodate the scale of large deployments, optimize for bandwidth and latency concerns in geographically dispersed environments, and to minimize the disruption in the event of an outage or management cluster upgrade. You can find the current management cluster scalability limits and system requirements <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/installation-requirements">here</link>.
pt_br: É recomendada a implementação de vários clusters de gerenciamento para acomodar a grande escala de implantações, otimizar os ambientes geograficamente dispersos conforme as expectativas de largura de banda e de latência e minimizar as interrupções em caso de paradas ou upgrades do cluster de gerenciamento. Você encontra os limites de escalabilidade dos clusters de gerenciamento e os requisitos do sistema atuais <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/installation-requirements">aqui</link>.

source: The <literal>time</literal> section is optional but it is highly recommended to configure it to avoid potential issues with certificates and clock skew. The values provided in this example are for illustrative purposes only. Please adjust them to fit your specific requirements.
pt_br: A seção <literal>time</literal> é opcional, mas sua configuração é altamente recomendada para evitar possíveis problemas com certificados e divergência de relógio. O valor usado neste exemplo é somente para fins ilustrativos. Ajuste-o de acordo com seus requisitos específicos.

source: The SUSE Edge for Telco Documentation (<xref linkend="atip"/>) has examples of more advanced usage of Metal<superscript>3</superscript> for telco use-cases.
pt_br: A documentação do SUSE Edge for Telco (<xref linkend="atip"/>) tem exemplos de uso mais avançado do Metal<superscript>3</superscript> para casos de uso de telecomunicações.

source: The SUSE Edge for Telco Management Cluster Documentation (<xref linkend="atip-management-cluster"/>) has more details on how to configure a management cluster with persistent storage.
pt_br: A documentação para cluster de gerenciamento do SUSE Edge for Telco (<xref linkend="atip-management-cluster"/>) tem mais detalhes sobre como configurar um cluster de gerenciamento com armazenamento persistente.

source: Minimum 8 GB RAM and 20 GB disk space for development or testing (see <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/installation-requirements#hardware-requirements">here</link> for production use)
pt_br: Espaço em disco mínimo de 8 GB RAM e 20 GB para desenvolvimento ou teste (consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/installation-requirements#hardware-requirements">aqui</link> para uso em produção)

source: Install Rancher easily with the commands from the <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancher Documentation</link>:
pt_br: Instale o Rancher facilmente com os comandos apresentados na <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">documentação do Rancher</link>:

source: <imageobject> <imagedata fileref="installing-elemental-extension-1.png" width=""/> </imageobject>
pt_br: <imageobject> <imagedata fileref="installing-elemental-extension-1.png" width="85%"/> </imageobject>

source: Installing Elemental extension1
pt_br: Instalando a extensão 1 do Elemental

source: <imageobject> <imagedata fileref="installing-elemental-extension-2.png" width=""/> </imageobject>
pt_br: <imageobject> <imagedata fileref="installing-elemental-extension-2.png" width="85%"/> </imageobject>
