Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The <link xl:href="https://longhorn.io/docs/1.8.1/deploy/install/airgap/">official documentation</link> for Longhorn contains a <literal>longhorn-images.txt</literal> file which lists all the images required for an air-gapped installation. We will be including their mirrored counterparts from the Rancher container registry in our definition file. Let’s create it:
pt_br: A <link xl:href="https://longhorn.io/docs/1.8.1/deploy/install/airgap/">documentação oficial</link> do Longhorn contém o arquivo <literal>longhorn-images.txt</literal> que lista todas as imagens necessárias a uma instalação air-gapped. Vamos incluir as contrapartes espelhadas do registro do contêiner do Rancher em nosso arquivo de definição. Vamos criá-lo:

source: This process works for both AMD64/Intel 64 and AArch64 architectures, although not all image profiles are available for both architectures, e.g. in SUSE Edge 3.3, where SUSE Linux Micro 6.1 is used, a profile with a real-time kernel (i.e. "Base-RT" or "Base-RT-SelfInstall") is not currently available for AArch64.
pt_br: Esse processo funciona nas duas arquiteturas AMD64/Intel 64 e AArch64, embora nem todos os perfis de imagem estejam disponíveis para ambas, por exemplo, no SUSE Edge 3.3, em que o SUSE Linux Micro 6.1 é usado, um perfil com kernel em tempo real (ou seja, "Base-RT" ou "Base-RT-SelfInstall") não está disponível para AArch64 no momento.

source: Follow the <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancher installation</link> documentation for more details.
pt_br: Consulte a documentação de <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">instalação do Rancher</link> para obter mais detalhes.

source: For further instructions, please see the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">documentation</link> for Edge Image Builder.
pt_br: Para obter mais instruções, consulte a <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">documentação</link> do Edge Image Builder.

source: Edge 3.3 migration
pt_br: Migração do Edge 3.3

source: This section explains how to migrate your <literal>management</literal> and <literal>downstream</literal> clusters from <literal>Edge 3.2</literal> to <literal>Edge 3.3.0</literal>.
pt_br: Esta seção explica como migrar os clusters de <literal>gerenciamento</literal> e <literal>downstream</literal> do <literal>Edge 3.2</literal> para o <literal>Edge 3.3.0</literal>.

source: Always perform cluster migrations from the <literal>latest Z-stream</literal> release of <literal>Edge 3.2</literal>.
pt_br: Faça sempre as migrações de cluster da versão <literal>Z-stream mais recente</literal> do <literal>Edge 3.2</literal>.

source: Always migrate to the <literal>Edge 3.3.0</literal> release. For subsequent post-migration upgrades, refer to the management (<xref linkend="day2-mgmt-cluster"/>) and downstream (<xref linkend="day2-downstream-clusters"/>) cluster sections.
pt_br: Migre sempre para a versão <literal>Edge 3.3.0</literal>. Para os upgrades pós-migração subsequentes, consulte as seções referentes ao cluster de gerenciamento (<xref linkend="day2-mgmt-cluster"/>) e downstream (<xref linkend="day2-downstream-clusters"/>).

source: As a result, before upgrading Metal<superscript>3</superscript> to an <literal>Edge 3.3.0</literal> compatible version, users must manually upgrade the underlying BMO CRDs.
pt_br: Como resultado, antes de fazer upgrade do Metal<superscript>3</superscript> para uma versão compatível do <literal>Edge 3.3.0</literal>, os usuários devem fazer upgrade manual das CRDs subjacentes do BMO.

source: Edge 3.3 Upgrade Controller
pt_br: Controller de upgrade do Edge 3.3

source: The only difference is that your <literal>UpgradePlan</literal> <emphasis role="strong">must</emphasis> specify the <literal>3.3.0</literal> release version:
pt_br: A única diferença é que o <literal>UpgradePlan</literal> <emphasis role="strong">deve</emphasis> especificar a versão de lançamento <literal>3.3.0</literal>:

source: The fleets <emphasis role="strong">must be used</emphasis> from the <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">release-3.3.0</link> release of the <literal>suse-edge/fleet-examples</literal> repository.
pt_br: As instâncias do Fleet <emphasis role="strong">devem ser usadas</emphasis> a partir da versão <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">release-3.3.0</link> do repositório <literal>suse-edge/fleet-examples</literal>.

source: Charts scheduled for an upgrade <emphasis role="strong">must</emphasis> be upgraded to versions compatible with the <literal>Edge 3.3.0</literal> release. For a list of the <literal>Edge 3.3.0</literal> components, refer to <xref linkend="release-notes-3-3-0"/>.
pt_br: Os gráficos programados para upgrade <emphasis role="strong">devem</emphasis> ser atualizados para versões compatíveis com o <literal>Edge 3.3.0</literal>. Para ver uma lista de componentes do <literal>Edge 3.3.0</literal>, consulte a <xref linkend="release-notes-3-3-0"/>.

source: To ensure a successful <literal>Edge 3.3.0</literal> migration, it is important that users comply with the points outlined above.
pt_br: Para garantir a migração bem-sucedida do <literal>Edge 3.3.0</literal>, é importante que os usuários cumpram os pontos descritos acima.

source: To create a <literal>GitRepo</literal> resource through the Rancher UI, follow their official <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">documentation</link>.
pt_br: Para criar um recurso <literal>GitRepo</literal> pela IU do Rancher, siga a <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">documentação</link> oficial dele.

source: The Edge team maintains a ready to use <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/system-upgrade-controller-plans/os-upgrade">fleet</link>. Depending on your environment this fleet could be used directly or as a template.
pt_br: A equipe do Edge mantém uma <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/system-upgrade-controller-plans/os-upgrade">instância do Fleet</link> pronta para uso. Dependendo do seu ambiente, ela pode ser usada diretamente ou como gabarito.

source: An example of how a <literal>GitRepo</literal> can be configured to use the fleet from the <literal>suse-edge/fleet-examples</literal> repository, can be viewed <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/gitrepos/day2/os-upgrade-gitrepo.yaml">here</link>.
pt_br: Há um exemplo de como configurar o <literal>GitRepo</literal> para usar a instância do Fleet de um repositório <literal>suse-edge/fleet-examples</literal> disponível <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/gitrepos/day2/os-upgrade-gitrepo.yaml">aqui</link>.

source: The Edge team maintains a ready to use <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">bundle</link> that can be used in the below steps.
pt_br: A equipe do Edge mantém um <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">bundle</link> pronto para uso que pode ser usado nas etapas a seguir.

source: By manually copying the <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.3.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">bundle content</link> from <literal>suse-edge/fleet-examples</literal> to the <emphasis role="strong">Create from YAML</emphasis> page.
pt_br: Copie manualmente o <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.3.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">conteúdo do bundle</link> de <literal>suse-edge/fleet-examples</literal> para a página <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML).

source: The Edge team maintains ready to use fleets for both <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/system-upgrade-controller-plans/rke2-upgrade">rke2</link> and <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/system-upgrade-controller-plans/k3s-upgrade">k3s</link> Kubernetes distributions. Depending on your environment, this fleet could be used directly or as a template.
pt_br: A equipe do Edge mantém instâncias do Fleet prontas para uso para distribuições Kubernetes tanto do <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/system-upgrade-controller-plans/rke2-upgrade">rke2</link> quanto do <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/system-upgrade-controller-plans/k3s-upgrade">k3s</link>. Dependendo do ambiente, a instância do Fleet pode ser usada diretamente ou como gabarito.

source: The Edge team maintains ready to use bundles for both <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">rke2</link> and <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">k3s</link> Kubernetes distributions. Depending on your environment these bundles could be used directly or as a template.
pt_br: A equipe do Edge mantém bundles prontos para uso para distribuições Kubernetes tanto do <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">rke2</link> quanto do <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">k3s</link>. Dependendo do ambiente, esses bundles podem ser usados diretamente ou como gabaritos.

source: By manually copying the bundle content for <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.3.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">RKE2</link> or <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.3.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">K3s</link> from <literal>suse-edge/fleet-examples</literal> to the <emphasis role="strong">Create from YAML</emphasis> page.
pt_br: Copie manualmente o conteúdo do bundle referente ao <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.3.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">RKE2</link> ou ao <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.3.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">K3s</link> de <literal>suse-edge/fleet-examples</literal> para a página <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML).

source: Use Fleet’s CLI to <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">convert a Helm chart into a Bundle</link> that you can directly use and will not need to be hosted somewhere. Fleet’s CLI can be retrieved from their <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.12.2">release</link> page, for Mac users there is a <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulae.
pt_br: Use a CLI do Fleet para <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">converter um gráfico Helm em bundle</link>, que você pode usar diretamente e não precisa ser hospedado em nenhum lugar. É possível recuperar a CLI do Fleet da página referente à respectiva <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.12.2">versão</link>. Para usuários do Mac, existe um Homebrew Formulae <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.

source: The <literal>GitRepo</literal> resource can be deployed through the <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Rancher UI</link>, or manually, by <link xl:href="https://fleet.rancher.io/tut-deployment">deploying</link> the resource to the <literal>management cluster</literal>.
pt_br: É possível implantar o recurso <literal>GitRepo</literal> pela <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">IU do Rancher</link> ou manualmente pela <link xl:href="https://fleet.rancher.io/tut-deployment">implantação</link> do recurso no <literal>cluster de gerenciamento</literal>.

source: Below you can find an example on how to create a <literal>Bundle</literal> resource from the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> and <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> Helm chart fleet templates and manually deploy this bundle to your <literal>management cluster</literal>.
pt_br: Veja a seguir um exemplo de como criar um recurso <literal>Bundle</literal> com base nos gabaritos de gráfico Helm <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> e <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> do Fleet e implantar manualmente esse bundle no <literal>cluster de gerenciamento</literal>.

source: Navigate to the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> Chart fleet template:
pt_br: Navegue até o gabarito de gráfico <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> do Fleet:

source: Fleet’s CLI can be retrieved from their <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.12.2">release</link> <emphasis role="strong">Assets</emphasis> page (<literal>fleet-linux-amd64</literal>).
pt_br: É possível recuperar a CLI do Fleet da página <emphasis role="strong">Assets</emphasis> (Ativos) da respectiva <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.12.2">versão</link> (<literal>fleet-linux-amd64</literal>).

source: Navigate to the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> Chart fleet template:
pt_br: Navegue até o gabarito de gráfico <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> do Fleet:

source: Helm charts that are deployed via <literal>EIB</literal> are upgraded through a <literal>fleet</literal> called <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/eib-charts-upgrader">eib-charts-upgrader</link>.
pt_br: O upgrade dos gráficos Helm que são implantados pelo <literal>EIB</literal> é feito por uma instância do <literal>Fleet</literal> chamada <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.3.0/fleets/day2/eib-charts-upgrader">eib-charts-upgrader</link>.

source: Pass these archives to the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/generate-chart-upgrade-data.sh">generate-chart-upgrade-data.sh</link> <literal>generate-chart-upgrade-data.sh</literal> script, which will include the data from these archives to the <literal>eib-charts-upgrader</literal> fleet.
pt_br: Especificar esses arquivos no script <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/generate-chart-upgrade-data.sh">generate-chart-upgrade-data.sh</link> <literal>generate-chart-upgrade-data.sh</literal>, que incluirá os dados dos arquivos na instância do Fleet <literal>eib-charts-upgrader</literal>.

source: Clone the <literal>suse-edge/fleet-examples</literal> repository from the correct release <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">tag</link>.
pt_br: Clone o repositório <literal>suse-edge/fleet-examples</literal> da <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">tag</link> da versão correta.

source: From <emphasis role="strong">Assets</emphasis> of the desired <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">release tag</link>, download the <literal>generate-chart-upgrade-data.sh</literal> script.
pt_br: Em <emphasis role="strong">Assets</emphasis> (Ativos) da <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">tag da versão</link> desejada, faça download do script <literal>generate-chart-upgrade-data.sh</literal>.

source: For <literal>GitRepo</literal> configuration and deployment through the Rancher UI, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link>.
pt_br: Para configuração e implantação do <literal>GitRepo</literal> pela IU do Rancher, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link> (Acessando o Fleet na IU do Racher).

source: Download the <literal>fleet-cli</literal> binary from the <literal>rancher/fleet</literal> <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.12.2">release</link> page (<literal>fleet-linux-amd64</literal> for Linux). For Mac users, there is a Homebrew Formulae that can be used - <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.
pt_br: Faça download do binário <literal>fleet-cli</literal> na página da <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.12.2">versão</link> do <literal>rancher/fleet</literal> (<literal>fleet-linux-amd64</literal> para Linux). Para usuários do Mac, existe um Homebrew Formulae que pode ser usado: <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.

source: <literal>SUSE Storage</literal> needs to be upgraded to a version that is compatible with the Edge 3.3.1 release. Meaning it needs to be upgraded to <literal>106.2.0+up1.8.1</literal>.
pt_br: É preciso fazer upgrade do <literal>SUSE Storage</literal> para uma versão compatível com o Edge 3.3.1, ou seja, para a versão <literal>106.2.0+up1.8.1</literal>.

source: Clone the <literal>suse-edge/fleet-example</literal> repository from the <literal>release-3.3.0</literal> tag.
pt_br: Clone o repositório <literal>suse-edge/fleet-example</literal> da tag <literal>release-3.3.0</literal>.

source: Outside of the <literal>archives</literal> directory, download the <literal>generate-chart-upgrade-data.sh</literal> script from the <literal>suse-edge/fleet-examples</literal> release <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">tag</link>.
pt_br: Fora do diretório <literal>archives</literal>, faça download do script <literal>generate-chart-upgrade-data.sh</literal> da <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.3.0">tag</link> da versão do <literal>suse-edge/fleet-examples</literal>.

source: After making the above validations, it is safe to assume that the Longhorn Helm chart has been upgraded from to the <literal>106.2.0+up1.8.1</literal> version.
pt_br: Depois de fazer as validações acima, é seguro pressupor que o upgrade do gráfico Helm do Longhorn foi feito para a versão <literal>106.2.0+up1.8.1</literal>.

source: The following steps do not apply to <literal>downstream</literal> clusters managed by SUSE Edge for Telco (<xref linkend="atip"/>). For guidance on upgrading these clusters, refer to <xref linkend="atip-lifecycle-downstream"/>.
pt_br: As etapas a seguir não são válidas para clusters <literal>downstream</literal> gerenciados pelo SUSE Edge for Telco (<xref linkend="atip"/>). Para obter orientação sobre o upgrade desses clusters, consulte a <xref linkend="atip-lifecycle-downstream"/>.

source: This section covers Kubernetes upgrades for downstream clusters that have <emphasis role="strong">NOT</emphasis> been created through a Rancher (<xref linkend="components-rancher"/>) instance. For information on how to upgrade the Kubernetes version of <literal>Rancher</literal> created clusters, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/upgrade-and-roll-back-kubernetes#upgrading-the-kubernetes-version">Upgrading and Rolling Back Kubernetes</link>.
pt_br: Esta seção aborda os upgrades do Kubernetes para clusters downstream que <emphasis role="strong">NÃO</emphasis> foram criados por uma instância do Rancher (<xref linkend="components-rancher"/>). Para obter informações sobre como fazer upgrade da versão do Kubernetes dos clusters criados pelo <literal>Rancher</literal>, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/getting-started/installation-and-upgrade/upgrade-and-roll-back-kubernetes#upgrading-the-kubernetes-version">Upgrading and Rolling Back Kubernetes</link> (Fazendo upgrade e rollback do Kubernetes).

source: Product Documentation
pt_br: Documentação do produto

source: Find the SUSE Edge for Telco documentation here
pt_br: Aqui você encontra a documentação do SUSE Edge for Telco

source: SUSE Edge for Telco (formerly known as Adaptive Telco Infrastructure Platform/ATIP) is a Telco-optimized edge computing platform that enables telecom companies to innovate and accelerate the modernization of their networks.
pt_br: O SUSE Edge for Telco (antes conhecido como Adaptive Telco Infrastructure Platform/ATIP) é uma plataforma de computação de borda otimizada para telecomunicações que permite que as empresas de telecomunicações inovem e acelerem a modernização de suas redes.

source: SUSE Edge for Telco is a complete Telco cloud stack for hosting CNFs such as 5G Packet Core and Cloud RAN.
pt_br: SUSE Edge for Telco é uma pilha de nuvem de telecomunicações completa para hospedar CNFs, como pacote 5G Core e Cloud RAN.

source: SUSE Edge for Telco is a platform designed for hosting modern, cloud native, Telco applications at scale from core to edge.
pt_br: O SUSE Edge for Telco é uma plataforma desenvolvida para hospedar em escala aplicativos de telecomunicações modernos e nativos de nuvem, do núcleo à borda.

source: This page explains the architecture and components used in SUSE Edge for Telco.
pt_br: Esta página explica a arquitetura e os componentes usados no SUSE Edge for Telco.

source: SUSE Edge for Telco Architecture
pt_br: Arquitetura do SUSE Edge for Telco
