Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Rancher Turtles Airgap Resources
es: Recursos de Rancher Turtles para entornos aislados
ja: Rancher Turtlesエアギャップリソース
pt_br: Recursos de isolamento do Rancher Turtles
zh_cn: Rancher Turtles 隔离资源

source: Elemental Dashboard Extension
es: Extensión de panel de control de Elemental
ja: Elementalダッシュボード拡張機能
pt_br: Extensão de dashboard do Elemental
zh_cn: Elemental 仪表板扩展

source: <link xl:href="https://github.com/rancher/ui-plugin-charts/tree/4.0.0/charts/elemental/3.0.1">Elemental Extension Helm Chart</link>
es: <link xl:href="https://github.com/rancher/ui-plugin-charts/tree/4.0.0/charts/elemental/3.0.1">Chart de Helm de extensión de Elemental</link>
ja: <link xl:href="https://github.com/rancher/ui-plugin-charts/tree/4.0.0/charts/elemental/3.0.1">Elemental拡張機能Helmチャート</link>
pt_br: <link xl:href="https://github.com/rancher/ui-plugin-charts/tree/4.0.0/charts/elemental/3.0.1">Gráfico Helm da extensão do Elemental</link>
zh_cn: <link xl:href="https://github.com/rancher/ui-plugin-charts/tree/4.0.0/charts/elemental/3.0.1">Elemental 扩展 Helm chart</link>

source: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.3">NMConfigurator Upstream Release</link>
es: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.3">Versión superior de NM Configurator</link>
ja: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.3">NMConfiguratorアップストリームリリース</link>
pt_br: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.3">Versão upstream do NMConfigurator</link>
zh_cn: <link xl:href="https://github.com/suse-edge/nm-configurator/releases/tag/v0.3.3">NMConfigurator 上游版本</link>

source: Akri (Deprecated)
es: Akri (obsoleto)
ja: Akri (廃止)
zh_cn: Akri（已弃用）

source: SR-IOV Network Operator
es: Operador de red SR-IOV
zh_cn: SR-IOV 网络操作器

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/system-upgrade-controller:v0.16.0
es: <link xl:href="https://charts.rancher.io/index.yaml">Repositorio de charts de Helm de Rancher</link><?asciidoc-br?> registry.suse.com/rancher/system-upgrade-controller:v0.16.0
ja: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helmリポジトリ</link><?asciidoc-br?> registry.suse.com/rancher/system-upgrade-controller:v0.16.0
zh_cn: <link xl:href="https://charts.rancher.io/index.yaml">Rancher chart Helm 储存库</link><?asciidoc-br?> registry.suse.com/rancher/system-upgrade-controller:v0.16.0

source: Kiwi Builder
pt_br: Construtor Kiwi
zh_cn: Kiwi 构建器

source: Deprecated features
es: Funciones obsoletas
ja: 廃止された機能
zh_cn: 已弃用功能

source: Unless otherwise stated, these apply to the 3.4.0 release and all subsequent z-stream versions.
es: A menos que se indique lo contrario, esto se aplica a la versión 3.4.0 y a todas las versiones z-stream posteriores.
ja: 特に記載のない限り、これらは3.4.0リリースおよびそれ以降のすべてのzストリームバージョンに適用されます。
zh_cn: 除非另有说明，否则以下功能适用于 3.4.0 版本及后续所有 z-stream 版本。

source: Akri was a Technology Preview offering in previous Edge releases and is now deprecated. Removal is planned for a future release.
es: Akri se ofrecía como tecnología en fase preliminar en las versiones anteriores de Edge, pero se ha dejado de usar. Se tiene prevista su eliminación en una versión futura.
ja: Akriは、以前のEdgeリリースでは技術プレビュー製品でしたが、現在は廃止されています。今後のリリースで削除される予定です。
zh_cn: Akri 在之前的 Edge 版本中为技术预览功能，目前已弃用，计划在未来版本中去除。

source: Technology Previews
es: Tecnologías en fase preliminar
ja: 技術プレビュー
pt_br: Prévias de tecnologia
zh_cn: 技术预览

source: Single-stack IPv6 deployments are a Technology Preview offering and are not subject to the standard scope of support.
es: Los despliegues IPv6 de pila única se ofrecen como tecnología en fase preliminar y no están sujetos al alcance estándar de la asistencia técnica.
ja: シングルスタックIPv6デプロイメントは、技術プレビュー製品であり、標準的なサポート範囲の対象外です。
zh_cn: 单栈 IPv6 部署为技术预览功能，不纳入标准支持范围。

source: Precision Time Protocol (PTP) on downstream deployments is a Technology Preview offering and is not subject to standard scope of support.
es: El protocolo de tiempo de precisión (PTP) en despliegues descendentes se ofrece como tecnología en fase preliminar y no está sujeto al alcance estándar de la asistencia técnica.
ja: ダウンストリームデプロイメントにおけるPrecision Time Protocol (PTP)は、技術プレビュー製品であり、標準的なサポート範囲の対象外です。
pt_br: O Precision Time Protocol (PTP) em implantações downstream é uma oferta de prévia de tecnologia e não está sujeito ao escopo padrão de suporte.
zh_cn: 下游部署中的精确时间协议 (PTP) 为技术预览功能，不纳入标准支持范围。

source: BGP mode for MetalLB is a Technology Preview offering and is not subject to standard scope of support.
es: El modo BGP para MetalLB es una tecnología en fase preliminar y no está sujeto al alcance estándar de la asistencia técnica.
ja: MetalLBのBGPモードは、技術プレビュー製品であり、標準的なサポート範囲の対象外です。
zh_cn: MetalLB 的 BGP 模式为技术预览功能，不纳入标准支持范围。

source: Component Verification
es: Verificación de componentes
ja: コンポーネントの検証
pt_br: Verificação de componentes
zh_cn: 组件验证

source: The components mentioned above may be verified using the Software Bill Of Materials (SBOM) data - for example, using <literal>cosign</literal> as outlined below:
es: Los componentes mencionados anteriormente pueden verificarse utilizando los datos de la lista de materiales de software (SBOM), por ejemplo, utilizando <literal>cosign</literal> como se describe a continuación:
ja: 上記のコンポーネントはSoftware Bill Of Materials (SBOM)のデータを使用して検証できます。たとえば、以下に説明するように<literal>cosign</literal>を使用します。
pt_br: Os componentes mencionados acima podem ser verificados usando os dados do Software Bill Of Materials (SBOM), por exemplo, com o comando <literal>cosign</literal> conforme descrito abaixo:
zh_cn: 可以使用软件材料清单 (SBOM) 数据来验证上述组件 - 例如，如下所述使用 <literal>cosign</literal>：

source: Download the SUSE Edge Container public key from the <link xl:href="https://www.suse.com/support/security/keys/">SUSE Signing Keys source</link>:
es: Descargue la clave pública del contenedor de SUSE Edge desde la <link xl:href="https://www.suse.com/support/security/keys/">fuente de claves de firma de SUSE</link>:
ja: <link xl:href="https://www.suse.com/support/security/keys/">SUSE署名キーのソース</link>からSUSE Edge Containerの公開鍵をダウンロードします。
pt_br: Faça download da chave pública do SUSE Edge Container da <link xl:href="https://www.suse.com/support/security/keys/">fonte de chaves de assinatura da SUSE</link>:
zh_cn: 从 <link xl:href="https://www.suse.com/support/security/keys/">SUSE 签名密钥来源</link>下载 SUSE Edge 容器公共密钥：

source: Verify the container image hash, for example using <literal>crane</literal>:
es: Verifique el hash de la imagen del contenedor; por ejemplo, usando <literal>crane</literal>:
ja: コンテナイメージのハッシュを検証します。たとえば、<literal>crane</literal>を使用します。
pt_br: Verifique o hash da imagem do contêiner, usando, por exemplo, o <literal>crane</literal>:
zh_cn: 验证容器映像哈希，例如，使用 <literal>crane</literal> 进行验证：

source: For multi-arch images it is also necessary to specify a platform when obtaining the digest, e.g <literal>--platform linux/amd64</literal> or <literal>--platform linux/arm64</literal>. Failure to do this will result in an error in the following step (<literal>Error: no matching attestations</literal>).
es: Para imágenes de varias arquitecturas, también es necesario especificar una plataforma al obtener el resumen; por ejemplo, <literal>--platform linux/amd64</literal> o <literal>--platform linux/arm64</literal>. Si no se hace, en el siguiente paso se producirá el error <literal>Error: no matching attestations</literal> (Error: no hay certificaciones que coincidan).
ja: マルチアーキテクチャイメージの場合、ダイジェストを取得する際にはプラットフォームを指定する必要があります。例: <literal>--platform linux/amd64</literal>または<literal>--platform linux/arm64</literal>。指定しないと、次の手順でエラーが発生します(<literal>Error: no matching attestations (エラー: 一致する認証がありません)</literal>)。
pt_br: Para imagens de várias arquiteturas, também é necessário especificar uma plataforma ao obter o resumo, por exemplo, <literal>--platform linux/amd64</literal> ou <literal>--platform linux/arm64</literal>. Se isso não for feito, um erro será retornado na etapa seguinte (<literal>Error: no matching attestations</literal>, "Erro: não há atestados correspondentes").
zh_cn: 对于多体系结构映像，获取摘要时还需要指定平台，例如 <literal>--platform linux/amd64</literal> 或 <literal>--platform linux/arm64</literal>。如果不这样做，后续步骤中会出现错误 (<literal>Error: no matching attestations</literal>)。

source: Verify with <literal>cosign</literal>:
es: Verifíquelo con <literal>cosign</literal>:
ja: <literal>cosign</literal>を使用して検証します。
pt_br: Faça a verificação com o comando <literal>cosign</literal>:
zh_cn: 使用 <literal>cosign</literal> 进行验证：

source: Extract SBOM data as described at the <link xl:href="https://www.suse.com/support/security/sbom/">SUSE SBOM documentation</link>:
es: Extraiga los datos SBOM como se describe en la <link xl:href="https://www.suse.com/support/security/sbom/">documentación de SBOM de SUSE</link>:
ja: <link xl:href="https://www.suse.com/support/security/sbom/">SUSE SBOMドキュメント</link>の説明に従ってSBOMデータを抽出します。
pt_br: Extraia os dados do SBOM conforme descrito na <link xl:href="https://www.suse.com/support/security/sbom/">documentação do SBOM da SUSE</link>:
zh_cn: 按照 <link xl:href="https://www.suse.com/support/security/sbom/">SUSE SBOM 文档</link>中所述提取 SBOM 数据：

source: Refer to the <xref linkend="day-2-operations"/> for details around how to upgrade to a new release.
es: Consulte la <xref linkend="day-2-operations"/> para obtener información sobre cómo actualizar a una versión nueva.
ja: 新しいリリースにアップグレードする方法の詳細については、<xref linkend="day-2-operations"/>を参照してください。
pt_br: Consulte a <xref linkend="day-2-operations"/> para obter detalhes sobre como fazer upgrade para uma nova versão.
zh_cn: 有关如何升级到新版本的详细信息，请参见<xref linkend="day-2-operations"/>。

source: Product Support Lifecycle
es: Ciclo de vida de la asistencia técnica del producto
ja: 製品サポートライフサイクル
pt_br: Ciclo de vida de suporte do produto
zh_cn: 产品支持生命周期

source: SUSE Edge is backed by award-winning support from SUSE, an established technology leader with a proven history of delivering enterprise-quality support services. For more information, see <link xl:href="https://www.suse.com/lifecycle">https://www.suse.com/lifecycle</link> and the Support Policy page at <link xl:href="https://www.suse.com/support/policy.html">https://www.suse.com/support/policy.html</link>. If you have any questions about raising a support case, how SUSE classifies severity levels, or the scope of support, please see the Technical Support Handbook at <link xl:href="https://www.suse.com/support/handbook/">https://www.suse.com/support/handbook/</link>.
es: SUSE Edge cuenta con el galardonado servicio de asistencia técnica de SUSE, un líder tecnológico consolidado con una trayectoria probada en la prestación de servicios de asistencia técnica de calidad empresarial. Para obtener más información, consulte <link xl:href="https://www.suse.com/lifecycle">https://www.suse.com/lifecycle</link> y la página de la política de asistencia técnica en <link xl:href="https://www.suse.com/support/policy.html">https://www.suse.com/support/policy.html</link>. Si tiene alguna pregunta sobre cómo abrir un caso de asistencia, cómo clasifica SUSE los niveles de gravedad o el alcance de la asistencia, consulte el Manual de asistencia técnica en <link xl:href="https://www.suse.com/support/handbook/">https://www.suse.com/support/handbook/</link>.
ja: SUSE Edgeは、SUSEが提供する定評あるサポートに支えられています。SUSEは、エンタープライズ品質のサポートサービスの提供において確固たる実績を誇るテクノロジリーダーです。詳細については、<link xl:href="https://www.suse.com/lifecycle">https://www.suse.com/lifecycle</link>、およびサポートポリシーのページ(<link xl:href="https://www.suse.com/support/policy.html">https://www.suse.com/support/policy.html</link>)を参照してください。サポートケースの作成、SUSEが重大度レベルを分類する方法、またはサポートの範囲について質問がある場合は、テクニカルサポートハンドブック(<link xl:href="https://www.suse.com/support/handbook/">https://www.suse.com/support/handbook/</link>)を参照してください。
pt_br: O SUSE Edge conta com o suporte reconhecido da SUSE, líder consagrada em tecnologia com um histórico comprovado de prestação de serviços de suporte de qualidade empresarial. Para obter mais informações, visite <link xl:href="https://www.suse.com/lifecycle">https://www.suse.com/lifecycle</link> e a página da política de suporte em <link xl:href="https://www.suse.com/support/policy.html">https://www.suse.com/support/policy.html</link>. Se você tiver dúvidas sobre como criar um caso de suporte, como a SUSE classifica os níveis de gravidade ou sobre o escopo do suporte, consulte o Manual de Suporte Técnico em <link xl:href="https://www.suse.com/support/handbook/">https://www.suse.com/support/handbook/</link>.
zh_cn: SUSE Edge 拥有 SUSE 屡获殊荣的支持服务作为后盾。SUSE 是公认的技术领导者，在提供企业级品质支持服务方面有着久经验证的历史。有关详细信息，请参见 <link xl:href="https://www.suse.com/lifecycle">https://www.suse.com/lifecycle</link> 和支持策略页面 (<link xl:href="https://www.suse.com/support/policy.html">https://www.suse.com/support/policy.html</link>)。如果您在提交支持案例、SUSE 如何划分严重性级别或支持范围方面有任何疑问，请参见技术支持手册 (<link xl:href="https://www.suse.com/support/handbook/">https://www.suse.com/support/handbook/</link>)。

source: SUSE Edge "3.4" is supported for 24-months of production support, with an initial 6-months of "full support", followed by 18-months of "maintenance support". After these support phases the product reaches "end of life" (EOL) and is no longer supported. More info about the lifecycle phases can be found in the table below:
es: SUSE Edge "3.4" cuenta con 24 meses de asistencia para producción, con 6 meses iniciales de "asistencia completa", seguidos de 18 meses de "asistencia de mantenimiento". Tras estas fases, el producto alcanza el "fin de vida útil" y deja de recibir asistencia. En la siguiente tabla se ofrece más información sobre las fases del ciclo de vida:
ja: SUSE Edge「3.4」は24か月間の運用サポートでサポートされ、最初の6か月間は「完全サポート」、その後の18か月間は「保守サポート」が提供されます。これらのサポートフェーズ後、製品は「サポート終了済み」(EOL)となり、サポートは終了となります。ライフサイクルフェーズの詳細については、以下の表を参照してください。
zh_cn: SUSE Edge“3.4”版本提供 24 个月的生产支持，其中前 6 个月提供“全面支持”，随后 18 个月提供“维护支持”。在这些支持阶段结束后，产品将进入“生命周期终止”(EOL) 状态，不再提供任何支持。有关各生命周期阶段的详细信息，请参见下表：

source: <emphasis role="strong">Full Support (6 months)</emphasis>
es: <emphasis role="strong">Asistencia completa (6 meses)</emphasis>
ja: <emphasis role="strong">完全サポート(6か月)</emphasis>
pt_br: <emphasis role="strong">Suporte completo (6 meses)</emphasis>
zh_cn: <emphasis role="strong">全面支持（6 个月）</emphasis>

source: Urgent and selected high-priority bug fixes will be released during the full support window, and all other patches (non-urgent, enhancements, new capabilities) will be released via the regular release schedule.
es: Durante el periodo de asistencia completa, se publicarán correcciones de errores urgentes y seleccionadas de alta prioridad. El resto de parches (no urgentes, mejoras, nuevas capacidades) se publicarán según el calendario de lanzamientos habitual.
ja: 緊急かつ選択された優先度の高いバグ修正は、完全サポート期間中にリリースされます。その他のすべてのパッチ(緊急でないもの、機能強化、新機能)は、通常のリリーススケジュールに従ってリリースされます。
pt_br: Correções de bugs urgentes e de alta prioridade selecionadas serão lançadas durante a janela de suporte completo, e todos os outros patches (não urgentes, melhorias, novos recursos) serão lançados de acordo com a programação de lançamento regular.
zh_cn: 在全面支持期内，会发布紧急和选定的高优先级 bug 修复，其他所有补丁（非紧急修复、功能增强、新功能）将按常规发布计划发布。

source: <emphasis role="strong">Maintenance Support (18 months)</emphasis>
es: <emphasis role="strong">Asistencia de mantenimiento (18 meses)</emphasis>
ja: <emphasis role="strong">保守サポート(18 か月)</emphasis>
zh_cn: <emphasis role="strong">维护支持（18 个月）</emphasis>

source: During this period, only critical fixes will be released via patches. Other bug fixes may be released at SUSE’s discretion but should not be expected.
es: Durante este periodo, solo se publicarán correcciones críticas mediante parches. Otras correcciones de errores podrán publicarse a discreción de SUSE, pero no deben esperarse.
ja: この期間中は、重要な修正のみがパッチとしてリリースされます。その他のバグ修正はSUSEの裁量によりリリースされる可能性がありますが、必ずしも提供されるとは限りません。
pt_br: Durante esse período, apenas correções críticas serão lançadas por meio de patches. Outras correções de bugs poderão ser lançadas a critério da SUSE, mas não devem ser esperadas.
zh_cn: 在此期间，仅通过补丁发布关键修复。其他 bug 修复可能由 SUSE 酌情发布，但不做保证。

source: <emphasis role="strong">End of Life (EOL)</emphasis>
es: <emphasis role="strong">Fin de vida útil</emphasis>
ja: <emphasis role="strong">サポート終了済み(EOL)</emphasis>
pt_br: <emphasis role="strong">Fim do serviço (EOL, End of Life)</emphasis>
zh_cn: <emphasis role="strong">生命周期终止 (EOL)</emphasis>

source: Once a product release reaches its End of Life date, the customer may continue to use the product within the terms of product licensing agreement. Support Plans from SUSE do not apply to product releases past their EOL date.
es: Una vez que un producto alcanza su fecha de fin de vida útil, el cliente puede seguir utilizándolo dentro de los términos del contrato de licencia del producto. Los planes de asistencia de SUSE no se aplican a los productos que hayan superado su fecha de fin de vida útil.
ja: 製品リリースがサポート終了済み日を迎えた場合、顧客は製品ライセンス契約の条件に従い、製品を引き続き使用することができます。SUSEのサポートプランは、EOL日を過ぎた製品リリースには適用されません。
pt_br: Quando um produto chega à data de fim do serviço, o cliente ainda pode usá-lo nos termos do contrato de licenciamento do produto. Os planos de suporte da SUSE não são válidos para versões de produtos que ultrapassaram a data EOL.
zh_cn: 产品版本到达生命周期终止日期后，客户可根据产品许可协议继续使用该产品，但 SUSE 的支持计划不再适用于已进入生命周期终止状态的产品版本。

source: Unless explicitly stated, all components listed are considered Generally Available (GA), and are covered by SUSE’s standard scope of support. Some components may be listed as "Technology Preview", where SUSE is providing customers with access to early pre-GA features and functionality for evaluation, but are not subject to the standard support policies and are not recommended for production use-cases. SUSE very much welcomes feedback and suggestions on the improvements that can be made to Technology Preview components, but SUSE reserves the right to deprecate a Technology Preview feature before it becomes Generally Available if it doesn’t meet the needs of our customers or doesn’t reach a state of maturity that we require.
es: A menos que se indique explícitamente lo contrario, todos los componentes mostrados se consideran de disponibilidad general y están cubiertos por el alcance estándar de la asistencia técnica de SUSE. Algunos componentes pueden aparecer como "tecnología en fase preliminar", lo que significa que SUSE proporciona a los clientes acceso a características y funcionalidades antes de que estén disponibles de forma generalizada para su evaluación, pero no están sujetos a las políticas de asistencia técnica estándar y no se recomiendan para casos de uso en producción. SUSE agradece enormemente los comentarios y sugerencias sobre las mejoras que se pueden realizar en los componentes de tecnología en fase preliminar, pero se reserva el derecho de descartar una función de tecnología en fase preliminar antes de que pase a estar disponible de forma generalizada si no satisface las necesidades de nuestros clientes o no alcanza el estado de madurez que requerimos.
ja: 明記されていない限り、記載されているコンポーネントはすべて一般提供(GA)とみなされ、SUSEの標準のサポート範囲の対象となります。一部のコンポーネントは「技術プレビュー」として記載されている場合があります。この場合、SUSEは評価のためにGA前の機能への早期アクセスをお客様に提供しますが、これらの機能には標準のサポートポリシーが適用されず、運用ユースケースには推奨されません。SUSEでは、技術プレビューのコンポーネントに関するフィードバックや、当該コンポーネントの改良についてのご提案を心からお待ちしております。しかし、機能がお客様のニーズを満たさない場合やSUSEが求める成熟度に達しない場合、一般提供になる前に技術プレビューの機能を廃止する権利を留保します。
pt_br: Exceto se for claramente especificado, todos os componentes listados são considerados em disponibilidade geral (GA, Generally Available) e cobertos pelo escopo padrão de suporte da SUSE. Alguns componentes podem constar na lista como "prévia de tecnologia", em que a SUSE concede aos clientes acesso antecipado a recursos e funcionalidades pré-GA para avaliação, mas que não estão sujeitos às políticas de suporte padrão e não são recomendados em casos de uso de produção. A SUSE tem grande consideração pelo feedback e pelas sugestões sobre melhorias que possam ser feitas nos componentes em prévia de tecnologia, mas reserva-se o direito de descontinuar um recurso em prévia de tecnologia antes de lançá-lo em disponibilidade geral, caso ele não atenda às necessidades de nossos clientes ou não atinja o estado de maturidade exigido pela SUSE.
zh_cn: 除非明确说明，否则列出的所有组件均被视为正式发布 (GA) 版本，并涵盖在 SUSE 的标准支持范围内。某些组件可能以“技术预览”版本的形式列出，SUSE 通过此类版本让客户提前体验尚未正式发布的特性和功能以进行评估，但这些组件没有标准支持政策的保障，不建议将其用于生产使用场景。SUSE 非常欢迎大家提供针对技术预览组件的改进意见和建议，但如果技术预览功能无法满足客户的需求或者达不到我们要求的成熟度，SUSE 保留在正式发布之前弃用该功能的权利。

source: Please note that SUSE must occasionally deprecate features or change API specifications. Reasons for feature deprecation or API change could include a feature being updated or replaced by a new implementation, a new feature set, upstream technology is no longer available, or the upstream community has introduced incompatible changes. It is not intended that this will ever happen within a given minor release (x.z), and so all z-stream releases will maintain API compatibility and feature functionality. SUSE will endeavor to provide deprecation warnings with plenty of notice within the release notes, along with workarounds, suggestions, and mitigations to minimize service disruption.
es: Tenga en cuenta que SUSE debe, ocasionalmente, dejar de utilizar funciones o cambiar las especificaciones de la API. Las razones para dejar de utilizar una función o cambiar la API pueden incluir la actualización o sustitución de una función por una nueva implementación, un nuevo conjunto de funciones, la indisponibilidad de la tecnología original o la introducción de cambios incompatibles por parte de la comunidad original. No se pretende que esto ocurra nunca dentro de una versión menor determinada (x.z), por lo que todas las versiones z-stream mantendrán la compatibilidad de la API y la funcionalidad de las funciones. SUSE se esforzará por proporcionar avisos de descatalogación con suficiente antelación en las notas de la versión, junto con soluciones alternativas, sugerencias y medidas paliativas para minimizar la interrupción del servicio.
ja: SUSEは場合により、機能の廃止やAPIの仕様変更を行わなければならないことがあることに注意してください。機能の廃止やAPIの変更の理由としては、機能が新しい実装によって更新または置き換えられた、新しい機能セットが導入された、アップストリームの技術が利用できなくなった、アップストリームコミュニティによって互換性のない変更が導入された、などが考えられます。これは特定のマイナーリリース(x.z)内で発生することは意図されていないため、すべてのzストリームリリースではAPIの互換性と機能が維持されます。SUSEは、廃止に関する警告をリリースノート内で十分に余裕をもって提供し、併せて回避策、推奨事項、サービスの中断を最小限に抑える軽減策も提供するよう努めます。
pt_br: Observe que a SUSE deve, ocasionalmente, descontinuar recursos ou alterar especificações de APIs. Alguns motivos para descontinuar um recurso ou alterar uma API são a atualização do recurso ou sua substituição por uma nova implementação, um novo conjunto de recursos, uma tecnologia upstream que não está mais disponível ou a comunidade upstream que fez alterações incompatíveis. Não há intenção de que isso aconteça dentro de uma determinada versão secundária (x.z) e, portanto, todas as versões z-stream manterão a compatibilidade com as APIs e as funcionalidades dos recursos. A SUSE se empenhará em enviar avisos sobre descontinuação com muito tempo de antecedência como parte das Notas de lançamento, junto com soluções alternativas, sugestões e mitigações para minimizar interrupções de serviços.
zh_cn: 请注意，SUSE 必须偶尔弃用功能或更改 API 规范。弃用功能或更改 API 的原因包括相应功能已更新或由新的实现取代、有新的功能集、上游技术不再可用，或者上游社区引入了不兼容的更改。在给定的次要版本 (x.z) 中，这种情况预期永远不会发生，因此所有 z-stream 版本都将保持 API 兼容性和原有功能。SUSE 将尽力在发行说明中提供弃用警告并发出充足的通告，同时提供解决方法、建议和缓解措施，以最大程度地减少服务中断。
