Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Currently, there are two ways to perform "Day 2" operations on your <literal>management</literal> cluster:
es: Actualmente, hay dos formas de realizar operaciones de "día 2" en su clúster de <literal>gestión</literal>:
ja: 現在、<literal>管理</literal>クラスタで「Day 2」操作を実行するには、次の2つの方法があります。
pt_br: Atualmente, há duas maneiras de realizar as operações de "dia 2" no cluster de <literal>gerenciamento</literal>:
zh_cn: 目前，可以通过两种方式在<literal>管理</literal>群集上执行“Day 2”操作：

source: Through <xref linkend="components-upgrade-controller"/> - <xref linkend="management-day2-upgrade-controller"/>
es: Mediante <xref linkend="components-upgrade-controller"/>: <xref linkend="management-day2-upgrade-controller"/>
ja: <xref linkend="components-upgrade-controller"/> - <xref linkend="management-day2-upgrade-controller"/>を通じて
pt_br: Usando o <xref linkend="components-upgrade-controller"/>: <xref linkend="management-day2-upgrade-controller"/>
zh_cn: 通过 <xref linkend="components-upgrade-controller"/> - <xref linkend="management-day2-upgrade-controller"/>

source: Through <xref linkend="components-fleet"/> - <xref linkend="management-day2-fleet"/>
es: Mediante <xref linkend="components-fleet"/>: <xref linkend="management-day2-fleet"/>
ja: <xref linkend="components-fleet"/> - <xref linkend="management-day2-fleet"/>を通じて
pt_br: Usando o <xref linkend="components-fleet"/>: <xref linkend="management-day2-fleet"/>
zh_cn: 通过 <xref linkend="components-fleet"/> - <xref linkend="management-day2-fleet"/>

source: The <literal>Upgrade Controller</literal> currently only supports <literal>Day 2</literal> operations for <emphasis role="strong">non air-gapped management</emphasis> clusters.
es: <literal>Upgrade Controller</literal> actualmente solo admite operaciones de <literal>día 2</literal> para clústeres <emphasis role="strong">que no estén en entornos aislados</emphasis>.
ja: <literal>Upgrade Controller</literal>は現在、<emphasis role="strong">非エアギャップ管理</emphasis>クラスタの<literal>Day 2</literal>操作のみをサポートしています。
pt_br: O <literal>Controller de upgrade</literal> oferece suporte apenas a operações de <literal>dia 2</literal> em clusters de <emphasis role="strong">gerenciamento não air-gapped</emphasis>.
zh_cn: <literal>升级控制器</literal>目前仅支持<emphasis role="strong">非隔离管理</emphasis>群集的 <literal>Day 2</literal> 操作。

source: This section covers how to perform the various <literal>Day 2</literal> operations related to upgrading your <literal>management</literal> cluster from one Edge platform version to another.
es: En esta sección se explica cómo realizar las distintas operaciones de <literal>día 2</literal> relacionadas con la actualización del clúster de <literal>gestión</literal> de una versión de la plataforma Edge a otra.
ja: このセクションでは、あるEdgeプラットフォームバージョンから別のバージョンに <literal>管理</literal>クラスタをアップグレードする方法に関連する さまざまな<literal>Day 2</literal>操作を実行する方法について説明します。
pt_br: Esta seção explica como realizar as diversas operações de <literal>dia 2</literal> relacionadas ao upgrade do cluster de <literal>gerenciamento</literal> de uma versão da plataforma Edge para outra.
zh_cn: 本节介绍如何执行与将<literal>管理</literal>群集从一个 Edge 平台版本升级到另一个版本相关的各种 <literal>Day 2</literal> 操作。

source: The <literal>Day 2</literal> operations are automated by the Upgrade Controller (<xref linkend="components-upgrade-controller"/>) and include:
es: Las operaciones de <literal>día 2</literal> se automatizan con Upgrade Controller (<xref linkend="components-upgrade-controller"/>) e incluyen:
ja: <literal>Day 2</literal>操作は、Upgrade Controller (<xref linkend="components-upgrade-controller"/>)によって自動化され、以下のものが含まれます。
pt_br: O Controller de upgrade (<xref linkend="components-upgrade-controller"/>) automatiza as operações de <literal>dia 2</literal>, o que inclui:
zh_cn: <literal>Day 2</literal> 操作由升级控制器（<xref linkend="components-upgrade-controller"/>）自动执行，包括：

source: SUSE Linux Micro (<xref linkend="components-slmicro"/>) OS upgrade
es: Actualización del sistema operativo SUSE Linux Micro (<xref linkend="components-slmicro"/>)
ja: SUSE Linux Micro (<xref linkend="components-slmicro"/>) OSのアップグレード
pt_br: Upgrade de sistema operacional SUSE Linux Micro (<xref linkend="components-slmicro"/>)
zh_cn: SUSE Linux Micro（<xref linkend="components-slmicro"/>）操作系统升级

source: <xref linkend="components-rke2"/> or <xref linkend="components-k3s"/> Kubernetes upgrade
es: Actualización de kubernetes con <xref linkend="components-rke2"/> o <xref linkend="components-k3s"/>
ja: <xref linkend="components-rke2"/>または<xref linkend="components-k3s"/> Kubernetesのアップグレード
pt_br: Upgrade de Kubernetes com <xref linkend="components-rke2"/> ou <xref linkend="components-k3s"/>
zh_cn: <xref linkend="components-rke2"/>或<xref linkend="components-k3s"/>Kubernetes 升级

source: SUSE additional components (SUSE Rancher Prime, SUSE Security, etc.) upgrade
es: Actualización de componentes adicionales de SUSE (SUSE Rancher Prime, SUSE Security, etc.)
ja: SUSE追加コンポーネント(SUSE Rancher Prime、SUSE Securityなど)のアップグレード
pt_br: Upgrade de componentes adicionais do SUSE (SUSE Rancher Prime, SUSE Security etc.)
zh_cn: 其他 SUSE 组件（SUSE Rancher Prime、SUSE Security 等）升级

source: Before upgrading your <literal>management</literal> cluster, the following prerequisites must be met:
es: Antes de actualizar su clúster de <literal>gestión</literal>, deben cumplirse los siguientes requisitos previos:
ja: <literal>管理</literal>クラスタをアップグレードする前に、次の前提条件が満たされている必要があります。
pt_br: Antes de fazer upgrade do cluster de <literal>gerenciamento</literal>, é necessário cumprir os seguintes pré-requisitos:
zh_cn: 升级<literal>管理</literal>群集之前，必须满足以下先决条件：

source: <literal>SCC registered nodes</literal> - ensure your cluster nodes' OS are registered with a subscription key that supports the OS version specified in the Edge release (<xref linkend="release-notes"/>) you intend to upgrade to.
es: <literal>Nodos registrados en el SCC</literal>: asegúrese de que los sistemas operativos de los nodos del clúster estén registrados con una clave de suscripción que admita la versión del sistema operativo especificada en la versión de Edge (<xref linkend="release-notes"/>) a la que desea actualizar.
ja: <literal>SCC登録ノード</literal> - クラスタのノードのOSが、アップグレードするEdgeリリース(<xref linkend="release-notes"/>)で指定されているOSバージョンをサポートするサブスクリプションキーで登録されていることを確認してください。
pt_br: <literal>Nós registrados do SCC</literal>: assegure que os nós do cluster do seu sistema operacional sejam registrados com uma chave de assinatura compatível com a versão de sistema operacional especificada no lançamento do Edge (<xref linkend="release-notes"/>) para o qual você pretende fazer upgrade.
zh_cn: <literal>已在 SCC 中注册的节点</literal> - 确保群集节点的操作系统已使用相应的订阅密钥注册，且该密钥支持要升级到的 Edge 版本中指定的操作系统版本（<xref linkend="release-notes"/>）。

source: <literal>Upgrade Controller</literal> - make sure that the <literal>Upgrade Controller</literal> has been deployed on your <literal>management</literal> cluster. For installation steps, refer to <xref linkend="components-upgrade-controller-installation"/>.
es: <literal>Upgrade Controller</literal>: asegúrese de que <literal>Upgrade Controller</literal> se haya desplegado en su clúster de <literal>gestión</literal>. Para conocer los pasos de instalación, consulte la <xref linkend="components-upgrade-controller-installation"/>.
ja: <literal>Upgrade Controller</literal> - <literal>Upgrade Controller</literal>が<literal>管理</literal>クラスタにデプロイされていることを確認します。インストール手順については、<xref linkend="components-upgrade-controller-installation"/>を参照してください。
pt_br: <literal>Controller de upgrade</literal>: garanta que o <literal>Controller de upgrade</literal> tenha sido implantado no cluster de <literal>gerenciamento</literal>. Para ver as etapas de instalação, consulte a <xref linkend="components-upgrade-controller-installation"/>.
zh_cn: <literal>升级控制器</literal> - 确保<literal>管理</literal>群集上已部署<literal>升级控制器</literal>。有关安装步骤，请参见<xref linkend="components-upgrade-controller-installation"/>。

source: Upgrade
es: Actualización
ja: アップグレード
pt_br: Fazer upgrade
zh_cn: 升级

source: Determine the Edge release (<xref linkend="release-notes"/>) version that you wish to upgrade your <literal>management</literal> cluster to.
es: Determine la versión de Edge (<xref linkend="release-notes"/>) a la que desea actualizar el clúster de <literal>gestión</literal>.
ja: <literal>管理</literal>クラスタをアップグレードするEdgeリリース(<xref linkend="release-notes"/>)バージョンを決定します。
pt_br: Determine a versão de lançamento do Edge (<xref linkend="release-notes"/>) para a qual você quer fazer upgrade do seu cluster de <literal>gerenciamento</literal>.
zh_cn: 确定要将<literal>管理</literal>群集升级到哪个 Edge 版本（<xref linkend="release-notes"/>）。

source: In the <literal>management</literal> cluster, deploy an <literal>UpgradePlan</literal> that specifies the desired <literal>release version</literal>. The <literal>UpgradePlan</literal> must be deployed in the namespace of the <literal>Upgrade Controller</literal>.
es: En el clúster de <literal>gestión</literal>, despliegue un recurso <literal>UpgradePlan</literal> que especifique la <literal>versión</literal> deseada. <literal>UpgradePlan</literal> debe desplegarse en el espacio de nombres de <literal>Upgrade Controller</literal>.
ja: <literal>管理</literal>クラスタに、目的の<literal>リリースバージョン</literal>を指定する<literal>UpgradePlan</literal>をデプロイします。<literal>UpgradePlan</literal>は<literal>Upgrade Controller</literal>のネームスペースにデプロイされる必要があります。
pt_br: No cluster de <literal>gerenciamento</literal>, implante um <literal>UpgradePlan</literal> que especifique a <literal>versão de lançamento</literal> desejada. É necessário implantar o <literal>UpgradePlan</literal> no namespace do <literal>Controller de upgrade</literal>.
zh_cn: 在<literal>管理</literal>群集中，部署一个指定目标<literal>版本</literal>的 <literal>UpgradePlan</literal>。<literal>UpgradePlan</literal> 必须部署在<literal>升级控制器</literal>的名称空间中。

source: There may be use-cases where you would want to make additional configurations over the <literal>UpgradePlan</literal>. For all possible configurations, refer to <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
es: Puede haber casos en los que desee realizar configuraciones adicionales sobre el recurso <literal>UpgradePlan</literal>. Para conocer todas las configuraciones posibles, consulte la <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
ja: <literal>UpgradePlan</literal>に対して追加の設定を行いたいユースケースがある場合があります。すべての可能な設定については、<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>を参照してください。
pt_br: Em alguns casos de uso, talvez você queira fazer configurações adicionais no <literal>UpgradePlan</literal>. Para saber todas as configurações possíveis, consulte a <xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>.
zh_cn: 某些情况下，除了 <literal>UpgradePlan</literal> 之外，您可能还想进行其他配置。有关所有可能的配置，请参见<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>。

source: Deploying the <literal>UpgradePlan</literal> to the <literal>Upgrade Controller’s</literal> namespace will begin the <literal>upgrade process</literal>.
es: El despliegue de <literal>UpgradePlan</literal> en el espacio de nombres de <literal>Upgrade Controller</literal> iniciará el <literal>proceso de actualización</literal>.
ja: <literal>Upgrade Controller</literal>のネームスペースに<literal>UpgradePlan</literal>をデプロイすると、<literal>アップグレードプロセス</literal>が開始されます。
pt_br: A implantação do <literal>UpgradePlan</literal> no namespace do <literal>Controller de upgrade</literal> inicia o <literal>processo de upgrade</literal>.
zh_cn: 将 <literal>UpgradePlan</literal> 部署到<literal>升级控制器</literal>的名称空间后，<literal>升级过程</literal>即会开始。

source: For more information on the actual <literal>upgrade process</literal>, refer to <xref linkend="components-upgrade-controller-how"/>.
es: Para obtener más información sobre el <literal>proceso de actualización</literal> real, consulte la <xref linkend="components-upgrade-controller-how"/>.
ja: 実際の<literal>アップグレードプロセス</literal>の詳細については、<xref linkend="components-upgrade-controller-how"/>を参照してください。
pt_br: Para obter mais informações sobre o <literal>processo de upgrade</literal> real, consulte a <xref linkend="components-upgrade-controller-how"/>.
zh_cn: 有关实际<literal>升级过程</literal>的详细信息，请参见<xref linkend="components-upgrade-controller-how"/>。

source: For information on how to track the <literal>upgrade process</literal>, refer to <xref linkend="components-upgrade-controller-how-track"/>.
es: Para obtener más información sobre cómo hacer un seguimiento del <literal>proceso de actualización</literal>, consulte la <xref linkend="components-upgrade-controller-how-track"/>.
ja: <literal>アップグレードプロセス</literal>を追跡する方法については、<xref linkend="components-upgrade-controller-how-track"/>を参照してください。
pt_br: Para obter informações sobre como acompanhar o <literal>processo de upgrade</literal>, consulte a <xref linkend="components-upgrade-controller-how-track"/>.
zh_cn: 有关如何跟踪<literal>升级过程</literal>的信息，请参见<xref linkend="components-upgrade-controller-how-track"/>。

source: This section offers information on how to perform "Day 2" operations using the Fleet (<xref linkend="components-fleet"/>) component.
es: Esta sección ofrece información sobre cómo realizar operaciones de "día 2" utilizando el componente Fleet (<xref linkend="components-fleet"/>).
ja: このセクションでは、Fleet (<xref linkend="components-fleet"/>)コンポーネントを使用して「Day 2」操作を実行する方法について説明します。
pt_br: Esta seção apresenta informações sobre como executar operações de "dia 2" usando o componente Fleet (<xref linkend="components-fleet"/>).
zh_cn: 本节提供有关如何使用 Fleet（<xref linkend="components-fleet"/>）组件执行“Day 2”操作的信息。

source: <xref linkend="management-day2-fleet-components"/> - default components used for all "Day 2" operations.
es: <xref linkend="management-day2-fleet-components"/>: los componentes predeterminados usados para todas las operaciones de "día 2".
ja: <xref linkend="management-day2-fleet-components"/> - すべての「Day 2」操作に使用されるデフォルトコンポーネント。
pt_br: <xref linkend="management-day2-fleet-components"/>: componentes padrão usados para todas as operações de "dia 2".
zh_cn: <xref linkend="management-day2-fleet-components"/> - 执行所有“Day 2”操作需要使用的默认组件。

source: <xref linkend="management-day2-fleet-determine-use-case"/> - provides an overview of the Fleet custom resources that will be used and their suitability for different "Day 2" operations use-cases.
es: <xref linkend="management-day2-fleet-determine-use-case"/>: proporciona una descripción general de los recursos personalizados de Fleet que se usarán y su idoneidad para diferentes casos de uso de operaciones de "día 2".
ja: <xref linkend="management-day2-fleet-determine-use-case"/> - 使用されるFleetカスタムリソースの概要と、これらのリソースがさまざまな「Day 2」操作のユースケースに適しているかどうかを説明します。
pt_br: <xref linkend="management-day2-fleet-determine-use-case"/>: apresenta uma visão geral dos recursos personalizados do Fleet que serão usados e como se adaptam aos diferentes casos de uso das operações de "dia 2".
zh_cn: <xref linkend="management-day2-fleet-determine-use-case"/> - 概述将使用的 Fleet 自定义资源及其在不同“Day 2”操作场景中的适用性。

source: <xref linkend="management-day2-upgrade-workflow"/> - provides a workflow guide for executing "Day 2" operations with Fleet.
es: <xref linkend="management-day2-upgrade-workflow"/>: proporciona una guía del flujo de trabajo para ejecutar operaciones de "día 2" con Fleet.
ja: <xref linkend="management-day2-upgrade-workflow"/> - Fleetを使用して「Day 2」操作を実行するためのワークフローガイドを提供します。
pt_br: <xref linkend="management-day2-upgrade-workflow"/>: fornece um guia de fluxo de trabalho para execução de operações de "dia 2" com o Fleet.
zh_cn: <xref linkend="management-day2-upgrade-workflow"/> - 提供使用 Fleet 执行“Day 2”操作的工作流程指南。

source: <xref linkend="management-day2-fleet-os-upgrade"/> - describes how to do OS upgrades using Fleet.
es: <xref linkend="management-day2-fleet-os-upgrade"/>: describe cómo realizar actualizaciones del sistema operativo con Fleet.
ja: <xref linkend="management-day2-fleet-os-upgrade"/> - Fleetを使用してOSアップグレードを実行する方法を説明します。
pt_br: <xref linkend="management-day2-fleet-os-upgrade"/>: descreve como fazer upgrades de sistema operacional com o Fleet.
zh_cn: <xref linkend="management-day2-fleet-os-upgrade"/> - 说明如何使用 Fleet 进行操作系统升级。

source: <xref linkend="management-day2-fleet-k8s-upgrade"/> - describes how to do Kubernetes version upgrades using Fleet.
es: <xref linkend="management-day2-fleet-k8s-upgrade"/>: describe cómo realizar actualizaciones de la versión de Kubernetes con Fleet.
ja: <xref linkend="management-day2-fleet-k8s-upgrade"/> - Fleetを使用してKubernetesバージョンのアップグレードを実行する方法を説明します。
pt_br: <xref linkend="management-day2-fleet-k8s-upgrade"/>: descreve como fazer upgrades de versão do Kubernetes com o Fleet.
zh_cn: <xref linkend="management-day2-fleet-k8s-upgrade"/> - 说明如何使用 Fleet 进行 Kubernetes 版本升级。

source: <xref linkend="management-day2-fleet-helm-upgrade"/> - describes how to do Helm chart upgrades using Fleet.
es: <xref linkend="management-day2-fleet-helm-upgrade"/>: describe cómo realizar actualizaciones de charts de Helm con Fleet.
ja: <xref linkend="management-day2-fleet-helm-upgrade"/> - Fleetを使用してHelmチャートのアップグレードを実行する方法を説明します。
pt_br: <xref linkend="management-day2-fleet-helm-upgrade"/>: descreve como fazer upgrades de gráficos Helm com o Fleet.
zh_cn: <xref linkend="management-day2-fleet-helm-upgrade"/> - 说明如何使用 Fleet 进行 Helm chart 升级。

source: Below you can find a description of the default components that should be set up on your <literal>management</literal> cluster so that you can successfully perform "Day 2" operations using Fleet.
es: A continuación, encontrará una descripción de los componentes predeterminados que deben configurarse en su clúster de <literal>gestión</literal> para poder realizar correctamente las operaciones de "día 2" con Fleet.
ja: 以下に、Fleetを使用して「Day 2」操作を正常に実行できるように<literal>管理</literal>クラスタに設定する必要があるデフォルトコンポーネントの説明を記載しています。
pt_br: Veja a seguir uma descrição dos componentes padrão que você deve configurar no cluster de <literal>gerenciamento</literal> para realizar operações de "dia 2" com sucesso pelo Fleet.
zh_cn: 下文将介绍为使用 Fleet 顺利执行“Day 2”操作而应在<literal>管理</literal>群集上设置的默认组件。

source: <emphasis role="strong">Optional</emphasis>; Responsible for managing <literal>downstream clusters</literal> and deploying the <literal>System Upgrade Controller</literal> on your <literal>management cluster</literal>.
es: (<emphasis role="strong">Opcional</emphasis>) Es el responsable de gestionar los <literal>clústeres descendentes</literal> y de desplegar <literal>System Upgrade Controller</literal> en su <literal>clúster de gestión</literal>.
ja: <emphasis role="strong">オプション</emphasis>: <literal>ダウンストリームクラスタ</literal>を管理し、<literal>System Upgrade Controller</literal>を<literal>管理クラスタ</literal>上にデプロイする責任。
pt_br: (<emphasis role="strong">Opcional</emphasis>) Responsável por gerenciar os <literal>clusters downstream</literal> e implantar o <literal>System Upgrade Controller</literal> no <literal>cluster de gerenciamento</literal>.
zh_cn: <emphasis role="strong">可选</emphasis>组件；负责管理<literal>下游群集</literal>并在<literal>管理群集</literal>上部署<literal>系统升级控制器</literal>。

source: For more information, see <xref linkend="components-rancher"/>.
es: Para obtener más información, consulte el <xref linkend="components-rancher"/>.
ja: 詳細については、<xref linkend="components-rancher"/>を参照してください。
pt_br: Para obter mais informações, consulte o <xref linkend="components-rancher"/>.
zh_cn: 有关详细信息，请参见<xref linkend="components-rancher"/>。

source: System Upgrade Controller (SUC)
zh_cn: 系统升级控制器 (SUC)

source: <emphasis role="strong">System Upgrade Controller</emphasis> is responsible for executing tasks on specified nodes based on configuration data provided through a custom resource, called a <literal>Plan</literal>.
es: <emphasis role="strong">System Upgrade Controller</emphasis> es responsable de ejecutar tareas en nodos específicos según los datos de configuración proporcionados mediante un recurso personalizado, denominado <literal>plan</literal>.
ja: <emphasis role="strong">System Upgrade Controller</emphasis>は、 <literal>Plan</literal>と呼ばれるカスタムリソースを通じて提供される設定データに基づいて指定されたノードでタスクを実行する責任を負います。
pt_br: <emphasis role="strong">System Upgrade Controller</emphasis> é responsável por executar tarefas em nós especificados com base nos dados de configuração fornecidos por um recurso personalizado chamado <literal>plano</literal>.
zh_cn: <emphasis role="strong">系统升级控制器</emphasis>负责根据通过名为<literal>计划</literal>的自定义资源提供的配置数据，在指定节点上执行任务。

source: <emphasis role="strong">SUC</emphasis> is actively utilized to upgrade the operating system and Kubernetes distribution.
es: <emphasis role="strong">SUC</emphasis> se utiliza activamente para actualizar el sistema operativo y la distribución de Kubernetes.
ja: <emphasis role="strong">SUC</emphasis>は、オペレーティングシステムとKubernetesディストリビューションのアップグレードに積極的に活用されます。
pt_br: O <emphasis role="strong">SUC</emphasis> é ativamente usado para fazer upgrade do sistema operacional e da distribuição Kubernetes.
zh_cn: 系统会主动利用 <emphasis role="strong">SUC</emphasis> 升级操作系统和 Kubernetes 发行版。

source: For more information about the <emphasis role="strong">SUC</emphasis> component and how it fits in the Edge stack, see <xref linkend="components-system-upgrade-controller"/>.
es: Para obtener más información sobre el componente <emphasis role="strong">SUC</emphasis> y cómo encaja en la pila de Edge, consulte el <xref linkend="components-system-upgrade-controller"/>.
ja: <emphasis role="strong">SUC</emphasis>コンポーネントとそれがEdgeスタックにどのように適合するかに関する詳細については、<xref linkend="components-system-upgrade-controller"/>を参照してください。
pt_br: Para obter mais informações sobre o componente <emphasis role="strong">SUC</emphasis> e como ele se adapta à pilha do Edge, consulte o <xref linkend="components-system-upgrade-controller"/>.
zh_cn: 有关 <emphasis role="strong">SUC</emphasis> 组件及其如何安置到 Edge 堆栈中的详细信息，请参见<xref linkend="components-system-upgrade-controller"/>。

source: Determine your use-case
es: Determinación de su caso de uso
ja: ユースケースの決定
pt_br: Determinar seu caso de uso
zh_cn: 确定您的使用场景

source: Fleet uses two types of <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">custom resources</link> to enable the management of Kubernetes and Helm resources.
es: Fleet usa dos tipos de <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> para permitir la gestión de los recursos de Kubernetes y Helm.
ja: Fleetは2種類の<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">カスタムリソース</link>を使用してKubernetesおよびHelmリソースの管理を有効にします。
pt_br: O Fleet usa dois tipos de <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> para permitir o gerenciamento de recursos do Kubernetes e do Helm.
zh_cn: Fleet 使用两种<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">自定义资源</link>来实现对 Kubernetes 和 Helm 资源的管理。

source: Below you can find information about the purpose of these resources and the use-cases they are best suited for in the context of "Day 2" operations.
es: A continuación, encontrará información sobre la finalidad de estos recursos y los casos de uso para los que son más adecuados en el contexto de las operaciones de "día 2".
ja: 以下に、これらのリソースの目的と、「Day 2」操作のコンテキストに最適なユースケースに関する情報を示します。
pt_br: Veja a seguir as informações sobre a finalidade desses recursos e para quais casos de uso eles são mais adequados no contexto das operações de "dia 2".
zh_cn: 下文将介绍这些资源的用途，以及在“Day 2”操作情境中它们最适合的使用场景。
