Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: One component K3s leverages is <link xl:href="https://github.com/k3s-io/kine">KINE</link>, which is a shim enabling the replacement of etcd with alternate storage back-ends originally targeting relational databases. As JetStream provides a Key Value API, this makes it possible to have NATS as a back-end for the K3s cluster.
es: Uno de los componentes que aprovecha K3s es <link xl:href="https://github.com/k3s-io/kine">KINE</link>, que es un shim que permite sustituir etcd por interfaces finales de almacenamiento alternativas destinadas originalmente a bases de datos relacionales. Dado que JetStream proporciona una API de clave-valor, esto hace posible utilizar NATS como interfaz final para el clúster K3s.
ja: K3sが利用するコンポーネントの1つが<link xl:href="https://github.com/k3s-io/kine">KINE</link>です。KINEは、最初からリレーショナルデータベースをターゲットとした代替ストレージバックエンドでetcdを置き換えることを可能にするシムです。JetStreamはKey Value APIを備えているので、NATSをK3sクラスタのバックエンドとして利用することが可能です。
pt_br: Um componente que o K3s usa é o <link xl:href="https://github.com/k3s-io/kine">KINE</link>, um shim que permite a substituição do etcd por back ends de armazenamento alternativos originalmente destinados a bancos de dados relacionais. Como o JetStream fornece uma API de chave-valor, é possível usar o NATS como back end para o cluster K3s.
zh_cn: K3s 利用的一个组件是 <link xl:href="https://github.com/k3s-io/kine">KINE</link>，它是一种适配层，能够用最初面向关系数据库的其他存储后端替代 etcd。由于 JetStream 提供了键值对 API，因此可以将 NATS 用作 K3s 群集的后端。

source: There is an already merged PR which makes the built-in NATS in K3s straightforward, but the change is still <link xl:href="https://github.com/k3s-io/k3s/issues/7410#issue-1692989394">not included</link> in the K3s releases.
es: Ya existe una solicitud para simplificar la integración de NATS en K3s, pero los cambios aún <link xl:href="https://github.com/k3s-io/k3s/issues/7410#issue-1692989394">no se han incluido</link> en las versiones de K3s.
ja: K3sのビルトインNATSが容易になるマージ済みのPRがありますが、この変更はまだK3sリリースに<link xl:href="https://github.com/k3s-io/k3s/issues/7410#issue-1692989394">含まれていません</link>。
pt_br: Já existe uma PR mesclada que simplifica o NATS incorporado no K3s, mas a alteração ainda <link xl:href="https://github.com/k3s-io/k3s/issues/7410#issue-1692989394">não está incluída</link> nas versões do K3s.
zh_cn: 有一个已经合并的 PR 可以直接将内置的 NATS 包含在 K3s 中，但这项更改仍<link xl:href="https://github.com/k3s-io/k3s/issues/7410#issue-1692989394">未包含</link>在 K3s 版本中。

source: For this reason, the K3s binary should be built manually.
es: Por eso, el binario de K3s debe crearse manualmente.
ja: このため、K3sのバイナリを手動で構築する必要があります。
pt_br: Por esse motivo, o binário do K3s deve ser criado manualmente.
zh_cn: 出于此原因，应该手动构建 K3s 二进制文件。

source: Building K3s
es: Creación de K3s
ja: K3sの構築
pt_br: Criando o K3s
zh_cn: 构建 K3s

source: The following command adds <literal>nats</literal> in the build tags to enable the NATS built-in feature in K3s:
es: El siguiente comando añade <literal>nats</literal> en las etiquetas de creación para habilitar la integración de NATS en K3s:
ja: 次のコマンドは、ビルドタグに<literal>nats</literal>を追加して、K3sでNATSビルトイン機能を有効にします。
pt_br: O seguinte comando adiciona o <literal>nats</literal> às tags de build para habilitar o recurso NATS incorporado no K3s:
zh_cn: 以下命令会在构建标记中添加 <literal>nats</literal>，以在 K3s 中启用 NATS 内置功能：

source: Replace &lt;node-ip&gt; with the actual IP of the node where the K3s will be started:
es: Sustituya &lt;node-ip&gt; con la IP real del nodo donde se iniciará K3s:
ja: &lt;node-ip&gt;は、K3sを起動するノードの実際のIPに置き換えます。
pt_br: Substitua &lt;node-ip&gt; pelo IP real do nó onde o K3s será iniciado:
zh_cn: 请将 &lt;node-ip&gt; 替换为启动 K3s 的节点的实际 IP：

source: Locally building K3s requires the buildx Docker CLI plugin. It can be <link xl:href="https://github.com/docker/buildx#manual-download">manually installed</link> if <literal>$ make local</literal> fails.
es: Para crear K3s localmente se necesita el complemento buildx Docker CLI. Se puede <link xl:href="https://github.com/docker/buildx#manual-download">instalar manualmente</link> si <literal>$ make local</literal> falla.
ja: K3sをローカルで構築するには、buildx Docker CLIプラグインが必要です。<literal>$ make local</literal>が失敗する場合は、<link xl:href="https://github.com/docker/buildx#manual-download">手動でインストール</link>できます。
pt_br: A criação local do K3s requer o plug-in buildx Docker CLI. Ele pode ser <link xl:href="https://github.com/docker/buildx#manual-download">manualmente instalado</link> em caso de falha no <literal>$ make local</literal>.
zh_cn: 在本地构建 K3s 需要 buildx Docker CLI 插件。如果 <literal>$ make local</literal> 失败，可以<link xl:href="https://github.com/docker/buildx#manual-download">手动安装</link>该插件。

source: Installing NATS CLI
es: Instalación de la interfaz de línea de comandos de NATS
ja: NATS CLIのインストール
pt_br: Instalando a CLI do NATS
zh_cn: 安装 NATS CLI

source: Running NATS as K3s back-end
es: Ejecución de NATS como interfaz final de K3s
ja: K3sのバックエンドとしてのNATSの実行
pt_br: Executando o NATS como back end do K3s
zh_cn: 运行用作 K3s 后端的 NATS

source: Let us <literal>ssh</literal> on the node and run the K3s with the <literal>--datastore-endpoint</literal> flag pointing to <literal>nats</literal>.
es: Vamos a usar <literal>ssh</literal> en el nodo y a ejecutar K3s con el indicador <literal>--datastore-endpoint</literal> apuntando a <literal>nats</literal>.
ja: ノードで<literal>ssh</literal>を実行し、<literal>--datastore-endpoint</literal>フラグで<literal>nats</literal>を指してK3sを実行しましょう。
pt_br: Vamos acessar o nó por <literal>ssh</literal> e executar o K3s com o sinalizador <literal>--datastore-endpoint</literal> apontando para <literal>nats</literal>.
zh_cn: 我们需要在节点上通过 <literal>ssh</literal> 进行连接，并使用指向 <literal>nats</literal> 的 <literal>--datastore-endpoint</literal> 标志运行 K3s。

source: The command below starts K3s as a foreground process, so the logs can be easily followed to see if there are any issues. To not block the current terminal, a <literal>&amp;</literal> flag could be added before the command to start it as a background process.
es: El siguiente comando inicia K3s como un proceso en primer plano, por lo que es posible consultar fácilmente en el registro si hay algún problema. Para no bloquear el terminal actual, se puede añadir el indicador <literal>&amp;</literal> antes del comando para iniciarlo como un proceso en segundo plano.
ja: 次のコマンドでは、K3sをフォアグランドプロセスとして起動するので、ログを簡単に追跡して問題がないかどうかを確認できます。現在の端末をブロックしないようにするには、コマンドの前に<literal>&amp;</literal>フラグを追加して、バックグラウンドプロセスとして起動できます。
pt_br: O comando a seguir inicia o K3s como um processo em primeiro plano, assim é possível acompanhar os registros facilmente para ver se há problemas. Para não bloquear o terminal atual, adicione o sinalizador <literal>&amp;</literal> antes do comando para iniciá-lo como um processo em segundo plano.
zh_cn: 以下命令将 K3s 作为前台进程启动，因此您可以轻松地通过日志来查看是否出现了任何问题。为了不阻碍当前终端，可以在该命令的前面添加 <literal>&amp;</literal> 标志，以将其作为后台进程启动。

source: For making the K3s server with the NATS back-end permanent on your <literal>slemicro</literal> VM, the script below can be run, which creates a <literal>systemd</literal> service with the needed configurations.
es: Para hacer permanente el servidor K3s con la interfaz final de NATS en su máquina virtual <literal>slemicro</literal>, puede ejecutar el siguiente guion, que crea un servicio <literal>systemd</literal> con la configuración necesaria.
ja: NATSバックエンドを使用するK3sサーバを<literal>slemicro</literal> VM上で永続化するには、次のスクリプトを実行して、必要な設定で<literal>systemd</literal>サービスを作成します。
pt_br: Para tornar o servidor K3s com o NATS como back end permanente em sua VM <literal>slemicro</literal>, execute o script abaixo para criar um serviço <literal>systemd</literal> com as configurações necessárias.
zh_cn: 为了将使用 NATS 后端的 K3s 服务器永久保留在您的 <literal>slemicro</literal> VM 上，可以运行以下脚本，以创建包含所需配置的 <literal>systemd</literal> 服务。

source: The following commands can be run on the node to verify that everything with the stream works properly:
es: Los siguientes comandos se pueden ejecutar en el nodo para verificar que todo lo relacionado con la transmisión funciona correctamente:
ja: 次のコマンドをノード上で実行して、ストリームのすべてが適切に動作していることを確認できます。
pt_br: É possível executar os seguintes comandos no nó para verificar se tudo funciona corretamente com o fluxo:
zh_cn: 可以在节点上运行以下命令来校验流的所有功能是否正常运行：

source: NVIDIA GPUs on SUSE Linux Micro
es: GPU NVIDIA en SUSE Linux Micro
ja: SUSE Linux Micro上のNVIDIA GPU
pt_br: GPUs NVIDIA no SUSE Linux Micro
zh_cn: SUSE Linux Micro 上的 NVIDIA GPU

source: This guide demonstrates how to implement host-level NVIDIA GPU support via the pre-built <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules">open-source drivers</link> on SUSE Linux Micro 6.1. These are drivers that are baked into the operating system rather than dynamically loaded by NVIDIA’s <link xl:href="https://github.com/NVIDIA/gpu-operator">GPU Operator</link>. This configuration is highly desirable for customers that want to pre-bake all artifacts required for deployment into the image, and where the dynamic selection of the driver version, that is, the user selecting the version of the driver via Kubernetes, is not a requirement. This guide initially explains how to deploy the additional components onto a system that has already been pre-deployed, but follows with a section that describes how to embed this configuration into the initial deployment via Edge Image Builder. If you do not want to run through the basics and set things up manually, skip right ahead to that section.
es: Esta guía muestra cómo implementar compatibilidad con GPU NVIDIA a nivel de host mediante <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules">controladores de código abierto</link> creados previamente en SUSE Linux Micro 6.1. Estos controladores están integrados en el sistema operativo, en lugar de cargarse de forma dinámica mediante el operador <link xl:href="https://github.com/NVIDIA/gpu-operator">GPU Operator</link> de NVIDIA. Esta configuración es muy recomendable para los clientes que desean integrar previamente todos los artefactos necesarios para el despliegue en la imagen y en cuando sea necesario seleccionar dinámicamente la versión del controlador; es decir, que el usuario pueda seleccionar la versión del controlador a través de Kubernetes. Al principio de esta guía se explica cómo desplegar los componentes adicionales en un sistema que ya ha sido desplegado previamente, y continúa con una sección donde se describe cómo integrar esta configuración en el despliegue inicial mediante Edge Image Builder. Si no desea repasar los conceptos básicos y configurarlo todo manualmente, pase directamente a esa sección.
ja: このガイドでは、事前構築済みの<link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules">オープンソースドライバ</link>を使用してホストレベルのNVIDIA GPUサポートをSUSE Linux Micro 6.1に実装する方法を説明します。これらのドライバは、NVIDIAの <link xl:href="https://github.com/NVIDIA/gpu-operator">GPU Operator</link>によって動的にロードされるのではなく、オペレーティングシステムにベイクされているドライバです。この設定は、デプロイメントに必要なすべてのアーティファクトをあらかじめイメージにベイクしておき、ドライバのバージョンを動的に選択する必要がない(つまり、ユーザがKubernetesを介してドライバのバージョンを選択する必要がない)お客様に非常に適しています。このガイドでは最初に、すでに事前にデプロイされているシステムに追加コンポーネントをデプロイする方法を説明しますが、その後のセクションでは、Edge Image Builderを使用してこの設定を初期デプロイメントに組み込む方法について説明します。基本的な操作を読む必要がない場合や、手動でセットアップしたくない場合は、スキップしてそちらのセクションに進んでください。
pt_br: Este guia demonstra como implementar o suporte à GPU NVIDIA no nível do host usando os <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules">drivers de código-fonte aberto</link> predefinidos no SUSE Linux Micro 6.1. Esses drivers são integrados ao sistema operacional, e não dinamicamente carregados pelo NVIDIA <link xl:href="https://github.com/NVIDIA/gpu-operator">GPU Operator</link>. Essa configuração é altamente aconselhável para clientes que desejam fazer bake prévio de todos os artefatos necessários para implantação na imagem, e quando não é um requisito a seleção dinâmica da versão do driver, ou seja, o usuário ter que selecionar a versão do driver pelo Kubernetes. Inicialmente, este guia explica como implantar componentes adicionais em um sistema que já tenha sido pré-implantado, mas prossegue com uma seção que descreve como incorporar essa configuração à implantação inicial por meio do Edge Image Builder. Se você não quer passar pelas etapas básicas e configurar tudo manualmente, avance direto para essa seção.
zh_cn: 本指南将演示如何通过预构建的<link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules">开源驱动程序</link>在 SUSE Linux Micro 6.1 上实现主机级别的 NVIDIA GPU 支持。这些驱动程序是内置在操作系统中的，而非由 NVIDIA 的 <link xl:href="https://github.com/NVIDIA/gpu-operator">GPU Operator</link> 动态加载。对于希望将部署所需的所有制品预先嵌入映像，且不需要动态选择驱动程序版本（即用户无需通过 Kubernetes 选择驱动程序版本）的客户而言，这种配置极具吸引力。本指南首先介绍如何将其他组件部署到已预先部署的系统，然后在一个章节中介绍如何通过 Edge Image Builder 将此配置嵌入到初始部署中。如果您不想了解基础知识并想要手动完成设置，请直接跳到该章节。

source: It is important to call out that the support for these drivers is provided by both SUSE and NVIDIA in tight collaboration, where the driver is built and shipped by SUSE as part of the package repositories. However, if you have any concerns or questions about the combination in which you use the drivers, ask your SUSE or NVIDIA account managers for further assistance. If you plan to use <link xl:href="https://www.nvidia.com/en-gb/data-center/products/ai-enterprise/">NVIDIA AI Enterprise</link> (NVAIE), ensure that you are using an <link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/platform-support.html#supported-nvidia-gpus-and-systems">NVAIE certified GPU</link>, which <emphasis>may</emphasis> require the use of proprietary NVIDIA drivers. If you are unsure, speak with your NVIDIA representative.
es: Es importante destacar que la asistencia para estos controladores la proporcionan tanto SUSE como NVIDIA en estrecha colaboración, y que el controlador ha sido creado y lo proporciona SUSE como parte de los repositorios de paquetes. Sin embargo, si tiene alguna duda o pregunta sobre la combinación en la que utiliza los controladores, solicite ayuda adicional a sus gestores de cuentas de SUSE o NVIDIA. Si tiene previsto utilizar <link xl:href="https://www.nvidia.com/en-gb/data-center/products/ai-enterprise/">NVIDIA AI Enterprise</link> (NVAIE), asegúrese de que está utilizando una <link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/platform-support.html#supported-nvidia-gpus-and-systems">GPU certificada para NVAIE</link>, lo que <emphasis>puede</emphasis> requerir el uso de controladores de NVIDIA. Si no está seguro, consulte con su representante de NVIDIA.
ja: これらのドライバのサポートは、SUSEとNVIDIAの両社が緊密に連携して提供しており、ドライバはパッケージリポジトリの一部としてSUSEによって構築および出荷されている点を強調しておくことが重要です。ただし、ドライバを使用する組み合わせについて不安や質問がある場合は、SUSEまたはNVIDIAのアカウントマネージャに問い合わせてサポートを受けてください。<link xl:href="https://www.nvidia.com/en-gb/data-center/products/ai-enterprise/">NVIDIA AI Enterprise</link> (NVAIE)を使用する予定の場合は、<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/platform-support.html#supported-nvidia-gpus-and-systems">NVAIE認定GPU</link>を使用していることを確認してください。NVAIE認定GPUでは、独自のNVIDIAドライバを使用する必要がある<emphasis>場合があります</emphasis>。不明な点がある場合は、NVIDIAの担当者に問い合わせてください。
pt_br: É importante destacar que o suporte a esses drivers é oferecido pela SUSE e NVIDIA em estreita colaboração, sendo que os drivers são criados e distribuídos pela SUSE como parte dos repositórios de pacotes. No entanto, se você tiver qualquer problema ou dúvida sobre a combinação dos drivers usada, contate os gerentes de conta da SUSE ou NVIDIA para receber mais ajuda. Se você pretende usar o <link xl:href="https://www.nvidia.com/en-gb/data-center/products/ai-enterprise/">NVIDIA AI Enterprise</link> (NVAIE), certifique-se de que tenha uma <link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/platform-support.html#supported-nvidia-gpus-and-systems">GPU certificada para NVAIE</link>, o que <emphasis>pode</emphasis> exigir o uso de drivers proprietários da NVIDIA. Se estiver em dúvida, fale com seu representante NVIDIA.
zh_cn: 需要特别说明的是，这些驱动程序的支持服务由 SUSE 和 NVIDIA 紧密合作提供，SUSE 负责驱动程序的构建，并将其作为软件包储存库的一部分分发。不过，如果您在驱动程序的使用组合方面有任何疑问或顾虑，请咨询您的 SUSE 或 NVIDIA 客户经理以获得进一步的帮助。如果您打算使用 <link xl:href="https://www.nvidia.com/en-gb/data-center/products/ai-enterprise/">NVIDIA AI Enterprise</link> (NVAIE)，请确保使用的是<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/platform-support.html#supported-nvidia-gpus-and-systems">经过 NVAIE 认证的 GPU</link>，这<emphasis>可能</emphasis>需要搭配使用 NVIDIA 的专有驱动程序。如果对此不确定，请咨询您的 NVIDIA 代表。

source: Further information about NVIDIA GPU operator integration is <emphasis>not</emphasis> covered in this guide. While integrating the NVIDIA GPU Operator for Kubernetes is not covered here, you can still follow most of the steps in this guide to set up the underlying operating system and simply enable the GPU operator to use the <emphasis>pre-installed</emphasis> drivers via the <literal>driver.enabled=false</literal> flag in the NVIDIA GPU Operator Helm chart, where it will simply pick up the installed drivers on the host. More comprehensive instructions are available from NVIDIA <link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/install-gpu-operator.html#chart-customization-options">here</link>.
es: Esta guía <emphasis>no</emphasis> incluye más información sobre la integración del operador GPU de NVIDIA. Aunque no trata sobre la integración del operador de GPU de NVIDIA para Kubernetes, puede seguir la mayoría de los pasos de esta guía para configurar el sistema operativo subyacente y, simplemente, habilitar el operador de GPU para que utilice los controladores <emphasis>preinstalados</emphasis> mediante el indicador <literal>driver.enabled=false</literal> en el chart de Helm del operador de GPU NVIDIA, donde bastará con seleccionar los controladores instalados en el host. Encontrará instrucciones más completas de NVIDIA <link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/install-gpu-operator.html#chart-customization-options">en este documento</link>.
ja: NVIDIA GPU Operatorの統合の詳細は、このガイドでは説明<emphasis>しません</emphasis>。Kubernetes用のNVIDIA GPU Operatorの統合についてはここでは説明しませんが、このガイドのほとんどの手順に従って、基礎となるオペレーティングシステムをセットアップできます。そして、NVIDIA GPU OperatorのHelmチャートの<literal>driver.enabled=false</literal>フラグを使用して<emphasis>プリインストール</emphasis>されたドライバをGPU Operatorが使用できるようにするだけで、ホスト上にインストールされたドライバが取得されます。より包括的な手順については、 NVIDIA (<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/install-gpu-operator.html#chart-customization-options">こちら</link>)で参照できます。
pt_br: Este guia <emphasis>não</emphasis> aborda mais informações sobre a integração do NVIDIA GPU Operator. A integração do NVIDIA GPU Operator para Kubernetes não é explicada aqui, mas você ainda pode seguir a maioria das etapas neste guia para configurar o sistema operacional subjacente e simplesmente permitir que o GPU Operator use os drivers <emphasis>pré-instalados</emphasis> por meio do sinalizador <literal>driver.enabled=false</literal> no gráfico Helm do NVIDIA GPU Operator, que apenas vai selecionar os drivers instalados no host. A NVIDIA apresenta instruções mais detalhadas <link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/install-gpu-operator.html#chart-customization-options">aqui</link>.
zh_cn: 本指南<emphasis>不会</emphasis>介绍有关 NVIDIA GPU Operator 集成的更多信息。虽然其中不会介绍如何为 Kubernetes 集成 NVIDIA GPU Operator，但您仍然可以按照本指南中的大部分步骤来设置底层操作系统，并通过 NVIDIA GPU Operator Helm chart 中的 <literal>driver.enabled=false</literal> 标志来让 GPU Operator 使用<emphasis>预安装的</emphasis>驱动程序，在这种情况下，GPU Operator 会直接选择主机上安装的驱动程序。NVIDIA 在<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/gpu-operator/latest/install-gpu-operator.html#chart-customization-options">此处</link>提供了更详细的说明。

source: At least one host with SUSE Linux Micro 6.1 installed; this can be physical or virtual.
es: Al menos un host con SUSE Linux Micro 6.1 instalado; puede ser físico o virtual.
ja: SUSE Linux Micro 6.1がインストールされている少なくても1台のホスト。物理でも仮想でも構いません。
pt_br: No mínimo, um host com o SUSE Linux Micro 6.1 instalado, que pode ser físico ou virtual.
zh_cn: 至少一台装有 SUSE Linux Micro 6.1 的主机，可以是物理主机，也可以是虚拟机。

source: Your hosts are attached to a subscription as this is required for package access — an evaluation is available <link xl:href="https://www.suse.com/download/sle-micro/">here</link>.
es: Sus hosts están vinculados a una suscripción obligatoria para poder acceder al paquete. Hay una versión de evaluación disponible <link xl:href="https://www.suse.com/download/sle-micro/">aquí</link>.
ja: パッケージへのアクセスにはサブスクリプションが必要であるため、ホストがサブスクリプションに接続されていること。評価版は<link xl:href="https://www.suse.com/download/sle-micro/">こちら</link>から入手できます。
pt_br: Seus hosts são anexados a uma assinatura porque isso é exigido para acesso ao pacote. Há uma avaliação disponível <link xl:href="https://www.suse.com/download/sle-micro/">aqui</link>.
zh_cn: 您的主机已附加到某个订阅，只有这样，才能访问软件包 — 可在<link xl:href="https://www.suse.com/download/sle-micro/">此处</link>进行评估。

source: A <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">compatible NVIDIA GPU</link> installed (or <emphasis>fully</emphasis> passed through to the virtual machine in which SUSE Linux Micro is running).
es: Una <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">GPU NVIDIA compatible</link> instalada (o transferida <emphasis>completamente</emphasis> a la máquina virtual en la que se ejecute SUSE Linux Micro).
ja: <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">互換性のあるNVIDIA GPU</link>がインストールされていること(またはSUSE Linux Microが実行されている仮想マシンに<emphasis>完全に</emphasis>パススルーされていること)。
pt_br: Uma <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">GPU NVIDIA compatível</link> instalada (ou <emphasis>completamente</emphasis> transferida para a máquina virtual na qual o SUSE Linux Micro está em execução).
zh_cn: 已安装<link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">兼容的 NVIDIA GPU</link>（或已<emphasis>完全</emphasis>直通到运行 SUSE Linux Micro 的虚拟机）。

source: Manual installation
es: Instalación manual
ja: 手動インストール
pt_br: Instalação manual
zh_cn: 手动安装
