Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#specify-network-interfaces-that-lb-ip-can-be-announced-from">Specify network interfaces that LB IP can be announced from</link>
es: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#specify-network-interfaces-that-lb-ip-can-be-announced-from">La especificación de las interfaces de red desde las que se puede anunciar la IP del equilibrador de carga</link>
ja: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#specify-network-interfaces-that-lb-ip-can-be-announced-from">LBのIPをアナウンスできるネットワークインタフェースを指定する</link>
pt_br: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#specify-network-interfaces-that-lb-ip-can-be-announced-from">Especificar as interfaces de rede das quais o IP do LB pode ser anunciado</link>
zh_cn: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#specify-network-interfaces-that-lb-ip-can-be-announced-from">指定可从中声明 LB IP 的网络接口</link>

source: And a lot more for <link xl:href="https://metallb.universe.tf/configuration/_advanced_bgp_configuration/">BGP</link>.
es: Y mucho más para <link xl:href="https://metallb.universe.tf/configuration/_advanced_bgp_configuration/">BGP</link>.
ja: また、<link xl:href="https://metallb.universe.tf/configuration/_advanced_bgp_configuration/">BGP</link>についても、さらに多くのカスタマイズが可能です。
pt_br: E muito mais para <link xl:href="https://metallb.universe.tf/configuration/_advanced_bgp_configuration/">BGP</link>.
zh_cn: 还可以对 <link xl:href="https://metallb.universe.tf/configuration/_advanced_bgp_configuration/">BGP</link> 进行其他许多自定义设置。

source: Traefik and MetalLB
es: Traefik y MetalLB
ja: TraefikとMetalLB
pt_br: Traefik e MetalLB
zh_cn: Traefik 和 MetalLB

source: Traefik is deployed by default with K3s (<link xl:href="https://docs.k3s.io/networking#traefik-ingress-controller">it can be disabled</link> with <literal>--disable=traefik</literal>) and it is by default exposed as <literal>LoadBalancer</literal> (to be used with Klipper). However, as Klipper needs to be disabled, Traefik service for ingress is still a <literal>LoadBalancer</literal> type. So at the moment of deploying MetalLB, the first IP will be assigned automatically to Traefik Ingress.
es: Traefik se despliega por defecto con K3s (<link xl:href="https://docs.k3s.io/networking#traefik-ingress-controller">se puede inhabilitar</link> con <literal>--disable=traefik</literal>) y se expone por defecto como <literal>LoadBalancer</literal> (para usarse con Klipper). Sin embargo, como hay que inhabilitar Klipper, el servicio Traefik para Ingress sigue siendo de tipo <literal>LoadBalancer</literal>. Por lo tanto, en el momento de desplegar MetalLB, la primera IP se asignará automáticamente para Traefik Ingress.
ja: Traefikは、デフォルトではK3sとともにデプロイされます(<literal>--disable=traefik</literal>を使用して<link xl:href="https://docs.k3s.io/networking#traefik-ingress-controller">K3sを無効にできます</link>)。また、デフォルトで<literal>LoadBalancer</literal>として公開されます(Klipperで使用するため)。ただし、Klipperを無効にする必要があるため、Ingress用Traefikサービスは<literal>LoadBalancer</literal>タイプのままです。そのため、MetalLBをデプロイした時点では、最初のIPは自動的にTraefik Ingressに割り当てられます。
pt_br: O Traefik é implantado por padrão com o K3s (<link xl:href="https://docs.k3s.io/networking#traefik-ingress-controller">ele pode ser desabilitado</link> com <literal>--disable=traefik</literal>) e exposto como <literal>LoadBalancer</literal> (para uso com o Klipper). No entanto, como o Klipper precisa ser desabilitado, o serviço Traefik para entrada ainda é um tipo de <literal>LoadBalancer</literal>. Sendo assim, no momento da implantação do MetalLB, o primeiro IP será automaticamente atribuído à entrada do Traefik.
zh_cn: 默认情况下，Traefik 会随 K3s 一起部署（可以使用 <literal>--disable=traefik</literal> <link xl:href="https://docs.k3s.io/networking#traefik-ingress-controller">禁用 Traefik</link>），并作为 <literal>LoadBalancer</literal> 公开（与 Klipper 一起使用）。但是，由于需要禁用 Klipper，用于入口的 Traefik 服务仍是 <literal>LoadBalancer</literal> 类型。因此在部署 MetalLB 的那一刻，第一个 IP 将自动分配给 Traefik 入口。

source: This will be applied later (<xref linkend="ingress-with-metallb"/>) in the process.
es: Esto se aplicará más tarde en el proceso (<xref linkend="ingress-with-metallb"/>).
ja: これは、このプロセスの後半(<xref linkend="ingress-with-metallb"/>)で適用されます。
pt_br: Isso será aplicado mais adiante (<xref linkend="ingress-with-metallb"/>) no processo.
zh_cn: 我们将在稍后的过程（<xref linkend="ingress-with-metallb"/>）中应用此操作。

source: Usage
es: Uso
ja: 使用法
pt_br: Uso
zh_cn: 用法

source: Let us create an example deployment:
es: Vamos a crear un despliegue de ejemplo:
ja: デプロイメントの例を作成してみましょう。
pt_br: Vamos criar uma implantação de exemplo:
zh_cn: 我们来创建示例部署：

source: And finally, the service:
es: Y, por último, el servicio:
ja: 最終的にサービスは次のようになります。
pt_br: E, por fim, o serviço:
zh_cn: 最后创建服务：

source: Let us see it in action:
es: Veámoslo en acción:
ja: 実際の動作を見てみましょう。
pt_br: Vamos vê-lo em ação:
zh_cn: 我们来看看此示例的实际效果：

source: Ingress with MetalLB
es: Ingress con MetalLB
ja: IngressとMetalLB
pt_br: Ingress com MetalLB
zh_cn: MetalLB 的入口

source: As Traefik is already serving as an ingress controller, we can expose any HTTP/HTTPS traffic via an <literal>Ingress</literal> object such as:
es: Como Traefik ya sirve como controlador de Ingress, podemos exponer todo el tráfico HTTP/HTTPS a través de un objeto <literal>Ingress</literal> como:
ja: TraefikはすでにIngressコントローラとして機能しているため、次のような<literal>Ingress</literal>オブジェクトを介してHTTP/HTTPSトラフィックを公開できます。
pt_br: Como o Traefik já atua como controlador de entrada, podemos expor o tráfego HTTP/HTTPS por um objeto <literal>Ingress</literal>, por exemplo:
zh_cn: 由于 Traefik 已用作入口控制器，我们可以通过 <literal>Ingress</literal> 对象公开任何 HTTP / HTTPS 流量，例如：

source: And then:
es: Y, a continuación:
ja: これにより、次のような結果が返されます。
pt_br: E depois:
zh_cn: 然后运行：

source: Verify that MetalLB works correctly:
es: Verifique que MetalLB funciona correctamente:
ja: MetalLBが正しく動作していることを確認します。
pt_br: Verifique se o MetalLB funciona corretamente:
zh_cn: 校验 MetalLB 是否正常工作：

source: In the example above, the traffic flows as follows:
es: En el ejemplo anterior, el flujo de tráfico es el siguiente:
ja: 上記の例では、トラフィックは次のように流れます。
pt_br: No exemplo acima, o tráfego flui da seguinte maneira:
zh_cn: 在以上示例中，流量的流动方式如下：

source: <literal>hellok3s.${IP}.sslip.io</literal> is resolved to the actual IP.
es: <literal>hellok3s.${IP}.sslip.io</literal> se resuelve en la IP real.
ja: <literal>hellok3s.${IP}.sslip.io</literal>が実際のIPに解決されます。
pt_br: <literal>hellok3s.${IP}.sslip.io</literal> é resolvido para o IP atual.
zh_cn: <literal>hellok3s.${IP}.sslip.io</literal> 解析为实际 IP。

source: Then the traffic is handled by the <literal>metallb-speaker</literal> pod.
es: Después, el tráfico se gestiona con el pod <literal>metallb-speaker</literal>.
ja: 続いて、トラフィックが<literal>metallb-speaker</literal> Podによって処理されます。
pt_br: Em seguida, o tráfego é processado pelo pod <literal>metallb-speaker</literal>.
zh_cn: 然后，流量由 <literal>metallb-speaker</literal> Pod 处理。

source: <literal>metallb-speaker</literal> redirects the traffic to the <literal>traefik</literal> controller.
es: <literal>metallb-speaker</literal> redirige el tráfico al controlador <literal>traefik</literal>.
ja: <literal>metallb-speaker</literal>がトラフィックを<literal>traefik</literal>コントローラにリダイレクトします。
pt_br: <literal>metallb-speaker</literal> redireciona o tráfego para o controlador <literal>traefik</literal>.
zh_cn: <literal>metallb-speaker</literal> 将流量重定向到 <literal>traefik</literal> 控制器。

source: Finally, Traefik forwards the request to the <literal>hello-kubernetes</literal> service.
es: Por último, Traefik reenvía la petición al servicio <literal>hello-kubernetes</literal>.
ja: 最後に、Traefikが要求を<literal>hello-kubernetes</literal>サービスに転送します。
pt_br: Por fim, o Traefik encaminha a solicitação para o serviço <literal>hello-kubernetes</literal>.
zh_cn: 最后，Traefik 将请求转发到 <literal>hello-kubernetes</literal> 服务。

source: MetalLB on K3s (using Layer 3 Mode)
es: MetalLB en K3s (con el modo de capa 3)
ja: K3s上のMetalLB (レイヤ3モードを使用)
zh_cn: K3s 上的 MetalLB（使用第 3 层模式）

source: In this guide, we demonstrate how to deploy MetalLB in layer 3 (L3) BGP mode.
es: En esta guía se explica cómo desplegar MetalLB en el modo de capa 3 (L3) de BGP.
ja: このガイドでは、MetalLBをレイヤ3 (L3) BGPモードでデプロイする方法について説明します。
zh_cn: 本指南将演示如何在第 3 层 (L3) BGP 模式下部署 MetalLB。

source: Supports Multiple Protocols: MetalLB supports both Layer 2 and Layer 3 BGP (Border Gateway Protocol) modes, providing flexibility for different network architectures and requirements.
es: Compatibilidad con múltiples protocolos: MetalLB admite el modo de capa 2 y el de capa 3 de BGP (Border Gateway Protocol, protocolo de gateway de frontera), lo que proporciona flexibilidad para diferentes arquitecturas y requisitos de red.
ja: 複数のプロトコルをサポート: MetalLBはレイヤ2モードとレイヤ3 BGP (Border Gateway Protocol)モードの両方をサポートし、さまざまなネットワークアーキテクチャと要件に柔軟に対応します。
zh_cn: 支持多种协议：MetalLB 支持第 2 层和第 3 层 BGP（边界网关协议）模式，提供了很大的灵活性，适合不同的网络架构并可满足不同的要求。

source: MetalLB on K3s (using L3)
es: MetalLB en K3s (con L3)
ja: K3s上のMetalLB (L3を使用)
zh_cn: K3s 上的 MetalLB（使用 L3）

source: In this quick start, L3 mode is used. This means that we need to have neighboring router(s) with BGP capabilities within the network range.
es: En este inicio rápido, se utilizará el modo L3. Esto significa que se necesita tener router vecinos con capacidad de BGP dentro del rango de red.
ja: このクイックスタートではL3モードを使用します。つまり、ネットワーク範囲内にBGP機能を備えた近隣ルータが必要です。
zh_cn: 本快速入门中使用 L3 模式，这意味着网络范围内需要有支持 BGP 功能的相邻路由器。

source: Router(s) on the network that support the BGP protocol.
es: Routers de la red que admiten el protocolo BGP.
ja: BGPプロトコルをサポートするネットワーク上のルータ。
zh_cn: 网络中支持 BGP 协议的路由器。

source: A free IP address within the network range for the service. In this example <literal>192.168.10.100</literal>
es: Una dirección IP libre en el rango de red del servicio. En este ejemplo, <literal>192.168.10.100</literal>
ja: サービス用のネットワーク範囲内の空きIPアドレス。この例では <literal>192.168.10.100</literal>
zh_cn: 网络范围内用于服务的空闲 IP 地址，本示例中为 <literal>192.168.10.100</literal>

source: You must make sure this IP address is unassigned. In a DHCP environment this address must not be part of the DHCP pool to avoid dual assignments.
es: Debe asegurarse de que esta dirección IP no esté asignada. En un entorno DHCP, esta dirección no debe ser parte del grupo DHCP para evitar asignaciones dobles.
ja: このIPアドレスが未割り当てであることを確認する必要があります。DHCP環境では、二重割り当てを避けるため、このアドレスをDHCPプールに含めないでください。
zh_cn: 您必须确保此 IP 地址未被分配。在 DHCP 环境中，该地址不得属于 DHCP 池，以避免重复分配。

source: Configuration to Advertise Service IP Addresses
es: Configuración para anunciar direcciones IP de servicio
ja: サービスIPアドレスをアドバタイズするための設定
zh_cn: 配置服务 IP 地址通告

source: Out of the box BGP advertises a Service IP address to all the peers that are configured. These peers, which are usually routers, will receive a route for each Service IP address with a 32 bit network mask. In this examlple we will use an FRR based router and is on the same network as our cluster. We will then use MetalLB’s BGP capability to advertise a service to that FRR based router.
es: La nueva versión de BGP anuncia una dirección IP de servicio a todos los pares configurados. Estos pares, que suelen ser routers, reciben una ruta por cada dirección IP de servicio con una máscara de red de 32 bits. En este ejemplo, se usará un router basado en FRR que se encuentra en la misma red que nuestro clúster. Después, se usará la capacidad de BGP de MetalLB para anunciar un servicio a ese router basado en FRR.
ja: すぐに利用可能なBGPは設定済みのすべてのピアにサービスIPアドレスをアドバタイズします。これらのピア(通常はルータ)は、各サービスIPアドレスに対して32ビットのネットワークマスクを持つルートを受け取ります。この例では、クラスタと同じネットワーク上にあるFRRベースのルータを使用します。その後、MetalLBのBGP機能を使用して、そのFRRベースのルータにサービスをアドバタイズします。
zh_cn: 默认情况下，BGP 会向所有已配置的对等方通告服务 IP 地址。这些对等方（通常是路由器）会收到每个服务 IP 地址的路由，且网络掩码为 32 位。在本示例中，我们将使用与群集处于同一网络的基于 FRR 的路由器，然后利用 MetalLB 的 BGP 功能向该基于 FRR 的路由器通告服务。

source: At this point, the installation is complete. Create an <literal>IPAddressPool</literal>:
es: Ahora, la instalación está completa. Cree un <literal>IPAddressPool</literal>:
ja: この時点でインストールは完了します。<literal>IPAddressPool</literal>を作成します。
zh_cn: 至此，安装已完成。接下来创建 <literal>IPAddressPool</literal>：

source: Configure a <literal>BGPPeer</literal>.
es: Configure un <literal>BGPPeer</literal>.
ja: <literal>BGPPeer</literal>を設定します。
zh_cn: 配置 <literal>BGPPeer</literal>。

source: The FRR router has ASN 1000 while our <literal>BGPPeer</literal> will have 1001. We can also see that the FRR Router has an IP address that is 192.168.3.140.
es: El router FRR tiene ASN 1000, mientras que nuestro <literal>BGPPeer</literal> tendrá 1001. También se puede observar que el router FRR tiene la dirección IP 192.168.3.140.
ja: FRRルータのASNは1000であり、<literal>BGPPeer</literal>は1001です。また、FRRルータのIPアドレスは192.168.3.140であることも確認できます。
zh_cn: FRR 路由器的 ASN 为 1000，而我们的 <literal>BGPPeer</literal> 的 ASN 为 1001。您还可看到 FRR 路由器的 IP 地址为 192.168.3.140。

source: Create the BGPAdvertisement (L3):
es: Cree el BGPAdvertisement (L3):
ja: BGPAdvertisement (L3)を作成します。
zh_cn: 创建 BGPAdvertisement（L3 模式）：

source: Create an example application with a service. In this case, IP address from the <literal>IPAddressPool</literal> is <literal>192.168.10.100</literal> for that service.
es: Cree una aplicación de ejemplo con un servicio. En este caso, la dirección IP de <literal>IPAddressPool</literal> es <literal>192.168.10.100</literal> para ese servicio.
ja: サービスを含むサンプルアプリケーションを作成します。この場合、そのサービスに対する <literal>IPAddressPool</literal>からのIPアドレスは<literal>192.168.10.100</literal>です。
zh_cn: 创建包含服务的示例应用程序。在本示例中，该服务将使用来自 <literal>IPAddressPool</literal> 的 IP 地址 <literal>192.168.10.100</literal>。

source: To verify, log onto the FRR Router to can see the routes created from the BGP advertisement.
es: Para verificar, inicie sesión en el router FRR para comprobar las rutas creadas desde el anuncio BGP.
ja: 確認するには、FRRルータにログオンし、BGPアドバタイズメントから作成されたルートを確認できます。
zh_cn: 要进行验证，可登录 FRR 路由器查看 BGP 通告生成的路由。

source: If this router is the default gateway for your network, you can run the <literal>curl</literal> command from a box on that network to verify that they can reach the httpd sample app
es: Si este router en el gateway por defecto para la red, puede ejecutar el comando <literal>curl</literal> desde un cuadro en esa red para verificar que pueden acceder a la aplicación HTTPD de ejemplo.
ja: このルータがネットワークのデフォルトゲートウェイである場合、そのネットワーク上のボックスから<literal>curl</literal>コマンドを実行し、httpdサンプルアプリに到達できることを確認できます。
zh_cn: 如果该路由器是您网络的默认网关，可在网络中的某个设备上运行 <literal>curl</literal> 命令，验证是否能访问 httpd 示例应用程序。

source: MetalLB in front of the Kubernetes API server
es: MetalLB delante del servidor de Kubernetes API
ja: Kubernetes APIサーバの前面のMetalLB
pt_br: MetalLB na frente do servidor da API Kubernetes
zh_cn: Kubernetes API 服务器前面的 MetalLB

source: This guide demonstrates using a MetalLB service to expose the RKE2/K3s API externally on an HA cluster with three control-plane nodes. To achieve this, a Kubernetes Service of type <literal>LoadBalancer</literal> will be manually created. Then an <literal>EndpointSlices</literal> object will be automatically created which keeps the IPs of all control plane nodes available in the cluster. For the EndpointSlices to be continuously synchronized with the events occurring in the cluster (adding/removing a node or a node goes offline), the Endpoint Copier Operator (<xref linkend="components-eco"/>) will be deployed. The operator monitors the events happening in the default <literal>kubernetes</literal> EndpointSlices and updates the managed one automatically to keep them in sync. Since the managed Service is of type <literal>LoadBalancer</literal>, MetalLB assigns it a static <literal>ExternalIP</literal>. This <literal>ExternalIP</literal> will be used to communicate with the API Server.
es: Esta guía explica cómo usar un servicio MetalLB para exponer la API de RKE2/K3s externamente en un clúster de HA con tres nodos de plano de control. Para lograrlo, se creará manualmente un servicio de Kubernetes de tipo <literal>LoadBalancer</literal>. Después, se creará automáticamente un objeto <literal>EndpointSlices</literal> que mantienen las IP de todos los nodos de plano de control disponibles en el clúster. Para que EndpointSlices esté continuamente sincronizado con los eventos que se producen en el clúster (añadir/eliminar un nodo o que un nodo se desconecte), se desplegará el Endpoint Copier Operator (<xref linkend="components-eco"/>). Este operador supervisa los eventos que ocurren en el EndPointSlices <literal>kubernetes</literal> por defecto y actualiza el que se gestiona automáticamente para mantenerlos sincronizados. Dado que el servicio gestionado es de tipo <literal>LoadBalancer</literal>, MetalLB le asigna una IP externa <literal>ExternalIP</literal> estática. Esta <literal>ExternalIP</literal> se utilizará para comunicarse con el servidor de API.
ja: このガイドでは、MetalLBサービスを使用して、3つのコントロールプレーンノードを持つHAクラスタ上でRKE2/K3s APIを外部に公開する方法を示します。これを実現するために、<literal>LoadBalancer</literal>タイプのKubernetes Serviceを手動で作成します。その後、<literal>EndpointSlices</literal>オブジェクトが自動的に作成され、クラスタで使用可能なすべてのコントロールプレーンノードのIPが保持されます。EndpointSlicesをクラスタで発生するイベント(ノードの追加/削除やノードのオフライン化)と継続的に同期するため、Endpoint Copier Operator (<xref linkend="components-eco"/>)がデプロイされます。このオペレータはデフォルトの<literal>kubernetes</literal> EndpointSlicesで発生するイベントを監視し、管理対象を自動的に更新して同期を維持します。管理対象のServiceは<literal>LoadBalancer</literal>タイプであるため、MetalLBは静的な<literal>ExternalIP</literal>を割り当てます。この<literal>ExternalIP</literal>はAPIサーバとの通信に使用されます。
zh_cn: 本指南将演示如何在具有三个控制平面节点的 HA 群集上，使用 MetalLB 服务将 RKE2/K3s API 向外部公开。要实现此目的，需要手动创建类型为 <literal>LoadBalancer</literal> 的 Kubernetes 服务。系统随后会自动创建 <literal>EndpointSlices</literal> 对象，该对象会保留群集中所有可用控制平面节点的 IP。为确保 EndpointSlices 能与群集中发生的事件（添加/去除节点或节点下线）保持实时同步，需部署 Endpoint Copier Operator（<xref linkend="components-eco"/>）。该操作器会监控默认 <literal>kubernetes</literal> EndpointSlices 中的事件，并自动更新受管理的 EndpointSlices，以使两者保持同步。由于受管理的服务类型为 <literal>LoadBalancer</literal>，MetalLB 会为其分配静态 <literal>ExternalIP</literal>。此 <literal>ExternalIP</literal> 将用于与 API 服务器通信。

source: Three hosts to deploy RKE2/K3s on top.
es: Tres hosts para desplegar RKE2/K3s encima.
ja: RKE2/K3sをデプロイするための3つのホスト。
pt_br: Três hosts para implantar o RKE2/K3s em cima.
zh_cn: 要在其上部署 RKE2/K3s 的三台主机。

source: Ensure the hosts have different host names.
es: Asegúrese de que los hosts tienen nombres distintos.
ja: ホスト名は各ホストで違う名前にしてください。
pt_br: Certifique-se de que os hosts tenham nomes diferentes.
zh_cn: 请确保这些主机的主机名不同。

source: For testing, these could be virtual machines
es: Para realizar pruebas, pueden ser máquinas virtuales.
ja: テストの場合は仮想マシンを使用できます。
pt_br: Para teste, eles podem ser máquinas virtuais.
zh_cn: 对于测试目的，这些主机可以是虚拟机

source: At least 2 available IPs in the network (one for the Traefik/Nginx and one for the managed service).
es: Al menos 2 IP disponibles en la red (una para Traefik/Nginx y otra para el servicio gestionado).
ja: ネットワーク内で2つ以上のIPが使用可能(Traefik/Nginx用に1つ、管理対象サービス用に1つ)。
pt_br: Pelo menos 2 IPs disponíveis na rede (um para o Traefik/Nginx e outro para o serviço gerenciado).
zh_cn: 网络中至少有 2 个可用 IP（一个用于 Traefik/Nginx，另一个用于受管服务）。

source: Installing RKE2/K3s
es: Instalación de RKE2/K3s
ja: RKE2/K3sのインストール
pt_br: Instalando o RKE2/K3s
zh_cn: 安装 RKE2/K3s

source: If you do not want to use a fresh cluster but want to use an existing one, skip this step and proceed to the next one.
es: Si no desea utilizar un clúster nuevo, omita este paso y continúe con el siguiente.
ja: 新しいクラスタを使用せず、既存のクラスタを使用する場合は、この手順をスキップして次の手順に進んでください。
pt_br: Se você não deseja usar um cluster novo, mas um existente, ignore esta etapa e avance para a próxima.
zh_cn: 如果您不想使用新群集，而要使用现有群集，请跳过此步骤并执行下一步。

source: First, a free IP in the network must be reserved that will be used later for <literal>ExternalIP</literal> of the managed Service.
es: En primer lugar, se debe reservar una IP libre en la red que se utilizará posteriormente para <literal>ExternalIP</literal> en el servicio gestionado.
ja: まず、ネットワーク内の空きIPを、後で管理対象のServiceの<literal>ExternalIP</literal>で使用できるように予約する必要があります。
pt_br: Primeiramente, é necessário reservar um IP livre para usar mais adiante como <literal>ExternalIP</literal> do serviço gerenciado.
zh_cn: 首先，必须在网络中预留一个可用 IP，该 IP 稍后将用作受管服务的 <literal>ExternalIP</literal>。

source: SSH to the first host and install the wanted distribution in cluster mode.
es: Use SSH para el primer host e instale la distribución deseada en modo de clúster.
ja: 最初のホストにSSHで接続して、クラスタモードで必要なディストリビューションをインストールします。
pt_br: Acesse o primeiro host por SSH e instale a distribuição desejada no modo de cluster.
zh_cn: 通过 SSH 连接到第一台主机并以群集模式安装所需的发行版。

source: For RKE2:
es: Para RKE2:
ja: RKE2の場合:
pt_br: Para RKE2:
zh_cn: 对于 RKE2，使用以下命令：

source: For K3s:
es: Para K3s:
ja: K3sの場合:
pt_br: Para K3s:
zh_cn: 对于 K3s，使用以下命令：

source: Make sure that <literal>--disable=servicelb</literal> flag is provided in the <literal>k3s server</literal> command.
es: Asegúrese de que se proporciona el indicador <literal>--disable=servicelb</literal> en el comando <literal>k3s server</literal>.
ja: 必ず、<literal>k3s server</literal>コマンドで<literal>--disable=servicelb</literal>フラグを指定してください。
pt_br: Verifique se o sinalizador <literal>--disable=servicelb</literal> foi inserido no comando <literal>k3s server</literal>.
zh_cn: 确保在 <literal>k3s server</literal> 命令中提供 <literal>--disable=servicelb</literal> 标志。

source: From now on, the commands should be run on the local machine.
es: A partir de ahora, los comandos deben ejecutarse en el equipo local.
ja: これ以降、コマンドはローカルマシンで実行する必要があります。
pt_br: A partir de agora, os comandos devem ser executados na máquina local.
zh_cn: 从现在开始，应在本地计算机上运行命令。

source: To access the API server from outside, the IP of the RKE2/K3s VM will be used.
es: Para acceder al servidor de API desde el exterior, se utilizará la IP de la máquina virtual RKE2/K3s.
ja: APIサーバに外部からアクセスするには、RKE2/K3s VMのIPを使用します。
pt_br: Para acessar o servidor da API de um ambiente externo, o IP da VM do RKE2/K3s será usado.
zh_cn: 要从外部访问 API 服务器，需使用 RKE2/K3s VM 的 IP。

source: Configuring an existing cluster
es: Configuración de un clúster existente
ja: 既存のクラスタの設定
pt_br: Configurando um cluster existente
zh_cn: 配置现有群集

source: This step is valid only if you intend to use an existing RKE2/K3s cluster.
es: Este paso solo es válido si pretende utilizar un clúster RKE2/K3s existente.
ja: この手順は、既存のRKE2/K3sクラスタを使用する 場合にのみ有効です。
pt_br: Esta etapa é válida apenas se você pretende usar um cluster RKE2/K3s existente.
zh_cn: 仅当您要使用现有的 RKE2/K3s 群集时，此步骤才有效。

source: To use an existing cluster the <literal>tls-san</literal> flags should be modified. Additionally, the <literal>servicelb</literal> LB should be disabled for K3s.
es: Para usar un clúster existente, deben modificarse los indicadores <literal>tls-san</literal>. Además, el equilibrador de carga <literal>servicelb</literal> debe inhabilitarse para K3s.
ja: 既存のクラスタを使用するには、<literal>tls-san</literal>フラグを修正する必要があります。また、K3sでは<literal>servicelb</literal> LBを無効にする必要があります。
pt_br: Modifique os sinalizadores <literal>tls-san</literal> para usar um cluster existente. Além disso, o LB <literal>servicelb</literal> deve ser desabilitado no K3s.
zh_cn: 要使用现有群集，应修改 <literal>tls-san</literal> 标志，此外还应针对 K3s 禁用 <literal>servicelb</literal> LB。
