Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Cluster deprovisioning
es: Desaprovisionamiento del clúster
ja: クラスタのプロビジョニング解除
pt_br: Desprovisionamento do cluster
zh_cn: 群集取消置备

source: The downstream cluster may be deprovisioned by deleting the resources applied in the creation steps above:
es: El clúster descendente se puede desaprovisionar eliminando los recursos aplicados en los pasos anteriores:
ja: ダウンストリームクラスタをプロビジョニング解除するには、上記の作成手順で適用したリソースを削除します。
pt_br: É possível desprovisionar o cluster downstream excluindo os recursos que foram aplicados nas etapas de criação acima:
zh_cn: 可以通过删除上述创建步骤中应用的资源来取消置备下游群集：

source: This triggers deprovisioning of the BareMetalHost resources, which may take several minutes, after which they should be in available state again:
es: Esto activa el desaprovisionamiento de los recursos BareMetalHost, lo que puede tardar varios minutos, tras lo cual deberían volver a estar disponibles:
ja: これにより、BareMetalHostリソースのプロビジョニング解除がトリガされます。これには数分かかることがあり、その後リソースは再び利用可能な状態になります。
pt_br: Esse procedimento aciona o desprovisionamento dos recursos do BareMetalHost, o que pode levar bastante tempo. Depois disso, eles deverão voltar para o estado disponível:
zh_cn: 这会触发 BareMetalHost 资源的取消置备，此过程可能需要几分钟，之后，这些资源将再次处于可用状态：

source: Known issues
es: Problemas conocidos
ja: 既知の問題
pt_br: Problemas conhecidos
zh_cn: 已知问题

source: The upstream <link xl:href="https://github.com/metal3-io/ip-address-manager">IP Address Management controller</link> is currently not supported, because it’s not yet compatible with our choice of network configuration tooling and first-boot toolchain in SLEMicro.
es: El <link xl:href="https://github.com/metal3-io/ip-address-manager">controlador de gestión de direcciones IP</link> actualmente no se admite, ya que aún no es compatible con nuestras herramientas de configuración de red y la cadena de herramientas de primer arranque en SLEMicro.
ja: 現在、アップストリームの<link xl:href="https://github.com/metal3-io/ip-address-manager">IPアドレス管理コントローラ</link>はサポートされていません。このコントローラには、SLEMicroで選択されているネットワーク設定ツールと初回ブートツールチェーンとの互換性がまだないためです。
pt_br: O <link xl:href="https://github.com/metal3-io/ip-address-manager">controlador de gerenciamento de endereços IP</link> upstream não é suportado no momento porque ainda não é compatível com a nossa seleção de ferramentas de configuração de rede e conjunto de ferramentas de primeira inicialização no SLEMicro.
zh_cn: 目前不支持上游 <link xl:href="https://github.com/metal3-io/ip-address-manager">IP 地址管理控制器</link>，因为它与我们在 SLEMicro 中选择的网络配置工具和首次引导工具链尚不兼容。

source: Relatedly, the IPAM resources and Metal3DataTemplate networkData fields are not currently supported.
es: Del mismo modo, los recursos IPAM y los campos networkData de Metal3DataTemplate no son compatibles actualmente.
ja: 関連して、 IPAMリソースと、Metal3DataTemplateのnetworkDataフィールドは現在のところサポートされていません。
pt_br: De modo semelhante, os recursos IPAM e os campos networkData de Metal3DataTemplate não são suportados no momento.
zh_cn: 此外，也不支持相关的 IPAM 资源和 Metal3DataTemplate networkData 字段。

source: Only deployment via redfish-virtualmedia is currently supported.
es: Actualmente, solo se admite el despliegue mediante redfish-virtualmedia.
ja: redfish-virtualmediaを介したデプロイメントのみが現在サポートされています。
pt_br: Apenas há suporte para implantação por redfish-virtualmedia.
zh_cn: 目前仅支持通过 redfish-virtualmedia 进行部署。

source: It is possible to observe a network device name misalignment between the ironic python agent (IPA) and the target operating system (SL Micro 6.0/6.1), especially when trying to configure predictable names for the devices.
es: Es posible que el nombre del dispositivo de red del agente Python de Ironic (IPA) no coincida con el del sistema operativo de destino (SL Micro 6.0/6.1), especialmente al intentar configurar nombres predecibles para los dispositivos.
ja: Ironic Python Agent (IPA)とターゲットオペレーティングシステム(SL Micro 6.0/6.1)の間で、特に、デバイスに予測可能な名前を設定しようとする際に、ネットワークデバイス名の不整合が発生する可能性があります。
zh_cn: 在 Ironic Python Agent (IPA) 与目标操作系统 (SL Micro 6.0/6.1) 之间，可能会出现网络设备名称不匹配的情况，尤其是在尝试为设备配置可预测名称时。

source: This happens because the kernel of the ironic python agent (IPA) is not currently aligned with the kernel of the target operating system (SL Micro 6.0/6.1), therefore there’s a misalignment in the network drivers that allows the IPA to discover network devices in a different naming pattern than SL Micro expects.
es: Esto ocurre porque el kernel del agente Python de Ironic (IPA) no está actualmente alineado con el kernel del sistema operativo de destino (SL Micro 6.0/6.1), por lo tanto, hay una desalineación en los controladores de red que permiten al IPA descubrir dispositivos de red con un patrón de nombre diferente al que espera SL Micro.
ja: これが発生するのは、Ironic Python Agent (IPA)のカーネルが現在、ターゲットオペレーティングシステム(SL Micro 6.0/6.1)のカーネルと整合していないためです。これにより、ネットワークドライバに不整合が生じ、SL Microが想定する命名パターンとは異なる命名パターンでIPAがネットワークデバイスを検出できるようになります。
zh_cn: 出现此问题的原因是，当前 Ironic Python Agent (IPA) 的内核与目标操作系统 (SL Micro 6.0/6.1) 的内核未保持一致，导致网络驱动程序不匹配，使得 IPA 发现网络设备时采用的命名规则与 SL Micro 的预期不一致。

source: There are two different approaches to be used as a workaround in the meantime: * Create two different secrets with the network configuration, one to be used with the IPA using the device names as IPA will discover and use it as <literal>preprovisioningNetworkDataName</literal> on the <literal>BareMetalHost</literal> definition and another secret with the device names as SL Micro will discover and use it as <literal>networkData.name</literal> on the <literal>BareMetalHost</literal> definition. * Use the UUIDs to reference other interfaces on the generated nmconnection files instead. More details in the <link xl:href="..tips/metal3.adoc">tips and tricks</link> section.
es: Mientras tanto, se pueden utilizar como solución provisional dos enfoques: * Crear dos secretos diferentes con la configuración de red, uno que usará con el IPA y que usará los nombres de los dispositivos tal como los detectará el IPA y que se empleará como <literal>preprovisioningNetworkDataName</literal> en la definición <literal>BareMetalHost</literal>, y otro secreto con los nombres de los dispositivos tal y como los detectará SL Micro y que se empleará como <literal>networkData.name</literal> en la definición <literal>BareMetalHost</literal>. * O utilizar los UUID para hacer referencia a otras interfaces en los archivos nmconnection generados. Encontrará más detalles en la sección <link xl:href="..tips/metal3.adoc">Consejos y trucos</link>.
ja: 当面の回避策として、以下の2つの異なるアプローチが利用可能です。* ネットワーク設定で2つの異なるシークレットを作成します。1つはIPAが検出するデバイス名を使用したIPAで使用されるシークレットで、<literal>BareMetalHost</literal>定義の<literal>preprovisioningNetworkDataName</literal>として使用します。もう1つはSL Microが検出するデバイス名を使用したシークレットで、<literal>BareMetalHost</literal>定義の<literal>networkData.name</literal>として使用します。* 代わりに、生成されたnmconnectionファイル上の他のインタフェースを参照するためにUUIDを使用します。詳細は、<link xl:href="..tips/metal3.adoc">ヒントとコツ</link>セクションを参照してください。
zh_cn: 目前可采用以下两种方法作为临时解决方案：* 创建两个不同的网络配置机密，一个供 IPA 使用，其设备名称需与 IPA 发现的名称一致，并在 <literal>BareMetalHost</literal> 定义中用作 <literal>preprovisioningNetworkDataName</literal>；另一个机密的设备名称需与 SL Micro 发现的名称一致，并在 <literal>BareMetalHost</literal> 定义中用作 <literal>networkData.name</literal>。* 改用 UUID 在生成的 nmconnection 文件中引用其他接口。更多详细信息请参见相关<link xl:href="..tips/metal3.adoc">提示与技巧</link>。

source: Planned changes
es: Cambios previstos
ja: 予定されている変更
pt_br: Alterações planejadas
zh_cn: 计划的更改

source: Enable support of the IPAM resources and configuration via networkData fields
es: Habilitar la compatibilidad con los recursos y la configuración de IPAM a través de los campos networkData.
ja: networkDataフィールドを使用した、IPAMリソースと設定のサポートの有効化
pt_br: Habilitar suporte de recursos e configuração do IPAM pelos campos networkData
zh_cn: 通过 networkData 字段启用 IPAM 资源和配置支持

source: Additional resources
es: Recursos adicionales
ja: 追加のリソース
pt_br: Recursos adicionais
zh_cn: 其他资源

source: The SUSE Telco Cloud Documentation (<xref linkend="atip"/>) has examples of more advanced usage of Metal<superscript>3</superscript> for telco use-cases.
es: En la documentación de SUSE Telco Cloud (<xref linkend="atip"/>) se incluyen ejemplos de uso más avanzados de Metal<superscript>3</superscript> para su uso en telecomunicaciones.
ja: SUSE Telco Cloudドキュメント(<xref linkend="atip"/>)には、通信事業者のユースケースにおけるMetal<superscript>3</superscript>のより高度な使用例が記載されています。
zh_cn: SUSE Telco Cloud 文档（<xref linkend="atip"/>）中提供了针对电信领域使用场景的 Metal<superscript>3</superscript> 高级用法示例。

source: Single-node configuration
es: Configuración de un solo nodo
ja: シングルノード設定
pt_br: Configuração de nó único
zh_cn: 单节点配置

source: For test/PoC environments where the management cluster is a single node, it is possible to avoid the requirement for an additional floating IP managed via MetalLB.
es: En entornos de prueba/PoC en los que el clúster de gestión es de un solo nodo, no se necesita una IP fleetnte adicional gestionada a través de MetalLB.
ja: 管理クラスタがシングルノードであるテスト/PoC環境では、MetalLBを介して管理されるフローティングIPを追加する必要はありません。
pt_br: Para ambientes de teste/PoC em que o cluster de gerenciamento é um nó único, é possível evitar o requisito de IP flutuante adicional gerenciado por MetalLB.
zh_cn: 对于管理群集仅包含单个节点的测试/PoC 环境，可能不需要通过 MetalLB 管理额外的浮动 IP。

source: In this mode, the endpoint for the management cluster APIs is the IP of the management cluster, therefore it should be reserved when using DHCP or statically configured to ensure the management cluster IP does not change - referred to as <literal>&lt;MANAGEMENT_CLUSTER_IP&gt;</literal> below.
es: En este modo, el punto final para las API del clúster de gestión es la IP del clúster de gestión, por lo que debe reservarse cuando se utiliza DHCP o debe configurarse de forma estática para garantizar que la IP del clúster de gestión no cambie, lo que se denomina <literal>&lt;MANAGEMENT_CLUSTER_IP&gt;</literal> abajo.
ja: このモードでは、管理クラスタAPIのエンドポイントが管理クラスタのIPになるため、DHCPを使用している場合はそのIPを予約するか、管理クラスタのIPが変更されないように静的に設定する必要があります(以下では<literal>&lt;MANAGEMENT_CLUSTER_IP&gt;</literal>と表記しています)。
pt_br: Nesse modo, o endpoint para as APIs do cluster de gerenciamento é o IP do cluster de gerenciamento, portanto, ele deve ser reservado ao usar DHCP ou configurado estaticamente para garantir que não seja alterado. Mencionado abaixo como <literal>&lt;MANAGEMENT_CLUSTER_IP&gt;</literal>.
zh_cn: 在此模式下，管理群集 API 的端点是管理群集的 IP，因此在使用 DHCP 时应预留该 IP，或者配置静态 IP，以确保管理群集 IP 不会变化 - 在下面显示为 <literal>MANAGEMENT_CLUSTER_IP</literal>。

source: To enable this scenario, the Metal<superscript>3</superscript> chart values required are as follows:
es: Para habilitar este escenario, los valores necesarios del chart de Metal<superscript>3</superscript> son los siguientes:
ja: このシナリオを有効にするために必要なMetal<superscript>3</superscript>チャートの値は次のとおりです。
pt_br: Para possibilitar esse cenário, os valores do gráfico do Metal<superscript>3</superscript> necessários são estes:
zh_cn: 为了实现此方案，必须如下所示指定 Metal<superscript>3</superscript> chart 值：

source: Disabling TLS for virtualmedia ISO attachment
es: Inhabilitación de TLS para la conexión ISO de medios virtuales
ja: 仮想メディアISOをアタッチするためのTLSの無効化
pt_br: Desabilitando TLS para anexo de ISO de mídia virtual
zh_cn: 对虚拟媒体 ISO 挂接禁用 TLS

source: Some server vendors verify the SSL connection when attaching virtual-media ISO images to the BMC, which can cause a problem because the generated certificates for the Metal<superscript>3</superscript> deployment are self-signed, to work around this issue it’s possible to disable TLS only for the virtualmedia disk attachment with Metal<superscript>3</superscript> chart values as follows:
es: Algunos proveedores de servidores verifican la conexión SSL al conectar imágenes ISO de medios virtuales al BMC, lo que puede causar un problema porque los certificados generados para el despliegue de Metal<superscript>3</superscript> son autofirmados. Para solucionar este problema, es posible desactivar TLS solo para la conexión del disco de medios virtuales con los valores del chart de Metal<superscript>3</superscript> de la siguiente manera:
ja: 一部のサーバベンダは、仮想メディアISOイメージをBMCにアタッチする際にSSL接続を検証しますが、Metal<superscript>3</superscript>のデプロイメント用に生成された証明書は自己署名されているため、問題が発生する可能性があります。この問題を回避するには、次のようなMetal<superscript>3</superscript>チャートの値を使用して、仮想メディアディスクをアタッチする場合にのみTLSを無効にすることができます。
pt_br: Alguns fornecedores de servidor verificam a conexão SSL ao anexar imagens ISO de mídia virtual ao BMC, o que pode causar um problema porque os certificados gerados para a implantação do Metal<superscript>3</superscript> são autoassinados. Para solucionar esse problema, desabilite o TLS apenas para anexo de disco de mídia virtual com os valores do gráfico do Metal<superscript>3</superscript> a seguir:
zh_cn: 某些服务器供应商在将虚拟媒体 ISO 映像挂接到 BMC 时会验证 SSL 连接，这可能会导致出现问题，因为针对 Metal<superscript>3</superscript> 部署生成的证书是自我签名证书。要解决此问题，可以使用如下所示的 Metal<superscript>3</superscript> chart 值仅对虚拟媒体磁盘挂接禁用 TLS：

source: An alternative solution is to configure the BMCs with the CA cert - in this case you can read the certificates from the cluster using <literal>kubectl</literal>:
es: Una solución alternativa es configurar los BMC con el certificado de la CA; en este caso, puede leer los certificados del clúster utilizando <literal>kubectl</literal>:
ja: 別の解決策は、CA証明書を使用してBMCを設定することです。この場合、<literal>kubectl</literal>を使用してクラスタから証明書を読み込むことができます。
pt_br: Uma solução alternativa é configurar os BMCs com o certificado de CA. Nesse caso, você pode ler os certificados do cluster usando o <literal>kubectl</literal>:
zh_cn: 另一种解决方法是使用 CA 证书配置 BMC - 在这种情况下，可以使用 <literal>kubectl</literal> 从群集读取证书：

source: The certificate can then be configured on the server BMC console, although the process for that is vendor specific (and not possible for all vendors, in which case the <literal>enable_vmedia_tls</literal> flag may be required).
es: A continuación, el certificado se puede configurar en el panel de control del BMC del servidor, aunque ese proceso es específico de cada proveedor (y no es posible para todos los proveedores, en cuyo caso puede ser necesario el indicador <literal>enable_vmedia_tls</literal>).
ja: これにより、証明書をサーバのBMCコンソールで設定できますが、そのプロセスはベンダ固有です(すべてのベンダで可能というわけではなく、可能でない場合は<literal>enable_vmedia_tls</literal>フラグが必要なことがあります)。
pt_br: Depois disso, o certificado poderá ser configurado no console de BMC do servidor, embora o processo para isso seja específico do fornecedor (e pode não ser possível para todos os fornecedores e, consequentemente, exigir o uso do sinalizador <literal>enable_vmedia_tls</literal>).
zh_cn: 然后可以在服务器 BMC 控制台上配置证书，不过，配置过程因供应商而异（并且不一定适用于所有供应商，如果不适用，可能需要指定 <literal>enable_vmedia_tls</literal> 标志）。

source: Storage configuration
es: Configuración de almacenamiento
ja: ストレージ設定
pt_br: Configuração do armazenamento
zh_cn: 存储配置

source: For test/PoC environments where the management cluster is a single node, no persistent storage is required, but for production use-cases it is recommended to install SUSE Storage (Longhorn) on the management cluster so that images related to Metal<superscript>3</superscript> can be persisted during a pod restart/reschedule.
es: Para entornos de prueba/PoC en los que el clúster de gestión es de un solo nodo, no se requiere almacenamiento persistente, pero para casos de uso en producción se recomienda instalar SUSE Storage (Longhorn) en el clúster de gestión para que las imágenes relacionadas con Metal<superscript>3</superscript> puedan conservarse durante el reinicio/reprogramación de un pod.
ja: 管理クラスタがシングルノードであるテスト/PoC環境では、永続ストレージは不要ですが、運用ユースケースでは管理クラスタにSUSE Storage (Longhorn)をインストールすることをお勧めします。これによりPodの再起動/再スケジュール時にMetal<superscript>3</superscript>に関連するイメージを保持できます。
pt_br: Para ambientes de teste/PoC em que o cluster de gerenciamento é um nó único, não há necessidade de armazenamento persistente; mas em casos de uso de produção, a recomendação é instalar o SUSE Storage (Longhorn) no cluster de gerenciamento para que as imagens relacionadas ao Metal<superscript>3</superscript> persistam durante a reinicialização/reprogramação de um pod.
zh_cn: 在管理群集仅包含一个节点的测试/PoC 环境中，不需要持久性存储机制；但对于生产环境，建议在管理群集上安装 SUSE Storage (Longhorn)，以便与 Metal<superscript>3</superscript> 相关的映像在 Pod 重启或重新调度时能够保持持久性。

source: To enable this persistent storage, the Metal<superscript>3</superscript> chart values required are as follows:
es: Para habilitar este almacenamiento persistente, los valores necesarios del chart de Metal<superscript>3</superscript> son los siguientes:
ja: この永続ストレージを有効にするために必要なMetal<superscript>3</superscript>チャート値は次のとおりです。
pt_br: Para habilitar o armazenamento persistente, os valores do gráfico do Metal<superscript>3</superscript> necessários são estes:
zh_cn: 为了实现此持久性存储机制，必须如下所示指定 Metal<superscript>3</superscript> chart 值：

source: The SUSE Telco Cloud Management Cluster Documentation (<xref linkend="atip-management-cluster"/>) has more details on how to configure a management cluster with persistent storage.
es: En la documentación sobre el clúster de gestión de SUSE Telco Cloud (<xref linkend="atip-management-cluster"/>) se incluyen más detalles sobre cómo configurar un clúster de gestión con almacenamiento persistente.
ja: SUSE Telco Cloud管理クラスタのドキュメント(<xref linkend="atip-management-cluster"/>)には、永続ストレージを使用した管理クラスタの設定方法に関する詳細が記載されています。
zh_cn: SUSE Telco Cloud 管理群集文档（<xref linkend="atip-management-cluster"/>）详细介绍了如何配置使用持久性存储机制的管理群集。

source: Remote host onboarding with Elemental
es: Incorporación de hosts remotos con Elemental
ja: Elementalを使用したリモートホストのオンボーディング
pt_br: Integração remota de host com o Elemental
zh_cn: 使用 Elemental 进行远程主机接入

source: This section documents the "phone home network provisioning" solution as part of SUSE Edge, where we use Elemental to assist with node onboarding. Elemental is a software stack enabling remote host registration and centralized full cloud-native OS management with Kubernetes. In the SUSE Edge stack we use the registration feature of Elemental to enable remote host onboarding into Rancher so that hosts can be integrated into a centralized management platform and from there, deploy and manage Kubernetes clusters along with layered components, applications, and their lifecycle, all from a common place.
es: En esta sección se explica la solución de aprovisionamiento de red "phone home" (el comando que se usa, traducido como "llamar a casa") como parte de SUSE Edge. En ella se utiliza Elemental para ayudar con la incorporación de nodos. Elemental es una pila de software que permite el registro remoto de hosts y la gestión centralizada y totalmente nativa en la nube del sistema operativo con Kubernetes. En la pila de SUSE Edge se utiliza la función de registro de Elemental para permitir la incorporación remota de hosts en Rancher, de modo que los hosts puedan integrarse en una plataforma de gestión centralizada y, desde allí, desplegar y gestionar clústeres de Kubernetes junto con componentes en capas, aplicaciones y su ciclo de vida, todo desde un lugar común.
ja: このセクションでは、SUSE Edgeの一部としての「Phone Homeネットワークプロビジョニング」ソリューションについて説明します。このソリューションは、Elementalを使用してノードのオンボーディングを支援します。Elementalは、Kubernetesを使用してリモートホスト登録と一元化された完全なクラウドネイティブOS管理を可能にするソフトウェアスタックです。SUSE Edgeスタックでは、Elementalの登録機能を使用して、リモートホストをRancherにオンボーディングできます。これにより、ホストを集中管理プラットフォームに統合し、そこからKubernetesクラスタに加えて、階層化コンポーネント、アプリケーション、およびそのライフサイクルをすべて共通の場所からデプロイおよび管理できるようになります。
pt_br: Esta seção apresenta a solução de "provisionamento de rede 'phone home'" como parte do SUSE Edge, em que usamos o Elemental para auxiliar na integração de nós. O Elemental é uma pilha de software que permite o registro remoto de hosts e o gerenciamento de sistema operacional nativo de nuvem e totalmente centralizado com o Kubernetes. Na pilha do SUSE Edge, usamos o recurso de registro do Elemental para fazer a integração remota de hosts no Rancher, o que permite integrar os hosts a uma plataforma de gerenciamento centralizada e, nela, implantar e gerenciar os clusters Kubernetes junto com os componentes em camadas, os aplicativos e o ciclo de vida deles, tudo de um único local.
zh_cn: 本章介绍 SUSE Edge 中的“自主回连网络置备”解决方案。我们将使用 Elemental 来协助完成节点接入。Elemental 是一个软件堆栈，可用于注册远程主机和通过 Kubernetes 实现集中式云原生操作系统全面管理。在 SUSE Edge 堆栈中，我们将使用 Elemental 的注册功能将远程主机接入 Rancher，以便将主机集成到集中式管理平台，然后从该平台部署和管理 Kubernetes 群集以及分层组件、应用程序及其生命周期，所有这些操作都在一个中心位置完成。

source: This approach can be useful in scenarios where the devices that you want to control are not on the same network as the management cluster or do not have a out-of-band management controller onboard to allow more direct control, and where you’re booting many different "unknown" systems at the edge, and need to securely onboard and manage them at scale. This is a common scenario for use cases in retail, industrial IoT, or other spaces where you have little control over the network your devices are being installed in.
es: Este enfoque puede ser útil en situaciones en las que los dispositivos que se desean controlar no se encuentren en la misma red que el clúster de gestión o no dispongan de un controlador de gestión fuera de banda integrado que permita un control más directo, y en los que se están arrancando muchos sistemas "desconocidos" diferentes en el perímetro y es necesario incorporarlos y gestionarlos de forma segura a gran escala. Este es un escenario común para usos en el comercio minorista, el IoT industrial u otros espacios en los que se tiene poco control sobre la red en la que se instalan los dispositivos.
ja: このアプローチが役立つシナリオとしては、制御するデバイスが管理クラスタと同じネットワーク上にないか、アウトオブバンド管理コントローラが搭載されておらず、より直接的に制御できない場合や、さまざまな「不明」なシステムをエッジで多数ブートしており、それらを安全にオンボーディングして大規模に管理する必要がある場合が考えられます。これは、小売や産業用IoTなど、デバイスが設置されるネットワークをほとんど制御できない分野のユースケースによく見られるシナリオです。
pt_br: Essa abordagem pode ser útil em cenários em que os dispositivos que você deseja controlar não estão na mesma rede que o cluster de gerenciamento, ou não têm uma integração por controlador de gerenciamento fora da banda que permita um controle mais direto, e quando você inicializa vários sistemas "desconhecidos" na borda e precisa integrá-los e gerenciá-los com segurança e em escala. Esse cenário é comum nos casos de uso de varejo, IoT industrial ou em outros ambientes de baixo controle da rede em que os dispositivos são instalados.
zh_cn: 此方法在以下情况下可能很有用：您要控制的设备与管理群集不在同一网络中，或没有带外管理控制器接入功能可以进行更直接的控制；您要在边缘处引导许多不同的“未知”系统，并且需要安全地大规模接入和管理这些系统。这种情况在以下领域的使用场景中很常见：零售、工业物联网，或几乎无法通过设备要安装到的网络进行控制的其他领域。

source: quickstart elemental architecture
es: guía de inicio rápido de la arquitectura de elemental
ja: クイックスタートElementalアーキテクチャ
pt_br: início rápido da arquitetura do elemental
zh_cn: Elemental 体系结构快速入门

source: Resources needed
es: Recursos necesarios
ja: 必要なリソース
pt_br: Recursos necessários
zh_cn: 所需资源

source: The following describes the minimum system and environmental requirements to run through this quickstart:
es: A continuación se describen los requisitos mínimos del sistema y del entorno para la ejecución:
ja: このクイックスタートを実行するためのシステムと環境の最小要件を次に示します。
pt_br: Veja a seguir uma descrição dos requisitos mínimos de sistema e de ambiente para execução por meio desta inicilização rápida:
zh_cn: 下面说明了学习本快速入门所要满足的最低系统和环境要求：

source: A host for the centralized management cluster (the one hosting Rancher and Elemental):
es: Un host para el clúster de gestión centralizada (el que aloja Rancher y Elemental):
ja: 集中管理クラスタ(RancherとElementalをホストするクラスタ)用のホスト:
pt_br: Um host para o cluster de gerenciamento centralizado (o mesmo que hospeda o Rancher e o Elemental):
zh_cn: 集中式管理群集的主机（托管 Rancher 和 Elemental 的主机）：
