Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <literal>RKE2</literal> as the Kubernetes cluster. Depending on the use case, it can be configured to use specific CNI plugins, such as <literal>Multus</literal>, <literal>Cilium</literal>, <literal>Calico</literal>, etc.
es: <literal>RKE2</literal> como clúster de Kubernetes. Dependiendo del caso práctico, se puede configurar para utilizar complementos de CNI específicos, como <literal>Multus</literal>, <literal>Cilium</literal>, <literal>Calico</literal>, etc.
ja: <literal>RKE2</literal> (Kubernetesクラスタ)。ユースケースに応じて、<literal>Multus</literal>、<literal>Cilium</literal>、<literal>Calico</literal>などの特定のCNIプラグインを使用するように設定できます。
pt_br: <literal>RKE2</literal> como cluster Kubernetes. Dependendo do caso de uso, é possível configurá-lo para usar plug-ins de CNI específicos, como <literal>Multus</literal>, <literal>Cilium</literal>, <literal>Calico</literal> etc.
zh_cn: <literal>RKE2</literal>（Kubernetes 群集），可以根据使用场景将其配置为使用特定的 CNI 插件，例如 <literal>Multus</literal>、<literal>Cilium</literal>、<literal>Calico</literal> 等。

source: <literal>Rancher</literal> as the management platform to manage the lifecycle of the clusters.
es: <literal>Rancher</literal> como plataforma de gestión del ciclo de vida de los clústeres.
ja: <literal>Rancher</literal> (管理プラットフォーム)。クラスタのライフサイクルを管理します。
pt_br: <literal>Rancher</literal> como plataforma de gerenciamento para gerenciar o ciclo de vida dos clusters.
zh_cn: <literal>Rancher</literal>（管理平台），用于管理群集的生命周期。

source: <literal>Metal<superscript>3</superscript></literal> as the component to manage the lifecycle of the bare-metal nodes.
es: <literal>Metal<superscript>3</superscript></literal> como componente para gestionar el ciclo de vida de los nodos bare metal.
ja: <literal>Metal<superscript>3</superscript></literal> (コンポーネント)。ベアメタルノードのライフサイクルを管理します。
pt_br: <literal>Metal<superscript>3</superscript></literal> como componente para gerenciar o ciclo de vida dos nós bare metal.
zh_cn: <literal>Metal<superscript>3</superscript></literal>，该组件用于管理裸机节点的生命周期。

source: <literal>CAPI</literal> as the component to manage the lifecycle of the Kubernetes clusters (downstream clusters). The <literal>RKE2 CAPI Provider</literal> is used to manage the lifecycle of the RKE2 clusters.
es: <literal>CAPI</literal> como componente para gestionar el ciclo de vida de los clústeres de Kubernetes (clústeres descendentes). El <literal>proveedor CAPI de RKE2</literal> se utiliza para gestionar el ciclo de vida de los clústeres RKE2.
ja: <literal>CAPI</literal> (コンポーネント)。Kubernetesクラスタ(ダウンストリームクラスタ)のライフサイクルを管理します。<literal>RKE2 CAPI Provider</literal>は、RKE2クラスタのライフサイクルを管理するために使用されます。
pt_br: <literal>CAPI</literal> como componente para gerenciar o ciclo de vida dos clusters Kubernetes (downstream). O <literal>provedor CAPI RKE2</literal> é usado para gerenciar o ciclo de vida dos clusters RKE2.
zh_cn: <literal>CAPI</literal>，该组件用于管理 Kubernetes 群集（下游群集）的生命周期。<literal>RKE2 CAPI 提供程序</literal>也用于管理 RKE2 群集的生命周期。

source: With all components mentioned above, the management cluster can manage the lifecycle of downstream clusters, using a declarative approach to manage the infrastructure and applications.
es: Con todos los componentes mencionados, el clúster de gestión puede gestionar el ciclo de vida de los clústeres descendentes usando un enfoque declarativo para gestionar la infraestructura y las aplicaciones.
ja: 上記のコンポーネントをすべて使用すると、管理クラスタは、宣言型アプローチを使用してインフラストラクチャやアプリケーションを管理し、ダウンストリームクラスタのライフサイクルを管理できます。
pt_br: Com todos os componentes mencionados acima, o cluster de gerenciamento pode gerenciar o ciclo de vida dos clusters downstream, aplicando uma abordagem declarativa para gerenciar a infraestrutura e os aplicativos.
zh_cn: 通过上述所有组件，管理群集可以管理下游群集的生命周期，并使用声明式方法来管理基础架构和应用程序。

source: For more information about <literal>SUSE Linux Micro</literal>, see: SUSE Linux Micro (<xref linkend="components-slmicro"/>)
es: Para obtener más información sobre <literal>SUSE Linux Micro</literal>, consulte: SUSE Linux Micro (<xref linkend="components-slmicro"/>)
ja: <literal>SUSE Linux Micro</literal>の詳細については、「SUSE Linux Micro」(<xref linkend="components-slmicro"/>)を参照してください。
pt_br: Para obter mais informações sobre o <literal>SUSE Linux Micro</literal>, consulte: SUSE Linux Micro (<xref linkend="components-slmicro"/>)
zh_cn: 有关 <literal>SUSE Linux Micro</literal> 的详细信息，请参见<xref linkend="components-slmicro"/>

source: For more information about <literal>RKE2</literal>, see: RKE2 (<xref linkend="components-rke2"/>)
es: Para obtener más información sobre <literal>RKE2</literal>, consulte: RKE2 (<xref linkend="components-rke2"/>)
ja: <literal>RKE2</literal>の詳細については、「RKE2」(<xref linkend="components-rke2"/>)を参照してください。
pt_br: Para obter mais informações sobre o <literal>RKE2</literal>, consulte: RKE2 (<xref linkend="components-rke2"/>)
zh_cn: 有关 <literal>RKE2</literal> 的详细信息，请参见<xref linkend="components-rke2"/>

source: For more information about <literal>Rancher</literal>, see: Rancher (<xref linkend="components-rancher"/>)
es: Para obtener más información sobre <literal>Rancher</literal>, consulte: Rancher (<xref linkend="components-rancher"/>)
ja: <literal>Rancher</literal>の詳細については、「Rancher」(<xref linkend="components-rancher"/>)を参照してください。
pt_br: Para obter mais informações sobre o <literal>Rancher</literal>, consulte: Rancher (<xref linkend="components-rancher"/>)
zh_cn: 有关 <literal>Rancher</literal> 的详细信息，请参见<xref linkend="components-rancher"/>

source: For more information about <literal>Metal<superscript>3</superscript></literal>, see: Metal3 (<xref linkend="components-metal3"/>)
es: Para obtener más información sobre <literal>Metal<superscript>3</superscript></literal>, consulte: Metal3 (<xref linkend="components-metal3"/>)
ja: <literal>Metal<superscript>3</superscript></literal>の詳細については、「Metal3」(<xref linkend="components-metal3"/>)を参照してください。
pt_br: Para obter mais informações sobre o <literal>Metal<superscript>3</superscript></literal>, consulte: Metal3 (<xref linkend="components-metal3"/>)
zh_cn: 有关 <literal>Metal<superscript>3</superscript></literal> 的详细信息，请参见<xref linkend="components-metal3"/>

source: Steps to set up the management cluster
es: Pasos para configurar el clúster de gestión
ja: 管理クラスタの設定手順
pt_br: Etapas para configurar o cluster de gerenciamento
zh_cn: 设置管理群集的步骤

source: The following steps are necessary to set up the management cluster (using a single node):
es: Los siguientes pasos son necesarios para configurar el clúster de gestión (usando un único nodo):
ja: 管理クラスタを設定するには、次の手順が必要です(シングルノードを使用)。
pt_br: As seguintes etapas são necessárias para configurar o cluster de gerenciamento (de nó único):
zh_cn: 需要执行以下步骤来设置管理群集（使用单个节点）：

source: product atip mgmtcluster1
es: clúster gestión de producto atip 1
ja: 製品atip管理クラスタ1
pt_br: clustergrcmt1 produto atip
zh_cn: ATIP 产品管理群集 1

source: The following are the main steps to set up the management cluster using a declarative approach:
es: Estos son los pasos principales para configurar el clúster de gestión usando un enfoque declarativo:
ja: 宣言型アプローチを使用して管理クラスタを設定するための主な手順は次のとおりです。
pt_br: Veja a seguir as etapas principais para configurar o cluster de gerenciamento com uma abordagem declarativa:
zh_cn: 使用声明式方法设置管理群集需要执行以下主要步骤：

source: <emphasis role="strong">Image preparation for connected environments (<xref linkend="mgmt-cluster-image-preparation-connected"/>)</emphasis>: The first step is to prepare the manifests and files with all the necessary configurations to be used in connected environments.
es: <emphasis role="strong">Preparación de imágenes para entornos conectados (<xref linkend="mgmt-cluster-image-preparation-connected"/>)</emphasis>. El primer paso es preparar los manifiestos y los archivos con todas las configuraciones necesarias para su uso en entornos conectados.
ja: <emphasis role="strong">接続環境のイメージの準備(<xref linkend="mgmt-cluster-image-preparation-connected"/>)</emphasis>: 最初の手順では、接続環境で使用する必要がある設定をすべて含むマニフェストとファイルを準備します。
pt_br: <emphasis role="strong">Preparação da imagem para ambientes conectados (<xref linkend="mgmt-cluster-image-preparation-connected"/>)</emphasis>: a primeira etapa é preparar o manifesto e os arquivos com todas as configurações necessárias aos ambientes conectados.
zh_cn: <emphasis role="strong">为联网环境准备映像（<xref linkend="mgmt-cluster-image-preparation-connected"/>）</emphasis>：第一步是准备包含所有必要配置的清单和文件，以便在联网环境中使用。

source: Directory structure for connected environments (<xref linkend="mgmt-cluster-directory-structure"/>): This step creates a directory structure to be used by Edge Image Builder to store the configuration files and the image itself.
es: Estructura de directorios para entornos conectados (<xref linkend="mgmt-cluster-directory-structure"/>). Este paso crea una estructura de directorios que Edge Image Builder utilizará para almacenar los archivos de configuración y la propia imagen.
ja: 接続環境のディレクトリ構造(<xref linkend="mgmt-cluster-directory-structure"/>): この手順では、Edge Image Builderで使用するディレクトリ構造を作成し、設定ファイルとイメージそのものを保存します。
pt_br: Estrutura de diretórios para ambientes conectados (<xref linkend="mgmt-cluster-directory-structure"/>): esta etapa cria uma estrutura de diretórios que o Edge Image Builder usará para armazenar os arquivos de configuração e a própria imagem.
zh_cn: 联网环境的目录结构（<xref linkend="mgmt-cluster-directory-structure"/>）：此步骤创建一个目录结构，供 Edge Image Builder 用来存储配置文件和映像本身。

source: Management cluster definition file (<xref linkend="mgmt-cluster-image-definition-file"/>): The <literal>mgmt-cluster.yaml</literal> file is the main definition file for the management cluster. It contains the following information about the image to be created:
es: Archivo de definición del clúster de gestión (<xref linkend="mgmt-cluster-image-definition-file"/>). El archivo <literal>mgmt-cluster.yaml</literal> es el archivo de definición principal del clúster de gestión. Contiene la siguiente información sobre la imagen que se va a crear:
ja: 管理クラスタ定義ファイル(<xref linkend="mgmt-cluster-image-definition-file"/>): <literal>mgmt-cluster.yaml</literal>ファイルが管理クラスタのメイン定義ファイルです。このファイルには、作成するイメージに関する次の情報が含まれています。
pt_br: Arquivo de definição do cluster de gerenciamento (<xref linkend="mgmt-cluster-image-definition-file"/>): o <literal>mgmt-cluster.yaml</literal> é o principal arquivo de definição do cluster de gerenciamento. Ele inclui as seguintes informações sobre a imagem que será criada:
zh_cn: 管理群集定义文件（<xref linkend="mgmt-cluster-image-definition-file"/>）：<literal>mgmt-cluster.yaml</literal> 文件是管理群集的主定义文件。其中包含有关所要创建的映像的以下信息：

source: Image Information: The information related to the image to be created using the base image.
es: Información de la imagen: la información relacionada con la imagen que se creará utilizando la imagen base.
ja: イメージ情報: ゴールデンイメージを使用して作成するイメージに関する情報。
pt_br: Informações da imagem: as informações relacionadas à imagem que será criada usando a imagem base.
zh_cn: 映像信息：与要使用基础映像创建的映像相关的信息。

source: Operating system: The operating system configurations to be used in the image.
es: Sistema operativo: las configuraciones del sistema operativo que se utilizarán en la imagen.
ja: オペレーティングシステム: イメージで使用するオペレーティングシステムの設定。
pt_br: Sistema operacional: a configuração do sistema operacional que será usada na imagem.
zh_cn: 操作系统：要在映像中使用的操作系统配置。

source: Kubernetes: Helm charts and repositories, kubernetes version, network configuration, and the nodes to be used in the cluster.
es: Kubernetes: los charts de Helm y los repositorios, la versión de Kubernetes, la configuración de red y los nodos que se utilizarán en el clúster.
ja: Kubernetes: Helmチャートとリポジトリ、Kubernetesのバージョン、ネットワーク設定、およびクラスタで使用するノード。
pt_br: Kubernetes: repositórios e gráficos Helm, versão do kubernetes, configuração de rede e os nós que serão usados no cluster.
zh_cn: Kubernetes：要在群集中使用的 Helm chart 和储存库、Kubernetes 版本、网络配置以及节点。

source: Custom folder (<xref linkend="mgmt-cluster-custom-folder"/>): The <literal>custom</literal> folder contains the configuration files and scripts to be used by Edge Image Builder to deploy a fully functional management cluster.
es: Carpeta personalizada (<xref linkend="mgmt-cluster-custom-folder"/>). La carpeta <literal>custom</literal> contiene los archivos de configuración y los guiones que utilizará Edge Image Builder para desplegar un clúster de gestión totalmente funcional.
ja: Customフォルダ(<xref linkend="mgmt-cluster-custom-folder"/>): <literal>custom</literal>フォルダには設定ファイルとスクリプトが含まれ、Edge Image Builderはこれらを使用して完全に機能する管理クラスタをデプロイします。
pt_br: Pasta custom (<xref linkend="mgmt-cluster-custom-folder"/>): a pasta <literal>custom</literal> contém os arquivos de configuração e os scripts que o Edge Image Builder usará para implantar um cluster totalmente funcional.
zh_cn: Custom 文件夹（<xref linkend="mgmt-cluster-custom-folder"/>）：<literal>custom</literal> 文件夹包含的配置文件和脚本供 Edge Image Builder 用来部署功能完备的管理群集。

source: Files: Contains the configuration files to be used by the management cluster.
es: Archivos: contiene los archivos de configuración que utilizará el clúster de gestión.
ja: ファイル: 管理クラスタが使用する設定ファイルが含まれています。
pt_br: Arquivos: contêm os arquivos de configuração que serão usados pelo cluster de gerenciamento.
zh_cn: Files 文件夹：包含管理群集要使用的配置文件。

source: Scripts: Contains the scripts to be used by the management cluster.
es: Guiones: contiene los guiones que utilizará el clúster de gestión.
ja: スクリプト: 管理クラスタが使用するスクリプトが含まれています。
pt_br: Scripts: contêm os scripts que serão usados pelo cluster de gerenciamento.
zh_cn: Scripts 文件夹：包含管理群集要使用的脚本。

source: Kubernetes folder (<xref linkend="mgmt-cluster-kubernetes-folder"/>): The <literal>kubernetes</literal> folder contains the configuration files to be used by the management cluster.
es: Carpeta de Kubernetes (<xref linkend="mgmt-cluster-kubernetes-folder"/>). La carpeta <literal>kubernetes</literal> contiene los archivos de configuración que utilizará el clúster de gestión.
ja: Kubernetesフォルダ(<xref linkend="mgmt-cluster-kubernetes-folder"/>): <literal>kubernetes</literal>フォルダには、管理クラスタが使用する設定ファイルが含まれています。
pt_br: Pasta kubernetes (<xref linkend="mgmt-cluster-kubernetes-folder"/>): a pasta <literal>kubernetes</literal> contém os arquivos de configuração que serão usados pelo cluster de gerenciamento.
zh_cn: Kubernetes 文件夹（<xref linkend="mgmt-cluster-kubernetes-folder"/>）：<literal>kubernetes</literal> 文件夹包含管理群集要使用的配置文件。

source: Manifests: Contains the manifests to be used by the management cluster.
es: Manifiestos: contiene los manifiestos que utilizará el clúster de gestión.
ja: Manifests: 管理クラスタが使用するマニフェストが含まれています。
pt_br: Manifestos: contêm os manifestos que serão usados pelo cluster de gerenciamento.
zh_cn: Manifests 文件夹：包含管理群集要使用的清单。

source: Helm: Contains the Helm values files to be used by the management cluster.
es: Helm: contiene los archivos de valores de Helm que utilizará el clúster de gestión.
ja: Helm: 管理クラスタによって使用されるHelm値ファイルが含まれます。
pt_br: Helm: contém os arquivos de valores do Helm que serão usados pelo cluster de gerenciamento.
zh_cn: Helm：包含管理群集要使用的 Helm 值文件。

source: Config: Contains the configuration files to be used by the management cluster.
es: Config: contiene los archivos de configuración que utilizará el clúster de gestión.
ja: Config: 管理クラスタが使用する設定ファイルが含まれています。
pt_br: Config: contém os arquivos de configuração que serão usados pelo cluster de gerenciamento.
zh_cn: Config 文件夹：包含管理群集要使用的配置文件。

source: Network folder (<xref linkend="mgmt-cluster-network-folder"/>): The <literal>network</literal> folder contains the network configuration files to be used by the management cluster nodes.
es: Carpeta de red (<xref linkend="mgmt-cluster-network-folder"/>). La carpeta <literal>network</literal> contiene los archivos de configuración de red que utilizarán los nodos del clúster de gestión.
ja: Networkフォルダ(<xref linkend="mgmt-cluster-network-folder"/>): <literal>network</literal>フォルダには、管理クラスタノードが使用するネットワーク設定ファイルが含まれています。
pt_br: Pasta network (<xref linkend="mgmt-cluster-network-folder"/>): a pasta <literal>network</literal> contém os arquivos de configuração de rede que serão usados pelos nós do cluster de gerenciamento.
zh_cn: Network 文件夹（<xref linkend="mgmt-cluster-network-folder"/>）：<literal>network</literal> 文件夹包含管理群集节点要使用的网络配置文件。

source: <emphasis role="strong">Image preparation for air-gap environments (<xref linkend="mgmt-cluster-image-preparation-airgap"/>)</emphasis>: The step is to show the differences to prepare the manifests and files to be used in an air-gap scenario.
es: <emphasis role="strong">Preparación de imágenes para entornos aislados (<xref linkend="mgmt-cluster-image-preparation-airgap"/>)</emphasis>. El paso consiste en mostrar las diferencias para preparar los manifiestos y los archivos que se utilizarán en un entorno aislado.
ja: <emphasis role="strong">エアギャップ環境でのイメージの準備(<xref linkend="mgmt-cluster-image-preparation-airgap"/>)</emphasis>: この手順では、エアギャップシナリオで使用するマニフェストとファイルを準備する際の相違点を示します。
pt_br: <emphasis role="strong">Preparação da imagem para ambientes air-gapped (<xref linkend="mgmt-cluster-image-preparation-airgap"/>)</emphasis>: a etapa mostra as diferenças para preparar os manifestos e os arquivos que serão usados em um cenário air-gapped.
zh_cn: <emphasis role="strong">为隔离环境准备映像（<xref linkend="mgmt-cluster-image-preparation-airgap"/>）</emphasis>：此步骤将说明与非隔离场景相比，准备要在隔离场景中使用的清单和文件有哪些差别。

source: Modifications in the definition file (<xref linkend="mgmt-cluster-image-definition-file-airgap"/>): The <literal>mgmt-cluster.yaml</literal> file must be modified to include the <literal>embeddedArtifactRegistry</literal> section with the <literal>images</literal> field set to all container images to be included into the EIB output image.
es: Modificaciones en el archivo de definición (<xref linkend="mgmt-cluster-image-definition-file-airgap"/>). El archivo <literal>mgmt-cluster.yaml</literal> debe modificarse para incluir la sección <literal>embeddedArtifactRegistry</literal> con el campo <literal>images</literal> establecido en todas las imágenes de contenedor que se incluirán en la imagen de salida de EIB.
ja: 定義ファイルの変更(<xref linkend="mgmt-cluster-image-definition-file-airgap"/>): <literal>mgmt-cluster.yaml</literal>ファイルを変更して<literal>embeddedArtifactRegistry</literal>セクションを含め、<literal>images</literal>フィールドに、EIBの出力イメージに組み込むすべてのコンテナイメージを設定する必要があります。
pt_br: Modificações no arquivo de definição (<xref linkend="mgmt-cluster-image-definition-file-airgap"/>): o arquivo <literal>mgmt-cluster.yaml</literal> deve ser modificado para incluir a seção <literal>embeddedArtifactRegistry</literal> com o campo <literal>images</literal> definido para que todas as imagens do contêiner sejam incluídas na imagem de saída do EIB.
zh_cn: 定义文件中的修改（<xref linkend="mgmt-cluster-image-definition-file-airgap"/>）：必须修改 <literal>mgmt-cluster.yaml</literal> 文件，以包含 <literal>embeddedArtifactRegistry</literal> 部分，并将 <literal>images</literal> 字段设置为要包含在 EIB 输出映像中的所有容器映像。

source: Modifications in the custom folder (<xref linkend="mgmt-cluster-custom-folder-airgap"/>): The <literal>custom</literal> folder must be modified to include the resources needed to run the management cluster in an air-gap environment.
es: Modificaciones en la carpeta custom (<xref linkend="mgmt-cluster-custom-folder-airgap"/>). La carpeta <literal>custom</literal> debe modificarse para incluir los recursos necesarios para ejecutar el clúster de gestión en un entorno aislado.
ja: customフォルダの変更(<xref linkend="mgmt-cluster-custom-folder-airgap"/>): <literal>custom</literal>フォルダを変更し、管理クラスタをエアギャップ環境で実行するために必要なリソースを含める必要があります。
pt_br: Modificações na pasta custom (<xref linkend="mgmt-cluster-custom-folder-airgap"/>): a pasta <literal>custom</literal> deve ser modificada para incluir os recursos necessários para executar o cluster de gerenciamento em um ambiente air-gapped.
zh_cn: custom 文件夹中的修改（<xref linkend="mgmt-cluster-custom-folder-airgap"/>）：必须修改 <literal>custom</literal> 文件夹，以包含用于在隔离环境中运行管理群集的资源。

source: Register script: The <literal>custom/scripts/99-register.sh</literal> script must be removed when you use an air-gap environment.
es: Guion de registro: el guion <literal>custom/scripts/99-register.sh</literal> debe eliminarse cuando se utiliza un entorno aislado.
ja: 登録スクリプト: エアギャップ環境を使用する場合、<literal>custom/scripts/99-register.sh</literal>スクリプトを削除する必要があります。
pt_br: Script de registro: o script <literal>custom/scripts/99-register.sh</literal> deve ser removido quando você usa um ambiente air-gapped.
zh_cn: 注册脚本：使用隔离环境时，必须去除 <literal>custom/scripts/99-register.sh</literal> 脚本。

source: Modifications in the helm values folder (<xref linkend="mgmt-cluster-helm-values-folder-airgap"/>): The <literal>helm/values</literal> folder must be modified to include the configuration needed to run the management cluster in an air-gap environment.
es: Modificaciones en la carpeta de valores de Helm (<xref linkend="mgmt-cluster-helm-values-folder-airgap"/>). La carpeta <literal>helm/values</literal> debe modificarse para incluir la configuración necesaria para ejecutar el clúster de gestión en un entorno aislado.
ja: helm値フォルダ(<xref linkend="mgmt-cluster-helm-values-folder-airgap"/>)での変更: <literal>helm/values</literal>フォルダはエアギャップ環境で管理クラスタを実行するために必要な設定を含むように変更する必要があります。
pt_br: Modificações na pasta de valores do Helm (<xref linkend="mgmt-cluster-helm-values-folder-airgap"/>): a pasta <literal>helm/values</literal> deve ser modificada para incluir a configuração necessária para executar o cluster de gerenciamento em um ambiente air-gapped.
zh_cn: Helm 值文件夹中的修改（<xref linkend="mgmt-cluster-helm-values-folder-airgap"/>）：必须修改 <literal>helm/values</literal> 文件夹，以包含在隔离环境中运行管理群集所需的配置。

source: <emphasis role="strong">Image creation (<xref linkend="mgmt-cluster-image-creation"/>)</emphasis>: This step covers the creation of the image using the Edge Image Builder tool (for both, connected and air-gap scenarios). Check the prerequisites (<xref linkend="components-eib"/>) to run the Edge Image Builder tool on your system.
es: <emphasis role="strong">Creación de la imagen (<xref linkend="mgmt-cluster-image-creation"/>)</emphasis>. Este paso abarca la creación de la imagen mediante la herramienta Edge Image Builder (tanto para escenarios conectados como en entornos aislados). Compruebe los requisitos previos (<xref linkend="components-eib"/>) para ejecutar la herramienta Edge Image Builder en su sistema.
ja: <emphasis role="strong">イメージの作成(<xref linkend="mgmt-cluster-image-creation"/>)</emphasis>: この手順では、Edge Image Builderツールを使用してイメージを作成します(接続環境とエアギャップ環境の両方が対象です)。ご使用のシステムでEdge Image Builderツールを実行するための前提条件(<xref linkend="components-eib"/>)を確認してください。
pt_br: <emphasis role="strong">Criação da imagem (<xref linkend="mgmt-cluster-image-creation"/>)</emphasis>: esta etapa abrange a criação da imagem com a ferramenta Edge Image Builder (para os cenários tanto conectados quanto air-gapped). Consulte os pré-requisitos (<xref linkend="components-eib"/>) para executar a ferramenta Edge Image Builder no seu sistema.
zh_cn: <emphasis role="strong">创建映像（<xref linkend="mgmt-cluster-image-creation"/>）</emphasis>：此步骤使用 Edge Image Builder 工具创建映像（适用于联网场景和隔离场景）。在系统上运行 Edge Image Builder 工具之前，请先检查先决条件（<xref linkend="components-eib"/>）。
