Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: In this section, you are going to install the NVIDIA drivers directly onto the SUSE Linux Micro operating system as the NVIDIA open-driver is now part of the core SUSE Linux Micro package repositories, which makes it as easy as installing the required RPM packages. There is no compilation or downloading of executable packages required. Below we walk through deploying the "G06" generation of driver, which supports the latest GPUs (see <link xl:href="https://en.opensuse.org/SDB:NVIDIA_drivers#Install">here</link> for further information), so select an appropriate driver generation for the NVIDIA GPU that your system has. For modern GPUs, the "G06" driver is the most common choice.
es: En esta sección, va a instalar los controladores de NVIDIA directamente en el sistema operativo SUSE Linux Micro, ya que el controlador de código abierto de NVIDIA ahora forma parte de los repositorios de paquetes principales de SUSE Linux Micro. De esta forma, basta con instalar los paquetes RPM necesarios. No es necesario compilar ni descargar paquetes ejecutables. A continuación, le guiaremos a través del despliegue de la generación "G06" del controlador, que admite las GPU más recientes (consulte <link xl:href="https://en.opensuse.org/SDB:NVIDIA_drivers#Install">este documento</link> para obtener más información). Debe seleccionar la generación adecuada del controlador de GPU de NVIDIA de su sistema. Para las GPU modernas, el controlador "G06" es la opción más habitual.
ja: このセクションでは、NVIDIAドライバをSUSE Linux Microオペレーティングシステムに直接インストールします。これはopen版NVIDIAドライバがSUSE Linux Microのコアパッケージリポジトリの一部となったためであり、必須のRPMパッケージをインストールするのと同じように簡単にインストールできるようになりました。実行可能パッケージのコンパイルやダウンロードは必要ありません。以下では、最新のGPUをサポートする「G06」世代ドライバのデプロイについて手順を追って説明します(詳細については<link xl:href="https://en.opensuse.org/SDB:NVIDIA_drivers#Install">こちら</link>を参照してください)。ご使用のシステムに搭載されているNVIDIA GPUに適切なドライバ世代を選択してください。最新のGPUでは、「G06」ドライバが最も一般的な選択肢です。
pt_br: Nesta seção, você vai instalar os drivers da NVIDIA diretamente no sistema operacional SUSE Linux Micro, já que o driver de código aberto da NVIDIA agora faz parte dos repositórios de pacotes principais do SUSE Linux Micro, o que o torna tão fácil de instalar quanto os pacotes RPM obrigatórios. Não há necessidade de compilação nem download de pacotes executáveis. Veja a seguir como implantar a geração "G06" do driver, que oferece suporte às GPUs mais recentes (consulte <link xl:href="https://en.opensuse.org/SDB:NVIDIA_drivers#Install">aqui</link> para obter mais informações). Sendo assim, selecione a geração do driver apropriada à GPU NVIDIA do seu sistema. Para GPUs modernas, o driver "G06" é a opção mais comum.
zh_cn: 本节介绍如何直接将 NVIDIA 驱动程序安装到 SUSE Linux Micro 操作系统上，因为 NVIDIA 开放驱动程序现在包含在核心 SUSE Linux Micro 软件包储存库中，因此，只需安装所需的 RPM 软件包就能安装这些驱动程序。无需编译或下载可执行软件包。下面介绍如何部署支持最新 GPU 的第六代 (G06) 驱动程序（有关更多信息，请参见<link xl:href="https://en.opensuse.org/SDB:NVIDIA_drivers#Install">此处</link>），请选择适合您系统中的 NVIDIA GPU 的驱动程序代系。对于新式 GPU，“G06”驱动程序是最常见的选择。

source: Before we begin, it is important to recognize that besides the NVIDIA open-driver that SUSE ships as part of SUSE Linux Micro, you might also need additional NVIDIA components for your setup. These could include OpenGL libraries, CUDA toolkits, command-line utilities such as <literal>nvidia-smi</literal>, and container-integration components such as <literal>nvidia-container-toolkit</literal>. Many of these components are not shipped by SUSE as they are proprietary NVIDIA software, or it makes no sense for us to ship them instead of NVIDIA. Therefore, as part of the instructions, we are going to configure additional repositories that give us access to said components and walk through certain examples of how to use these tools, resulting in a fully functional system. It is important to distinguish between SUSE repositories and NVIDIA repositories, as occasionally there can be a mismatch between the package versions that NVIDIA makes available versus what SUSE has built. This usually arises when SUSE makes a new version of the open-driver available, and it takes a couple of days before the equivalent packages are made available in NVIDIA repositories to match.
es: Antes de comenzar, tenga en cuenta que, además del controlador de código abierto de NVIDIA que SUSE incluye en SUSE Linux Micro, es posible que necesite componentes adicionales de NVIDIA para su configuración. Por ejemplo, bibliotecas OpenGL, kits de herramientas CUDA, utilidades de línea de comandos como <literal>nvidia-smi</literal> y componentes de integración de contenedores como <literal>nvidia-container-toolkit</literal>. SUSE no suministra muchos de estos componentes, ya sea porque son software propiedad de NVIDIA o porque no tiene sentido que los suministremos nosotros en lugar de NVIDIA. Por lo tanto, como parte de las instrucciones, configuraremos repositorios adicionales que nos den acceso a dichos componentes y veremos algunos ejemplos de uso de estas herramientas, de modo que el sistema resultante será totalmente funcional. Es importante distinguir entre los repositorios de SUSE y los de NVIDIA, ya que en ocasiones puede haber una discrepancia entre las versiones de los paquetes que NVIDIA pone a disposición y las que SUSE ha creado. Esto suele ocurrir cuando SUSE lanza una nueva versión del controlador de código abierto y pasan un par de días antes de que los paquetes equivalentes estén disponibles en los repositorios de NVIDIA.
ja: 始める前に、SUSEがSUSE Linux Microの一部として出荷するopen版NVIDIAドライバのほかに、ご自身のセットアップに追加のNVIDIAコンポーネントも必要な場合があることを認識しておくことが重要です。たとえば、OpenGLライブラリ、CUDAツールキット、 <literal>nvidia-smi</literal>などのコマンドラインユーティリティ、<literal>nvidia-container-toolkit</literal>などのコンテナ統合コンポーネントです。これらのコンポーネントの多くはNVIDIA独自のソフトウェアであるため、SUSEからは出荷されません。また、NVIDIAの代わりにSUSEが出荷しても意味がありません。そのため、説明の一環として、これらのコンポーネントにアクセスできるようにする追加のリポジトリを設定し、これらのツールの使用方法の例をいくつか説明し、完全に機能するシステムを作成します。SUSEのリポジトリとNVIDIAのリポジトリを区別することが重要です。これは、NVIDIAが提供するパッケージのバージョンとSUSEが構築したものが一致しない場合があるためです。これは通常、SUSEがopen版ドライバの新バージョンを利用可能にしたときに発生し、NVIDIAのリポジトリで同等のパッケージが利用可能になるまでに数日かかります。
pt_br: Antes de começar, é importante reconhecer que, além do driver de código aberto da NVIDIA que a SUSE distribui como parte do SUSE Linux Micro, você precisa de componentes NVIDIA adicionais para sua configuração. Eles podem ser bibliotecas OpenGL, kits de ferramentas CUDA, utilitários de linha de comando, como <literal>nvidia-smi</literal>, e componentes de integração de contêiner, como <literal>nvidia-container-toolkit</literal>. Muitos desses componentes não são distribuídos pela SUSE porque são softwares proprietários da NVIDIA, ou porque não faz sentido distribuí-los no lugar da NVIDIA. Portanto, como parte das instruções, vamos configurar repositórios adicionais para termos acesso a esses componentes e percorrer alguns exemplos de como usar essas ferramentas para obter um sistema totalmente funcional. É importante diferenciar entre os repositórios SUSE e NVIDIA, já que pode haver incompatibilidade entre as versões dos pacotes que a NVIDIA disponibiliza e as que a SUSE compilou. Geralmente, isso acontece quando a SUSE cria uma nova versão do driver de código aberto disponível e leva alguns dias até que os pacotes equivalentes sejam disponibilizados nos repositórios NVIDIA para compatibilidade.
zh_cn: 在开始之前，需要明确一点，除了 SUSE 在 SUSE Linux Micro 中随附的 NVIDIA 开放驱动程序之外，您的配置可能还需要其他 NVIDIA 组件。这些组件可能包括 OpenGL 库、CUDA 工具包、命令行实用程序（例如 <literal>nvidia-smi</literal>）和容器集成组件（例如 <literal>nvidia-container-toolkit</literal>）。其中许多组件并非由 SUSE 提供，因为它们属于 NVIDIA 的专有软件，或者由我们而非 NVIDIA 来提供这些组件并不合理。因此，在本指南的操作步骤中，我们将配置额外的储存库以便获取上述组件，并通过一些示例说明如何使用这些工具，最终搭建出一个功能完整的系统。需要注意区分 SUSE 储存库和 NVIDIA 储存库，因为两者提供的软件包版本偶尔会出现不匹配的情况。这种情况通常发生在 SUSE 发布了新版本的开放驱动程序后，NVIDIA 储存库可能需要几天时间才能提供与之匹配的对应版本软件包。

source: We recommend that you ensure that the driver version that you are selecting is compatible with your GPU and meets any CUDA requirements that you may have by checking:
es: Le recomendamos que se asegure de que la versión del controlador que selecciona sea compatible con su GPU y cumpla con los requisitos de CUDA que pueda tener. Compruebe lo siguiente:
ja: 以下をチェックして、選択するドライババージョンがGPUと互換性があり、CUDAの要件を満たしていることを確認することをお勧めします。
pt_br: A recomendação é garantir que você selecione uma versão do driver compatível com a GPU e que atenda aos possíveis requisitos de CUDA verificando o seguinte:
zh_cn: 我们建议您采取以下措施来确保所选驱动程序版本与您的 GPU 兼容并符合现有的任何 CUDA 要求：

source: The <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">CUDA release notes</link>
es: Las <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">notas de la versión de CUDA</link>
ja: <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">CUDAリリースノート</link>
pt_br: As <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">Notas de lançamento de CUDA</link>
zh_cn: 查看 <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">CUDA 发行说明</link>

source: The driver version that you plan on deploying has a matching version in the <link xl:href="https://download.nvidia.com/suse/sle15sp6/x86_64/">NVIDIA repository</link> and ensuring that you have equivalent package versions for the supporting components available
es: Que la versión del controlador que tiene previsto desplegar tenga una versión equivalente en el <link xl:href="https://download.nvidia.com/suse/sle15sp6/x86_64/">repositorio de NVIDIA</link> y que dispone de versiones equivalentes de los paquetes para los componentes relacionados
ja: デプロイを計画しているドライババージョンが、<link xl:href="https://download.nvidia.com/suse/sle15sp6/x86_64/">NVIDIAリポジトリ</link>に一致するバージョンがあり、サポートコンポーネントの同等のパッケージバージョンが利用可能であることを確認します。
pt_br: A versão do driver que você pretende implantar tem uma versão correspondente no <link xl:href="https://download.nvidia.com/suse/sle15sp6/x86_64/">repositório NVIDIA</link> e é certeza de que há versões de pacote equivalentes para os componentes de suporte disponíveis
zh_cn: 检查您要部署的驱动程序版本是否在 <link xl:href="https://download.nvidia.com/suse/sle15sp6/x86_64/">NVIDIA 储存库</link>中有匹配的版本，并确保支持组件有可用的对应软件包版本

source: To find the NVIDIA open-driver versions, either run <literal>zypper se -s nvidia-open-driver</literal> on the target machine <emphasis>or</emphasis> search the SUSE Customer Center for the "nvidia-open-driver" in <link xl:href="https://scc.suse.com/packages?name=SUSE%20Linux%20Micro&amp;version=6.1&amp;arch=x86_64">SUSE Linux Micro 6.1 for AMD64/Intel 64</link>.
es: Para localizar las versiones del controlador de código abierto de NVIDIA, ejecute <literal>zypper se -s nvidia-open-driver</literal> en el equipo de destino <emphasis>o</emphasis> busque "nvidia-open-driver" en el Centro de servicios al cliente de SUSE en <link xl:href="https://scc.suse.com/packages?name=SUSE%20Linux%20Micro&amp;version=6.1&amp;arch=x86_64">SUSE Linux Micro 6.1 para AMD64/Intel 64</link>.
ja: NVIDIAオープンドライババージョンを確認するには、ターゲットマシンで<literal>zypper se -s nvidia-open-driver</literal>を実行するか、<emphasis>または</emphasis>SUSE Customer Centerで<link xl:href="https://scc.suse.com/packages?name=SUSE%20Linux%20Micro&amp;version=6.1&amp;arch=x86_64">SUSE Linux Micro 6.1 for AMD64/Intel 64</link>の「nvidia-open-driver」を検索します。
pt_br: Para encontrar as versões de driver de código aberto da NVIDIA, execute <literal>zypper se -s nvidia-open-driver</literal> na máquina de destino <emphasis>ou</emphasis> pesquise no SUSE Customer Center por "nvidia-open-driver" no <link xl:href="https://scc.suse.com/packages?name=SUSE%20Linux%20Micro&amp;version=6.1&amp;arch=x86_64">SUSE Linux Micro 6.1 para AMD64/Intel 64</link>.
zh_cn: 要查找 NVIDIA 开放驱动程序版本，请在目标计算机上运行 <literal>zypper se -s nvidia-open-driver</literal>，<emphasis>或者</emphasis>在 SUSE Customer Center 上<link xl:href="https://scc.suse.com/packages?name=SUSE%20Linux%20Micro&amp;version=6.1&amp;arch=x86_64">适用于 AMD64/Intel64 的 SUSE Linux Micro 6.1</link> 中搜索“nvidia-open-driver”。

source: SUSE Customer Centre
es: Centro de servicios al cliente de SUSE
pt_br: SUSE Customer Center
zh_cn: SUSE Customer Center

source: When you have confirmed that an equivalent version is available in the NVIDIA repos, you are ready to install the packages on the host operating system. For this, we need to open up a <literal>transactional-update</literal> session, which creates a new read/write snapshot of the underlying operating system so we can make changes to the immutable platform (for further instructions on <literal>transactional-update</literal>, see <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-transactional-updates/transactional-updates.html">here</link>):
es: Cuando haya confirmado que hay una versión equivalente disponible en los repositorios de NVIDIA, podrá instalar los paquetes en el sistema operativo host. Para ello, debemos abrir una sesión <literal>transactional-update</literal>, que crea una nueva instantánea de lectura/escritura del sistema operativo subyacente para que podamos realizar cambios en la plataforma inmutable (para obtener más instrucciones sobre <literal>transactional-update</literal>, consulte <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-transactional-updates/transactional-updates.html">este documento</link>):
ja: NVIDIAリポジトリで同等のバージョンが利用可能であることを確認したら、ホストオペレーティングシステムにパッケージをインストールできます。そのためには、<literal>transactional-update</literal>セッションを開く必要があります。これにより、基礎となるオペレーティングシステムの読み込み/書き込みスナップショットが新しく作成され、イミュータブルプラットフォームに変更を加えることが可能になります(<literal>transactional-update</literal>の詳細については、<link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-transactional-updates/transactional-updates.html">こちら</link>を参照してください)。
pt_br: Depois que você confirmar a disponibilidade de uma versão equivalente nos repositórios NVIDIA, estará pronto para instalar os pacotes no sistema operacional host. Para isso, precisamos abrir uma sessão <literal>transactional-update</literal>, que cria um novo instantâneo de leitura/gravação do sistema operacional subjacente para que possamos fazer alterações na plataforma imutável (para obter mais instruções sobre <literal>transactional-update</literal>, consulte <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-transactional-updates/transactional-updates.html">aqui</link>):
zh_cn: 在确认 NVIDIA 储存库中提供了对应版本后，便可以在主机操作系统上安装软件包了。为此，需要打开 <literal>transactional-update</literal> 会话，它会创建底层操作系统的新读/写快照，以便我们可以对不可变平台进行更改（有关 <literal>transactional-update</literal> 的更多说明，请参见<link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-transactional-updates/transactional-updates.html">此处</link>）：

source: When you are in your <literal>transactional-update</literal> shell, add an additional package repository from NVIDIA. This allows us to pull in additional utilities, for example, <literal>nvidia-smi</literal>:
es: Cuando acceda a la shell <literal>transactional-update</literal>, añada un repositorio de paquetes adicional de NVIDIA. Esto nos permite incorporar utilidades adicionales, por ejemplo, <literal>nvidia-smi</literal>:
ja: <literal>transactional-update</literal>シェルを起動したら、NVIDIAからパッケージリポジトリを追加します。これにより、<literal>nvidia-smi</literal>などの追加ユーティリティをプルできます。
pt_br: Quando estiver no shell <literal>transactional-update</literal>, adicione outro repositório de pacotes da NVIDIA para que possamos obter os utilitários adicionais, por exemplo, <literal>nvidia-smi</literal>:
zh_cn: 在进入 <literal>transactional-update</literal> 外壳后，添加来自 NVIDIA 的其他软件包储存库。这样就可以提取其他实用程序，例如 <literal>nvidia-smi</literal>：

source: You can then install the driver and <literal>nvidia-compute-utils</literal> for additional utilities. If you do not need the utilities, you can omit it, but for testing purposes, it is worth installing at this stage:
es: A continuación, puede instalar el controlador y <literal>nvidia-compute-utils</literal> para obtener utilidades adicionales. Si no necesita las utilidades, puede omitirlas, pero para fines de prueba, vale la pena instalarlas en esta etapa:
ja: その後、ドライバと、追加ユーティリティの<literal>nvidia-compute-utils</literal>をインストールできます。ユーティリティが不要の場合は省略できますが、テスト目的の場合は、この段階でインストールする価値があります。
pt_br: Depois disso, você poderá instalar o driver e <literal>nvidia-compute-utils</literal> para os utilitários adicionais. Se os utilitários não forem necessários, você poderá omiti-los. No entanto, é importante instalá-los neste estágio para fins de teste:
zh_cn: 然后，可以安装驱动程序，并安装 <literal>nvidia-compute-utils</literal> 来获取其他实用程序。如果您不需要这些实用程序，可以省略其安装步骤，但为了稍后进行测试，最好现在就安装它们：

source: If the installation fails, this might indicate a dependency mismatch between the selected driver version and what NVIDIA ships in their repositories. Refer to the previous section to verify that your versions match. Attempt to install a different driver version. For example, if the NVIDIA repositories have an earlier version, you can try specifying <literal>nvidia-open-driver-G06-signed-kmp=550.54.14</literal> on your install command to specify a version that aligns.
es: Si la instalación falla, podría deberse a una incompatibilidad entre la versión del controlador seleccionada y la que NVIDIA incluye en sus repositorios. Consulte la sección anterior para verificar que las versiones coincidan. Pruebe a instalar una versión diferente del controlador. Por ejemplo, si los repositorios de NVIDIA tienen una versión anterior, puede especificar <literal>nvidia-open-driver-G06-signed-kmp=550.54.14</literal> en su comando de instalación para especificar una versión que coincida.
ja: インストールが失敗する場合、選択したドライババージョンとNVIDIAがリポジトリで配布しているバージョンとの間で依存関係の不一致があることを示している可能性があります。前のセクションを参照して、バージョンが一致していることを確認してください。また、別のドライババージョンをインストールしてみてください。たとえば、NVIDIAリポジトリに以前のバージョンがある場合、インストールコマンドに<literal>nvidia-open-driver-G06-signed-kmp=550.54.14</literal>を指定して、一致するバージョンを指定してみることができます。
pt_br: Se houver falha na instalação, poderá ser indicativo de uma incompatibilidade de dependência entre a versão do driver selecionada e a que a NVIDIA distribui em seus repositórios. Consulte a seção anterior para verificar se as suas versões são compatíveis. Tente instalar outra versão do driver. Por exemplo, se os repositórios NVIDIA tiverem uma versão mais antiga, tente especificar <literal>nvidia-open-driver-G06-signed-kmp=550.54.14</literal> em seu comando de instalação para especificar uma versão equivalente.
zh_cn: 如果安装失败，可能表明所选驱动程序版本与 NVIDIA 在其储存库中提供的版本之间存在依赖项不匹配情况。请参见上一节来校验您的版本是否匹配。尝试安装不同的驱动程序版本。例如，如果 NVIDIA 储存库中的版本较低，您可以尝试在 install 命令中指定 <literal>nvidia-open-driver-G06-signed-kmp=550.54.14</literal>，以指定一致的版本。

source: Next, if you are <emphasis>not</emphasis> using a supported GPU (remembering that the list can be found <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">here</link>), you can see if the driver works by enabling support at the module level, but your mileage may vary — skip this step if you are using a <emphasis>supported</emphasis> GPU:
es: A continuación, si <emphasis>no</emphasis> utiliza una GPU compatible (recuerde que la lista está <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">aquí</link>), puede comprobar si el controlador funciona habilitando la compatibilidad a nivel de módulo, pero los resultados pueden variar. Omita este paso si utiliza una GPU <emphasis>compatible</emphasis>:
ja: 次に、サポートされているGPUを使用して<emphasis>いない</emphasis>場合は(<link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">こちら</link>でリストを確認できます)、モジュールレベルでサポートを有効にすることで、ドライバが動作するかどうかを確認できますが、結果はユーザによって異なります。<emphasis>サポートされている</emphasis>GPUを使用している場合は、この手順はスキップしてください。
pt_br: Em seguida, se você <emphasis>não</emphasis> usa uma GPU compatível (lembrando que a lista está disponível <link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">aqui</link>), pode conferir se o driver funciona habilitando o suporte no nível do módulo, mas a sua milhagem poderá variar. Pule esta etapa se você usa uma GPU <emphasis>compatível</emphasis>:
zh_cn: 接下来，如果您使用的 GPU <emphasis>不</emphasis>在支持列表中（支持列表可参考<link xl:href="https://github.com/NVIDIA/open-gpu-kernel-modules#compatible-gpus">此处</link>），可以尝试通过在模块层面启用支持来测试驱动程序是否能正常工作，但结果可能因设备而异 — 如果您使用的是<emphasis>支持的</emphasis> GPU，请跳过此步骤：

source: Now that you have installed these packages, it is time to exit the <literal>transactional-update</literal> session:
es: Ahora que ha instalado estos paquetes, es el momento de salir de la sesión <literal>transactional-update</literal>:
ja: これらのパッケージをインストールしたので、<literal>transactional-update</literal>セッションを終了します。
pt_br: Agora que você instalou os pacotes, saia da sessão <literal>transactional-update</literal>:
zh_cn: 安装这些软件包后，请退出 <literal>transactional-update</literal> 会话：

source: Make sure that you have exited the <literal>transactional-update</literal> session before proceeding.
es: Asegúrese de haber salido de la sesión <literal>transactional-update</literal> antes de continuar.
ja: 次に進む前に、<literal>transactional-update</literal>セッションを終了していることを確認してください。
pt_br: Antes de prosseguir, garanta que já tenha saído da sessão <literal>transactional-update</literal>.
zh_cn: 在继续之前，请确保已退出 <literal>transactional-update</literal> 会话。

source: Now that you have installed the drivers, it is time to reboot. As SUSE Linux Micro is an immutable operating system, it needs to reboot into the new snapshot that you created in a previous step. The drivers are only installed into this new snapshot, hence it is not possible to load the drivers without rebooting into this new snapshot, which happens automatically. Issue the reboot command when you are ready:
es: Después de instalar los controladores, reinicie. Dado que SUSE Linux Micro es un sistema operativo inmutable, es necesario reiniciar en la nueva instantánea que ha creado en el paso anterior. Los controladores solo se instalan en esta nueva instantánea, por lo que no es posible cargarlos sin reiniciar en ella, lo cual se realiza automáticamente. Ejecute el comando de reinicio cuando esté listo:
ja: ドライバをインストールしたら、再起動します。SUSE Linux Microはイミュータブルオペレーティングシステムであるため、前の手順で作成した新しいスナップショットで再起動する必要があります。ドライバはこの新しいスナップショットにのみインストールされるため、この新しいスナップショットで再起動しないとドライバをロードできません(新しいスナップショットでの再起動は自動的に実行されます)。準備ができたらrebootコマンドを発行します。
pt_br: Agora que você instalou os drivers, faça a reinicialização. Como o SUSE Linux Micro é um sistema operacional imutável, ele precisa ser reinicializado no novo instantâneo criado na etapa anterior. Os drivers são instalados apenas nesse novo instantâneo, já que não é possível carregá-los sem a reinicialização nele, o que é feito automaticamente. Execute o comando de reinicialização quando estiver pronto:
zh_cn: 安装驱动程序后，接下来请重引导系统。由于 SUSE Linux Micro 是不可变的操作系统，因此它需要重引导至您在上一步骤中创建的新快照。驱动程序只会安装到此新快照中，因此如果系统不重引导至此新快照（会自动重引导），就无法加载驱动程序。准备就绪后，发出 reboot 命令：

source: Once the system has rebooted successfully, log back in and use the <literal>nvidia-smi</literal> tool to verify that the driver is loaded successfully and that it can both access and enumerate your GPUs:
es: Una vez que el sistema se haya reiniciado correctamente, vuelva a iniciar sesión y use la herramienta <literal>nvidia-smi</literal> para comprobar que el controlador se ha cargado correctamente y que puede acceder y mostrar sus GPU:
ja: システムが正常に再起動したら、ログインし直し、 <literal>nvidia-smi</literal>ツールを使用して、ドライバが正常にロードされていて、GPUへのアクセスと列挙をどちらも実行できることを確認します。
pt_br: Após a reinicialização bem-sucedida do sistema, faça login novamente e use a ferramenta <literal>nvidia-smi</literal> para verificar se o driver foi carregado com sucesso e pode acessar e enumerar as GPUs:
zh_cn: 系统成功重引导后，请重新登录并使用 <literal>nvidia-smi</literal> 工具校验驱动程序是否已成功加载，以及它是否可以访问和枚举您的 GPU：
