Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Please refer to the Edge Networking component (<xref linkend="components-nmc"/>) for a more comprehensive explanation of the above configuration and examples of this feature.
es: Consulte la sección sobre el componente de red de Edge (<xref linkend="components-nmc"/>) para obtener una explicación más completa de la configuración anterior y ejemplos de esta función.
ja: 上記の設定のより包括的な説明と、この機能の例については、Edgeネットワーキングのコンポーネント(<xref linkend="components-nmc"/>)を参照してください。
pt_br: Consulte o componente de rede de borda (<xref linkend="components-nmc"/>) para ver uma explicação mais abrangente da configuração acima e exemplos desse recurso.
zh_cn: 有关上述配置的更详细解释以及此功能的示例，请参见“边缘网络”组件（<xref linkend="components-nmc"/>）。

source: Building the image
es: Creación de la imagen
ja: イメージの構築
pt_br: Criando a imagem
zh_cn: 构建映像

source: Now that we’ve got a base image and an image definition for EIB to consume, let’s go ahead and build the image. For this, we simply use <literal>podman</literal> to call the EIB container with the "build" command, specifying the definition file:
es: Ahora que tenemos una imagen base y una definición de imagen para que EIB la utilice, vamos a crear la imagen. Para ello, solo tenemos que usar <literal>Podman</literal> para llamar al contenedor EIB con el comando "build", especificando el archivo de definición:
ja: EIBで使用するゴールデンイメージとイメージ定義ができたので、イメージを構築してみましょう。これには、<literal>podman</literal>を使用し、定義ファイルを指定して「build」コマンドでEIBコンテナを呼び出すだけです。
pt_br: Agora que temos uma imagem base e uma definição da imagem para o EIB usar, vamos criar a imagem. Para isso, simplesmente usaremos o <literal>podman</literal> para chamar o contêiner do EIB com o comando "build", especificando o arquivo de definição:
zh_cn: 获得基础映像和可供 EIB 使用的映像定义后，接下来我们需要构建映像。为此，只需使用 <literal>podman</literal> 结合“build”命令调用 EIB 容器，并指定定义文件：

source: The output of the command should be similar to:
es: El resultado del comando debe tener este aspecto:
ja: コマンドの出力は次のようになります。
pt_br: A saída do comando deve ter esta aparência:
zh_cn: 该命令应输出如下所示的内容：

source: The built ISO image is stored at <literal>$CONFIG_DIR/eib-image.iso</literal>:
es: La imagen ISO creada se guarda en <literal>$CONFIG_DIR/eib-image.iso</literal>:
ja: 構築されたISOイメージは<literal>$CONFIG_DIR/eib-image.iso</literal>に保存されます。
pt_br: A imagem ISO criada é armazenada em <literal>$CONFIG_DIR/eib-image.iso</literal>:
zh_cn: 构建的 ISO 映像存储在 <literal>$CONFIG_DIR/eib-image.iso</literal> 中：

source: Each build creates a time-stamped folder in <literal>$CONFIG_DIR/_build/</literal> that includes the logs of the build, the artifacts used during the build, and the <literal>combustion</literal> and <literal>artefacts</literal> directories which contain all the scripts and artifacts that are added to the CRB image.
es: Para cada imagen se crea una carpeta con marca de tiempo en <literal>$CONFIG_DIR/_build/</literal> que incluye los registros del proceso de creación, los artefactos utilizados durante la creación y los directorios <literal>combustion</literal> y <literal>artefacts</literal>, que contienen todos los guiones y artefactos que se añaden a la imagen lista para arrancar.
ja: ビルドごとに、<literal>$CONFIG_DIR/_build/</literal>内にタイムスタンプ付きのフォルダが作成されます。このフォルダには、ビルドのログ、ビルド中に使用されたアーティファクト、およびCRBイメージに追加されたすべてのスクリプトとアーティファクトを含む<literal>combustion</literal>ディレクトリと<literal>artefacts</literal>ディレクトリが含まれます。
pt_br: Cada build cria uma pasta com marcação de data e hora em <literal>$CONFIG_DIR/_build/</literal>, que inclui os registros do build, os artefatos usados durante o build e os diretórios <literal>combustion</literal> e <literal>artefacts</literal> com todos os scripts e artefatos adicionados à imagem CRB.
zh_cn: 每次构建时都会在 <literal>$CONFIG_DIR/_build/</literal> 中创建一个带时间戳的文件夹，其中包含构建日志、构建期间使用的制品以及 <literal>combustion</literal> 和 <literal>artefacts</literal> 目录，这两个目录包含添加到 CRB 映像的所有脚本和制品。

source: The contents of this directory should look like:
es: El contenido de este directorio tendrá este aspecto:
ja: このディレクトリの内容は次のようになります。
pt_br: O conteúdo do diretório deve ter esta aparência:
zh_cn: 此目录的内容如下所示：

source: If the build fails, <literal>eib-build.log</literal> is the first log that contains information. From there, it will direct you to the component that failed for debugging.
es: Si la compilación falla, <literal>eib-build.log</literal> es el primer registro que contiene información. Desde allí, se le dirigirá al componente que falló para su depuración.
ja: ビルドが失敗した場合、情報が含まれる最初のログは<literal>eib-build.log</literal>です。そこから、失敗したコンポーネントに移動してデバッグを行います。
pt_br: Se houver falha no build, <literal>eib-build.log</literal> será o primeiro registro com as informações. A partir disso, ele vai direcionar você para o componente com falha para depuração.
zh_cn: 如果构建失败，首先会在 <literal>eib-build.log</literal> 中记录相关信息。该日志会指出哪个组件构建失败，方便您进行调试。

source: At this point, you should have a ready-to-use image that will:
es: En este punto, debe tener una imagen lista para usar que:
ja: この時点で、以下を行う、すぐに使用できるイメージができているはずです。
pt_br: Neste ponto, você deve ter uma imagem pronta para uso que:
zh_cn: 此时，您应该有了一个随时可用的映像，它可以：

source: Deploy SUSE Linux Micro 6.1
es: Desplegará SUSE Linux Micro 6.1
ja: SUSE Linux Micro 6.1をデプロイする
pt_br: Implantará o SUSE Linux Micro 6.1.
zh_cn: 部署 SUSE Linux Micro 6.1

source: Configure the root password
es: Configurará la contraseña raíz
ja: ルートパスワードを設定する
pt_br: Configurará a senha de root.
zh_cn: 配置 root 口令

source: Install the <literal>nvidia-container-toolkit</literal> package
es: Instalará el paquete <literal>nvidia-container-toolkit</literal>
ja: <literal>nvidia-container-toolkit</literal>パッケージをインストールする
pt_br: Instalará o pacote <literal>nvidia-container-toolkit</literal>.
zh_cn: 安装 <literal>nvidia-container-toolkit</literal> 软件包

source: Configure an embedded container registry to serve content locally
es: Configurará un registro de contenedor integrado para proporcionar contenido localmente
ja: コンテンツをローカルに提供する組み込みのコンテナレジストリを設定する
pt_br: Configurará um registro de contêiner incorporado para enviar o conteúdo localmente.
zh_cn: 配置嵌入的容器仓库以在本地处理内容

source: Install single-node RKE2
es: Instalará RKE2 de un solo nodo
ja: シングルノードRKE2をインストールする
pt_br: Instalará o RKE2 de nó único.
zh_cn: 安装单节点 RKE2

source: Configure static networking
es: Configurará la red estática
ja: 静的ネットワーキングを設定する
pt_br: Configurará a rede estática.
zh_cn: 配置静态网络

source: Install KubeVirt
es: Instalará KubeVirt
ja: KubeVirtをインストールする
pt_br: Instalará o KubeVirt.
zh_cn: 安装 KubeVirt

source: Deploy a user-supplied manifest
es: Desplegará un manifiesto proporcionado por el usuario
ja: ユーザが指定したマニフェストをデプロイする
pt_br: Implantará um manifesto fornecido pelo usuário.
zh_cn: 部署用户提供的清单

source: Debugging the image build process
es: Depuración del proceso de creación de imágenes
ja: イメージ構築プロセスのデバッグ
pt_br: Depurando o processo de criação da imagem
zh_cn: 调试映像构建过程

source: If the image build process fails, refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/debugging.md">upstream debugging guide</link>.
es: Si el proceso de creación de imágenes falla, consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/debugging.md">guía original sobre depuración</link>.
ja: イメージ構築プロセスが失敗する場合は、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/debugging.md">アップストリームのデバッグガイド</link>を参照してください。
zh_cn: 如果映像构建过程失败，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/debugging.md">上游调试指南</link>。

source: Testing your newly built image
es: Prueba de la imagen recién creada
ja: 新しく構築されたイメージのテスト
pt_br: Testando a imagem recém-criada
zh_cn: 测试新构建的映像

source: For instructions on how to test the newly built CRB image, refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/testing-guide.md">upstream image testing guide</link>.
es: Para obtener instrucciones sobre cómo probar la imagen lista para arrancar recién creada, consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/testing-guide.md">guía original sobre pruebas de imágenes</link>.
ja: 新しく構築されたCRBイメージをテストする方法については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/testing-guide.md">アップストリームのイメージテストガイド</link>を参照してください。
zh_cn: 有关如何测试新构建的 CRB 映像的说明，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/testing-guide.md">上游映像测试指南</link>。

source: SUSE Multi-Linux Manager is included in SUSE Edge to provide automation and control for keeping SUSE Linux Micro as the underlying operating system consistently up-to-date on all nodes of your edge deployment. It can also be used to manage Kubernetes and applications deployed on Kubernetes on your edge nodes.
es: SUSE Multi-Linux Manager está incluido en SUSE Edge y proporciona automatización y control con el fin de mantener el sistema operativo subyacente SUSE Linux Micro constantemente actualizado en todos los nodos de su despliegue periférico. También se puede usar para gestionar Kubernetes y las aplicaciones desplegadas en Kubernetes en los nodos periféricos.
ja: SUSE Multi-Linux ManagerはSUSE Edgeに含まれており、エッジデプロイメントのすべてのノードでSUSE Linux Microを基盤となるオペレーティングシステムとして常に最新の状態に保つための自動化と制御を提供します。また、エッジノード上のKubernetesとKubernetes上にデプロイされたアプリケーションの管理にも使用できます。
zh_cn: SUSE Edge 中包含的 SUSE Multi-Linux Manager 可提供自动化管理功能，确保边缘部署的所有节点上作为底层操作系统的 SUSE Linux Micro 始终保持最新状态。它还可用于管理边缘节点上的 Kubernetes 以及在 Kubernetes 上部署的应用程序。

source: This quickstart guide is intended to get you up to speed with SUSE Multi-Linux Manager as quickly as possible, with the goal of providing operating system updates to your edge nodes. The quickstart guide doesn’t discuss topics like sizing your storage, creating and managing additional software channels for staging purposes, or managing users, system groups, and organizations for larger deployments. For production use, we strongly recommend to get familiar with the comprehensive <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUSE Multi-Linux Manager Documentation</link>.
es: Esta guía de inicio rápido tiene como objetivo familiarizarle con SUSE Multi-Linux Manager lo antes posible, con el fin de proporcionar actualizaciones del sistema operativo a sus nodos periféricos. No aborda temas como el dimensionamiento del almacenamiento, la creación y gestión de canales de software adicionales con fines de preparación, ni la gestión de usuarios, grupos de sistemas y organizaciones para despliegues de mayor envergadura. Para su uso en producción, le recomendamos encarecidamente que se familiarice con la completa <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">documentación de SUSE Multi-Linux Manager</link>.
ja: このクイックスタートガイドは、エッジノードにオペレーティングシステムの更新を提供することを目的として、SUSE Multi-Linux Managerをできるだけ早く使いこなすためのものです。このクイックスタートガイドでは、ストレージのサイズ設定、ステージング目的の追加ソフトウェアチャンネルの作成と管理、大規模なデプロイメントのためのユーザ、システムグループ、組織の管理などのトピックについては説明しません。運用環境で使用する場合は、包括的な<link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUSE Multi-Linux Manager のドキュメント</link>を参照することを強くお勧めします。
pt_br: O objetivo deste início rápido é agilizar ao máximo para você a instalação e configuração do SUSE Multi-Linux Manager para fornecer as atualizações de sistema operacional para seus nós de borda. O guia de início rápido não aborda tópicos como dimensionar armazenamento, criar e gerenciar canais de software adicionais para fins de preparação ou gerenciar usuários, grupos de sistemas e organizações para implantações de maior porte. Para uso em produção, é altamente recomendável familiarizar-se com a <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">documentação completa do SUSE Multi-Linux Manager</link>.
zh_cn: 本快速入门指南旨在帮助您尽快熟悉 SUSE Multi-Linux Manager，目标是为您的边缘节点提供操作系统更新。本快速入门指南不会涉及诸如调整存储容量、创建和管理用于过渡的额外软件通道，或是针对大规模部署场景管理用户、系统组及组织等主题。对于生产用途，我们强烈建议您熟悉内容全面的 <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUSE Multi-Linux Manager 文档</link>。

source: The following steps are required to prepare SUSE Edge for using SUSE Multi-Linux Manager effectively:
es: Para preparar SUSE Edge a fin de que SUSE Multi-Linux Manager se use de forma eficaz, es necesario seguir los siguientes pasos:
ja: SUSE Multi-Linux Managerを効果的に使用するためにSUSE Edgeを準備するには、次の手順が必要です。
pt_br: As seguintes etapas são necessárias para preparar o SUSE Edge para uso eficaz do SUSE Multi-Linux Manager:
zh_cn: 要使 SUSE Edge 能够有效使用 SUSE Multi-Linux Manager，需执行以下步骤：

source: Deploy and configure SUSE Multi-Linux Manager Server.
es: Desplegar y configurar SUSE Multi-Linux Manager Server
ja: SUSE Multi-Linux Manager Serverのデプロイと設定
pt_br: Implantar e configurar o SUSE Multi-Linux Manager Server.
zh_cn: 部署并配置 SUSE Multi-Linux Manager 服务器。

source: Sync the SUSE Linux Micro package repositories.
es: Sincronizar los repositorios de paquetes de SUSE Linux Micro
ja: SUSE Linux Microパッケージリポジトリの同期
pt_br: Sincronizar os repositórios de pacotes do SUSE Linux Micro.
zh_cn: 同步 SUSE Linux Micro 软件包储存库。

source: Create system groups.
es: Crear grupos de sistemas
ja: システムグループの作成
pt_br: Criar grupos de sistemas.
zh_cn: 创建系统组。

source: Create activation keys.
es: Crear claves de activación
ja: アクティベーションキーの作成
pt_br: Criar chaves de ativação.
zh_cn: 创建激活密钥。

source: Use Edge Image Builder to prepare installation media for SUSE Multi-Linux Manager registration
es: Usar Edge Image Builder para preparar el medio de instalación para el registro de SUSE Multi-Linux Manager
ja: Edge Image Builderを使用したSUSE Multi-Linux Manager登録用インストールメディアの準備
pt_br: Usar o Edge Image Builder para preparar a mídia de instalação para registro do SUSE Multi-Linux Manager.
zh_cn: 使用 Edge Image Builder 准备用于 SUSE Multi-Linux Manager 注册的安装媒体。

source: Deploy SUSE Multi-Linux Manager Server
es: Despliegue de SUSE Multi-Linux Manager Server
ja: SUSE Multi-Linux Manager Serverのデプロイ
pt_br: Implantar o SUSE Multi-Linux Manager Server
zh_cn: 部署 SUSE Multi-Linux Manager 服务器

source: If you already have an instance of SUSE Multi-Linux Manager 5.0.5 running, you can skip this step.
es: Si ya tiene una instancia de SUSE Multi-Linux Manager 5.0.5 en ejecución, puede omitir este paso.
ja: SUSE Multi-Linux Manager 5.0.5のインスタンスをすでに実行している場合は、この手順をスキップできます。
zh_cn: 如果您已在运行 SUSE Multi-Linux Manager 5.0.5 实例，则可跳过此步骤。

source: You can run SUSE Multi-Linux Manager Server on a dedicated physical server, as a virtual machine on your own hardware, or in the cloud. Pre-configured virtual machine images for SUSE Multi-Linux Server are provided for supported public clouds.
es: Puede ejecutar SUSE Multi-Linux Manager Server en un servidor físico dedicado, como máquina virtual en su propio hardware, o en la nube. Se proporcionan imágenes de máquinas virtuales preconfiguradas para SUSE Multi-Linux Server para las nubes públicas compatibles.
ja: SUSE Multi-Linux Manager Serverは、専用の物理サーバ、自身のハードウェア上の仮想マシン、またはクラウドで実行できます。SUSE Multi-Linux Serverの事前に設定された仮想マシンイメージはサポートされているパブリッククラウド用に提供されています。
pt_br: Você pode executar o SUSE Multi-Linux Manager Server em um servidor físico dedicado, como uma máquina virtual em seu próprio hardware, ou na nuvem. São fornecidas imagens pré-configuradas da máquina virtual para o SUSE Multi-Linux Server para nuvens públicas suportadas.
zh_cn: 您可以在专用物理服务器、自有硬件上的虚拟机或云中运行 SUSE Multi-Linux Manager 服务器。针对受支持的公有云，我们提供了预配置的 SUSE Multi-Linux 服务器虚拟机映像。

source: In this quick start we’re using the "qcow2" image <literal>SUSE-Manager-Server.x86_64-5.0.4-Qcow-5.0-2025-04.qcow2</literal> for AMD64/Intel 64 that you can find at <link xl:href="https://www.suse.com/download/suse-manager/">https://www.suse.com/download/suse-manager/</link> or in the SUSE Customer Center. This image will work as a virtual machine on hypervisors like KVM. Please always check for the newest version of the image and use it for new installations.
es: En esta guía de inicio rápido se utiliza la imagen "qcow2" <literal>SUSE-Manager-Server.x86_64-5.0.4-Qcow-5.0-2025-04.qcow2</literal> para AMD64/Intel 64. La puede encontrar en <link xl:href="https://www.suse.com/download/suse-manager/">https://www.suse.com/download/suse-manager/</link> o en el Centro de servicios al cliente de SUSE. Esta imagen funciona como una máquina virtual en hipervisores como KVM. Compruebe siempre que dispone de la versión más reciente de la imagen y utilícela para las nuevas instalaciones.
ja: このクイックスタートでは、AMD64/Intel 64用の「qcow2」イメージ<literal>SUSE-Manager-Server.x86_64-5.0.4-Qcow-5.0-2025-04.qcow2</literal>を使用しています。このイメージは、<link xl:href="https://www.suse.com/download/suse-manager/">https://www.suse.com/download/suse-manager/</link>またはSUSE Customer Centerで入手できます。このイメージは、KVMなどのハイパーバイザー上の仮想マシンとして機能します。イメージの最新バージョンを常に確認して、新しいインストールに使用してください。
zh_cn: 在本快速入门中，我们针对 AMD64/Intel 64 体系结构使用“qcow2”映像 <literal>SUSE-Manager-Server.x86_64-5.0.4-Qcow-5.0-2025-04.qcow2</literal>，您可通过 <link xl:href="https://www.suse.com/download/suse-manager/">https://www.suse.com/download/suse-manager/</link> 或 SUSE Customer Center 获取该映像。此映像可在 KVM 等超级管理程序上作为虚拟机运行。请务必检查是否有可用的最新版映像，并在执行全新安装时使用最新版本。

source: You can also install SUSE Multi-Linux Manager Server on any of the other supported hardware architectures. In that case pick the image that matches your hardware architecture.
es: También puede instalar SUSE Multi-Linux Manager Server en cualquier otra arquitectura de hardware compatible. En tal caso, elija la imagen que coincida con su arquitectura de hardware.
ja: SUSE Multi-Linux Manager Serverを他のサポートされているハードウェアアーキテクチャにもインストールできます。その場合は、ハードウェアアーキテクチャに合ったイメージを選択してください。
pt_br: Você também pode instalar o SUSE Multi-Linux Manager Server em qualquer outra arquitetura de hardware compatível. Nesse caso, escolha a imagem correspondente à arquitetura.
zh_cn: 您也可以在其他任何受支持的硬件体系结构上安装 SUSE Multi-Linux Manager 服务器。在这种情况下，请选择与您的硬件体系结构相匹配的映像。

source: Once you have downloaded the image, create a virtual machine that meets at least the following minimal hardware specifications:
es: Una vez que haya descargado la imagen, cree una máquina virtual que cumpla, como mínimo, con las siguientes especificaciones de hardware:
ja: イメージをダウンロードしたら、次の最小ハードウェア仕様を満たす仮想マシンを作成します。
pt_br: Depois de fazer download da imagem, crie uma máquina virtual que atenda pelo menos às seguintes especificações mínimas de hardware:
zh_cn: 下载映像后，请创建一台至少满足以下最低硬件规格的虚拟机：

source: 4 physical or virtual cores
es: 4 núcleos físicos o virtuales
ja: 4つの物理コアまたは仮想コア
pt_br: 4 núcleos físicos ou virtuais
zh_cn: 4 个物理或虚拟核心

source: an additional block device that has at least 100 GB
es: Un dispositivo de bloque adicional con una capacidad mínima de 100 GB
ja: 最低100GBの追加のブロックデバイス
pt_br: um dispositivo de blocos adicional com, no mínimo, 100 GB
zh_cn: 一个至少 100 GB 的额外块设备

source: With the qcow2 image, there is no need to install the operating system. You can directly attach the image as your root partition.
es: Con la imagen qcow2, no es necesario instalar el sistema operativo. Puede conectar directamente la imagen como su partición raíz.
ja: qcow2イメージでは、オペレーティングシステムをインストールする必要はありません。イメージをルートパーティションとして直接アタッチできます。
pt_br: Com a imagem qcow2, não há necessidade de instalar o sistema operacional. É possível anexar a imagem diretamente como a partição raiz.
zh_cn: 使用 qcow2 映像时，无需安装操作系统。您可以直接将该映像挂接为根分区。

source: You need to set up the network so that your edge nodes can later access SUSE Multi-Linux Manager Server with a hostname that contains the fully qualified domain name ("FQDN")!
es: Debe configurar la red para que sus nodos periféricos puedan acceder posteriormente a SUSE Multi-Linux Manager Server con un nombre de host que contenga el nombre de dominio completo.
ja: 後でエッジノードが完全修飾ドメイン名(「FQDN」)を含むホスト名でSUSE Multi-Linux Manager Serverにアクセスできるように、ネットワークを設定する必要があります。
pt_br: Configure a rede para que os nós de borda possam acessar o SUSE Multi-Linux Manager Server posteriormente com um nome de host que inclua o nome de domínio completo e qualificado ("FQDN", Fully Qualified Domain Name)!
zh_cn: 您需要设置网络，以便您的边缘节点日后能够通过包含完全限定域名（简称“FQDN”）的主机名访问 SUSE Multi-Linux Manager 服务器！

source: When you boot SUSE Multi-Linux Manager for the first time you need to perform some initial configuration:
es: Cuando inicie SUSE Multi-Linux Manager por primera vez, deberá realizar algunas configuraciones iniciales:
ja: SUSE Multi-Linux Managerを初めてブートする際には、いくつかの初期設定を実行する必要があります。
pt_br: Quando você inicializa o SUSE Multi-Linux Manager pela primeira vez, precisa fazer algumas configurações iniciais:
zh_cn: 首次引导 SUSE Multi-Linux Manager 时，需要执行一些初始配置：

source: Select your keyboard layout
es: Seleccionar la disposición del teclado
ja: キーボードレイアウトの選択
pt_br: Selecionar o layout do seu teclado
zh_cn: 选择键盘布局

source: Accept the license agreement
es: Aceptar el acuerdo de licencia
ja: ライセンス契約の同意
pt_br: Aceitar o contrato de licença
zh_cn: 接受许可协议

source: Select your time zone
es: Seleccionar la zona horaria
ja: タイムゾーンの選択
pt_br: Selecionar seu fuso horário
zh_cn: 选择您所在的时区

source: Enter the root password for the operating system
es: Introducir la contraseña raíz del sistema operativo
ja: オペレーティングシステムのルートパスワードの入力
pt_br: Inserir a senha de root do sistema operacional
zh_cn: 输入操作系统的 root 口令

source: The next steps need to be done as the "root" user:
es: Los pasos siguientes se deben realizar con permisos de usuario root:
ja: 次の各手順は「ルート」ユーザとして実行する必要があります。
pt_br: As etapas seguintes precisam ser realizas como usuário "root":
zh_cn: 后续步骤需要以“root”用户身份执行：

source: For the next step you need the registration code for the SUSE Multi-Linux Manager Extension that you can find in the SUSE Customer Center. The same code can be used for both registering SUSE Linux Micro and SUSE Multi-Linux Manager:
es: Para el paso siguiente, necesita el código de registro para la extensión de SUSE Multi-Linux Manager que encontrará en el Centro de servicios al cliente de SUSE. Se puede usar el mismo código para registrar tanto SUSE Linux Micro como SUSE Multi-Linux Manager:
ja: 次の手順では、SUSE Customer Centerで入手可能なSUSE Multi-Linux Manager Extensionの登録コードが必要です。同じコードを使用して、SUSE Linux MicroとSUSE Multi-Linux Managerの両方を登録できます。
zh_cn: 下一步操作需要使用 SUSE Multi-Linux Manager 扩展的注册代码，您可在 SUSE Customer Center 中找到该注册代码。此注册代码可同时用于注册 SUSE Linux Micro 和 SUSE Multi-Linux Manager：

source: Register SUSE Linux Micro:
es: Registre SUSE Linux Micro:
ja: SUSE Linux Microを登録します。
pt_br: Registre o SUSE Linux Micro:
zh_cn: 注册 SUSE Linux Micro：

source: Register SUSE Multi-Linux Manager:
es: Registre SUSE Multi-Linux Manager:
ja: SUSE Multi-Linux Managerを登録します。
pt_br: Registre o SUSE Multi-Linux Manager:
zh_cn: 注册 SUSE Multi-Linux Manager：

source: The product string depends on your hardware architecture! For example, if you are using SUSE Multi-Linux Manager on a 64-bit Arm system, the string is "SUSE-Manager-Server/5.0/aarch64".
es: La cadena del producto depende de la arquitectura de su hardware. Por ejemplo, si utiliza SUSE Multi-Linux Manager en un sistema ARM de 64 bits, la cadena es "SUSE-Manager-Server/5.0/aarch64".
ja: 製品文字列は、ハードウェアアーキテクチャによって異なります。たとえば、64ビットArmシステムでSUSE Multi-Linux Managerを使用している場合、文字列は「SUSE-Manager-Server/5.0/aarch64」になります。
pt_br: A string do produto depende da arquitetura de hardware. Por exemplo, se você usa o SUSE Multi-Linux Manager em um sistema Arm de 64 bits, a string é "SUSE-Manager-Server/5.0/aarch64".
zh_cn: 产品字符串取决于您的硬件体系结构！例如，如果您在 64 位 Arm 系统上使用 SUSE Multi-Linux Manager，则该字符串为“SUSE-Manager-Server/5.0/aarch64”。

source: Reboot
es: Rearranque.
ja: 再起動します。
pt_br: Reinicializar
zh_cn: 重引导

source: Update the system:
es: Actualice el sistema:
ja: システムを更新します。
pt_br: Atualize o sistema:
zh_cn: 更新系统：
