Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Since the process address space is virtual, the <literal>CPU</literal> and the operating system need to remember which pages belong to which process, and where each page is stored. The greater the number of pages, the longer the search for memory mapping. When a process uses <literal>1 GB</literal> of memory, that is 262144 entries to look up (<literal>1 GB</literal> / <literal>4 K</literal>). If a page table entry consumes 8 bytes, that is <literal>2 MB</literal> (262144 * 8) to look up.
es: Dado que el espacio de direcciones del proceso es virtual, la <literal>CPU</literal> y el sistema operativo deben recordar qué páginas pertenecen a cada proceso y dónde se almacena cada página. Cuanto más páginas haya, más tiempo llevará la búsqueda de asignación de memoria. Cuando un proceso usa <literal>1 GB</literal> de memoria, eso supone 262 144 entradas que buscar (<literal>1 GB</literal> / <literal>4 K</literal>). Si una entrada de la tabla de páginas consume 8 bytes, eso supone <literal>2 MB</literal> (262 144 * 8) que buscar.
ja: プロセスのアドレススペースは仮想であるため、<literal>CPU</literal>とオペレーティングシステムは、どのページがどのプロセスに属していて、各ページがどこに保管されているかを覚えておく必要があります。ページ数が多いほど、メモリマッピングの検索に時間がかかります。プロセスが<literal>1GB</literal>のメモリを使用する場合、検索するエントリは262,144個になります(<literal>1GB</literal> / <literal>4K</literal>)。1つのページテーブルエントリが8バイトを消費する場合、<literal>2MB</literal> (262,144 * 8)を検索することになります。
pt_br: Como o espaço do endereço do processo é virtual, a <literal>CPU</literal> e o sistema operacional precisam memorizar quais páginas pertencem a qual processo, e onde cada página é armazenada. Quanto maior o número de páginas, mais longa a pesquisa de mapeamento de memória. Quando um processo usa <literal>1 GB</literal> de memória, isso equivale a 262144 entradas para pesquisa (<literal>1 GB</literal>/<literal>4 K</literal>). Se uma entrada da tabela de páginas consome 8 bytes, isso equivale a <literal>2 MB</literal> (262144 * 8) para pesquisa.
zh_cn: 由于进程地址空间是虚拟的，<literal>CPU</literal> 和操作系统需要记住哪些页属于哪个进程，以及每个页存储在哪个位置。页数越多，内存映射的搜索时间就越长。当进程使用 <literal>1 GB</literal> 内存时，需要查找 262144 个项 (<literal>1 GB</literal> / <literal>4 K</literal>)。如果一个页表项占用 8 个字节，则需要查找 <literal>2 MB</literal> (262144 * 8) 内存。

source: Most current <literal>CPU</literal> architectures support larger-than-default pages, which give the <literal>CPU/OS</literal> fewer entries to look up.
es: La mayoría de las arquitecturas actuales de <literal>CPU</literal> admiten páginas más grandes que las predeterminadas, lo que reduce el número de entradas que la <literal>CPU/SO</literal> debe buscar.
ja: 最新の<literal>CPU</literal>アーキテクチャはデフォルトより大きいページをサポートしているので、<literal>CPU/OS</literal>が検索するエントリが減少します。
pt_br: As arquiteturas de <literal>CPU</literal> mais atuais oferecem suporte às páginas maiores que o padrão, o que reduz o número de entradas para a <literal>CPU/SO</literal> pesquisar.
zh_cn: 当前的大多数 <literal>CPU</literal> 体系结构都支持大于默认值的页，因此减少了 <literal>CPU/操作系统</literal>需要查找的项。

source: To enable the huge pages, we should add the following kernel parameters. In this example, we configure 40 1G pages, though the huge page size and exact number should be tailored to your application’s memory requirements:
es: Para habilitar estas páginas enormes (huge pages), debemos añadir los siguientes parámetros del kernel. En este ejemplo, configuramos 40 páginas de 1 GB, aunque el tamaño de la página enorme y el número exacto de ellas deben adaptarse a los requisitos de memoria de su aplicación:
ja: Huge Pageを有効にするには、次のカーネルパラメータを追加する必要があります。この例では、40個の1Gページを設定していますが、Huge Pageのサイズと正確な数は、アプリケーションのメモリ要件に合わせて調整する必要があります。
pt_br: Para habilitar o HugePages, devemos adicionar os seguintes parâmetros do kernel. Neste exemplo, configuramos 40 páginas de 1G, portanto, o tamanho e o número exato de páginas enormes devem ser adaptados aos requisitos de memória do seu aplicativo:
zh_cn: 要启用大页，我们应添加以下内核参数。在此例中，我们配置了 40 个 1G 页面，不过大页大小和确切数量应根据应用程序的内存需求进行调整：

source: This option allows to set the size of huge pages to 1 G
es: Esta opción permite establecer el tamaño de las páginas enormes en 1 G
ja: このオプションを使用すると、Huge Pageを1Gに設定できます
pt_br: Essa opção permite definir o tamanho das páginas enormes como 1 G
zh_cn: 此选项允许将大页的大小设置为 1 G

source: This is the number of huge pages defined before
es: Este es el número de páginas enormes definidas anteriormente
ja: 前に定義したHuge Pageの数です
pt_br: Esse é o número de páginas enormes definido antes
zh_cn: 这是先前定义的大页数量

source: This is the default value to get the huge pages
es: Este es el valor predeterminado para obtener las páginas enormes
ja: Huge Pageを取得するためのデフォルト値です
pt_br: Esse é o valor padrão para obter as páginas enormes
zh_cn: 这是用于获取大页的默认值

source: Modify the GRUB file <literal>/etc/default/grub</literal> to add these parameters in <literal>GRUB_CMDLINE_LINUX</literal>:
es: Modifique el archivo GRUB <literal>/etc/default/grub</literal> para añadir estos parámetros en <literal>GRUB_CMDLINE_LINUX</literal>:
ja: GRUBファイル<literal>/etc/default/grub</literal>を変更して、これらのパラメータを<literal>GRUB_CMDLINE_LINUX</literal>に追加します。
pt_br: Modifique o arquivo GRUB <literal>/etc/default/grub</literal> para adicionar esses parâmetros a <literal>GRUB_CMDLINE_LINUX</literal>:
zh_cn: 修改 GRUB 文件 <literal>/etc/default/grub</literal>，在 <literal>GRUB_CMDLINE_LINUX</literal> 中添加这些参数：

source: To validate that the parameters are applied after the reboot, you can check the command line:
es: Para comprobar que los parámetros se han aplicado después del rearranque, puede consultar la línea de comandos:
ja: 再起動後にパラメータが適用されていることを検証するには、次のコマンドラインを確認できます。
pt_br: Para validar se os parâmetros foram aplicados após a reinicialização, verifique a linha de comando:
zh_cn: 要验证重引导后是否应用了这些参数，可以检查命令行：

source: Using huge pages
es: Uso de páginas enormes
ja: Huge Pageの使用
pt_br: Usando o HugePages
zh_cn: 使用大页

source: To use the huge pages, we need to mount them:
es: Para usar las páginas enormes, debe montarlas:
ja: Huge Pageを使用するには、Huge Pageをマウントする必要があります。
pt_br: Para usar o HugePages, precisamos montá-lo:
zh_cn: 要使用大页，需要挂载它们：

source: Deploy a Kubernetes workload, creating the resources and the volumes:
es: Despliegue una carga de trabajo de Kubernetes creando los recursos y los volúmenes:
ja: Kubernetesワークロードをデプロイし、リソースとボリュームを作成します。
pt_br: Implante a carga de trabalho Kubernetes criando os recursos e os volumes:
zh_cn: 部署 Kubernetes 工作负载，并创建资源和卷：

source: CPU pinning on Kubernetes
es: Fijación de CPU en Kubernetes
ja: KubernetesでのCPUピニング
pt_br: Fixação da CPU em Kubernetes
zh_cn: 在 Kubernetes 上进行 CPU 绑定

source: Prerequisite
es: Requisito previo
ja: 前提条件
pt_br: Pré-requisito
zh_cn: 先决条件

source: Must have the <literal>CPU</literal> tuned to the performance profile covered in this section (<xref linkend="cpu-tuned-configuration"/>).
es: Debe tener la <literal>CPU</literal> ajustada al perfil de rendimiento descrito en esta sección (<xref linkend="cpu-tuned-configuration"/>).
ja: こちらのセクション(<xref linkend="cpu-tuned-configuration"/>)で説明したパフォーマンスプロファイルに合わせて<literal>CPU</literal>が調整されていること。
pt_br: A <literal>CPU</literal> deve estar ajustada de acordo com o perfil de desempenho abordado nesta seção (<xref linkend="cpu-tuned-configuration"/>).
zh_cn: 必须根据<xref linkend="cpu-tuned-configuration"/>一节中所述的性能配置文件微调 <literal>CPU</literal>。

source: Configure Kubernetes for CPU Pinning
es: Configuración de Kubernetes para la fijación de CPU
ja: CPUピニング用のKubernetesの設定
pt_br: Configurar o Kubernetes para fixação da CPU
zh_cn: 配置 Kubernetes 以进行 CPU 绑定

source: Configure kubelet arguments to implement CPU management in the <literal>RKE2</literal> cluster. Add the following configuration block such as below example to your <literal>/etc/rancher/rke2/config.yaml</literal> file. Make sure specifying the housekeeping CPU cores in <literal>kubelet-reserved</literal> and <literal>system-reserved</literal> arguments:
es: Configure los argumentos de kubelet para implementar la gestión de la CPU en el clúster <literal>RKE2</literal>. Añada el siguiente bloque de configuración, como se muestra en el ejemplo siguiente, al archivo <literal>/etc/rancher/rke2/config.yaml</literal>. Asegúrese de especificar los núcleos de CPU de mantenimiento en los argumentos <literal>kubelet-reserved</literal> y <literal>system-reserved</literal>:
ja: <literal>RKE2</literal>クラスタでCPU管理を実装するためにkubelet引数を設定します。次の例のような設定ブロックを<literal>/etc/rancher/rke2/config.yaml</literal>ファイルに追加します。<literal>kubelet-reserved</literal>および <literal>system-reserved</literal>引数でハウスキーピング用CPUコアを指定していることを確認します。
pt_br: Configure os argumentos de kubelet para implementar o gerenciamento da CPU no cluster <literal>RKE2</literal>. Adicione o seguinte bloco de configuração, como no exemplo abaixo, ao arquivo <literal>/etc/rancher/rke2/config.yaml</literal>. Especifique os núcleos da CPU de manutenção nos argumentos <literal>kubelet-reserved</literal> e <literal>system-reserved</literal>:
zh_cn: 配置 kubelet 参数以在 <literal>RKE2</literal> 群集中实现 CPU 管理。将以下配置块（如下例所示）添加到 <literal>/etc/rancher/rke2/config.yaml</literal> 文件中。确保在 <literal>kubelet-reserved</literal> 和 <literal>system-reserved</literal> 参数中指定系统管理 CPU 核心：

source: Leveraging Pinned CPUs for Workloads
es: Aprovechamiento de CPU fijadas para cargas de trabajo
ja: ワークロードにピニングされたCPUを活用する
pt_br: Aproveitando as CPUs fixadas para as cargas de trabalho
zh_cn: 为工作负载使用绑定的 CPU

source: There are three ways to use that feature using the <literal>Static Policy</literal> defined in kubelet depending on the requests and limits you define on your workload:
es: Hay tres formas de utilizar esa función utilizando la <literal>directiva estática</literal> definida en kubelet, dependiendo de las solicitudes y los límites que defina en su carga de trabajo:
ja: kubeletで定義された<literal>静的ポリシー</literal>を使ってCPUピニング機能を使用する方法は、ワークロードに対して定義した要求と制限に応じて3つあります。
pt_br: Há três maneiras de usar este recurso com a <literal>política estática</literal> definida no kubelet, dependendo das solicitações e dos limites definidos em sua carga de trabalho:
zh_cn: 根据您在工作负载上定义的请求和限制，可以用三种方式通过 kubelet 中定义的<literal>静态策略</literal>来使用该功能：

source: <literal>BestEffort</literal> QoS Class: If you do not define any request or limit for <literal>CPU</literal>, the pod is scheduled on the first <literal>CPU</literal> available on the system.
es: Clase de calidad de servicio <literal>BestEffort</literal>: si no se define ninguna solicitud o límite para la <literal>CPU</literal>, el pod se programa en la primera <literal>CPU</literal> disponible en el sistema.
ja: <literal>BestEffort</literal> QoSクラス: <literal>CPU</literal>に対して要求または制限を定義していない場合、Podはシステムで使用できる最初の<literal>CPU</literal>でスケジュールされます。
pt_br: Classe de QoS <literal>BestEffort</literal>: se você não definir uma solicitação ou um limite de <literal>CPU</literal>, o pod será programado na primeira <literal>CPU</literal> disponível no sistema.
zh_cn: <literal>BestEffort</literal> QoS 类：如果没有定义任何 <literal>CPU</literal> 请求或限制，则 Pod 将调度到系统中第一个可用的 <literal>CPU</literal> 上。

source: An example of using the <literal>BestEffort</literal> QoS Class could be:
es: Este es un ejemplo de uso de la clase de calidad de servicio <literal>BestEffort</literal>:
ja: <literal>BestEffort</literal> QoSクラスを使用する例を次に示します。
pt_br: Um exemplo de uso da classe de QoS <literal>BestEffort</literal> é:
zh_cn: 使用 <literal>BestEffort</literal> QoS 类的示例如下：

source: <literal>Burstable</literal> QoS Class: If you define a request for CPU, which is not equal to the limits, or there is no CPU request.
es: Clase de calidad de servicio <literal>Burstable</literal>: si se define una solicitud para la CPU que no se ajusta a los límites establecidos, o si no hay ninguna solicitud de CPU.
ja: <literal>Burstable</literal> QoSクラス: CPUに対して要求を定義し、その要求が制限と同じではない場合、またはCPUの要求がない場合。
pt_br: Classe de QoS <literal>Burstable</literal>: se você definir uma solicitação de CPU que não é igual aos limites, ou se não houver solicitações de CPU.
zh_cn: <literal>Burstable</literal> QoS 类：如果定义了 CPU 请求且该请求不等于限制值，或者没有定义 CPU 请求，请使用此方式。

source: Examples of using the <literal>Burstable</literal> QoS Class could be:
es: Ejemplos de uso de la clase de calidad de servicio <literal>Burstable</literal>:
ja: <literal>Burstable</literal> QoSクラスを使用する例を次に示します。
pt_br: Alguns exemplos de uso da classe de QoS <literal>Burstable</literal> são:
zh_cn: 使用 <literal>Burstable</literal> QoS 类的示例如下：

source: or
es: o
ja: または
pt_br: ou
zh_cn: 或

source: <literal>Guaranteed</literal> QoS Class: If you define a request for CPU, which is equal to the limits.
es: Clase de calidad de servicio <literal>Guaranteed</literal>: si define una solicitud de CPU que es igual a los límites.
ja: <literal>Guaranteed</literal> QoSクラス: CPUに対して要求を定義し、その要求が制限と同じである場合。
pt_br: Classe de QoS <literal>Guaranteed</literal>: se você definir uma solicitação de CPU igual aos limites.
zh_cn: <literal>Guaranteed</literal> QoS 类：如果定义了 CPU 请求且该请求等于限制值，请使用此方式。

source: An example of using the <literal>Guaranteed</literal> QoS Class could be:
es: Ejemplo de uso de la clase de calidad de servicio <literal>Guaranteed</literal>:
ja: <literal>Guaranteed</literal> QoSクラスを使用する例を次に示します。
pt_br: Um exemplo de uso da classe de QoS <literal>Guaranteed</literal> é:
zh_cn: 使用 <literal>Guaranteed</literal> QoS 类的示例如下：

source: NUMA-aware scheduling
es: Programación compatible con NUMA
ja: NUMA対応のスケジューリング
pt_br: Programação com reconhecimento de NUMA
zh_cn: 可感知 NUMA 的调度

source: Non-Uniform Memory Access or Non-Uniform Memory Architecture (<literal>NUMA</literal>) is a physical memory design used in <literal>SMP</literal> (multiprocessors) architecture, where the memory access time depends on the memory location relative to a processor. Under <literal>NUMA</literal>, a processor can access its own local memory faster than non-local memory, that is, memory local to another processor or memory shared between processors.
es: El acceso a la memoria no uniforme o arquitectura de memoria no uniforme (<literal>NUMA</literal>) es un diseño de memoria física utilizado en la arquitectura <literal>SMP</literal> (multiprocesadores) en la que el tiempo de acceso a la memoria depende de la ubicación de la memoria con respecto al procesador. En <literal>NUMA</literal>, un procesador puede acceder a su propia memoria local más rápido que a la memoria no local; es decir, la memoria local de otro procesador o la memoria compartida entre procesadores.
ja: Non-Uniform Memory AccessまたはNon-Uniform Memory Architecture (<literal>NUMA</literal>)は、<literal>SMP</literal> (マルチプロセッサ)アーキテクチャにおいて使用される物理メモリ設計であり、メモリアクセス時間がプロセッサからのメモリの相対的な位置によって異なります。<literal>NUMA</literal>では、プロセッサは専用のローカルメモリに、非ローカルメモリ、つまり別のプロセッサにローカルなメモリや複数のプロセッサで共有されているメモリよりも高速にアクセスできます。
pt_br: Acesso não uniforme à memória ou arquitetura não uniforme de acesso à memória (<literal>NUMA</literal>, Non-Uniform Memory Access ou Non-Uniform Memory Architecture) é um projeto de memória física usado na arquitetura <literal>SMP</literal> (multiprocessadores), em que o tempo de acesso à memória depende do local da memória relativo ao processador. No <literal>NUMA</literal>, um processador pode acessar a própria memória local com mais rapidez do que a memória não local, ou seja, a memória local de outro processador ou a memória compartilhada entre processadores.
zh_cn: 非统一内存访问或非统一内存体系结构 (<literal>NUMA</literal>) 是 <literal>SMP</literal>（多处理器）体系结构中使用的物理内存设计，其中内存访问时间取决于相对于处理器的内存位置。在 <literal>NUMA</literal> 下，与访问非本地内存（即，另一个处理器本地的内存，或者在处理器之间共享的内存）相比，处理器可以更快地访问自身的本地内存。

source: Identifying NUMA nodes
es: Identificación de nodos NUMA
ja: NUMAノードの特定
pt_br: Identificando os nós NUMA
zh_cn: 识别 NUMA 节点

source: To identify the <literal>NUMA</literal> nodes, on your system use the following command:
es: Para identificar los nodos <literal>NUMA</literal>, utilice el siguiente comando en su sistema:
ja: <literal>NUMA</literal>ノードを特定するには、システムで次のコマンドを使用します。
pt_br: Para identificar os nós <literal>NUMA</literal>, execute o seguinte comando em seu sistema:
zh_cn: 要识别 <literal>NUMA</literal> 节点，请在系统上使用以下命令：

source: For this example, we have only one <literal>NUMA</literal> node showing 64 <literal>CPUs</literal>.
es: En este ejemplo, solo tenemos un nodo <literal>NUMA</literal> que muestra 64 <literal>CPU</literal>.
ja: この例では、<literal>NUMA</literal>ノードが1つだけあり、64個の<literal>CPU</literal>が表示されています。
pt_br: Para este exemplo, temos apenas um nó <literal>NUMA</literal> com 64 <literal>CPUs</literal>.
zh_cn: 对于此示例，只有一个 <literal>NUMA</literal> 节点显示了 64 个 <literal>CPU</literal>。

source: <literal>NUMA</literal> needs to be enabled in the <literal>BIOS</literal>. If <literal>dmesg</literal> does not have records of NUMA initialization during the bootup, then <literal>NUMA</literal>-related messages in the kernel ring buffer might have been overwritten.
es: <literal>NUMA</literal> debe estar habilitado en el <literal>BIOS</literal>. Si <literal>dmesg</literal> no tiene registros de la inicialización de NUMA durante el arranque, es posible que los mensajes relacionados con <literal>NUMA</literal> del búfer del anillo del kernel se hayan sobrescrito.
ja: <literal>NUMA</literal>は<literal>BIOS</literal>で有効にする必要があります。<literal>dmesg</literal>にブート時のNUMA初期化レコードがない場合、カーネルリングバッファ内の<literal>NUMA</literal>関連のメッセージが上書きされた可能性があります。
pt_br: É necessário habilitar o <literal>NUMA</literal> no <literal>BIOS</literal>. Se o <literal>dmesg</literal> não tem registros de inicialização do NUMA durante o bootup, as mensagens relacionadas ao <literal>NUMA</literal> no buffer de anel do kernel podem ter sido substituídas.
zh_cn: <literal>NUMA</literal> 需要在 <literal>BIOS</literal> 中启用。如果 <literal>dmesg</literal> 中没有引导过程中 NUMA 初始化的记录，则可能表示内核环缓冲区中的 <literal>NUMA</literal> 相关消息已被重写。

source: <literal>MetalLB</literal> is a load-balancer implementation for bare-metal Kubernetes clusters, using standard routing protocols like <literal>L2</literal> and <literal>BGP</literal> as advertisement protocols. It is a network load balancer that can be used to expose services in a Kubernetes cluster to the outside world due to the need to use Kubernetes Services type <literal>LoadBalancer</literal> with bare-metal.
es: <literal>MetalLB</literal> es una implementación de equilibrador de carga para clústeres bare metal de Kubernetes que utiliza protocolos de enrutamiento estándar como <literal>L2</literal> y <literal>BGP</literal> como protocolos de anuncios. Se trata de un equilibrador de carga de red que se puede utilizar para exponer servicios de un clúster de Kubernetes al mundo exterior que necesite utilizar el tipo de servicios de Kubernetes <literal>LoadBalancer</literal> con bare metal.
ja: <literal>MetalLB</literal>は、ベアメタルKubernetesクラスタ用のロードバランサの実装であり、<literal>L2</literal>や<literal>BGP</literal>などの標準ルーティングプロトコルをアドバタイズプロトコルとして使用します。ベアメタル環境ではKubernetesサービスタイプ<literal>LoadBalancer</literal>を使用する必要があるため、Kubernetesクラスタ内のサービスを外部に公開するために使用できるのは、ネットワークロードバランサです。
pt_br: <literal>MetalLB</literal> é uma implementação de balanceador de carga para clusters Kubernetes bare metal, que usa os protocolos de roteamento padrão, como <literal>L2</literal> e <literal>BGP</literal>, como protocolos de anúncio. Trata-se de um balanceador de carga de rede que pode ser usado para expor serviços em um cluster Kubernetes ao ambiente externo por causa da necessidade de usar serviços do Kubernetes do tipo <literal>LoadBalancer</literal> com bare metal.
zh_cn: <literal>MetalLB</literal> 是裸机 Kubernetes 群集的负载平衡器实现，使用 <literal>L2</literal> 和 <literal>BGP</literal> 等标准路由协议作为广告协议。它是一个网络负载平衡器，可用于向外部公开 Kubernetes 群集中的服务（因为需要在裸机上使用 Kubernetes 服务类型 <literal>LoadBalancer</literal>）。

source: To enable <literal>MetalLB</literal> in the <literal>RKE2</literal> cluster, the following steps are required:
es: Para habilitar <literal>MetalLB</literal> en el clúster <literal>RKE2</literal>, se deben seguir estos pasos:
ja: <literal>RKE2</literal>クラスタで<literal>MetalLB</literal>を有効にするには、次の手順を実行する必要があります。
pt_br: Para habilitar o <literal>MetalLB</literal> no cluster <literal>RKE2</literal>, são necessárias as seguintes etapas:
zh_cn: 要在 <literal>RKE2</literal> 群集中启用 <literal>MetalLB</literal>，需要执行以下步骤：

source: Install <literal>MetalLB</literal> using the following command:
es: Instale <literal>MetalLB</literal> con este comando:
ja: 次のコマンドを使用して<literal>MetalLB</literal>をインストールします。
pt_br: Instale o <literal>MetalLB</literal> usando o seguinte comando:
zh_cn: 使用以下命令安装 <literal>MetalLB</literal>：

source: Create the <literal>IpAddressPool</literal> and the <literal>L2advertisement</literal> configuration:
es: Cree la configuración <literal>IpAddressPool</literal> y <literal>L2advertisement</literal>:
ja: <literal>IpAddressPool</literal>および<literal>L2advertisement</literal>の設定を作成します。
pt_br: Crie a configuração de <literal>IpAddressPool</literal> e <literal>L2advertisement</literal>:
zh_cn: 创建 <literal>IpAddressPool</literal> 和 <literal>L2advertisement</literal> 配置：

source: Create the endpoint service to expose the <literal>VIP</literal>:
es: Cree el servicio de punto final para exponer la <literal>IP virtual</literal>:
ja: <literal>VIP</literal>を公開するためのエンドポイントサービスを作成します。
pt_br: Crie o serviço de endpoint para expor o <literal>VIP</literal>:
zh_cn: 创建端点服务来公开 <literal>VIP</literal>：

source: Check the <literal>VIP</literal> is created and the <literal>MetalLB</literal> pods are running:
es: Compruebe que se ha creado la <literal>IP virtual</literal> y que los pods de <literal>MetalLB</literal> se están ejecutando:
ja: <literal>VIP</literal>が作成され、<literal>MetalLB</literal>のPodが実行中であることを確認します。
pt_br: Verifique se o <literal>VIP</literal> foi criado e se os pods do <literal>MetalLB</literal> estão em execução:
zh_cn: 检查 <literal>VIP</literal> 是否已创建并且 <literal>MetalLB</literal> Pod 是否正在运行：

source: Private registry configuration
es: Configuración del registro privado
ja: プライベートレジストリ設定
pt_br: Configuração do registro particular
zh_cn: 专用仓库配置

source: <literal>Containerd</literal> can be configured to connect to private registries and use them to pull private images on each node.
es: Es posible configurar <literal>Containerd</literal> para que se conecte a registros privados y los use para extraer imágenes privadas en cada nodo.
ja: <literal>Containerd</literal>をプライベートレジストリに接続するように設定し、そのプライベートレジストリを使用して各ノードにプライベートイメージをプルできます。
pt_br: É possível configurar o <literal>Containerd</literal> para conexão com os registros particulares e usá-los para extrair as imagens particulares de cada nó.
zh_cn: 可以配置 <literal>Containerd</literal> 以连接到专用仓库，然后使用专用仓库提取每个节点上的专用映像。
