Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Remote system on-boarding into Rancher Prime with Elemental (<xref linkend="components-elemental"/>), enabling late binding of connected edge nodes to desired Kubernetes clusters and application deployment, e.g. via GitOps.
es: Incorporación remota del sistema a Rancher Prime con Elemental (<xref linkend="components-elemental"/>), lo que permite la vinculación posterior de los nodos periféricos conectados a los clústeres de Kubernetes deseados y el despliegue de aplicaciones, por ejemplo, a través de GitOps.
ja: Elemental (<xref linkend="components-elemental"/>)を使用したRancher Primeへのリモートシステムのオンボーディングにより、接続されたエッジノードを目的のKubernetesクラスタに遅延バインディングしたり、GitOps経由でアプリケーションをデプロイメントしたりできます。
pt_br: Integração remota do sistema ao Rancher Prime com Elemental (<xref linkend="components-elemental"/>), que permite a vinculação posterior dos nós de borda conectados aos clusters Kubernetes e a implantação de aplicativos, por exemplo, pelo GitOps.
zh_cn: 借助 Elemental（<xref linkend="components-elemental"/>）实现的远程系统接入 Rancher Prime，支持将连接的边缘节点与所需的 Kubernetes 群集和应用程序部署进行后期绑定（例如通过 GitOps）。

source: An Optional full bare-metal lifecycle and management support with Metal3 (<xref linkend="components-metal3"/>), MetalLB (<xref linkend="components-metallb"/>), and <literal>CAPI</literal> (Cluster API) infrastructure providers, enabling the full end-to-end provisioning of baremetal systems that have remote management capabilities.
es: Compatibilidad opcional completa del ciclo de vida y la gestión física (bare metal) con los proveedores de infraestructura Metal3 (<xref linkend="components-metal3"/>), MetalLB (<xref linkend="components-metallb"/>) y <literal>CAPI</literal> (Cluster API), lo que permite el aprovisionamiento completo de extremo a extremo de sistemas físicos con capacidades de gestión remota.
ja: Metal3 (<xref linkend="components-metal3"/>)、MetalLB (<xref linkend="components-metallb"/>)、および<literal>CAPI</literal> (Cluster API)インフラストラクチャプロバイダによるオプションの完全なベアメタルライフサイクルおよび管理サポートにより、リモート管理機能を備えたベアメタルシステムの完全なエンドツーエンドのプロビジョニングが可能になります。
pt_br: Suporte opcional completo ao ciclo de vida e gerenciamento bare metal com os provedores de infraestrutura Metal3 (<xref linkend="components-metal3"/>), MetalLB (<xref linkend="components-metallb"/>) e <literal>CAPI</literal> (Cluster API), que permite o provisionamento total, de ponta a ponta, dos sistemas bare metal com recursos de gerenciamento remoto.
zh_cn: 可选的完整裸机生命周期与管理支持，通过 Metal3（<xref linkend="components-metal3"/>）、MetalLB（<xref linkend="components-metallb"/>）和 <literal>CAPI</literal> (Cluster API) 基础架构提供程序实现，支持对具有远程管理功能的裸机系统执行完整的端到端置备。

source: An optional GitOps engine called Fleet (<xref linkend="components-fleet"/>) for managing the provisioning and lifecycle of downstream clusters and applications that reside on them.
es: Un motor GitOps opcional llamado Fleet (<xref linkend="components-fleet"/>) para gestionar el aprovisionamiento y el ciclo de vida de los clústeres descendentes y las aplicaciones que residen en ellos.
ja: ダウンストリームクラスタとそれらに存在するアプリケーションのプロビジョニングとライフサイクルの管理のためのFleet (<xref linkend="components-fleet"/>)と呼ばれるオプションのGitOpsエンジン。
pt_br: Um mecanismo opcional do GitOps chamado Fleet (<xref linkend="components-fleet"/>) que gerencia o provisionamento e o ciclo de vida dos clusters downstream e dos aplicativos que residem neles.
zh_cn: 名为 Fleet（<xref linkend="components-fleet"/>）的可选 GitOps 引擎，用于管理下游群集和其上安装的应用程序的置备和生命周期。

source: Underpinning the management cluster itself is SUSE Linux Micro (<xref linkend="components-slmicro"/>) as the base operating system and RKE2 (<xref linkend="components-rke2"/>) as the Kubernetes distribution supporting the management cluster applications.
es: El clúster de gestión tiene SUSE Linux Micro (<xref linkend="components-slmicro"/>) como sistema operativo base y RKE2 (<xref linkend="components-rke2"/>) como distribución de Kubernetes que aporta compatibilidad con las aplicaciones del clúster de gestión.
ja: 管理クラスタ自体を支えるのは、ベースオペレーティングシステムとしてのSUSE Linux Micro (<xref linkend="components-slmicro"/>)と、管理クラスタアプリケーションをサポートするKubernetesディストリビューションとしてのRKE2 (<xref linkend="components-rke2"/>)です。
pt_br: O cluster de gerenciamento conta com o SUSE Linux Micro (<xref linkend="components-slmicro"/>) como o alicerce do sistema operacional de base e com o RKE2 (<xref linkend="components-rke2"/>) como a distribuição Kubernetes que oferece suporte aos aplicativos do cluster de gerenciamento.
zh_cn: 支撑管理群集本身的是作为基础操作系统的 SUSE Linux Micro（<xref linkend="components-slmicro"/>），以及作为支持管理群集应用程序的 Kubernetes 发行版的 RKE2（<xref linkend="components-rke2"/>）。

source: Downstream Clusters
es: Clústeres descendentes
ja: ダウンストリームクラスタ
pt_br: Clusters downstream
zh_cn: 下游群集

source: suse edge downstream cluster
es: clúster descendente de suse edge
ja: SUSE Edgeダウンストリームクラスタ
pt_br: cluster downstream do suse edge
zh_cn: Suse Edge 下游群集

source: <emphasis role="strong">Downstream</emphasis>: This is the distributed part of SUSE Edge that is used to run the user workloads at the Edge, i.e. the software that is running at the edge location itself, and is typically comprised of the following components:
es: <emphasis role="strong">Descendentes</emphasis>: esta es la parte distribuida de SUSE Edge que se utiliza para ejecutar las cargas de trabajo del usuario en el perímetro; es decir, el software que se ejecuta en la propia ubicación perimetral y que, normalmente, se compone de los siguientes componentes:
ja: <emphasis role="strong">ダウンストリーム</emphasis>: これは、エッジでユーザワークロードを実行するために使用されるSUSE Edgeの分散部分です。つまり、エッジの場所自体で実行されるソフトウェアであり、通常は次のコンポーネントで構成されます。
pt_br: <emphasis role="strong">Downstream</emphasis>: trata-se da parte distribuída do SUSE Edge usada para executar as cargas de trabalho dos usuários no Edge, ou seja, o software que é executado no próprio local de borda, e que normalmente inclui os seguintes componentes:
zh_cn: <emphasis role="strong">下游</emphasis>：SUSE Edge 的分布式组件，用于在边缘运行用户工作负载，即边缘位置运行的软件，通常由以下组件组成：

source: A choice of Kubernetes distributions, with secure and lightweight distributions like K3s (<xref linkend="components-k3s"/>) and RKE2 (<xref linkend="components-rke2"/>) (<literal>RKE2</literal> is hardened, certified and optimized for usage in government and regulated industries).
es: Una selección de distribuciones de Kubernetes, con distribuciones seguras y ligeras como K3s (<xref linkend="components-k3s"/>) y RKE2 (<xref linkend="components-rke2"/>) (<literal>RKE2</literal> está reforzada, certificada y optimizada para su uso en el sector público y en industrias reguladas).
ja: K3s (<xref linkend="components-k3s"/>)やRKE2 (<xref linkend="components-rke2"/>)などのセキュアで軽量なディストリビューションを含む、Kubernetesディストリビューションの選択肢(<literal>RKE2</literal>は、政府機関や規制産業での使用に耐えるように強化、認定、最適化されています)。
pt_br: Uma seleção de distribuições Kubernetes, com distribuições seguras e leves como K3s (<xref linkend="components-k3s"/>) e RKE2 (<xref linkend="components-rke2"/>) (<literal>RKE2</literal> é protegido, certificado e otimizado para uso em órgãos governamentais e setores regulamentados).
zh_cn: 多种可供选择的 Kubernetes 发行版，包含 K3s（<xref linkend="components-k3s"/>）和 RKE2（<xref linkend="components-rke2"/>）等安全的轻量级发行版（<literal>RKE2</literal> 已针对政府用途和受监管行业进行强化、认证和优化）。

source: SUSE Security (<xref linkend="components-suse-security"/>) to enable security features like image vulnerability scanning, deep packet inspection, and real-time threat and vulnerability protection.
es: SUSE Security (<xref linkend="components-suse-security"/>) para habilitar funciones de seguridad como el análisis de vulnerabilidades de imágenes, la inspección profunda de paquetes y la protección en tiempo real contra amenazas y vulnerabilidades.
ja: SUSE Security (<xref linkend="components-suse-security"/>)を使用するとイメージ脆弱性スキャン、ディープパケットインスペクション、リアルタイム脅威および脆弱性保護のようなセキュリティ機能が有効になります。
pt_br: SUSE Security (<xref linkend="components-suse-security"/>) para habilitar recursos de segurança, como verificação de vulnerabilidade de imagens, inspeção detalhada de pacotes e proteção contra ameaças e vulnerabilidades em tempo real.
zh_cn: SUSE Security（<xref linkend="components-suse-security"/>），提供映像漏洞扫描、深度数据包检测、实时威胁和漏洞防护等安全功能。

source: Software block storage with SUSE Storage (<xref linkend="components-suse-storage"/>) to enable lightweight persistent, resilient, and scalable block-storage.
es: Software de almacenamiento en bloques con SUSE Storage (<xref linkend="components-suse-storage"/>) que permite un sistema de almacenamiento en bloques ligero, persistente, resistente y escalable.
ja: SUSE Storage (<xref linkend="components-suse-storage"/>)によるソフトウェアブロックストレージにより、軽量で永続的、弾力性があり、拡張可能なブロックストレージが可能になります。
pt_br: Armazenamento de software em blocos com o SUSE Storage (<xref linkend="components-suse-storage"/>), que possibilita o armazenamento em blocos leve, persistente, resiliente e escalável.
zh_cn: 借助 SUSE Storage（<xref linkend="components-suse-storage"/>）实现的软件块存储，提供轻量级、持久化、弹性佳且可扩缩的块存储服务。

source: A lightweight, container-optimized, hardened Linux operating system with SUSE Linux Micro (<xref linkend="components-slmicro"/>), providing an immutable and highly resilient OS for running containers and virtual machines at the edge. SUSE Linux Micro is available for both AArch64 and AMD64/Intel 64 architectures, and it also supports <literal>Real-Time Kernel</literal> for latency sensitive applications (e.g. telco use-cases).
es: Un sistema operativo Linux ligero, optimizado para contenedores y reforzado con SUSE Linux Micro (<xref linkend="components-slmicro"/>), que proporciona un sistema operativo inmutable y altamente resistente para ejecutar contenedores y máquinas virtuales en el perímetro. SUSE Linux Micro está disponible para las arquitecturas AArch64 y AMD64/Intel 64, y también es compatible con el <literal>kernel en tiempo real</literal> para aplicaciones sensibles a la latencia (por ejemplo, para uso en telecomunicaciones).
ja: SUSE Linux Micro (<xref linkend="components-slmicro"/>)を搭載した、軽量でコンテナに最適化された堅牢なLinuxオペレーティングシステムで、エッジでのコンテナや仮想マシンの実行に不変で耐障害性に優れたOSを提供します。SUSE Linux Microは、AArch64およびAMD64/Intel 64アーキテクチャの両方で使用でき、レイテンシの影響を受けやすいアプリケーション(通信事業者のユースケースなど)向けの<literal>リアルタイムカーネル</literal>もサポートしています。
zh_cn: 基于 SUSE Linux Micro（<xref linkend="components-slmicro"/>）打造的轻量级、容器优化且安全强化的 Linux 操作系统，可为在边缘运行容器和虚拟机提供不可变且高弹性的操作系统环境。SUSE Linux Micro 适用于 AArch64 和 AMD64/Intel 64 两种体系结构，还支持<literal>实时内核</literal>，可满足对延迟敏感的应用需求（如电信领域的使用场景）。

source: For connected clusters (i.e. those that do have connectivity to the management cluster) two agents are deployed, namely Rancher System Agent for managing the connectivity to Rancher Prime, and venv-salt-minion for taking instructions from SUSE Multi-Linux Manager for applying Linux software updates. These agents are not required for management of disconnected clusters.
es: Para los clústeres conectados (los que tienen conectividad con el clúster de gestión), se despliegan dos agentes: Rancher System Agent, para gestionar la conectividad con Rancher Prime, y venv-salt-minion, para recibir instrucciones de SUSE Multi-Linux Manager y aplicar las actualizaciones de software de Linux. Estos agentes no son necesarios para la gestión de clústeres desconectados.
ja: 接続されたクラスタ(つまり、管理クラスタに接続しているクラスタ)には、Rancher Primeへの接続を管理するためのRancher System Agentと、SUSE Multi-Linux Managerからの指示を受けてLinuxソフトウェアの更新を適用するためのvenv-salt-minionの2つのエージェントがデプロイされます。これらのエージェントは、切断されたクラスタの管理には必要ありません。
pt_br: Para os clusters conectados (ou seja, os que têm conectividade com o cluster de gerenciamento), dois agentes são implantados: Agente do sistema Rancher, para gerenciar a conectividade com o Rancher Prime, e venv-salt-minion, para receber as instruções do SUSE Multi-Linux Manager e aplicar as atualizações de software Linux. Eles não são obrigatórios para o gerenciamento de clusters desconectados.
zh_cn: 对于连接的群集（即与管理群集连接的群集），会部署两个代理。一个是 Rancher System Agent，用于管理与 Rancher Prime 的连接；另一个是 venv-salt-minion，用于接收 SUSE Multi-Linux Manager 的指令，以执行 Linux 软件更新。这些代理对于离线群集的管理而言并非必需组件。

source: Connectivity
es: Conectividad
ja: 接続
pt_br: Conectividade
zh_cn: 连接

source: suse edge connected architecture
es: arquitectura conectada de suse edge
ja: SUSE Edge接続アーキテクチャ
pt_br: arquitetura conectada do suse edge
zh_cn: Suse Edge 连接的体系结构

source: The above image provides a high-level architectural overview for <emphasis role="strong">connected</emphasis> downstream clusters and their attachment to the management cluster. The management cluster can be deployed on a wide variety of underlying infrastructure platforms, in both on-premises and cloud capacities, depending on networking availability between the downstream clusters and the target management cluster. The only requirement for this to function are API and callback URL’s to be accessible over the network that connects downstream cluster nodes to the management infrastructure.
es: La imagen anterior ofrece una descripción general de la arquitectura de los clústeres descendentes <emphasis role="strong">conectados</emphasis> y sus conexiones con el clúster de gestión. El clúster de gestión se puede desplegar en una amplia variedad de plataformas de infraestructura subyacentes, tanto en instalaciones locales como en la nube, dependiendo de la disponibilidad de red entre los clústeres descendentes y el clúster de gestión de destino. El único requisito para que funcione es que sea posible acceder a las API y las URL de redirección a través de la red que conecta los nodos del clúster descendente con la infraestructura de gestión.
ja: 上記のイメージは、<emphasis role="strong">接続された</emphasis>ダウンストリームクラスタと、それらの管理クラスタへの接続に関する高レベルアーキテクチャの概要を示しています。管理クラスタは、ダウンストリームクラスタとターゲット管理クラスタとの間のネットワーキングの可用性に応じて、オンプレミスとクラウドの両方の容量で、さまざまな基礎となるインフラストラクチャプラットフォーム上にデプロイできます。これが機能するための唯一の要件は、ダウンストリームクラスタノードを管理インフラストラクチャに接続するネットワークでアクセス可能なAPIとコールバックURLです。
pt_br: A imagem acima apresenta uma visão geral de alto nível da arquitetura dos clusters downstream <emphasis role="strong">conectados</emphasis> e sua relação com o cluster de gerenciamento. É possível implantar o cluster de gerenciamento em uma ampla variedade de plataformas de infraestrutura subjacentes, em instalações tanto no local quanto na nuvem, dependendo da disponibilidade de rede entre os clusters downstream e o cluster de gerenciamento de destino. O único requisito para que isso funcione é que a API e o URL de callback estejam acessíveis pela rede que conecta os nós do cluster downstream à infraestrutura de gerenciamento.
zh_cn: 上图提供了<emphasis role="strong">连接</emphasis>的下游群集及其与管理群集的连接的总体体系结构概览。管理群集可以部署在各种底层基础架构平台上，包括本地和云平台，具体取决于下游群集和目标管理群集之间的网络连接情况。这项功能的唯一要求是 API 和回调 URL 可以通过连接下游群集节点和管理基础架构的网络进行访问。

source: It’s important to recognize that there are distinct mechanisms in which this connectivity is established relative to the mechanism of downstream cluster deployment. The details of this are explained in much more depth in the next section, but to set a baseline understanding, there are three primary mechanisms for connected downstream clusters to be established as a "managed" cluster:
es: Es importante entender que existen mecanismos distintos en los que se establece esta conectividad en relación con el mecanismo de despliegue del clúster descendente. Esto se explica con mucho más detalle en la siguiente sección. Como descripción general: existen tres mecanismos principales para que los clústeres descendentes conectados se establezcan como un clúster "gestionado":
ja: この接続が確立されるメカニズムは、ダウンストリームクラスタのデプロイメントのメカニズムとは異なるものであることを認識することが重要です。この詳細については、次のセクションでさらに詳しく説明しますが、基本的な理解を深めるために、接続されたダウンストリームクラスタが「管理」クラスタとして確立される主なメカニズムは3つあります。
pt_br: É importante reconhecer que existem mecanismos em que a conectividade é estabelecida e que são diferentes do mecanismo de implantação do cluster downstream. Há uma explicação mais detalhada sobre isso na próxima seção; mas, para um entendimento geral, há três mecanismos principais para estabelecer os clusters downstream conectados como um cluster "gerenciado":
zh_cn: 必须注意，建立这种连接的机制不同于下游群集部署的机制。下一节将对此进行更深入的介绍，不过先建立一个基本概念，连接的下游群集成为“受管理”群集主要有三种机制：

source: The downstream clusters are deployed in a "disconnected" capacity at first (e.g. via Edge Image Builder (<xref linkend="components-eib"/>)), and are then imported into the management cluster if/when connectivity allows.
es: Los clústeres descendentes se despliegan inicialmente en modo "desconectado" (por ejemplo, mediante Edge Image Builder, <xref linkend="components-eib"/>) y, a continuación, se importan al clúster de gestión si la conectividad lo permite.
ja: ダウンストリームクラスタはまず「切断された」容量でデプロイされ(Edge Image Builder (<xref linkend="components-eib"/>)経由)、接続が許可されると、管理クラスタにインポートされます。
pt_br: Os clusters downstream são implantados primeiro no modo "desconectado" (por exemplo, pelo Edge Image Builder (<xref linkend="components-eib"/>)) e depois são importados para o cluster de gerenciamento se ou quando a conectividade permite.
zh_cn: 下游群集先以“断开连接”的方式部署（例如通过 Edge Image Builder（<xref linkend="components-eib"/>）），然后在连接允许的情况下导入管理群集。

source: The downstream clusters are configured to use the built-in onboarding mechanism (e.g. via Elemental (<xref linkend="components-elemental"/>)), and they automatically register into the management cluster at first-boot, allowing for late-binding of the cluster configuration.
es: Los clústeres descendentes se configuran para utilizar el mecanismo de incorporación integrado (por ejemplo, a través de Elemental (<xref linkend="components-elemental"/>)) y se registran automáticamente en el clúster de gestión en el primer arranque, lo que permite la vinculación posterior de la configuración del clúster.
ja: ダウンストリームクラスタは、組み込みオンボーディングメカニズム(たとえばElemental (<xref linkend="components-elemental"/>)経由)を使用するように設定され、初回ブート時に管理クラスタに自動的に登録されるため、クラスタ設定の遅延バインディングが許可されます。
pt_br: Os clusters downstream são configurados para usar o mecanismo de integração incorporado (por exemplo, pelo Elemental (<xref linkend="components-elemental"/>)) e são automaticamente registrados no cluster de gerenciamento na primeira inicialização, o que permite a vinculação posterior da configuração do cluster.
zh_cn: 下游群集会被配置为使用内置的初始配置机制（例如通过 Elemental（<xref linkend="components-elemental"/>）），并且它们在首次引导时会自动注册到管理群集，以允许群集配置的后期绑定。

source: The downstream clusters have been provisioned with the baremetal management capabilities (CAPI + Metal<superscript>3</superscript>), and they’re automatically imported into the management cluster once the cluster has been deployed and configured (via the Rancher Turtles operator).
es: Los clústeres descendentes se han aprovisionado con capacidades de gestión bare metal (CAPI + Metal<superscript>3</superscript>) y se importan automáticamente en el clúster de gestión después de que este se haya desplegado y configurado (a través del operador Rancher Turtles).
ja: ダウンストリームクラスタにはベアメタル管理機能(CAPI + Metal<superscript>3</superscript>)がプロビジョニングされており、クラスタがデプロイされ、設定されると(Rancher Turtlesオペレータ経由)管理クラスタに自動的にインポートされます。
pt_br: Os clusters downstream foram provisionados com os recursos de gerenciamento bare metal (CAPI + Metal<superscript>3</superscript>) e são automaticamente importados para o cluster de gerenciamento após a implantação e configuração do cluster (pelo operador Rancher Turtles).
zh_cn: 下游群集已置备裸机管理功能 (CAPI + Metal<superscript>3</superscript>)，群集一旦部署和配置（通过 Rancher Turtles 操作器），它们就会自动导入管理群集。

source: It’s recommended that multiple management clusters are implemented to accommodate the scale of large deployments, optimize for bandwidth and latency concerns in geographically dispersed environments, and to minimize the disruption in the event of an outage or management cluster upgrade. You can find the current management cluster scalability limits and system requirements <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements">here</link>.
es: Se recomienda implementar varios clústeres de gestión para adaptarse a implementaciones de gran tamaño, optimizar el ancho de banda y la latencia en entornos geográficamente dispersos y minimizar las interrupciones en caso de una caída del servicio o una actualización del clúster de gestión. Encontrará los límites actuales de escalabilidad del clúster de gestión y los requisitos del sistema <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements">aquí</link>.
ja: 大規模なデプロイメントの規模に対応し、地理的に分散した環境における帯域幅とレイテンシの問題を最適化し、停止時や管理クラスタのアップグレード時の混乱を最小限に抑えるために、複数の管理クラスタを実装することが推奨されます。現在の管理クラスタのスケーラビリティの限界とシステム要件については、<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements">こちら</link>をご覧ください。
zh_cn: 建议实施多个管理群集，以满足大规模部署需求，优化地理分散环境中的带宽和延迟问题，并在发生故障或管理群集升级时最大限度减少中断影响。您可在<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/installation-requirements">此处</link>查看当前管理群集的可伸缩性限制和系统要求。

source: Common Edge Deployment Patterns
es: Patrones de despliegue perimetrales comunes
ja: 一般的なEdgeデプロイメントパターン
pt_br: Padrões de implantação de borda comuns
zh_cn: 常见的 Edge 部署模式

source: Due to the varying set of operating environments and lifecycle requirements, we’ve implemented support for a number of distinct deployment patterns that loosely align to the market segments and use-cases that SUSE Edge operates in. We have documented a quickstart guide for each of these deployment patterns to help you get familiar with the SUSE Edge platform based around your needs. The three deployment patterns that we support today are described below, with a link to the respective quickstart page.
es: Debido a la variedad de entornos operativos y requisitos de ciclo de vida existentes, hemos implantado compatibilidad para una serie de patrones de despliegue que se ajustan de manera general a los sectores del mercado y los casos de uso en los que funciona SUSE Edge. Hemos creado una guía de inicio rápido para cada uno de estos patrones a fin de que pueda familiarizarse con la plataforma SUSE Edge en función de sus necesidades. A continuación, se describen los tres patrones de despliegue que admitimos actualmente, con un enlace a la página de inicio rápido correspondiente.
ja: 動作環境とライフサイクル要件はさまざまであるため、SUSEでは、SUSE Edgeを運用する市場セグメントやユースケースに大まかに一致する別個のデプロイメントパターンを多数サポートしています。また、これらの各デプロイメントパターンに対応するクイックスタートガイドを作成し、ユーザのニーズに基づいてSUSE Edgeプラットフォームに習熟できるようにしています。以下に、現在サポートされている3つのデプロイメントパターンを、各クイックスタートページへのリンクとともに説明します。
pt_br: Devido à variedade de ambientes operacionais e requisitos de ciclo de vida, implementamos o suporte a alguns padrões de implantação que se adaptam de maneira flexível aos segmentos de mercado e casos de uso em que o SUSE Edge atua. Documentamos um guia de início rápido para cada um desses padrões de implantação para ajudar você a se familiarizar com a plataforma SUSE Edge de acordo com as suas necessidades. Os três padrões de implantação com suporte atualmente estão descritos a seguir, com um link para a respectiva página do guia de início rápido.
zh_cn: 由于操作环境和生命周期要求各不相同，我们已针对一些不同的部署模式实施了支持，这些模式与 SUSE Edge 适用的细分市场和使用场景大体一致。我们为其中的每种部署模式编写了一份快速入门指南，以帮助您根据自己的需求熟悉 SUSE Edge 平台。下面介绍了我们目前支持的三种部署模式，并附有相关快速入门页面的链接。

source: Directed network provisioning
es: Aprovisionamiento de red dirigida
ja: ダイレクトネットワークプロビジョニング
pt_br: Provisionamento de rede direcionado
zh_cn: 定向网络置备
