Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: RKE2 is a fundamental piece of the SUSE Edge stack. It sits on top of SUSE Linux Micro (<xref linkend="components-slmicro"/>), providing a standard Kubernetes interface required to deploy Edge workloads.
es: RKE2 es una pieza fundamental de la pila de SUSE Edge. Se sitúa sobre SUSE Linux Micro (<xref linkend="components-slmicro"/>) y proporciona una interfaz de Kubernetes estándar necesaria para desplegar cargas de trabajo de Edge.
ja: RKE2はSUSE Edgeスタックの基礎を成す部分です。RKE2はSUSE Linux Micro (<xref linkend="components-slmicro"/>)上に位置し、Edgeワークロードをデプロイするために必要な標準Kubernetesインタフェースを提供します。
pt_br: O RKE2 é um componente fundamental da pilha do SUSE Edge. Ele coexiste com o SUSE Linux Micro (<xref linkend="components-slmicro"/>), oferecendo a interface padrão do Kubernetes necessária para implantar cargas de trabalho do Edge.
zh_cn: RKE2 是 SUSE Edge 堆栈的基本组成部分。它位于 SUSE Linux Micro（<xref linkend="components-slmicro"/>）的顶层，提供部署 Edge 工作负载所需的标准 Kubernetes 接口。

source: The recommended way of installing RKE2 as part of the SUSE Edge stack is by using Edge Image Builder (EIB). See the EIB documentation (<xref linkend="components-eib"/>) for more details on how to configure it to deploy RKE2.
es: La forma recomendada de instalar RKE2 como parte de la pila de SUSE Edge es utilizando Edge Image Builder (EIB). Consulte la documentación de EIB (<xref linkend="components-eib"/>) para obtener más detalles sobre cómo hacerlo.
ja: RKE2をSUSE Edgeスタックの一部としてインストールする場合に推奨される方法は、Edge Image Builder (EIB)を使用することです。RKE2をデプロイするようにEIBを設定する方法の詳細については、EIBのドキュメント(<xref linkend="components-eib"/>)を参照してください。
pt_br: A maneira recomendada de instalar o RKE2 como parte da pilha do SUSE Edge é usar o Edge Image Builder (EIB). Consulte a documentação do EIB (<xref linkend="components-eib"/>) para obter mais detalhes de como configurá-lo para implantar o RKE2.
zh_cn: 将 RKE2 安装为 SUSE Edge 堆栈一部分的建议方法是使用 Edge Image Builder (EIB)。有关如何配置 EIB 来部署 RKE2 的详细信息，请参见 EIB 文档（<xref linkend="components-eib"/>）。

source: EIB is flexible enough to support any parameter required by RKE2, such as specifying the RKE2 version, the <link xl:href="https://docs.rke2.io/reference/server_config">servers</link> or the <link xl:href="https://docs.rke2.io/reference/linux_agent_config">agents</link> configuration, covering all the Edge use cases.
es: EIB es lo suficientemente flexible como para admitir cualquier parámetro requerido por RKE2, como especificar la versión de RKE2, la configuración de <link xl:href="https://docs.rke2.io/reference/server_config">servidores</link> o la configuración de los <link xl:href="https://docs.rke2.io/reference/linux_agent_config">agentes</link>, cubriendo todos los casos de uso de Edge.
ja: EIBは十分な柔軟性を備えているため、RKE2のバージョン、<link xl:href="https://docs.rke2.io/reference/server_config">サーバ</link>、または<link xl:href="https://docs.rke2.io/reference/linux_agent_config">エージェント</link>設定の指定など、RKE2で要求されるあらゆるパラメータをサポートすることができ、Edgeのすべてのユースケースに対応できます。
pt_br: O EIB é flexível o suficiente para dar suporte aos parâmetros exigidos pelo RKE2, como especificar a versão do RKE2, a configuração de <link xl:href="https://docs.rke2.io/reference/server_config">servidores</link> ou de <link xl:href="https://docs.rke2.io/reference/linux_agent_config">agentes</link>, englobando todos os casos de uso do Edge.
zh_cn: EIB 足够灵活，支持 RKE2 所需的任何参数（例如指定 RKE2 版本、<link xl:href="https://docs.rke2.io/reference/server_config">服务器</link>或<link xl:href="https://docs.rke2.io/reference/linux_agent_config">代理</link>配置），适用于所有 Edge 使用场景。

source: For other use cases involving Metal<superscript>3</superscript>, RKE2 is also being used and installed. In those particular cases, the <link xl:href="https://github.com/rancher-sandbox/cluster-api-provider-rke2">Cluster API Provider RKE2</link> automatically deploys RKE2 on clusters being provisioned with Metal<superscript>3</superscript> using the Edge Stack.
es: También se usa e instala para otros casos de uso relacionados con Metal<superscript>3</superscript>. En ellos, la versión de <link xl:href="https://github.com/rancher-sandbox/cluster-api-provider-rke2">RK2 de proveedor de Cluster API</link> despliega automáticamente RKE2 en los clústeres que se aprovisionan con Metal<superscript>3</superscript> utilizando la pila de Edge.
ja: Metal<superscript>3</superscript>に関連する他のユースケースでも、RKE2が使用およびインストールされます。このような特定のケースでは、<link xl:href="https://github.com/rancher-sandbox/cluster-api-provider-rke2">Cluster API Provider RKE2</link>によって、Edgeスタックを使用してMetal<superscript>3</superscript>でプロビジョニングされるクラスタにRKE2が自動的にデプロイされます。
pt_br: Para outros casos de uso envolvendo o Metal<superscript>3</superscript>, o RKE2 também é usado e instalado. Nesses casos específicos, o <link xl:href="https://github.com/rancher-sandbox/cluster-api-provider-rke2">provedor Cluster API RKE2</link> implanta automaticamente o RKE2 nos clusters que são provisionados com o Metal<superscript>3</superscript> usando a pilha do Edge.
zh_cn: 对于涉及 Metal<superscript>3</superscript> 的其他使用场景，也可以使用和安装 RKE2。在这种特殊情况下，<link xl:href="https://github.com/rancher-sandbox/cluster-api-provider-rke2">Cluster API 提供程序 RKE2</link> 会自动在使用 Edge Stack 通过 Metal<superscript>3</superscript> 置备的群集上部署 RKE2。

source: In those cases, the RKE2 configuration must be applied on the different CRDs involved. An example of how to provide a different CNI using the <literal>RKE2ControlPlane</literal> CRD looks like:
es: En esos casos, la configuración de RKE2 debe aplicarse en las diferentes CRD involucradas. Un ejemplo de cómo proporcionar una CNI diferente utilizando la CRD <literal>RKE2ControlPlane</literal> sería el siguiente:
ja: このような場合、関係する各種のCRDにRKE2設定を適用する必要があります。<literal>RKE2ControlPlane</literal> CRDを使用して異なるCNIを提供する方法の例は、次のようになります。
pt_br: Nesses casos, a configuração do RKE2 deve ser aplicada às diversas CRDs envolvidas. Um exemplo de como fornecer uma CNI diferente usando a CRD <literal>RKE2ControlPlane</literal> tem esta aparência:
zh_cn: 在这种情况下，必须在涉及的不同 CRD 上应用 RKE2 配置。以下示例说明如何使用 <literal>RKE2ControlPlane</literal> CRD 提供不同的 CNI：

source: For more information about the Metal<superscript>3</superscript> use cases, see <xref linkend="components-metal3"/>.
es: Para obtener más información sobre los casos de uso de Metal<superscript>3</superscript>, consulte el <xref linkend="components-metal3"/>.
ja: Metal<superscript>3</superscript>のユースケースの詳細については、<xref linkend="components-metal3"/>を参照してください。
pt_br: Para obter mais informações sobre os casos de uso do Metal<superscript>3</superscript>, consulte o <xref linkend="components-metal3"/>.
zh_cn: 有关 Metal<superscript>3</superscript> 使用场景的详细信息，请参见<xref linkend="components-metal3"/>。

source: High availability
ja: 高可用性
pt_br: Alta disponibilidade
zh_cn: 高可用性

source: For HA deployments, EIB automatically deploys and configures MetalLB (<xref linkend="components-metallb"/>) and the Endpoint Copier Operator (<xref linkend="components-eco"/>) to expose the RKE2 API endpoint externally.
es: Para los despliegues de HA (High Availability, alta disponibilidad), EIB despliega y configura automáticamente MetalLB (<xref linkend="components-metallb"/>) y el operador Endpoint Copier Operator (<xref linkend="components-eco"/>) para exponer externamente el punto final de la API de RKE2.
ja: HAデプロイメントの場合、EIBはMetalLB (<xref linkend="components-metallb"/>)とEndpoint Copier Operator (<xref linkend="components-eco"/>)を自動的にデプロイして設定し、RKE2 APIエンドポイントを外部に公開します。
pt_br: Para implantações de alta disponibilidade, o EIB implanta e configura automaticamente o MetalLB (<xref linkend="components-metallb"/>) e o Endpoint Copier Operator (<xref linkend="components-eco"/>) para expor o endpoint da API do RKE2 externamente.
zh_cn: 对于高可用性 (HA) 部署，EIB 会自动部署并配置 MetalLB（<xref linkend="components-metallb"/>）和 Endpoint Copier Operator（<xref linkend="components-eco"/>），以向外部公开 RKE2 API 端点。

source: Networking
es: Redes
ja: ネットワーキング
pt_br: Rede
zh_cn: 网络

source: SUSE Edge Stack supports <link xl:href="https://docs.cilium.io/en/stable/">Cilium</link>, <link xl:href="https://docs.tigera.io/calico/latest/about/">Calico</link>, with Cilium as its default CNI. <link xl:href="https://github.com/k8snetworkplumbingwg/multus-cni">Multus</link> meta-plugin can also be used when pods require multiple network interfaces. RKE2 standalone supports <link xl:href="https://docs.rke2.io/install/network_options">a wider range of CNI options</link>.
es: La pila de SUSE Edge admite <link xl:href="https://docs.cilium.io/en/stable/">Cilium</link> y <link xl:href="https://docs.tigera.io/calico/latest/about/">Calico</link>, siendo Cilium su CNI por defecto. El metacomplemento <link xl:href="https://github.com/k8snetworkplumbingwg/multus-cni">Multus</link> también se puede usar si los pods requieren varias interfaces de red. RKE2 por sí mismo admite <link xl:href="https://docs.rke2.io/install/network_options">una gama más amplia de opciones de CNI</link>.
ja: SUSE Edgeスタックは、 <link xl:href="https://docs.cilium.io/en/stable/">Cilium</link>、 <link xl:href="https://docs.tigera.io/calico/latest/about/">Calico</link>をサポートしており、CiliumをデフォルトのCNIとしています。Podが複数のネットワークインタフェースを必要とする場合には<link xl:href="https://github.com/k8snetworkplumbingwg/multus-cni">Multus</link> meta-pluginも使用できます。RKE2スタンドアロンは、<link xl:href="https://docs.rke2.io/install/network_options">より幅広いCNIオプション</link>をサポートしています。
pt_br: A pilha do SUSE Edge suporta o <link xl:href="https://docs.cilium.io/en/stable/">Cilium</link> e o <link xl:href="https://docs.tigera.io/calico/latest/about/">Calico</link>, com o Cilium como CNI padrão. O metaplug-in <link xl:href="https://github.com/k8snetworkplumbingwg/multus-cni">Multus</link> também pode ser usado quando os pods exigem várias interfaces de rede. O RKE2 independente oferece suporte a uma <link xl:href="https://docs.rke2.io/install/network_options">ampla gama de opções de CNI</link>.
zh_cn: SUSE Edge 堆栈支持 <link xl:href="https://docs.cilium.io/en/stable/">Cilium</link>、<link xl:href="https://docs.tigera.io/calico/latest/about/">Calico</link>，并使用 Cilium 作为其默认 CNI。如果 Pod 需要多个网络接口，也可使用 <link xl:href="https://github.com/k8snetworkplumbingwg/multus-cni">Multus</link> 元插件。RKE2 独立版本支持<link xl:href="https://docs.rke2.io/install/network_options">更广泛的 CNI 选项</link>。

source: Storage
es: Almacenamiento
ja: ストレージ
pt_br: Armazenamento
zh_cn: 存储

source: RKE2 does not provide any kind of persistent storage class or operators. For clusters spanning over multiple nodes, it is recommended to use SUSE Storage (<xref linkend="components-suse-storage"/>).
es: RKE2 no proporciona ninguna clase ni operador de almacenamiento persistente. Para clústeres que abarquen varios nodos, se recomienda utilizar SUSE Storage (<xref linkend="components-suse-storage"/>).
ja: RKE2は、どのような種類の永続ストレージクラスやオペレータも提供していません。複数のノードにまたがるクラスタの場合は、SUSE Storage (<xref linkend="components-suse-storage"/>)を使用することをお勧めします。
pt_br: O RKE2 não inclui nenhum tipo de classe ou operador de armazenamento persistente. Para clusters com vários nós, é recomendado usar o SUSE Storage (<xref linkend="components-suse-storage"/>).
zh_cn: RKE2 不提供任何类型的持久性存储类或操作器。对于跨多个节点的群集，建议使用 SUSE Storage（<xref linkend="components-suse-storage"/>）。

source: SUSE Storage is a lightweight, reliable, and user-friendly distributed block storage system designed for Kubernetes. It is a product based on Longhorn, an open-source project initially developed by Rancher Labs and currently incubated under the CNCF.
es: SUSE Storage es un sistema de almacenamiento en bloques distribuido ligero, fiable y fácil de usar diseñado para Kubernetes. Se trata de un producto basado en Longhorn, un proyecto de código abierto desarrollado inicialmente por Rancher Labs y actualmente incubado bajo la CNCF.
ja: SUSE Storageは、Kubernetes向けに設計された、信頼性が高くユーザフレンドリな軽量の分散ブロックストレージシステムです。当初はRancher Labsによって開発され、現在はCNCFの下でインキュベートされているオープンソースプロジェクトであるLonghornをベースにした製品です。
pt_br: O SUSE Storage é um sistema de armazenamento em blocos distribuído, leve, confiável e amigável projetado para Kubernetes. Trata-se de um produto com base no Longhorn, um projeto de código-fonte aberto inicialmente desenvolvido pela Rancher Labs e que agora é incubado pela CNCF.
zh_cn: SUSE Storage 是一款可靠、易用的轻量级分布式块存储系统，专为 Kubernetes 设计。它是基于 Longhorn 的一款产品，而 Longhorn 是一个开源项目，最初由 Rancher Labs 开发，目前在 CNCF 旗下孵化。

source: If you are following this guide, it assumes that you have the following already available:
es: Si está siguiendo esta guía, se da por hecho que ya dispone de lo siguiente:
ja: このガイドに従って操作を進める場合、以下がすでに用意されていることを想定しています。
pt_br: Se você está seguindo este guia, já deve ter os seguintes itens disponíveis:
zh_cn: 如果您要学习本指南，事先需要做好以下准备：

source: At least one host with SUSE Linux Micro 6.1 installed; this can be physical or virtual
es: Al menos un host con SUSE Linux Micro 6.1 instalado; puede ser físico o virtual
ja: SUSE Linux Micro 6.1がインストールされた最低1台のホスト(物理ホストでも仮想ホストでも可)
pt_br: No mínimo, um host com o SUSE Linux Micro 6.1 instalado, que pode ser físico ou virtual
zh_cn: 至少一台装有 SUSE Linux Micro 6.1 的主机，可以是物理主机，也可以是虚拟主机

source: A Kubernetes cluster installed; either K3s or RKE2
es: Un clúster de Kubernetes instalado; ya sea K3s o RKE2
ja: インストール済みのKubernetesクラスタ1つ(K3sまたはRKE2)
pt_br: Um cluster Kubernetes instalado, K3s ou RKE2
zh_cn: 已安装一个 Kubernetes 群集，可以是 K3s 或 RKE2

source: Manual installation of SUSE Storage
es: Instalación manual de SUSE Storage
ja: SUSE Storageの手動インストール
pt_br: Instalação manual do SUSE Storage
zh_cn: 手动安装 SUSE Storage

source: Installing Open-iSCSI
es: Instalación de Open-iSCSI
ja: Open-iSCSIのインストール
pt_br: Instalando o Open-iSCSI
zh_cn: 安装 Open-iSCSI

source: A core requirement of deploying and using SUSE Storage is the installation of the <literal>open-iscsi</literal> package and the <literal>iscsid</literal> daemon running on all Kubernetes nodes. This is necessary, since Longhorn relies on <literal>iscsiadm</literal> on the host to provide persistent volumes to Kubernetes.
es: Un requisito fundamental para desplegar y utilizar SUSE Storage es instalar el paquete <literal>open-iscsi</literal> y que el daemon <literal>iscsid</literal> se ejecute en todos los nodos de Kubernetes. Esto es obligatorio, ya que Longhorn depende de que <literal>iscsiadm</literal> esté en el host para proporcionar volúmenes persistentes a Kubernetes.
ja: SUSE Storageをデプロイして使用するための中心的な要件は、<literal>open-iscsi</literal>パッケージをインストールすることと、<literal>iscsid</literal>デーモンをすべてのKubernetesノード上で実行することです。これは、Longhornがホスト上の<literal>iscsiadm</literal>を利用してKubernetesに永続ボリュームを提供するために必要です。
pt_br: Um requisito essencial da implantação e do uso do SUSE Storage é a instalação do pacote <literal>open-iscsi</literal> e a execução do daemon <literal>iscsid</literal> em todos os nós Kubernetes. Isso é necessário porque o Longhorn conta com o <literal>iscsiadm</literal> no host para fornecer volumes persistentes ao Kubernetes.
zh_cn: 要部署并使用 SUSE Storage，需满足的一项核心要求是在所有 Kubernetes 节点上安装 <literal>open-iscsi</literal> 软件包并运行 <literal>iscsid</literal> 守护程序。之所以有此要求，是因为 Longhorn 依赖于主机上的 <literal>iscsiadm</literal> 来为 Kubernetes 提供持久卷。

source: Let’s install it:
es: Vamos a instalarlo:
ja: インストールしてみましょう。
pt_br: Vamos instalá-lo:
zh_cn: 我们来安装此软件包：

source: It is important to note that once the operation is completed, the package is only installed into a new snapshot as SUSE Linux Micro is an immutable operating system. In order to load it and for the <literal>iscsid</literal> daemon to start running, we must reboot into that new snapshot that we just created. Issue the reboot command when you are ready:
es: Es importante tener en cuenta que, una vez completada la operación, el paquete solo se instala en una nueva instantánea, ya que SUSE Linux Micro es un sistema operativo inmutable. Para cargarlo y que el daemon <literal>iscsid</literal> comience a ejecutarse, hay que volver a arrancar en esa nueva instantánea que acabamos de crear. Ejecute el comando reboot cuando esté listo:
ja: SUSE Linux Microはイミュータブルオペレーティングシステムであるため、操作が完了すると、パッケージは新しいスナップショットにのみインストールされることに注意することが重要です。パッケージをロードし、<literal>iscsid</literal>デーモンの実行を開始するには、作成した新しいスナップショットで再起動する必要があります。準備が整ったら、rebootコマンドを発行します。
pt_br: Como o SUSE Linux Micro é um sistema operacional imutável, é importante notar que o pacote será instalado apenas em um novo instantâneo após a conclusão da operação. Para carregá-lo e para que o daemon <literal>iscsid</literal> seja executado, é necessário reinicializar no novo instantâneo que acabamos de criar. Execute o comando de reinicialização quando você estiver pronto:
zh_cn: 请务必注意，在操作完成后，该软件包只会安装到新快照中，因为 SUSE Linux Micro 是不可变的操作系统。要加载该软件包并让 <literal>iscsid</literal> 守护程序开始运行，我们必须重引导至刚刚创建的新快照。准备就绪后，发出 reboot 命令：

source: For additional help installing open-iscsi, refer to the <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/#installing-open-iscsi">official Longhorn documentation</link>.
es: Para obtener ayuda adicional sobre cómo instalar open-iscsi, consulte la <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/#installing-open-iscsi">documentación oficial de Longhorn</link>.
ja: open-iscsiのインストールに関する追加のヘルプについては、<link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/#installing-open-iscsi">Longhornの公式ドキュメント</link>を参照してください。
zh_cn: 如需更多有关安装 open-iscsi 的帮助，请参见<link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/#installing-open-iscsi">官方 Longhorn 文档</link>。

source: Installing SUSE Storage
es: Instalación de SUSE Storage
ja: SUSE Storageのインストール
pt_br: Instalando o SUSE Storage
zh_cn: 安装 SUSE Storage

source: There are several ways to install SUSE Storage on your Kubernetes clusters. This guide will follow through the Helm installation, however feel free to follow the <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/">official documentation</link> if another approach is desired.
es: Hay varias formas de instalar SUSE Storage en los clústeres de Kubernetes. Esta guía explica la instalación con Helm, pero si desea usar otro método, puede seguir la <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/">documentación oficial</link>.
ja: KubernetesクラスタにSUSE Storageをインストールするには複数の方法があります。このガイドでは、Helmでのインストールに従いますが、別のアプローチが必要な場合は<link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/">公式ドキュメント</link>に従ってください。
zh_cn: 可通过多种方式在 Kubernetes 群集上安装 SUSE Storage。本指南将介绍如何通过 Helm 进行安装，但如果您想要采用其他方法，请按照<link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/">官方文档</link>中的说明操作。

source: Add the Rancher Charts Helm repository:
es: Añada el repositorio de charts de Helm de Rancher:
ja: Rancher Charts Helmリポジトリを追加します。
pt_br: Adicione o repositório de gráficos Helm do Rancher:
zh_cn: 添加 Rancher Chart Helm 储存库：

source: Fetch the latest charts from the repository:
es: Obtenga los charts más recientes del repositorio:
ja: リポジトリから最新のチャートをフェッチします。
pt_br: Busque os gráficos mais recentes no repositório:
zh_cn: 从储存库提取最新的 chart：

source: Install SUSE Storage in the <literal>longhorn-system</literal> namespace:
es: Instale SUSE Storage en el espacio de nombres <literal>longhorn-system</literal>:
ja: <literal>longhorn-system</literal>ネームスペースにSUSE Storageをインストールします。
pt_br: Instale o SUSE Storage no namespace <literal>longhorn-system</literal>:
zh_cn: 在 <literal>longhorn-system</literal> 名称空间中安装 SUSE Storage：

source: Confirm that the deployment succeeded:
es: Confirme que el despliegue se ha realizado correctamente:
ja: デプロイメントが成功したことを確認します。
pt_br: Confirme se a implantação foi bem-sucedida:
zh_cn: 确认部署是否成功：

source: Creating SUSE Storage volumes
es: Creación de volúmenes de SUSE Storage
ja: SUSE Storageボリュームの作成
pt_br: Criando volumes do SUSE Storage
zh_cn: 创建 SUSE Storage 卷

source: SUSE Storage utilizes Kubernetes resources called <literal>StorageClass</literal> in order to automatically provision <literal>PersistentVolume</literal> objects for pods. Think of <literal>StorageClass</literal> as a way for administrators to describe the <emphasis>classes</emphasis> or <emphasis>profiles</emphasis> of storage they offer.
es: SUSE Storage utiliza recursos de Kubernetes denominados <literal>StorageClass</literal> para aprovisionar automáticamente objetos <literal>PersistentVolume</literal> para los pods. Piense en <literal>StorageClass</literal> como una forma que tienen los administradores de describir las <emphasis>clases</emphasis> o los <emphasis>perfiles</emphasis> de almacenamiento que ofrecen.
ja: SUSE Storageは、<literal>StorageClass</literal>というKubernetesリソースを利用して、Podの<literal>PersistentVolume</literal>オブジェクトを自動的にプロビジョニングします。<literal>StorageClass</literal>は、管理者が、自身が提供する<emphasis>クラス</emphasis>または<emphasis>プロファイル</emphasis>を記述する方法だと考えてください。
pt_br: O SUSE Storage usa os recursos do Kubernetes chamados <literal>StorageClass</literal> para provisionar automaticamente os objetos <literal>PersistentVolume</literal> aos pods. Pense no <literal>StorageClass</literal> como um método para os administradores descreverem <emphasis>classes</emphasis> ou <emphasis>perfis</emphasis> do armazenamento que eles oferecem.
zh_cn: SUSE Storage 利用名为 <literal>StorageClass</literal> 的 Kubernetes 资源来自动为 Pod 置备 <literal>PersistentVolume</literal> 对象。可以将 <literal>StorageClass</literal> 视为管理员描述其提供的存储<emphasis>类</emphasis>或<emphasis>配置文件</emphasis>的一种方式。

source: Let’s create a <literal>StorageClass</literal> with some default options:
es: Vamos a crear un recurso <literal>StorageClass</literal> con algunas opciones predeterminadas:
ja: デフォルトのオプションをいくつか使用して<literal>StorageClass</literal>を作成しましょう。
pt_br: Vamos criar um <literal>StorageClass</literal> com algumas opções padrão:
zh_cn: 我们来创建一个采用默认选项的 <literal>StorageClass</literal>：

source: Now that we have our <literal>StorageClass</literal> in place, we need a <literal>PersistentVolumeClaim</literal> referencing it. A <literal>PersistentVolumeClaim</literal> (PVC) is a request for storage by a user. PVCs consume <literal>PersistentVolume</literal> resources. Claims can request specific sizes and access modes (e.g., they can be mounted once read/write or many times read-only).
es: Ahora que ya tenemos nuestro <literal>StorageClass</literal>, necesitamos una solicitud <literal>PersistentVolumeClaim</literal> que haga referencia a él. Una <literal>PersistentVolumeClaim</literal> (PVC) es una solicitud de almacenamiento por parte de un usuario. Las PVC consumen recursos <literal>PersistentVolume</literal>. Las solicitudes pueden pedir tamaños y modos de acceso específicos (por ejemplo, se pueden montar una vez en modo lectura/escritura o varias veces en modo solo lectura).
ja: <literal>StorageClass</literal>を作成したので、それを参照する<literal>PersistentVolumeClaim</literal>が必要です。<literal>PersistentVolumeClaim</literal> (PVC)は、ユーザによるストレージの要求です。PVCは<literal>PersistentVolume</literal>リソースを使用します。クレームでは、特定のサイズとアクセスモードを要求できます(たとえば、1つのノードで読み取り/書き込み可能でマウントすることも、複数のノードで読み取り専用でマウントすることもできます)。
pt_br: Agora que temos um <literal>StorageClass</literal>, precisamos que um <literal>PersistentVolumeClaim</literal> faça referência a ele. Um <literal>PersistentVolumeClaim</literal> (PVC) é uma solicitação de armazenamento feita pelo usuário. Os PVCs consomem os recursos <literal>PersistentVolume</literal>. As declarações podem solicitar tamanhos e modos de acesso específicos (por exemplo, é possível montá-las como leitura/gravação uma vez ou como somente leitura várias vezes).
zh_cn: 创建 <literal>StorageClass</literal> 后，我们需要提供一个 <literal>PersistentVolumeClaim</literal> 来引用它。<literal>PersistentVolumeClaim</literal> (PVC) 是用户发出的存储请求。PVC 使用 <literal>PersistentVolume</literal> 资源。声明可以请求特定的大小和访问模式（例如，可以以读/写模式挂载声明一次，或以只读模式挂载声明多次）。

source: Let’s create a <literal>PersistentVolumeClaim</literal>:
es: Vamos a crear una <literal>PersistentVolumeClaim</literal>:
ja: <literal>PersistentVolumeClaim</literal>を作成しましょう。
pt_br: Vamos criar um <literal>PersistentVolumeClaim</literal>:
zh_cn: 我们来创建 <literal>PersistentVolumeClaim</literal>：
