Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <xref linkend="management-day2-fleet-k8s-upgrade-overview"/> - overview of the upgrade process.
es: <xref linkend="management-day2-fleet-k8s-upgrade-overview"/>: descripción general del proceso de actualización.
ja: <xref linkend="management-day2-fleet-k8s-upgrade-overview"/> - アップグレードプロセスの概要。
pt_br: <xref linkend="management-day2-fleet-k8s-upgrade-overview"/>: visão geral do processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-k8s-upgrade-overview"/> - 升级过程概述。

source: <xref linkend="management-day2-fleet-k8s-upgrade-requirements"/> - requirements of the upgrade process.
es: <xref linkend="management-day2-fleet-k8s-upgrade-requirements"/>: requisitos del proceso de actualización.
ja: <xref linkend="management-day2-fleet-k8s-upgrade-requirements"/> - アップグレードプロセスの要件。
pt_br: <xref linkend="management-day2-fleet-k8s-upgrade-requirements"/>: requisitos do processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-k8s-upgrade-requirements"/> - 升级过程的要求。

source: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment"/> - information on how to deploy <literal>SUC plans</literal>, responsible for triggering the upgrade process.
es: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment"/>: información sobre cómo desplegar <literal>planes de SUC</literal>, responsables de iniciar el proceso de actualización.
ja: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment"/> - <literal>SUC Plan</literal>のデプロイ方法に関する情報。このプランはアップグレードプロセスをトリガする責任を負います。
pt_br: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment"/>: informações de como implantar os <literal>planos do SUC</literal>, responsáveis por acionar o processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment"/> - 关于如何部署负责触发升级过程的 <literal>SUC 计划</literal>的信息。

source: This section covers the custom components that the <literal>K8s upgrade</literal> process uses over the default "Day 2" components (<xref linkend="management-day2-fleet-components"/>).
es: Esta sección trata sobre los componentes personalizados que el proceso de <literal>actualización de K8s</literal> usa en lugar de los componentes predeterminados de "día 2" (<xref linkend="management-day2-fleet-components"/>).
ja: このセクションでは、 <literal>K8sアップグレード</literal>プロセスがデフォルトの「Day 2」コンポーネント(<xref linkend="management-day2-fleet-components"/>)よりも使用するカスタムコンポーネントについて説明します。
pt_br: Esta seção aborda os componentes personalizados que o processo de <literal>upgrade do K8s</literal> usa com os componentes de "dia 2" padrão (<xref linkend="management-day2-fleet-components"/>).
zh_cn: 本节介绍 <literal>K8s 升级</literal>过程中使用的自定义组件，这些组件与默认“Day 2”组件（<xref linkend="management-day2-fleet-components"/>）不同。

source: Container image responsible for upgrading the RKE2 version of a specific node.
es: Es la imagen de contenedor responsable de actualizar la versión de RKE2 de un nodo específico.
ja: 特定のノードのRKE2バージョンのアップグレードを担当するコンテナイメージ。
pt_br: Imagem do contêiner responsável por fazer upgrade da versão do RKE2 de um nó específico.
zh_cn: 容器映像负责升级特定节点的 RKE2 版本。

source: Shipped through a Pod created by <emphasis role="strong">SUC</emphasis> based on a <emphasis role="strong">SUC Plan</emphasis>. The Plan should be located on each <emphasis role="strong">cluster</emphasis> that is in need of a RKE2 upgrade.
es: Se incluye a través de un pod creado por <emphasis role="strong">SUC</emphasis> basado en un <emphasis role="strong">plan de SUC</emphasis>. El plan debe estar ubicado en cada <emphasis role="strong">clúster</emphasis> que necesite una actualización de RKE2.
ja: <emphasis role="strong">SUC Plan</emphasis>に基づいて<emphasis role="strong">SUC</emphasis>によって作成されたPodを通じて配布されます。このPlanは、RKE2のアップグレードが必要な各<emphasis role="strong">クラスタ</emphasis>に配置する必要があります。
pt_br: Incluída em um pod criado pelo <emphasis role="strong">SUC</emphasis> com base no <emphasis role="strong">plano do SUC</emphasis>. O plano deve estar localizado em cada <emphasis role="strong">cluster</emphasis> que precisa de upgrade do RKE2.
zh_cn: 此组件由 <emphasis role="strong">SUC</emphasis> 根据 <emphasis role="strong">SUC 计划</emphasis>创建的 Pod 分发。该计划应位于需要进行 RKE2 升级的每个<emphasis role="strong">群集</emphasis>上。

source: For more information regarding how the <literal>rke2-upgrade</literal> image performs the upgrade, see the <link xl:href="https://github.com/rancher/rke2-upgrade/tree/master">upstream</link> documentation.
es: Para obtener más información sobre cómo la imagen <literal>rke2-upgrade</literal> realiza la actualización, consulte la <link xl:href="https://github.com/rancher/rke2-upgrade/tree/master">documentación original</link>.
ja: <literal>rke2-upgrade</literal>イメージによるアップグレードの実行方法の詳細については、<link xl:href="https://github.com/rancher/rke2-upgrade/tree/master">アップストリーム</link>ドキュメントを参照してください。
pt_br: Para obter mais informações sobre como a imagem <literal>rke2-upgrade</literal> faz o upgrade, consulte a documentação <link xl:href="https://github.com/rancher/rke2-upgrade/tree/master">upstream</link>.
zh_cn: 有关 <literal>rke2-upgrade</literal> 映像如何执行升级的详细信息，请参见<link xl:href="https://github.com/rancher/rke2-upgrade/tree/master">上游</link>文档。

source: Container image responsible for upgrading the K3s version of a specific node.
es: Es la imagen de contenedor responsable de actualizar la versión de K3s de un nodo específico.
ja: 特定のノードのK3sバージョンのアップグレードを担当するコンテナイメージ。
pt_br: Imagem do contêiner responsável por fazer upgrade da versão do K3s de um nó específico.
zh_cn: 容器映像负责升级特定节点的 K3s 版本。

source: Shipped through a Pod created by <emphasis role="strong">SUC</emphasis> based on a <emphasis role="strong">SUC Plan</emphasis>. The Plan should be located on each <emphasis role="strong">cluster</emphasis> that is in need of a K3s upgrade.
es: Se incluye a través de un pod creado por <emphasis role="strong">SUC</emphasis> basado en un <emphasis role="strong">plan de SUC</emphasis>. El plan debe estar ubicado en cada <emphasis role="strong">clúster</emphasis> que necesite una actualización de K3s.
ja: <emphasis role="strong">SUC Plan</emphasis>に基づいて<emphasis role="strong">SUC</emphasis>によって作成されたPodを通じて配布されます。このPlanは、K3sのアップグレードが必要な各<emphasis role="strong">クラスタ</emphasis>に配置する必要があります。
pt_br: Incluída em um pod criado pelo <emphasis role="strong">SUC</emphasis> com base no <emphasis role="strong">plano do SUC</emphasis>. O plano deve estar localizado em cada <emphasis role="strong">cluster</emphasis> que precisa de upgrade do K3s.
zh_cn: 此组件由 <emphasis role="strong">SUC</emphasis> 根据 <emphasis role="strong">SUC 计划</emphasis>创建的 Pod 分发。该计划应位于需要进行 K3s 升级的每个<emphasis role="strong">群集</emphasis>上。

source: For more information regarding how the <literal>k3s-upgrade</literal> image performs the upgrade, see the <link xl:href="https://github.com/k3s-io/k3s-upgrade">upstream</link> documentation.
es: Para obtener más información sobre cómo realiza la imagen <literal>k3s-upgrade</literal> la actualización, consulte la <link xl:href="https://github.com/k3s-io/k3s-upgrade">documentación original</link>.
ja: <literal>k3s-upgrade</literal>イメージによるアップグレードの実行方法の詳細については、<link xl:href="https://github.com/k3s-io/k3s-upgrade">アップストリーム</link>ドキュメントを参照してください。
pt_br: Para obter mais informações sobre como a imagem <literal>k3s-upgrade</literal> faz o upgrade, consulte a documentação <link xl:href="https://github.com/k3s-io/k3s-upgrade">upstream</link>.
zh_cn: 有关 <literal>k3s-upgrade</literal> 映像如何执行升级的详细信息，请参见<link xl:href="https://github.com/k3s-io/k3s-upgrade">上游</link>文档。

source: The Kubernetes distribution upgrade for management cluster nodes is done by utilizing <literal>Fleet</literal> and the <literal>System Upgrade Controller (SUC)</literal>.
es: La actualización de la distribución de Kubernetes para los nodos del clúster de gestión se realiza con <literal>Fleet</literal> y <literal>System Upgrade Controller (SUC)</literal>.
ja: 管理クラスタノードのKubernetesディストリビューションのアップグレードは、<literal>Fleet</literal>と<literal>System Upgrade Controller (SUC)</literal>を利用して実行されます。
pt_br: O upgrade de distribuições Kubernetes para nós de cluster de gerenciamento é feito pelo <literal>Fleet</literal> e pelo <literal>System Upgrade Controller (SUC)</literal>.
zh_cn: 通过 <literal>Fleet</literal> 和<literal>系统升级控制器 (SUC)</literal> 来为管理群集节点升级 Kubernetes 发行版。

source: <literal>Fleet</literal> is used to deploy and manage <literal>SUC plans</literal> onto the desired cluster.
es: <literal>Fleet</literal> se usa para desplegar y gestionar <literal>planes de SUC</literal> en el clúster deseado.
ja: <literal>Fleet</literal>は、<literal>SUC Plan</literal>を目的のクラスタにデプロイし、管理するために使用されます。
pt_br: O <literal>Fleet</literal> é usado para implantar e gerenciar <literal>planos do SUC</literal> no cluster desejado.
zh_cn: <literal>Fleet</literal> 用于将 <literal>SUC 计划</literal>部署到目标群集并对其进行管理。

source: <literal>SUC plans</literal> are <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">custom resources</link> that describe the steps that <emphasis role="strong">SUC</emphasis> needs to follow in order for a specific task to be executed on a set of nodes. For an example of how an <literal>SUC plan</literal> looks like, refer to the <link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">upstream repository</link>.
es: Los <literal>planes de SUC</literal> son <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> que describen los pasos que debe seguir <emphasis role="strong">SUC</emphasis> para ejecutar una tarea específica en un conjunto de nodos. Para ver un ejemplo de un <literal>plan de SUC</literal>, consulte el <link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">repositorio original</link>.
ja: <literal>SUC Plan</literal>は、 <emphasis role="strong">SUC</emphasis>が特定のタスクをノードのセットで実行するために従う必要がある手順を記述した<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">カスタムリソース</link>です。<literal>SUC Plan</literal>の例については、<link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">アップストリームリポジトリ</link>を参照してください。
pt_br: Os <literal>planos do SUC</literal> são <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> que descrevem as etapas que o <emphasis role="strong">SUC</emphasis> precisa seguir para execução de uma tarefa específica em um conjunto de nós. Para ver um exemplo de como é um <literal>plano do SUC</literal>, consulte o <link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">repositório upstream</link>.
zh_cn: <literal>SUC 计划</literal>是一种<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">自定义资源</link>，描述了 <emphasis role="strong">SUC</emphasis> 为在一组节点上执行特定任务而需要遵循的步骤。有关 <literal>SUC 计划</literal>的示例，请参见<link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">上游储存库</link>。

source: The <literal>K8s SUC plans</literal> are shipped on each cluster by deploying a <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> or <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> resource to a specific Fleet <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">workspace</link>. Fleet retrieves the deployed <literal>GitRepo/Bundle</literal> and deploys its contents (the <literal>K8s SUC plans</literal>) to the desired cluster(s).
es: Los <literal>planes de SUC de K8s</literal> se incluyen en cada clúster desplegando un recurso <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> o <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> en un <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">espacio de trabajo</link> específico de Fleet. Fleet recupera el <literal>GitRepo/Bundle</literal> desplegado y despliega su contenido (los <literal>planes de SUC de K8s</literal>) en los clústeres deseados.
ja: <literal>K8s SUC Plan</literal>は、 <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link>または<link xl:href="https://fleet.rancher.io/bundle-add">バンドル</link>リソースを特定のFleet<link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">ワークスペース</link>にデプロイすることで各クラスタに配布されます。Fleetはデプロイされた<literal>GitRepo/バンドル</literal>を取得し、その内容(<literal>K8s SUC Plan</literal>)を目的のクラスタにデプロイします。
pt_br: Os <literal>planos do SUC do K8s</literal> são enviados a cada cluster por meio da implantação de um recurso <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> ou <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> em um <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">espaço de trabalho</link> do Fleet específico. O Fleet recupera o <literal>GitRepo/Bundle</literal> implantado e implanta seu conteúdo (os <literal>planos do SUC do K8s</literal>) no(s) cluster(s) desejado(s).
zh_cn: 通过向特定 Fleet <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">工作区</link>部署 <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> 或<link xl:href="https://fleet.rancher.io/bundle-add">捆绑包</link>资源将 <literal>K8s SUC 计划</literal>分发到各个群集。Fleet 会获取已部署的 <literal>GitRepo/捆绑包</literal>，并将其内容（<literal>K8s SUC 计划</literal>）部署到目标群集。

source: <literal>K8s SUC plans</literal> describe the following workflow:
es: Los <literal>planes de SUC de K8s</literal> describen el siguiente flujo de trabajo:
ja: <literal>K8s SUC Plan</literal>は、次のワークフローを記述します。
pt_br: Os <literal>planos do SUC do K8s</literal> descrevem o seguinte fluxo de trabalho:
zh_cn: <literal>K8s SUC 计划</literal>描述了以下工作流程：

source: Always <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link> the nodes before K8s upgrades.
es: Use siempre el comando <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link> en los nodos antes de las actualizaciones de K8s.
ja: 常に、K8sをアップグレードする前に、ノードを<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link>します。
pt_br: Sempre use o comando <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link> nos nós antes dos upgrades do K8s.
zh_cn: 执行 K8s 升级前，务必要<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">封锁</link>节点。

source: Always upgrade the <literal>control-plane</literal> nodes <emphasis role="strong">one</emphasis> node at a time and the <literal>worker</literal> nodes <emphasis role="strong">two</emphasis> nodes at a time.
es: Actualice siempre los nodos de <literal>control-plane</literal> (plano de control) de <emphasis role="strong">uno en uno</emphasis> y los nodos <literal>worker</literal> (trabajador) de <emphasis role="strong">dos en dos</emphasis>.
ja: 常に、一度に <emphasis role="strong">1</emphasis>ノードずつ<literal>コントロールプレーン</literal>ノードをアップグレードし、一度に <emphasis role="strong">2</emphasis>ノードずつ<literal>ワーカー</literal>ノードをアップグレードします。
pt_br: Sempre faça upgrade dos nós do <literal>plano de controle</literal> <emphasis role="strong">um</emphasis> de cada vez, e dos nós do <literal>worker</literal> <emphasis role="strong">dois</emphasis> nós de cada vez.
zh_cn: 始终一次升级<emphasis role="strong">一个</emphasis><literal>控制平面</literal>节点，一次升级<emphasis role="strong">两个</emphasis><literal>工作</literal>节点。

source: Once the <literal>K8s SUC plans</literal> are deployed, the workflow looks like this:
es: Una vez desplegados los <literal>planes de SUC de K8s</literal>, el flujo de trabajo es el siguiente:
ja: <literal>K8s SUC Plan</literal>がデプロイされたら、ワークフローは次のようになります。
pt_br: Depois que os <literal>planos do SUC do K8s</literal> forem implantados, o fluxo de trabalho terá esta aparência:
zh_cn: 部署 <literal>K8s SUC 计划</literal>后，工作流程如下：

source: SUC reconciles the deployed <literal>K8s SUC plans</literal> and creates a <literal>Kubernetes Job</literal> on <emphasis role="strong">each node</emphasis>.
es: SUC reconcilia los <literal>planes de SUC de K8s</literal> desplegados y crea un <literal>trabajo de Kubernetes</literal> en <emphasis role="strong">cada nodo</emphasis>.
ja: SUCは、デプロイ済みの<literal>K8s SUC Plan</literal>を照合し、 <literal>Kubernetes Job</literal>を<emphasis role="strong">各ノード</emphasis>に作成します。
pt_br: O SUC reconcilia os <literal>planos do SUC do K8s</literal> implantados e cria um <literal>Kubernetes Job</literal> em <emphasis role="strong">cada nó</emphasis>.
zh_cn: SUC 协调已部署的 <literal>K8s SUC 计划</literal>，并在<emphasis role="strong">每个节点</emphasis>上创建一个 <literal>Kubernetes 作业</literal>。

source: Depending on the Kubernetes distribution, the Job will create a Pod that runs either the rke2-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>) or the k3s-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>) container image.
es: Dependiendo de la distribución de Kubernetes, el trabajo creará un pod que ejecutará la imagen de contenedor rke2-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>) o k3s-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>).
ja: Kubernetesディストリビューションによって、Jobはrke2-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>)またはk3s-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>)のコンテナイメージを実行するPodを作成します。
pt_br: Dependendo da distribuição Kubernetes, o job cria um pod que executa a imagem de contêiner do rke2-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>) ou do k3s-upgrade (<xref linkend="management-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>).
zh_cn: 根据 Kubernetes 发行版的不同，该作业将创建一个运行 rke2-upgrade（<xref linkend="management-day2-fleet-k8s-upgrade-components-rke2-upgrade"/>）或 k3s-upgrade（<xref linkend="management-day2-fleet-k8s-upgrade-components-k3s-upgrade"/>）容器映像的 Pod。

source: The created Pod will go through the following workflow:
es: El pod creado seguirá el siguiente flujo de trabajo:
ja: 作成されたPodは次のワークフローを実行します。
pt_br: O pod criado vai percorrer o seguinte fluxo de trabalho:
zh_cn: 创建的 Pod 将执行以下工作流程：

source: Replace the existing <literal>rke2/k3s</literal> binary on the node with the one from the <literal>rke2-upgrade/k3s-upgrade</literal> image.
es: Sustituye el binario <literal>rke2/k3s</literal> existente en el nodo por el de la imagen <literal>rke2-upgrade/k3s-upgrade</literal>.
ja: ノード上の既存の<literal>rke2/k3s</literal>バイナリを<literal>rke2-upgrade/k3s-upgrade</literal>イメージのバイナリで置き換えます。
pt_br: Substitua o binário <literal>rke2/k3s</literal> existente no nó pelo da imagem <literal>rke2-upgrade/k3s-upgrade</literal>.
zh_cn: 用 <literal>rke2-upgrade/k3s-upgrade</literal> 映像中的二进制文件替换节点上现有的 <literal>rke2/k3s</literal> 二进制文件。

source: Kill the running <literal>rke2/k3s</literal> process.
es: Detiene el proceso <literal>rke2/k3s</literal> en ejecución.
ja: 実行中の<literal>rke2/k3s</literal>プロセスを強制終了します。
pt_br: Cancele o processo do <literal>rke2/k3s</literal> em execução.
zh_cn: 终止正在运行的 <literal>rke2/k3s</literal> 进程。

source: Killing the <literal>rke2/k3s</literal> process triggers a restart, launching a new process that runs the updated binary, resulting in an upgraded Kubernetes distribution version.
es: Al detener el proceso <literal>rke2/k3s</literal>, se activa un reinicio y se lanza un nuevo proceso que ejecuta el binario actualizado, lo que da como resultado una versión actualizada de la distribución de Kubernetes.
ja: <literal>rke2/k3s</literal>プロセスを強制終了すると、再起動がトリガされ、更新されたバイナリを実行する新しいプロセスが起動し、Kubernetesディストリビューションバージョンがアップグレードされます。
pt_br: O cancelamento do processo do <literal>rke2/k3s</literal> aciona a reinicialização, o que inicia um novo processo que executa o binário atualizado, resultando em uma versão atualizada da distribuição Kubernetes.
zh_cn: 终止 <literal>rke2/k3s</literal> 进程会触发重启，启动运行已更新二进制文件的新进程，从而实现 Kubernetes 发行版版本的升级。

source: fleet day2 management k8s upgrade
es: actualización de k8s de gestión de día2 con fleet
ja: fleet day2管理k8sアップグレード
pt_br: upgrade k8s gerenciamento dia2 fleet
zh_cn: Fleet Day2 管理 k8s 升级

source: <emphasis role="strong">Backup your Kubernetes distribution:</emphasis>
es: <emphasis role="strong">Haga una copia de seguridad de su distribución de Kubernetes:</emphasis>
ja: <emphasis role="strong">Kubernetesディストリビューションをバックアップします。</emphasis>
pt_br: <emphasis role="strong">Faça backup da distribuição Kubernetes:</emphasis>
zh_cn: <emphasis role="strong">备份您的 Kubernetes 发行版：</emphasis>

source: For <emphasis role="strong">RKE2 clusters</emphasis>, see the <link xl:href="https://docs.rke2.io/datastore/backup_restore">RKE2 Backup and Restore</link> documentation.
es: Para los <emphasis role="strong">clústeres RKE2</emphasis>, consulte <link xl:href="https://docs.rke2.io/datastore/backup_restore">RKE2 Backup and Restore</link> (Copia de seguridad y restauración de RKE2).
ja: <emphasis role="strong">RKE2クラスタ</emphasis>については、<link xl:href="https://docs.rke2.io/datastore/backup_restore">RKE2のバックアップと復元</link>に関するドキュメントを参照してください。
pt_br: Para <emphasis role="strong">clusters RKE2</emphasis>, consulte a documentação sobre <link xl:href="https://docs.rke2.io/datastore/backup_restore">backup e restauração do RKE2</link>.
zh_cn: 对于 <emphasis role="strong">RKE2 群集</emphasis>，请参见 <link xl:href="https://docs.rke2.io/datastore/backup_restore">RKE2 Backup and Restore</link> 文档。

source: For <emphasis role="strong">K3s clusters</emphasis>, see the <link xl:href="https://docs.k3s.io/datastore/backup-restore">K3s Backup and Restore</link> documentation.
es: Para los <emphasis role="strong">clústeres K3s</emphasis>, consulte <link xl:href="https://docs.k3s.io/datastore/backup-restore">K3s Backup and Restore</link> (Copia de seguridad y restauración de K3s).
ja: <emphasis role="strong">K3sクラスタ</emphasis>については、<link xl:href="https://docs.k3s.io/datastore/backup-restore">K3sのバックアップと復元</link>に関するドキュメントを参照してください。
pt_br: Para <emphasis role="strong">clusters K3s</emphasis>, consulte a documentação sobre <link xl:href="https://docs.k3s.io/datastore/backup-restore">backup e restauração do K3s</link>.
zh_cn: 对于 <emphasis role="strong">K3s 群集</emphasis>，请参见 <link xl:href="https://docs.k3s.io/datastore/backup-restore">K3s Backup and Restore</link> 文档。
