Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Isolate the cores 1-30 and 33-62. <literal>domain</literal> indicates these CPUs are part of isolation domain. <literal>nohz</literal> enables tickless operation on these isolated CPUs when they are idle, to reduce interruptions. <literal>managed_irq</literal> isolates pinned CPUs from being targeted by IRQs. This contemplates <literal>irqaffinity=0-7</literal>, which already directs mosts IRQs to the housekeeping cores.
es: Aísla los núcleos 1-30 y 33-62. <literal>domain</literal> indica que estas CPU forman parte del dominio de aislamiento. <literal>nohz</literal> habilita el funcionamiento sin marcas en estas CPU aisladas cuando están inactivas para reducir las interrupciones. <literal>managed_irq</literal> aísla las CPU fijadas para que no sean objeto de IRQ. Esto contempla <literal>irqaffinity=0-7</literal>, que ya dirige la mayoría de las IRQ a los núcleos de mantenimiento.
ja: コア1-30と3-62を分離します。<literal>domain</literal>は、これらのCPUが分離ドメインに属していることを示します。<literal>nohz</literal>は、これらの分離されたCPUがアイドル状態である場合にティックレス操作を有効にし、割り込みを減らします。<literal>managed_irq</literal>は、ピニングされたCPUがIRQの対象とならないように分離します。これは、ほとんどのIRQをハウスキーピングコアに指定する<literal>irqaffinity=0-7</literal>を考慮しています。
pt_br: Isolar os núcleos 1-30 e 33-62. <literal>domain</literal> indica que as CPUs fazem parte do domínio de isolamento. <literal>nohz</literal> permite a operação sem ticks nessas CPUs isoladas quando estão ociosas, para reduzir interrupções. <literal>managed_irq</literal> isola as CPUs fixadas para que não sejam destinos das IRQs. Isso contempla o <literal>irqaffinity=0-7</literal>, que já direciona a maiorias das IRQs para os núcleos de manutenção.
zh_cn: 隔离核心 1-30 和 33-62。<literal>domain</literal> 表示这些 CPU 属于隔离域。<literal>nohz</literal> 在这些隔离的 CPU 空闲时启用无节拍操作，以减少中断。<literal>managed_irq</literal> 使绑定的 CPU 免受 IRQ 干扰。这考虑了 <literal>irqaffinity=0-7</literal>，它已将大多数 IRQ 定向到系统管理核心。

source: This option allows the kernel to skew the timer interrupts across the isolated CPUs.
es: Esta opción permite al kernel distribuir las interrupciones del temporizador entre las CPU aisladas.
ja: このオプションを使用すると、カーネルは分離されたCPU全体でタイマー割り込みをずらすことができます。
pt_br: Essa opção permite que o kernel distribua as interrupções do temporizador entre as CPUs isoladas.
zh_cn: 此选项允许内核在隔离的 CPU 之间错开定时器中断。

source: When enabled, kernel’s periodic timer interrupt (the 'tick') will stop on any CPU core that is idle. This primary benefits the housekeeping CPUs (<literal>0,31,32,63</literal>). This conserves power and reduces unnecessary wake-ups on those general-purpose cores.
es: Si está habilitada, la interrupción periódica del temporizador del kernel (la "marca") se detendrá en cualquier núcleo de CPU que esté inactivo. Esto beneficia principalmente a las CPU de mantenimiento (<literal>0,31,32,63</literal>). De este modo se ahorra energía y se reducen los despertares innecesarios en esos núcleos de uso general.
ja: 有効にすると、カーネルの定期的なタイマー割り込み(「ティック」)は、アイドル状態のCPUコアで停止します。これにより、主にハウスキーピング用CPU (<literal>0、31、32、63</literal>)にメリットをもたらします。これにより、電力が節約され、汎用コアでの不要なウェイクアップが削減されます。
pt_br: Quando habilitada, a interrupção periódica do temporizador do kernel ("tick") vai parar em qualquer núcleo da CPU que esteja ocioso. Isso beneficia principalmente as CPUs de manutenção (<literal>0,31,32,63</literal>), além de economizar energia e reduzir ativações desnecessárias nos núcleos de uso geral.
zh_cn: 启用后，内核的周期性定时器中断（即“节拍”）将在任何空闲的 CPU 核心上停止。这主要有益于系统管理 CPU（<literal>0、31、32、63</literal>）。这可节省电力并减少这些通用核心上不必要的唤醒。

source: For the isolated cores, this stops the tick and it does so even when the CPU is running a single active task. It means it makes the CPU run in full tickless mode (or 'dyntick'). The kernel will only deliver timer interrupts when they are actually needed.
es: En el caso de los núcleos aislados, esto detiene la marca incluso si la CPU está ejecutando una sola tarea activa. Es decir, hace que la CPU funcione en modo totalmente sin marcas (o "dyntick"). El kernel solo proporcionará interrupciones del temporizador cuando sean realmente necesarias.
ja: 分離されたコアの場合、これによりティックが停止され、CPUが単一のアクティブなタスクを実行している場合でも停止されます。つまり、CPUは完全なティックレスモード(または「dyntick」)で動作します。カーネルは、実際に必要な場合にのみタイマー割り込みを発生させます。
pt_br: Para os núcleos isolados, esse processo interrompe o tick, mesmo quando a CPU está executando uma única tarefa ativa. Dessa forma, ele faz com que a CPU seja executada no modo sem ticks total (ou "dyntick"). O kernel apenas enviará interrupções do temporizador quando forem de fato necessárias.
zh_cn: 对于隔离的核心，这会停止节拍，即使 CPU 运行单个活动任务，也不例外。这意味着它使 CPU 以完全无节拍模式（或“动态节拍”）运行。内核仅在实际需要时才会传递定时器中断。

source: This option offloads the RCU callback processing from specified CPU cores.
es: Esta opción descarga el procesamiento de retrollamada de RCU de los núcleos de CPU especificados.
ja: このオプションは、指定のCPUコアからRCUコールバック処理をオフロードします。
pt_br: Essa opção descarrega o processamento de retorno de chamada RCU dos núcleos especificados da CPU.
zh_cn: 此选项会将 RCU 回调处理从指定的 CPU 核心卸载。

source: When this option is set, no-RCU-callback CPUs will regularly 'poll' to see if callback handling is required, rather than being explicitly woken up by other CPUs. This can reduce the interrupt overhead.
es: Cuando esta opción está definida, las CPU sin retrollamada de RCU realizarán sondeos periódicos para comprobar si es necesario gestionar las retrollamadas, en lugar de que se activen explícitamente por otras CPU. Esto puede reducir la sobrecarga de interrupciones.
ja: このオプションを設定すると、no-RCU-callback CPUは、他のCPUによって明示的にウェイクアップされるのではなく、コールバック処理が必要かどうかを確認するために定期的に「ポーリング」します。これにより、割り込みオーバーヘッドを削減できます。
pt_br: Quando essa opção é definida, as CPUs sem retorno de chamada RCU fazem uma sondagem regular para ver se o processamento de retornos de chamada é necessário, em vez de ser explicitamente ativadas por outras CPUs. Isso pode reduzir a sobrecarga das interrupções.
zh_cn: 如果设置此选项，无 RCU 回调的 CPU 将定期“轮询”以确定是否需要处理回调，而不是由其他 CPU 显式唤醒。这可以减少中断开销。

source: This option allows the kernel to run the interrupts to the housekeeping cores.
es: Esta opción permite al kernel ejecutar las interrupciones en los núcleos de mantenimiento.
ja: このオプションを使用すると、カーネルはハウスキーピング用コアに割り込みを実行できるようになります。
pt_br: Essa opção permite que o kernel execute as interrupções nos núcleos de manutenção.
zh_cn: 此选项允许内核在系统管理核心上运行中断。

source: This minimizes the latency of exiting the idle state, but at the cost of keeping the CPU running at full speed in the idle thread.
es: Esto minimiza la latencia al salir del estado inactivo, pero a costa de mantener la CPU funcionando a toda velocidad en el subproceso inactivo.
ja: これにより、アイドル状態から抜け出すまでのレイテンシが最小化されますが、その代償として、CPUがアイドルスレッドでフルスピードで稼働し続けることになります。
pt_br: Isso minimiza a latência de sair do estado ocioso, mas à custa de manter a CPU em execução na velocidade máxima no thread ocioso.
zh_cn: 最大限度减少因退出空闲状态造成的延迟，但代价是 CPU 在空闲线程中也要保持全速运行。

source: This option disables only the NMI watchdog. This can be omitted when <literal>nowatchdog</literal> is set.
es: Esta opción inhabilita únicamente el watchdog de NMI. Se puede omitir si se ha definido <literal>nowatchdog</literal>.
ja: このオプションはNMIウォッチドッグのみを無効にします。<literal>nowatchdog</literal>が設定されている場合は省略できます。
pt_br: Essa opção desabilita apenas o watchdog de NMI. Para omiti-la, defina <literal>nowatchdog</literal>.
zh_cn: 此选项仅禁用 NMI 看门狗。如果设置了 <literal>nowatchdog</literal>，则可以省略此选项。

source: This option disables the soft-lockup watchdog which is implemented as a timer running in the timer hard-interrupt context.
es: Esta opción inhabilita el watchdog de bloqueo suave, que se implementa como un temporizador que se ejecuta en el contexto de interrupción dura del temporizador.
ja: このオプションは、タイマーのハード割り込みコンテキストで実行されるタイマーとして実装されるソフトロックアップウォッチドッグを無効にします。
pt_br: Essa opção desabilita o watchdog de bloqueio flexível, que é implementado como um temporizador executado no contexto de interrupção fixa do temporizador.
zh_cn: 此选项会禁用软锁死看门狗，该看门狗通过运行在定时器硬中断上下文中的定时器实现。

source: The following commands modify the GRUB configuration and apply the changes mentioned above to be present on the next boot:
es: Los siguientes comandos modifican la configuración de GRUB y aplican los cambios mencionados anteriormente para que estén presentes en el próximo arranque:
ja: 次のコマンドでGRUB設定を変更し、上記の変更を次回ブート時に適用します。
pt_br: Os seguintes comandos modificam a configuração do GRUB e aplicam as alterações mencionadas acima para que estejam presentes na próxima inicialização:
zh_cn: 以下命令会修改 GRUB 配置并应用上述更改，以便下次引导时使用更改的配置：

source: Edit the <literal>/etc/default/grub</literal> file with above parameters and the file will look like this:
es: Edite el archivo <literal>/etc/default/grub</literal> con los parámetros anteriores. El archivo tendrá este aspecto:
ja: 上記パラメータを使用して<literal>/etc/default/grub</literal>ファイルを編集します。ファイルは次のようになります。
pt_br: Edite o arquivo <literal>/etc/default/grub</literal> com os parâmetros acima, e ele terá esta aparência:
zh_cn: 编辑 <literal>/etc/default/grub</literal> 文件，在其中添加上述参数，如下所示：

source: Update the GRUB configuration:
es: Actualice la configuración de GRUB:
ja: GRUB設定を更新します。
pt_br: Atualize a configuração do GRUB:
zh_cn: 更新 GRUB 配置：

source: To validate that the parameters are applied after the reboot, the following command can be used to check the kernel command line:
es: Para comprobar que los parámetros se han aplicado después del rearranque, puede utilizar el siguiente comando para comprobar la línea de comandos del kernel:
ja: 再起動後にパラメータが適用されていることを検証するには、次のコマンドを使用してカーネルコマンドラインを確認できます。
pt_br: Para validar a aplicação dos parâmetros após a reinicialização, é possível usar o seguinte comando para verificar a linha de comando do kernel:
zh_cn: 要验证重引导后是否应用了这些参数，可使用以下命令检查内核命令行：

source: There is another script that can be used to tune the CPU configuration, which basically is doing the following steps:
es: Puede usar otro guion para ajustar la configuración de la CPU, que básicamente realiza los siguientes pasos:
ja: CPU設定を調整するために使用可能な別のスクリプトがあります。これは基本的には次の手順を実行します。
pt_br: Existe outro script que pode ser usado para ajustar a configuração da CPU que, basicamente, executa as seguintes etapas:
zh_cn: 另外还有一个脚本可用于调整 CPU 配置，它主要执行以下步骤：

source: Set the CPU governor to <literal>performance</literal>.
es: Definir el regulador de la CPU como <literal>performance</literal>.
ja: CPUガバナーを<literal>パフォーマンス</literal>に設定します。
pt_br: Definir o controlador da CPU como <literal>performance</literal>.
zh_cn: 将 CPU 调节器设置为 <literal>performance</literal>。

source: Unset the timer migration to the isolated CPUs.
es: Desactivar la migración del temporizador a las CPU aisladas.
ja: 分離されたCPUへのタイマーのマイグレーションの設定を解除します。
pt_br: Cancelar a definição da migração do temporizador para as CPUs isoladas.
zh_cn: 取消将定时器迁移到隔离 CPU 的设置。

source: Migrate the kdaemon threads to the housekeeping CPUs.
es: Migrar los subprocesos kdaemon a las CPU de mantenimiento.
ja: kdaemonスレッドをハウスキーピング用CPUに移行します。
pt_br: Migrar os threads kdaemon para as CPUs de manutenção.
zh_cn: 将 kdaemon 线程迁移到管家 CPU。

source: Set the isolated CPUs latency to the lowest possible value.
es: Definir la latencia de las CPU aisladas en el valor más bajo posible.
ja: 分離したCPUレイテンシを可能な限り低い値に設定します。
pt_br: Definir a latência das CPUs isoladas como o valor mais baixo possível.
zh_cn: 将隔离的 CPU 延迟设置为尽可能低的值。

source: Delay the vmstat updates to 300 seconds.
es: Retrasar las actualizaciones de vmstat a 300 segundos.
ja: vmstatの更新を300秒に遅延させます。
pt_br: Atrasar as atualizações de vmstat para 300 segundos.
zh_cn: 将 vmstat 更新延迟到 300 秒。

source: The script is available at <link xl:href="https://raw.githubusercontent.com/suse-edge/atip/refs/heads/release-3.4/telco-examples/edge-clusters/dhcp-less/eib/custom/files/performance-settings.sh">SUSE Telco Cloud Examples repository</link>.
es: El guion está disponible en el <link xl:href="https://raw.githubusercontent.com/suse-edge/atip/refs/heads/release-3.4/telco-examples/edge-clusters/dhcp-less/eib/custom/files/performance-settings.sh">repositorio de ejemplos de SUSE Telco Cloud</link>.
ja: スクリプトは、<link xl:href="https://raw.githubusercontent.com/suse-edge/atip/refs/heads/release-3.4/telco-examples/edge-clusters/dhcp-less/eib/custom/files/performance-settings.sh">SUSE Telco Cloudサンプルリポジトリ</link>で入手できます。
zh_cn: 该脚本可在 <link xl:href="https://raw.githubusercontent.com/suse-edge/atip/refs/heads/release-3.4/telco-examples/edge-clusters/dhcp-less/eib/custom/files/performance-settings.sh">SUSE Telco Cloud 示例代码库</link>中获得。

source: CNI Configuration
es: Configuración de la CNI
ja: CNI設定
pt_br: Configuração da CNI
zh_cn: CNI 配置

source: <literal>Cilium</literal> is the default CNI plug-in for SUSE Telco Cloud. To enable Cilium on RKE2 cluster as the default plug-in, the following configuration is required in the <literal>/etc/rancher/rke2/config.yaml</literal> file:
es: <literal>Cilium</literal> es el complemento de CNI predeterminado para SUSE Telco Cloud. Para habilitar Cilium en el clúster RKE2 como complemento predeterminado hay que configurar lo siguiente en el archivo <literal>/etc/rancher/rke2/config.yaml</literal>:
ja: <literal>Cilium</literal>はSUSE Telco CloudのデフォルトのCNIプラグインです。RKE2クラスタでCiliumをデフォルトのプラグインとして有効にするには、<literal>/etc/rancher/rke2/config.yaml</literal>ファイルに次の設定が必要です。
zh_cn: <literal>Cilium</literal> 是 SUSE Telco Cloud 的默认 CNI 插件。要在 RKE2 群集上启用 Cilium 作为默认插件，需要在 <literal>/etc/rancher/rke2/config.yaml</literal> 文件中进行以下配置：

source: This can also be specified with command-line arguments, that is, <literal>--cni=cilium</literal> into the server line in <literal>/etc/systemd/system/rke2-server</literal> file.
es: Esto también se puede especificar con argumentos de línea de comandos, es decir, con <literal>--cni=cilium</literal> en la línea del servidor del archivo <literal>/etc/systemd/system/rke2-server</literal>.
ja: これはコマンドライン引数でも指定できます。具体的には、<literal>/etc/systemd/system/rke2-server</literal>ファイルのサーバの行に<literal>--cni=cilium</literal>を追加します。
pt_br: Também é possível especificar isso com argumentos de linha de comando, ou seja, <literal>--cni=cilium</literal> na linha do servidor no arquivo <literal>/etc/systemd/system/rke2-server</literal>.
zh_cn: 也可以使用命令行参数来指定此配置，即，将 <literal>--cni=cilium</literal> 添加到 <literal>/etc/systemd/system/rke2-server</literal> 文件的 server 行中。

source: To use the <literal>SR-IOV</literal> network operator described in the next section (<xref linkend="option2-sriov-helm"/>), use <literal>Multus</literal> with another CNI plug-in, like <literal>Cilium</literal> or <literal>Calico</literal>, as a secondary plug-in.
es: Para usar el operador de red <literal>SR-IOV</literal> descrito en la siguiente sección (<xref linkend="option2-sriov-helm"/>), use <literal>Multus</literal> con otro complemento de CNI, como <literal>Cilium</literal> o <literal>Calico</literal>, como complemento secundario.
ja: 次のセクション(<xref linkend="option2-sriov-helm"/>)で説明する<literal>SR-IOV</literal> Network Operatorを使用するには、<literal>Multus</literal>とともに、<literal>Cilium</literal>や<literal>Calico</literal>などの別のCNIプラグインをセカンダリプラグインとして使用します。
pt_br: Para usar o operador de rede <literal>SR-IOV</literal> descrito na próxima seção (<xref linkend="option2-sriov-helm"/>), use o <literal>Multus</literal> com outro plug-in de CNI, como <literal>Cilium</literal> ou <literal>Calico</literal>, como o plug-in secundário.
zh_cn: 要使用下一节（<xref linkend="option2-sriov-helm"/>）中所述的 <literal>SR-IOV</literal> 网络操作器，请将 <literal>Multus</literal> 与另一个 CNI 插件（例如 <literal>Cilium</literal> 或 <literal>Calico</literal>）一起用作辅助插件。

source: <literal>Calico</literal> is another CNI plug-in for SUSE Edge for Telco. To enable Calico on RKE2 cluster as the default plug-in, the following configuration is required in the <literal>/etc/rancher/rke2/config.yaml</literal> file:
es: <literal>Calico</literal> es otro complemento de CNI para SUSE Telco Cloud. Para habilitar Calico en el clúster de RKE2 como complemento por defecto, se requiere la siguiente configuración en el archivo <literal>/etc/rancher/rke2/config.yaml</literal>:
ja: <literal>Calico</literal>は、SUSE Edge for Telco用の別のCNIプラグインです。RKE2クラスタ上でデフォルトプラグインとしてCalicoを有効にするには、<literal>/etc/rancher/rke2/config.yaml</literal>ファイルに次の設定が必要です。
zh_cn: <literal>Calico</literal> 是 SUSE Edge for Telco 的另一款 CNI 插件。要在 RKE2 群集上启用 Calico 作为默认插件，需要在 <literal>/etc/rancher/rke2/config.yaml</literal> 文件中进行以下配置：

source: This can also be specified with command-line arguments, that is, <literal>--cni=calico</literal> into the server line in <literal>/etc/systemd/system/rke2-server</literal> file.
es: Esto también se puede especificar con argumentos de línea de comandos, es decir, con <literal>--cni=calico</literal> en la línea del servidor del archivo <literal>/etc/systemd/system/rke2-server</literal>.
ja: これは、コマンドライン引数で指定することもできます。つまり、<literal>--cni=calico</literal>を<literal>/etc/systemd/system/rke2-server</literal>ファイルのサーバ行に追加します。
zh_cn: 也可通过命令行参数指定此配置，即在 <literal>/etc/systemd/system/rke2-server</literal> 文件的 server 行中添加 <literal>--cni=calico</literal>。

source: For more information about CNI plug-ins, see <link xl:href="https://docs.rke2.io/install/network_options">Network Options</link>.
es: Para obtener más información sobre los complementos de CNI, consulte <link xl:href="https://docs.rke2.io/install/network_options">Network Options</link> (Opciones de red).
ja: CNIプラグインの詳細については、「<link xl:href="https://docs.rke2.io/install/network_options">Network Options (ネットワークオプション)</link>」を参照してください。
zh_cn: 有关 CNI 插件的详细信息，请参见 <link xl:href="https://docs.rke2.io/install/network_options">Network Options</link>。

source: In general terms, bonding provides a method for aggregating multiple network interfaces into a single logical "bonded" interface. This is typically used to increase service availability by introducing redundant networking paths, but can also be used to increase bandwidth with certain bond modes. The following CNI plug-ins are supported for the Bond CNI plugin in combination with multus:
es: En términos generales, la vinculación proporciona un método para agregar múltiples interfaces de red en una única interfaz lógica "vinculada". Normalmente, se utiliza para aumentar la disponibilidad del servicio mediante la introducción de rutas de red redundantes, pero también se puede usar para aumentar el ancho de banda con determinados modos de vinculación. Los siguientes complementos de CNI son compatibles con el complemento de CNI de vinculación en combinación con multus:
ja: 一般的に、ボンディングは複数のネットワークインタフェースを単一の論理的な「ボンディング」インタフェースに集約する方法を提供します。これは通常、冗長なネットワーキングパスを導入することでサービスの可用性を向上させるために使用されますが、特定のボンディングモードで帯域幅を増やすためにも使用できます。multusと組み合わせてBond CNIプラグインでは、以下のCNIプラグインがサポートされています。
zh_cn: 通常而言，绑定是一种将多个网络接口聚合为单个逻辑“绑定”接口的方法。这通常用于通过引入冗余网络路径提高服务可用性，也可在特定绑定模式下用于提高带宽。以下 CNI 插件支持与 multus 结合使用的 Bond CNI 插件：

source: Bond CNI with MACVLAN
es: CNI de vinculación con MACVLAN
ja: Bond CNIとMACVLAN
zh_cn: Bond CNI 与 MACVLAN 结合使用

source: To use the Bond CNI plugin with MACVLAN two free interfaces are needed in the container. The following example uses 'enp8s0' and 'enp9s0'. Start by creating network attachment definitions for them:
es: Para usar el complemento de CNI de vinculación con MACVLAN se necesitan dos interfaces libres en el contenedor. En el ejemplo siguiente se usan "enp8s0" y "enp9s0". Para empezar, cree sus definiciones de conexión de red:
ja: Bond CNIプラグインとMACVLANを組み合わせて使用するには、コンテナ内に2つの空きインタフェースが必要です。以下の例では、「enp8s0」と「enp9s0」を使用しています。まず、これらのインタフェースに対するネットワークアタッチメント定義を作成します。
zh_cn: 要将 Bond CNI 插件与 MACVLAN 结合使用，容器中需要有两个空闲接口。本示例使用“enp8s0”和“enp9s0”。首先为它们创建网络附加定义：

source: After this, add a network attachment definition for the bond itself.
es: Después, añada una definición de conexión de red a la propia vinculación.
ja: この後で、ボンド自体のネットワークアタッチメント定義を追加します。
zh_cn: 之后，为绑定本身添加网络附加定义。

source: The IP address assignment here is static and defines the address of the bond as '192.168.200.100' on a /24 network, with a gateway residing on the network’s first available address. In the bond’s network attachment we also define the type of bond we want. In this case it is active-backup.
es: La asignación de direcciones IP aquí es estática y define la dirección de la vinculación como "192.168.200.100" en una red /24, con un gateway que reside en la primera dirección disponible de la red. En la conexión de red de la vinculación también se define el tipo de vinculación que queremos. En este caso es "active-backup" (copia de seguridad activa).
ja: ここでのIPアドレス割り当ては静的であり、ボンドのアドレスを/24ネットワーク上の「192.168.200.100」と定義し、ゲートウェイはネットワークで最初に利用可能なアドレス上に配置されます。ボンドのネットワークアタッチメントでは、必要なボンドのタイプも定義します。この場合はactive-backupです。
zh_cn: 此处采用的是静态 IP 地址分配方式，将绑定的地址定义为 /24 网络上的“192.168.200.100”，网关位于该网络的第一个可用地址。在绑定的网络附加定义中，我们还定义了所需的绑定类型，本示例中为 active-backup。

source: To use this bond, the pod needs to know about all interfaces. An example pod definition might look like this:
es: Para usar esta vinculación, el pod debe conocer todas las interfaces. Una definición de pod de ejemplo tendría este aspecto:
ja: このボンドを使用するには、ポッドがすべてのインタフェースについて認識している必要があります。ポッド定義例は次のようになります。
zh_cn: 要使用此绑定，Pod 需要了解所有接口。以下是 Pod 定义示例：

source: Note how the annotation refers to all networks and how it defines the mapping between the interfaces 'enp8s0 → net1', and 'enp9s0→net2'.
es: Observe cómo la anotación hace referencia a todas las redes y cómo define la asignación entre las interfaces "enp8s0 → net1" y "enp9s0→net2".
ja: アノテーションがすべてのネットワークをどのように参照しているか、およびインタフェース「enp8s0 → net1」と「enp9s0→net2」間のマッピングをどのように定義しているかに注意してください。
zh_cn: 请注意注解如何引用所有网络，以及如何定义接口“enp8s0 → net1”和“enp9s0 → net2”之间的映射关系。

source: Bond CNI with Host Device
es: CNI de vinculación con dispositivo host
ja: Bond CNIとホストデバイス
zh_cn: Bond CNI 与 Host Device 结合使用

source: To use the Bond CNI plugin with host device, two free interfaces are needed on the host. These interfaces are then mapped through to the container. The following example uses 'enp8s0' and 'enp9s0'. Start by creating network attachment definitions for them:
es: Para usar el complemento de CNI de vinculación con el dispositivo host se necesitan dos interfaces libres en el host. Luego, esas interfaces se asignan al contenedor. En el ejemplo siguiente se usan "enp8s0" y "enp9s0". Para empezar, cree sus definiciones de conexión de red:
ja: Bond CNIプラグインとホストデバイスを組み合わせて使用するには、ホスト上に2つの空きインタフェースが必要です。これらのインタフェースはコンテナにマッピングされます。以下の例では、「enp8s0」と「enp9s0」を使用しています。まず、これらのインタフェースに対するネットワークアタッチメント定義を作成します。
zh_cn: 要将 Bond CNI 插件与 Host Device 结合使用，主机上需要有两个空闲接口。这些接口随后会映射到容器中。本示例使用“enp8s0”和“enp9s0”。首先为它们创建网络附加定义：

source: After this, add network attachment definition for the bond itself. This is similar to the MACVLAN use case.
es: Después, añada la definición de conexión de red a la propia vinculación. Es similar al uso con MACVLAN.
ja: この後で、ボンド自体のネットワークアタッチメント定義を追加します。これはMACVLANの使用例と同様です。
zh_cn: 之后，为绑定本身添加网络附加定义，此过程与 MACVLAN 场景类似。

source: The IP address assignment here is static and defines the address of the bond as '192.168.200.100' on a /24 network, with a gateway residing on the network’s first available address. In the bond’s network attachment, define the type of bond. In this case it is active-backup.
es: La asignación de direcciones IP aquí es estática y define la dirección de la vinculación como "192.168.200.100" en una red /24, con un gateway que reside en la primera dirección disponible de la red. En la conexión de red de la vinculación también se define el tipo de vinculación. En este caso es "active-backup" (copia de seguridad activa).
ja: ここでのIPアドレス割り当ては静的であり、ボンドのアドレスを/24ネットワーク上の「192.168.200.100」と定義し、ゲートウェイはネットワークで最初に利用可能なアドレス上に配置されます。ボンドのネットワークアタッチメントでは、ボンドのタイプを定義します。この場合はactive-backupです。
zh_cn: 此处采用的是静态 IP 地址分配方式，将绑定的地址定义为 /24 网络上的“192.168.200.100”，网关位于该网络的第一个可用地址。在绑定的网络附加定义中，定义绑定类型，本示例中为 active-backup。
