Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: To use this bond, the pod needs to know about all interfaces. An example pod definition for bond with host devices might look like this:
es: Para usar esta vinculación, el pod debe conocer todas las interfaces. Una definición de pod de ejemplo para la vinculación para los dispositivos host tendría este aspecto:
ja: このボンドを使用するには、ポッドがすべてのインタフェースについて認識している必要があります。ホストデバイスとのボンドのポッド定義例は次のようになります。
zh_cn: 要使用此绑定，Pod 需要了解所有接口。以下是结合 Host Device 使用绑定的 Pod 定义示例：

source: Bond CNI with SR-IOV
es: CNI de vinculación con SR-IOV
ja: Bond CNIとSR-IOV
zh_cn: Bond CNI 与 SR-IOV 结合使用

source: Using the Bond CNI with SR-IOV is fairly straight forward. For more details on how to set up SR-IOV, see <xref linkend="sriov"/>. As described there, you have to create <literal>SriovNetworkNodePolicies</literal> that defines <literal>resourceNames</literal>, as well as number of virtual functions and such. The <literal>resourceNames</literal> are being used by the <literal>SriovNetwork</literal> which is used as interfaces in the pod definition. The bond definition is exactly the same as for the MACVLAN and host device cases.
es: El uso de CNI de vinculación con SR-IOV es bastante sencillo. Para obtener más detalles sobre cómo configurar SR-IOV, consulte la <xref linkend="sriov"/>. Tal y como se describe allí, debe crear directivas <literal>SriovNetworkNodePolicies</literal> que definen <literal>resourceNames</literal>, así como el número de funciones virtuales. Los <literal>resourceNames</literal> se usan en <literal>SriovNetwork</literal>, que se utiliza como interfaz en la definición del pod. La definición de la vinculación es exactamente la misma que en los casos de MACVLAN y el dispositivo host.
ja: Bond CNIをSR-IOVと組み合わせて使用するのは非常に簡単です。SR-IOVの設定方法の詳細については、<xref linkend="sriov"/>を参照してください。そこに記載されているとおりに、<literal>SriovNetworkNodePolicies</literal>を作成し、<literal>resourceNames</literal>や仮想機能の数などを定義する必要があります。<literal>resourceNames</literal>は、ポッド定義でインタフェースとして使用される<literal>SriovNetwork</literal>によって使用されます。ボンドの定義は、MACVLANとホストデバイスの場合とまったく同じです。
zh_cn: 将 Bond CNI 与 SR-IOV 结合使用的操作相当简单。有关如何设置 SR-IOV 的详细信息，请参见<xref linkend="sriov"/>。如前文所述，您需要创建 <literal>SriovNetworkNodePolicies</literal>，在其中定义 <literal>resourceNames</literal> 以及虚拟功能的数量等。<literal>resourceNames</literal> 供 <literal>SriovNetwork</literal> 使用，SriovNetwork 在 Pod 定义中用作接口。绑定定义与 MACVLAN 和 Host Device 场景完全相同。

source: Bond CNI with SR-IOV is only applicable to SRIOV Virtual Functions (VF) using the kernel driver. Userspace driver VFs - such as those used in DPDK workloads - can not be bonded with the Bond CNI.
es: El CNI de vinculación con SR-IOV solo se aplica a funciones virtuales de SRIOV que usan el controlador del kernel. Las funciones virtuales del controlador de espacio de usuario, como las que se usan en las cargas de trabajo del DPDK, no se pueden vincular con el CNI de vinculación.
ja: Bond CNIとSR-IOVの組み合わせは、カーネルドライバを使用するSRIOV仮想機能(VF)にのみ適用されます。DPDKワークロードで使用されるようなユーザスペースドライバのVFは、Bond CNIでボンディングできません。
zh_cn: Bond CNI 与 SR-IOV 结合使用这种方式仅适用于使用内核驱动程序的 SRIOV 虚拟功能。用户空间驱动程序 VF（如 DPDK 工作负载中使用的 VF）无法通过 Bond CNI 进行绑定。

source: SR-IOV allows a device, such as a network adapter, to separate access to its resources among various <literal>PCIe</literal> hardware functions. There are different ways to deploy <literal>SR-IOV</literal>, and here, we show two different options:
es: SR-IOV permite que un dispositivo, como un adaptador de red, divida el acceso a sus recursos entre varias funciones de hardware <literal>PCIe</literal>. Hay diferentes formas de desplegar <literal>SR-IOV</literal>, y aquí mostramos dos:
ja: SR-IOVを使用すると、ネットワークアダプタなどのデバイスで、そのリソースへのアクセスをさまざまな<literal>PCIe</literal>ハードウェア機能の間で分離することができます。<literal>SR-IOV</literal>をデプロイするにはさまざまな方法がありますが、ここでは2つの方法を示します。
pt_br: O SR-IOV permite que um dispositivo, por exemplo, adaptador de rede, separe o acesso a seus recursos entre várias funções de hardware <literal>PCIe</literal>. Há diversas maneiras de implantar o <literal>SR-IOV</literal> e, neste documento, mostramos duas opções diferentes:
zh_cn: SR-IOV 允许网络适配器等设备在各种 <literal>PCIe</literal> 硬件功能之间分隔对其资源的访问。可以通过多种方式部署 <literal>SR-IOV</literal>，本节将介绍两种不同的方式：

source: Option 1: using the <literal>SR-IOV</literal> CNI device plug-ins and a config map to configure it properly.
es: Opción 1: usar los complementos de dispositivo de CNI <literal>SR-IOV</literal> y un mapa de configuración para configurarlo correctamente.
ja: オプション1: <literal>SR-IOV</literal> CNIデバイスプラグインと設定マップを使用して適切に設定する。
pt_br: Opção 1: usar os plug-ins de dispositivo CNI <literal>SR-IOV</literal> e um mapa de configuração para configurá-lo de maneira apropriada.
zh_cn: 方式 1：使用 <literal>SR-IOV</literal> CNI 设备插件和配置映射来正确配置 SR-IOV。

source: Option 2 (recommended): using the <literal>SR-IOV</literal> Helm chart from Rancher Prime to make this deployment easy.
es: Opción 2 (recomendada): usar el chart de Helm de <literal>SR-IOV</literal> en Rancher Prime para facilitar este despliegue.
ja: オプション2 (推奨): Rancher Primeから<literal>SR-IOV</literal> Helmチャートを使用してこのデプロイメントを簡単に行えるようにする。
pt_br: Opção 2 (recomendada): usar o gráfico Helm do <literal>SR-IOV</literal> do Rancher Prime para facilitar a implantação.
zh_cn: 方式 2（建议）：使用 Rancher Prime 中的 <literal>SR-IOV</literal> Helm chart 来轻松完成此部署。

source: <emphasis role="strong">Option 1 - Installation of SR-IOV CNI device plug-ins and a config map to configure it properly</emphasis>
es: <emphasis role="strong">Opción 1: Instalación de complementos de dispositivo de CNI SR-IOV y un mapa de configuración para configurarlo correctamente</emphasis>
ja: <emphasis role="strong">オプション1 - SR-IOV CNIデバイスプラグインと設定マップをインストールして適切に設定する</emphasis>
pt_br: <emphasis role="strong">Opção 1 – Instalação dos plug-ins de dispositivo CNI SR-IOV e um mapa de configuração para configurá-lo de maneira apropriada</emphasis>
zh_cn: <emphasis role="strong">方式 1 - 安装 SR-IOV CNI 设备插件并准备配置映射来正确配置 SR-IOV</emphasis>

source: Prepare the config map for the device plug-in
es: Prepare el mapa de configuración para el complemento de dispositivo
ja: デバイスプラグインの設定マップを準備する
pt_br: Preparar o mapa de configuração para o plug-in de dispositivo
zh_cn: 为设备插件准备配置映射

source: Get the information to fill the config map from the <literal>lspci</literal> command:
es: Obtenga la información para rellenar el mapa de configuración desde el comando <literal>lspci</literal>:
ja: 設定マップに入力する情報を<literal>lspci</literal>コマンドから取得します。
pt_br: Obtenha as informações para preencher o mapa de configuração executando o comando <literal>lspci</literal>:
zh_cn: 使用 <literal>lspci</literal> 命令获取用于填充配置映射的信息：

source: The config map consists of a <literal>JSON</literal> file that describes devices using filters to discover, and creates groups for the interfaces. The key is understanding filters and groups. The filters are used to discover the devices and the groups are used to create the interfaces.
es: El mapa de configuración es un archivo <literal>JSON</literal> que describe los dispositivos utilizando filtros para detectarlos, y crea grupos para las interfaces. Lo importante es comprender qué son los filtros y los grupos. Los filtros se usan para detectar los dispositivos y los grupos, para crear las interfaces.
ja: 設定マップは<literal>JSON</literal>ファイルで構成され、このファイルで、フィルタを使用して検出を行うデバイスを記述し、インタフェースのグループを作成します。フィルタとグループを理解することが重要です。フィルタはデバイスを検出するために使用され、グループはインタフェースを作成するために使用されます。
pt_br: O mapa de configuração consiste em um arquivo <literal>JSON</literal> que descreve os dispositivos usando filtros para descobri-los e cria grupos para as interfaces. O principal é entender os filtros e os grupos. Os filtros são usados para descobrir os dispositivos, e os grupos para criar as interfaces.
zh_cn: 配置映射由一个 <literal>JSON</literal> 文件组成，该文件描述通过过滤器发现的设备，以及创建接口组所需的信息。此处的关键在于理解过滤器和组。过滤器用于发现设备，组用于创建接口。

source: It could be possible to set filters:
es: Es posible establecer filtros como:
ja: フィルタを設定することもできます。
pt_br: É possível definir os filtros desta maneira:
zh_cn: 可以设置过滤器：

source: deviceID: <literal>0d5c</literal> (Accelerator card)
es: deviceID: <literal>0d5c</literal> (tarjeta Accelerator)
ja: deviceID: <literal>0d5c</literal> (アクセラレータカード)
pt_br: deviceID: <literal>0d5c</literal> (placa aceleradora)
zh_cn: deviceID：<literal>0d5c</literal>（加速卡）

source: driver: <literal>vfio-pci</literal> (driver)
es: driver: <literal>vfio-pci</literal> (controlador)
ja: driver: <literal>vfio-pci</literal> (ドライバ)
zh_cn: driver：<literal>vfio-pci</literal>（驱动程序）

source: pfNames: <literal>p2p1</literal> (physical interface name)
es: pfNames: <literal>p2p1</literal> (nombre de interfaz física)
ja: pfNames: <literal>p2p1</literal> (物理インタフェース名)
pt_br: pfNames: <literal>p2p1</literal> (nome da interface física)
zh_cn: pfNames：<literal>p2p1</literal>（物理接口名称）

source: It could be possible to also set filters to match more complex interface syntax, for example:
es: También es posible definir filtros con una sintaxis de interfaz más compleja, por ejemplo:
ja: フィルタを設定して、より複雑なインタフェース構文に一致させることもできます。次に例を示します。
pt_br: É possível também definir os filtros para corresponder à uma sintaxe de interface mais complexa, por exemplo:
zh_cn: 还可以设置过滤器来匹配更复杂的接口语法，例如：

source: pfNames: <literal>["eth1#1,2,3,4,5,6"]</literal> or <literal>[eth1#1-6]</literal> (physical interface name)
es: pfNames: <literal>["eth1#1,2,3,4,5,6"]</literal> o <literal>[eth1#1-6]</literal> (nombre de interfaz física)
ja: pfNames: <literal>["eth1#1,2,3,4,5,6"]</literal>または<literal>[eth1#1-6]</literal> (物理インタフェース名)
pt_br: pfNames: <literal>["eth1#1,2,3,4,5,6"]</literal> ou <literal>[eth1#1-6]</literal> (nome da interface física)
zh_cn: pfNames：<literal>["eth1#1,2,3,4,5,6"]</literal> 或 <literal>[eth1#1-6]</literal>（物理接口名称）

source: Related to the groups, we could create a group for the <literal>FEC</literal> card and another group for the <literal>Intel</literal> card, even creating a prefix depending on our use case:
es: Para los grupos, es posible crear un grupo para la tarjeta <literal>FEC</literal> y otro para la tarjeta <literal>Intel</literal>, o incluso crear un prefijo en función de nuestro caso de uso:
ja: グループに関連して、<literal>FEC</literal>カード用のグループを1つと、<literal>Intel</literal>カード用のグループを1つ作成し、さらに、ユースケースに応じてプレフィックスを作成することもできます。
pt_br: Em relação aos grupos, podemos criar um para a placa <literal>FEC</literal> e outro para a placa <literal>Intel</literal>, e até criar um prefixo dependendo do nosso caso de uso:
zh_cn: 至于组，我们可为 <literal>FEC</literal> 卡创建一个组，为 <literal>Intel</literal> 卡创建另一个组，甚至可以根据具体使用场景创建一个前缀：

source: There are a lot of combinations to discover and create the resource group to allocate some <literal>VFs</literal> to the pods.
es: Hay muchas combinaciones posibles para descubrir y crear el grupo de recursos necesario para asignar <literal>funciones virtuales</literal> a los pods.
ja: リソースグループを検出して作成し、一部の<literal>VF</literal>をPodに割り当てる組み合わせは多数あります。
pt_br: Há inúmeras combinações para descobrir e criar o grupo de recursos para alocar algumas <literal>VFs</literal> aos pods.
zh_cn: 可以发现许多组合，并创建资源组来为 Pod 分配一些 <literal>VF</literal>。

source: For more information about the filters and groups, visit <link xl:href="https://github.com/k8snetworkplumbingwg/sriov-network-device-plugin">sr-iov network device plug-in</link>.
es: Para obtener más información sobre los filtros y los grupos, consulte <link xl:href="https://github.com/k8snetworkplumbingwg/sriov-network-device-plugin">sr-iov network device plug-in</link> (Complemento de dispositivo de red sr-iov).
ja: フィルタとグループの詳細については、「<link xl:href="https://github.com/k8snetworkplumbingwg/sriov-network-device-plugin">sriov-network-device-plugin (sr-iovネットワークデバイスプラグイン)</link>」を参照してください。
pt_br: Para obter mais informações sobre filtros e grupos, visite <link xl:href="https://github.com/k8snetworkplumbingwg/sriov-network-device-plugin">sr-iov network device plug-in</link> (Plug-in de dispositivo de rede sr-iov).
zh_cn: 有关过滤器和组的详细信息，请访问 <link xl:href="https://github.com/k8snetworkplumbingwg/sriov-network-device-plugin">sr-iov 网络设备插件</link>。

source: After setting the filters and groups to match the interfaces depending on the hardware and the use case, the following config map shows an example to be used:
es: Después de configurar los filtros y los grupos que coincidan con las interfaces del hardware y el caso de uso, el mapa de configuración siguiente muestra un ejemplo útil:
ja: フィルタとグループを設定して、ハードウェアとユースケースに応じたインタフェースに一致させると、使用する例が次の設定マップに表示されます。
pt_br: Depois de definir os filtros e os grupos para corresponder as interfaces, dependendo do hardware e do caso de uso, o seguinte mapa de configuração mostrará um exemplo para ser usado:
zh_cn: 根据硬件和使用场景设置用于匹配接口的过滤器和组后，下面的配置映射展示了一个可使用的示例：

source: Prepare the <literal>daemonset</literal> file to deploy the device plug-in.
es: Prepare el archivo <literal>daemonset</literal> para desplegar el complemento de dispositivo.
ja: <literal>daemonset</literal>ファイルを準備して、デバイスプラグインをデプロイします。
pt_br: Preparar o arquivo <literal>daemonset</literal> para implantar o plug-in de dispositivo
zh_cn: 准备 <literal>daemonset</literal> 文件以部署设备插件。

source: The device plug-in supports several architectures (<literal>arm</literal>, <literal>amd</literal>, <literal>ppc64le</literal>), so the same file can be used for different architectures deploying several <literal>daemonset</literal> for each architecture.
es: El complemento de dispositivo admite varias arquitecturas (<literal>arm</literal>, <literal>amd</literal> o <literal>ppc64le</literal>), por lo que se puede usar el mismo archivo para diferentes arquitecturas, desplegando un <literal>daemonset</literal> para cada arquitectura.
ja: このデバイスプラグインは、複数のアーキテクチャ(<literal>arm</literal>、<literal>amd</literal>、<literal>ppc64le</literal>)をサポートしています。したがって、同じファイルを異なるアーキテクチャに使用して、各アーキテクチャに複数の<literal>daemonset</literal>をデプロイできます。
pt_br: O plug-in de dispositivo oferece suporte a várias arquiteturas (<literal>arm</literal>, <literal>amd</literal>, <literal>ppc64le</literal>), portanto, é possível usar o mesmo arquivo para arquiteturas diferentes ao implantar vários <literal>daemonset</literal> para cada arquitetura.
zh_cn: 设备插件支持多种体系结构（<literal>arm</literal>、<literal>amd</literal>、<literal>ppc64le</literal>），因此同一文件可用于不同的体系结构，以便为每个体系结构部署多个 <literal>daemonset</literal>。

source: After applying the config map and the <literal>daemonset</literal>, the device plug-in will be deployed and the interfaces will be discovered and available for the pods.
es: Después de aplicar el mapa de configuración y el <literal>daemonset</literal>, se desplegará el complemento de dispositivo y se detectarán las interfaces, que estarán disponibles para los pods.
ja: 設定マップと<literal>daemonset</literal>を適用すると、デバイスプラグインがデプロイされ、インタフェースが検出されてPodで使用できるようになります。
pt_br: Depois de aplicar o mapa de configuração e o <literal>daemonset</literal>, o plug-in de dispositivo será implantado, e as interfaces serão descobertas e estarão disponíveis para os pods.
zh_cn: 应用配置映射和 <literal>daemonset</literal> 后，将部署设备插件，发现接口并将其提供给 Pod 使用。

source: Check the interfaces discovered and available in the nodes to be used by the pods:
es: Compruebe qué interfaces se han detectado y están disponibles en los nodos para los pods:
ja: Podで使用するノードでインタフェースが検出されて利用可能であることを確認します。
pt_br: Verifique as interfaces descobertas e disponíveis nos nós usados pelos pods:
zh_cn: 检查节点中发现的且可供 Pod 使用的接口：

source: The <literal>FEC</literal> is <literal>intel.com/intel_fec_5g</literal> and the value is 1.
es: La tarjeta <literal>FEC</literal> es <literal>intel.com/intel_fec_5g</literal> y su valor es 1.
ja: <literal>FEC</literal>は<literal>intel.com/intel_fec_5g</literal>で、値は1です。
pt_br: O <literal>FEC</literal> é <literal>intel.com/intel_fec_5g</literal> e o valor é 1.
zh_cn: <literal>FEC</literal> 为 <literal>intel.com/intel_fec_5g</literal>，值为 1。

source: The <literal>VF</literal> is <literal>intel.com/intel_sriov_odu</literal> or <literal>intel.com/intel_sriov_oru</literal> if you deploy it with a device plug-in and the config map without Helm charts.
es: La función virtual <literal>VF</literal> es <literal>intel.com/intel_sriov_odu</literal> o <literal>intel.com/intel_sriov_oru</literal> si la despliega con un complemento de dispositivo y el mapa de configuración sin charts de Helm.
ja: Helmチャートを使用せずに、デバイスプラグインと設定マップを使用してデプロイした場合、<literal>VF</literal>は、<literal>intel.com/intel_sriov_odu</literal>または<literal>intel.com/intel_sriov_oru</literal>です。
pt_br: A <literal>VF</literal> é <literal>intel.com/intel_sriov_odu</literal> ou <literal>intel.com/intel_sriov_oru</literal>, se você a implantar com um plug-in de dispositivo e um mapa de configuração sem gráficos Helm.
zh_cn: 如果您部署 SR-IOV 时使用了设备插件和配置映射，但未使用 Helm chart，则 <literal>VF</literal> 为 <literal>intel.com/intel_sriov_odu</literal> 或 <literal>intel.com/intel_sriov_oru</literal>。

source: If there are no interfaces here, it makes little sense to continue because the interface will not be available for pods. Review the config map and filters to solve the issue first.
es: Si no hay interfaces, no tiene mucho sentido continuar, ya que la interfaz no estará disponible para los pods. Revise primero el mapa de configuración y los filtros para resolver el problema.
ja: ここにインタフェースがない場合、そのインタフェースをPodで使用することはできないため、続行しても意味がありません。まず、設定マップとフィルタを確認して問題を解決してください。
pt_br: Se não há interfaces neste ponto, não faz muito sentido continuar porque a interface não estará disponível para os pods. Revise o mapa de configuração e os filtros para resolver o problema primeiro.
zh_cn: 如果此处没有接口，则继续操作就意义不大，因为 Pod 没有可用的接口。请先检查配置映射和过滤器来解决问题。

source: <emphasis role="strong">Option 2 (recommended) - Installation using Rancher using Helm chart for SR-IOV CNI and device plug-ins</emphasis>
es: <emphasis role="strong">Opción 2 (recomendada): instalación con Rancher mediante el chart de Helm para la CNI SR-IOV y los complementos de dispositivo</emphasis>
ja: <emphasis role="strong">オプション2 (推奨) - Rancherを使用し、SR-IOV CNIおよびデバイスプラグイン用のHelmチャートを使用したインストール</emphasis>
pt_br: <emphasis role="strong">Opção 2 (recomendada) – Instalação usando o Rancher com gráficos Helm para plug-ins de dispositivo CNI SR-IOV</emphasis>
zh_cn: <emphasis role="strong">方式 2（建议）- 使用 Rancher 和 Helm chart 安装 SR-IOV CNI 和设备插件</emphasis>

source: Get Helm if not present:
es: Consiga Helm si no está presente:
ja: Helmがない場合は入手します。
pt_br: Obtenha o Helm se não estiver presente:
zh_cn: 获取 Helm（如果没有）：

source: Install SR-IOV.
es: Instale SR-IOV.
ja: SR-IOVをインストールします。
pt_br: Instale o SR-IOV.
zh_cn: 安装 SR-IOV。

source: Check the deployed resources crd and pods:
es: Compruebe los crd y los pods de los recursos desplegados:
ja: デプロイしたリソースのcrdとPodを確認します。
pt_br: Verifique os recursos crd e os pods implantados:
zh_cn: 检查已部署的资源 CRD 和 Pod：

source: Check the label in the nodes.
es: Compruebe la etiqueta de los nodos.
ja: ノードのラベルを確認します。
pt_br: Verifique o rótulo nos nós.
zh_cn: 检查节点中的标签。

source: With all resources running, the label appears automatically in your node:
es: Con todos los recursos en ejecución, la etiqueta aparece automáticamente en su nodo:
ja: すべてのリソースが実行されていると、ラベルがノードに自動的に表示されます。
pt_br: Com todos os recursos em execução, o rótulo aparecerá automaticamente em seu nó:
zh_cn: 所有资源都运行后，标签会自动出现在您的节点中：

source: Review the <literal>daemonset</literal> to see the new <literal>sriov-network-config-daemon</literal> and <literal>sriov-rancher-nfd-worker</literal> as active and ready:
es: Revise el <literal>daemonset</literal> para comprobar si las entradas <literal>sriov-network-config-daemon</literal> y <literal>sriov-rancher-nfd-worker</literal> nuevas están activas y listas:
ja: <literal>daemonset</literal>を確認し、新しい<literal>sriov-network-config-daemon</literal>および<literal>sriov-rancher-nfd-worker</literal>がアクティブで準備できていることを確認します。
pt_br: Revise o <literal>daemonset</literal> para ver os novos <literal>sriov-network-config-daemon</literal> e <literal>sriov-rancher-nfd-worker</literal> já ativos e prontos:
zh_cn: 查看 <literal>daemonset</literal>，您会看到新的 <literal>sriov-network-config-daemon</literal> 和 <literal>sriov-rancher-nfd-worker</literal> 处于活动状态并已准备就绪：

source: In a few minutes (can take up to 10 min to be updated), the nodes are detected and configured with the <literal>SR-IOV</literal> capabilities:
es: En unos minutos (la actualización puede tardar hasta 10 minutos), los nodos se detectan y se configuran capacidad de <literal>SR-IOV</literal>:
ja: 数分後(更新に最大で10分かかる可能性があります)、ノードが検出されて、<literal>SR-IOV</literal>の機能が設定されます。
pt_br: Em poucos minutos (a atualização pode levar até 10 minutos), os nós são detectados e configurados com os recursos do <literal>SR-IOV</literal>:
zh_cn: 几分钟后（最多可能需要 10 分钟才会更新），将检测到节点，其上已配置了 <literal>SR-IOV</literal> 功能：

source: Check the interfaces detected.
es: Compruebe las interfaces detectadas.
ja: 検出されたインタフェースを確認します。
pt_br: Verifique as interfaces detectadas.
zh_cn: 检查已检测到的接口。

source: The interfaces discovered should be the PCI address of the network device. Check this information with the <literal>lspci</literal> command in the host.
es: Las interfaces detectadas deben ser la dirección PCI del dispositivo de red. Compruebe esta información con el comando <literal>lspci</literal> en el host.
ja: 検出されたインタフェースはネットワークデバイスのPCIアドレスである必要があります。この情報は、ホストで<literal>lspci</literal>コマンドを使用して確認します。
pt_br: As interfaces descobertas devem ser o endereço PCI do dispositivo de rede. Verifique essa informação com o comando <literal>lspci</literal> no host.
zh_cn: 发现的接口应为网络设备的 PCI 地址。请在主机中使用 <literal>lspci</literal> 命令检查此信息。

source: If your interface is not detected here, ensure that it is present in the next config map:
es: Si su interfaz no se detecta, asegúrese de que esté presente en el siguiente mapa de configuración:
ja: ここでインタフェースが検出されていない場合は、インタフェースが次の設定マップに存在することを確認してください。
pt_br: Se a sua interface não foi detectada neste momento, verifique se ela está presente no próximo mapa de configuração:
zh_cn: 如果此处未检测到您的接口，请确保该接口存在于下一个配置映射中：

source: If your device is not there, edit the config map, adding the right values to be discovered (should be necessary to restart the <literal>sriov-network-config-daemon</literal> daemonset).
es: Si su dispositivo no aparece, edite el mapa de configuración y añada los valores correctos que se deban detectar (puede que sea necesario reiniciar el daemonset <literal>sriov-network-config-daemon</literal>).
ja: ここにデバイスがない場合は、設定マップを編集して、検出すべき適切な値を追加します(<literal>sriov-network-config-daemon</literal>デーモンセットの再起動が必要になります)。
pt_br: Se o seu dispositivo não estiver presente lá, edite o mapa de configuração adicionando os valores corretos a serem descobertos (deve ser necessário reiniciar o daemonset <literal>sriov-network-config-daemon</literal>).
zh_cn: 如果此处未检测到您的设备，请编辑配置映射，添加要发现的正确值（如有必要，请重启 <literal>sriov-network-config-daemon</literal> daemonset）。

source: Create the <literal>NetworkNode Policy</literal> to configure the <literal>VFs</literal>.
es: Cree la directiva <literal>NetworkNodePolicy</literal> para configurar las <literal>funciones virtuales</literal>.
ja: <literal>NetworkNodeポリシー</literal>を作成して<literal>VF</literal>を設定します。
pt_br: Crie a <literal>política NetworkNode</literal> para configurar as <literal>VFs</literal>.
zh_cn: 创建 <literal>NetworkNode 策略</literal>来配置 <literal>VF</literal>。
