Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The <literal>raw</literal> image generated using <literal>EIB</literal> must include the specific container images (helm-chart OCI and container images) required to run the downstream cluster in an air-gapped scenario. For more information, refer to this section (<xref linkend="eib-edge-image-airgap"/>).
es: La imagen <literal>raw</literal> generada con <literal>EIB</literal> debe incluir las imágenes de contenedor específicas (OCI de chart de Helm e imágenes de contenedor) necesarias para ejecutar el clúster descendente en un entorno aislado. Para obtener más información, consulte la <xref linkend="eib-edge-image-airgap"/>.
ja: <literal>EIB</literal>を使用して生成された<literal>生</literal>のイメージには、エアギャップシナリオでダウンストリームクラスタを実行するために必要な特定のコンテナイメージ(HelmチャートOCIイメージとコンテナイメージ)を含める必要があります。詳細については、こちらのセクション(<xref linkend="eib-edge-image-airgap"/>)を参照してください。
pt_br: A imagem <literal>raw</literal> gerada pelo <literal>EIB</literal> deve incluir as imagens do contêiner específicas (imagens OCI de gráfico Helm e do contêiner) necessárias para executar o cluster downstream em um cenário air-gapped. Para obter mais informações, consulte esta seção (<xref linkend="eib-edge-image-airgap"/>).
zh_cn: 使用 <literal>EIB</literal> 生成的<literal>原始</literal>映像必须包含用于在隔离场景中运行下游群集的特定容器映像（helm-chart OCI 和容器映像）。有关详细信息，请参见<xref linkend="eib-edge-image-airgap"/>。

source: In case of using SR-IOV or any other custom workload, the images required to run the workloads must be preloaded in your private registry following the preload private registry section (<xref linkend="preload-private-registry"/>).
es: En caso de usar SR-IOV o cualquier otra carga de trabajo personalizada, las imágenes necesarias para ejecutar las cargas de trabajo deben cargarse previamente en su registro privado siguiendo las instrucciones de la <xref linkend="preload-private-registry"/>.
ja: SR-IOVまたはその他のカスタムワークロードを使用する場合、プライベートレジストリへのプリロードに関するセクション(<xref linkend="preload-private-registry"/>)に従って、ワークロードを実行するために必要なイメージをプライベートレジストリにプリロードする必要があります。
pt_br: No caso de uso de SR-IOV ou qualquer outra carga de trabalho personalizada, as imagens necessárias para executar as cargas de trabalho devem ser pré-carregadas no registro particular, seguindo a seção sobre pré-carregamento no registro particular (<xref linkend="preload-private-registry"/>).
zh_cn: 如果使用 SR-IOV 或任何其他自定义工作负载，则必须按照有关预加载专用仓库的一节（<xref linkend="preload-private-registry"/>）所述，在专用仓库中预加载用于运行工作负载的映像。

source: Enroll the bare-metal hosts in air-gap scenarios
es: Inscripción de los hosts bare metal en entornos aislados
ja: エアギャップシナリオでのベアメタルホストの登録
pt_br: Registrar hosts bare metal em cenários air-gapped
zh_cn: 在隔离场景中登记裸机主机

source: The process to enroll the bare-metal hosts in the management cluster is the same as described in the previous section (<xref linkend="enroll-bare-metal-host"/>).
es: El proceso para inscribir los hosts bare metal en el clúster de gestión es el mismo que se describe en la <xref linkend="enroll-bare-metal-host"/>.
ja: 管理クラスタにベアメタルホストを登録するプロセスは、前のセクション(<xref linkend="enroll-bare-metal-host"/>)で説明したプロセスと同じです。
pt_br: O processo de registro de hosts bare metal no cluster de gerenciamento é o mesmo descrito na seção anterior (<xref linkend="enroll-bare-metal-host"/>).
zh_cn: 在管理群集中登记裸机主机的过程与上前面的章节（<xref linkend="enroll-bare-metal-host"/>）中所述的过程相同。

source: Provision the downstream cluster in air-gap scenarios
es: Aprovisionamiento del clúster descendente en entornos aislados
ja: エアギャップシナリオでのダウンストリームクラスタのプロビジョニング
pt_br: Provisionar o cluster downstream em cenários air-gapped
zh_cn: 在隔离场景中置备下游群集

source: There are some important changes required to provision the downstream cluster in air-gapped scenarios:
es: Hay algunos cambios importantes que se deben realizar para aprovisionar el clúster descendente en entornos aislados:
ja: エアギャップシナリオでダウンストリームクラスタをプロビジョニングするために必要となる重要な変更がいくつかあります。
pt_br: Há algumas alterações importantes necessárias para provisionar o cluster downstream em cenários air-gapped:
zh_cn: 需要进行一些重大更改才能在隔离场景中置备下游群集：

source: The <literal>RKE2ControlPlane</literal> block in the <literal>capi-provisioning-example.yaml</literal> file must include the <literal>spec.agentConfig.airGapped: true</literal> directive.
es: El bloque <literal>RKE2ControlPlane</literal> del archivo <literal>capi-provisioning-example.yaml</literal> debe incluir la directiva <literal>spec.agentConfig.airGapped: true</literal>.
ja: <literal>capi-provisioning-example.yaml</literal>ファイルの<literal>RKE2ControlPlane</literal>ブロックに<literal>spec.agentConfig.airGapped: true</literal>ディレクティブを含める必要があります。
pt_br: O bloco <literal>RKE2ControlPlane</literal> no arquivo <literal>capi-provisioning-example.yaml</literal> deve incluir a diretiva <literal>spec.agentConfig.airGapped: true</literal>.
zh_cn: <literal>capi-provisioning-example.yaml</literal> 文件中的 <literal>RKE2ControlPlane</literal> 必须包含 <literal>spec.agentConfig.airGapped: true</literal> 指令。

source: The private registry configuration must be included in the <literal>RKE2ControlPlane</literal> block in the <literal>capi-provisioning-airgap-example.yaml</literal> file following the private registry section (<xref linkend="atip-private-registry"/>).
es: La configuración del registro privado debe incluirse en el bloque <literal>RKE2ControlPlane</literal> del archivo <literal>capi-provisioning-airgap-example.yaml</literal>, después de la sección del registro privado (<xref linkend="atip-private-registry"/>).
ja: プライベートレジストリに関するセクション(<xref linkend="atip-private-registry"/>)に従って、プライベートレジストリの設定を<literal>capi-provisioning-airgap-example.yaml</literal>ファイルの<literal>RKE2ControlPlane</literal>ブロックに含める必要があります。
pt_br: É necessário incluir a configuração do registro particular no bloco <literal>RKE2ControlPlane</literal> do arquivo <literal>capi-provisioning-airgap-example.yaml</literal> de acordo com a seção de registro particular (<xref linkend="atip-private-registry"/>).
zh_cn: 必须按照有关专用仓库的一节（<xref linkend="atip-private-registry"/>）所述，将专用仓库配置包含在 <literal>capi-provisioning-airgap-example.yaml</literal> 文件的 <literal>RKE2ControlPlane</literal> 块中。

source: If you are using SR-IOV or any other <literal>AdditionalUserData</literal> configuration (combustion script) which requires the helm-chart installation, you must modify the content to reference the private registry instead of using the public registry.
es: Si usa SR-IOV o cualquier otra configuración <literal>AdditionalUserData</literal> (guion de Combustion) que requiera la instalación del chart de Helm, debe modificar el contenido para que haga referencia al registro privado en lugar de utilizar el registro público.
ja: SR-IOV、またはHelmチャートをインストールする必要があるその他の<literal>AdditionalUserData</literal>設定(combustionスクリプト)を使用している場合、内容を変更して、パブリックレジストリを使用するのではなくプライベートレジストリを参照する必要があります。
pt_br: Se você usa SR-IOV ou qualquer outra configuração <literal>AdditionalUserData</literal> (script combustion) que requer a instalação de gráfico Helm, deve modificar o conteúdo para fazer referência ao registro particular, em vez de usar o registro público.
zh_cn: 如果您使用的是 SR-IOV 或任何其他需要安装 helm-chart 的 <literal>AdditionalUserData</literal> 配置（combustion 脚本），则必须修改配置内容以引用专用仓库，而不是使用公共仓库。

source: The following example shows the SR-IOV configuration in the <literal>AdditionalUserData</literal> block in the <literal>capi-provisioning-airgap-example.yaml</literal> file with the modifications required to reference the private registry
es: El siguiente ejemplo muestra la configuración SR-IOV del bloque <literal>AdditionalUserData</literal> del archivo <literal>capi-provisioning-airgap-example.yaml</literal> con las modificaciones necesarias para hacer referencia al registro privado.
ja: 次の例は、プライベートレジストリを参照するために必要な変更を行った、<literal>capi-provisioning-airgap-example.yaml</literal>ファイルの<literal>AdditionalUserData</literal>ブロックのSR-IOVの設定を示しています。
pt_br: O exemplo a seguir mostra a configuração de SR-IOV no bloco <literal>AdditionalUserData</literal> do arquivo <literal>capi-provisioning-airgap-example.yaml</literal> com as modificações necessárias para fazer referência ao registro particular.
zh_cn: 以下示例显示了 <literal>capi-provisioning-airgap-example.yaml</literal> 文件的 <literal>AdditionalUserData</literal> 块中的 SR-IOV 配置，以及为了引用专用仓库而需进行的修改。

source: Private Registry secrets references
es: Referencias de secretos del registro privado
ja: プライベートレジストリのシークレットの参照
pt_br: Referências de segredos do registro particular
zh_cn: 专用仓库机密引用

source: Helm-Chart definition using the private registry instead of the public OCI images.
es: Definición del chart de Helm que usa el registro privado en lugar de las imágenes OCI públicas.
ja: パブリックOCIイメージではなくプライベートレジストリを使用するHelmチャートの定義
pt_br: Definição do gráfico Helm usando o registro particular em vez das imagens OCI públicas
zh_cn: 在 Helm-Chart 定义中使用专用仓库而不是公共 OCI 映像。

source: Lifecycle actions
es: Acciones del ciclo de vida
ja: ライフサイクルのアクション
pt_br: Ações de ciclo de vida
zh_cn: 生命周期操作

source: This section covers the lifecycle management actions for clusters deployed via SUSE Telco Cloud.
es: Esta sección describe las acciones de gestión del ciclo de vida de los clústeres desplegados con SUSE Telco Cloud.
ja: このセクションでは、SUSE Telco Cloudを介してデプロイされたクラスタのライフサイクル管理アクションについて説明します。
zh_cn: 本章介绍通过 SUSE Telco Cloud 部署的群集的生命周期管理操作。

source: Management cluster upgrades
es: Actualizaciones del clúster de gestión
ja: 管理クラスタのアップグレード
pt_br: Upgrades de cluster de gerenciamento
zh_cn: 管理群集升级

source: The upgrade of the management cluster involves several components. For a list of the general components that require an upgrade, see the <literal>Day 2</literal> management cluster (<xref linkend="day2-mgmt-cluster"/>) documentation.
es: La actualización del clúster de gestión implica varios componentes. Para obtener una lista de los componentes generales que requieren una actualización, consulte la documentación sobre el clúster de gestión de <literal>día 2</literal> (<xref linkend="day2-mgmt-cluster"/>).
ja: 管理クラスタのアップグレードには複数のコンポーネントが関係します。アップグレードする必要がある一般的なコンポーネントのリストについては、<literal>Day 2</literal>管理クラスタ(<xref linkend="day2-mgmt-cluster"/>)のドキュメントを参照してください。
pt_br: O upgrade do cluster de gerenciamento envolve vários componentes. Para ver a lista dos componentes gerais que exigem upgrade, consulte a documentação do cluster de gerenciamento de <literal>dia 2</literal> (<xref linkend="day2-mgmt-cluster"/>).
zh_cn: 管理群集的升级涉及到多个组件。有关需要升级的常规组件的列表，请参见 <literal>Day 2</literal> 管理群集（<xref linkend="day2-mgmt-cluster"/>）文档。

source: The upgrade procedure for components specific to this setup can be seen below.
es: El procedimiento de actualización de los componentes específicos de esta configuración se indica a continuación.
ja: このセットアップに固有のコンポーネントのアップグレード手順は以下のとおりです。
pt_br: O procedimento de upgrade dos componentes específicos desta configuração está descrito abaixo.
zh_cn: 下面介绍了针对此设置组件的升级过程。

source: <emphasis role="strong">Upgrading Metal<superscript>3</superscript></emphasis>
es: <emphasis role="strong">Actualización de Metal<superscript>3</superscript></emphasis>
ja: <emphasis role="strong">Metal<superscript>3</superscript>のアップグレード</emphasis>
pt_br: <emphasis role="strong">Fazendo upgrade do Metal<superscript>3</superscript></emphasis>
zh_cn: <emphasis role="strong">升级 Metal<superscript>3</superscript></emphasis>

source: To upgrade <literal>Metal<superscript>3</superscript></literal>, use the following command to update the Helm repository cache and fetch the latest chart to install <literal>Metal<superscript>3</superscript></literal> from the Helm chart repository:
es: Para actualizar <literal>Metal<superscript>3</superscript></literal>, use el comando siguiente para actualizar la caché del repositorio de Helm y obtener el chart más reciente para instalar <literal>Metal<superscript>3</superscript></literal> desde el repositorio de charts de Helm:
ja: <literal>Metal<superscript>3</superscript></literal>をアップグレードするには、次のコマンドを使用してHelmリポジトリキャッシュを更新し、最新のチャートをフェッチしてHelmチャートリポジトリから<literal>Metal<superscript>3</superscript></literal>をインストールします。
pt_br: Para fazer upgrade do <literal>Metal<superscript>3</superscript></literal>, use o seguinte comando para atualizar o cache do repositório Helm e buscar o gráfico mais recente para instalar o <literal>Metal<superscript>3</superscript></literal> do repositório de gráficos Helm:
zh_cn: 要升级 <literal>Metal<superscript>3</superscript></literal>，请使用以下命令更新 Helm 储存库缓存，并从 Helm chart 储存库提取用于安装 <literal>Metal<superscript>3</superscript></literal> 的最新 chart：

source: After that, the easy way to upgrade is to export your current configurations to a file, and then upgrade the <literal>Metal<superscript>3</superscript></literal> version using that previous file. If any change is required in the new version, the file can be edited before the upgrade.
es: Después, la forma más fácil de actualizar es exportar las configuraciones actuales a un archivo y, a continuación, actualizar la versión de <literal>Metal<superscript>3</superscript></literal> utilizando ese archivo anterior. Si es necesario realizar algún cambio en la nueva versión, el archivo se puede editar antes de la actualización.
ja: その後、現在の設定をファイルにエクスポートしてから、その前のファイルを使用して<literal>Metal<superscript>3</superscript></literal>のバージョンをアップグレードすると、簡単にアップグレードできます。新しいバージョンで何らかの変更が必要な場合、アップグレードの前にそのファイルを編集できます。
pt_br: Depois disso, a maneira fácil de fazer upgrade é exportar suas configurações atuais para um arquivo e fazer upgrade da versão do <literal>Metal<superscript>3</superscript></literal> usando o arquivo anterior. Se for necessário alterar alguma coisa na nova versão, edite o arquivo antes do upgrade.
zh_cn: 然后，最简单的升级方式是将当前配置导出到某个文件，然后使用该文件升级 <literal>Metal<superscript>3</superscript></literal> 版本。如果需要对新版本进行任何更改，可以先编辑该文件，然后再升级。

source: Downstream cluster upgrades
es: Actualización de clústeres descendentes
ja: ダウンストリームクラスタのアップグレード
pt_br: Upgrades de cluster downstream
zh_cn: 下游群集升级

source: Upgrading downstream clusters involves updating several components. The following sections cover the upgrade process for each of the components.
es: Para actualizar los clústeres descendentes hay que actualizar varios componentes. Las siguientes secciones describen el proceso de actualización de cada uno de los componentes.
ja: ダウンストリームクラスタをアップグレードするには、複数のコンポーネントを更新する必要があります。次の各セクションでは、各コンポーネントのアップグレードプロセスについて説明します。
pt_br: O upgrade de clusters downstream envolve a atualização de vários componentes. As seções a seguir abordam o processo de upgrade de cada um deles.
zh_cn: 升级下游群集涉及到更新多个组件。以下章节介绍了每个组件的升级过程。

source: <emphasis role="strong">Upgrading the operating system</emphasis>
es: <emphasis role="strong">Actualización del sistema operativo</emphasis>
ja: <emphasis role="strong">オペレーティングシステムのアップグレード</emphasis>
pt_br: <emphasis role="strong">Fazendo upgrade do sistema operacional</emphasis>
zh_cn: <emphasis role="strong">升级操作系统</emphasis>

source: For this process, check the following reference (<xref linkend="eib-edge-image-connected"/>) to build the new image with a new operating system version. With this new image generated by <literal>EIB</literal>, the next provision phase uses the new operating version provided. In the following step, the new image is used to upgrade the nodes.
es: Para este proceso, consulte la siguiente referencia (<xref linkend="eib-edge-image-connected"/>) para crear la nueva imagen con una nueva versión del sistema operativo. Con esta nueva imagen generada por <literal>EIB</literal>, la siguiente fase de aprovisionamiento utiliza la nueva versión operativa proporcionada. En el siguiente paso, la nueva imagen se utiliza para actualizar los nodos.
ja: このプロセスでは、次の参照資料(<xref linkend="eib-edge-image-connected"/>)を確認して、新しいオペレーティングシステムバージョンで新しいイメージを構築します。<literal>EIB</literal>で生成されたこの新しいイメージにより、次のプロビジョニングフェーズでは、指定した新しいオペレーティングシステムバージョンが使用されます。次の手順では、この新しいイメージを使用してノードをアップグレードします。
pt_br: Para este processo, consulte a seguinte referência (<xref linkend="eib-edge-image-connected"/>) para criar uma imagem com uma nova versão do sistema operacional. Com essa imagem gerada pelo <literal>EIB</literal>, a próxima fase de provisionamento usará a nova versão do sistema operacional fornecida. Na etapa seguinte, a nova imagem será usada para fazer upgrade dos nós.
zh_cn: 对于此过程，请参考此章节(<xref linkend="eib-edge-image-connected"/>)来构建包含新操作系统版本的新映像。使用 <literal>EIB</literal> 生成此新映像后，下一置备阶段将使用提供的新操作系统版本。下一步骤将使用新映像来升级节点。

source: <emphasis role="strong">Upgrading the RKE2 cluster</emphasis>
es: <emphasis role="strong">Actualización del clúster RKE2</emphasis>
ja: <emphasis role="strong">RKE2クラスタのアップグレード</emphasis>
pt_br: <emphasis role="strong">Fazendo upgrade do cluster RKE2</emphasis>
zh_cn: <emphasis role="strong">升级 RKE2 群集</emphasis>

source: The changes required to upgrade the <literal>RKE2</literal> cluster using the automated workflow are the following:
es: Los cambios necesarios para actualizar el clúster <literal>RKE2</literal> utilizando el flujo de trabajo automatizado son los siguientes:
ja: 自動化されたワークフローを使用して<literal>RKE2</literal>クラスタをアップグレードするために必要な変更は次のとおりです。
pt_br: As alterações necessárias para fazer upgrade do cluster <literal>RKE2</literal> usando o fluxo de trabalho automatizado são as seguintes:
zh_cn: 需要做出以下更改才能使用自动化工作流程升级 <literal>RKE2</literal> 群集：

source: Change the block <literal>RKE2ControlPlane</literal> in the <literal>capi-provisioning-example.yaml</literal> shown in the following section (<xref linkend="single-node-provision"/>):
es: Cambie el bloque <literal>RKE2ControlPlane</literal> en el archivo <literal>capi-provisioning-example.yaml</literal> que se muestra en la siguiente sección (<xref linkend="single-node-provision"/>):
ja: 次のセクション(<xref linkend="single-node-provision"/>)に示す<literal>capi-provisioning-example.yaml</literal>のブロック<literal>RKE2ControlPlane</literal>を次のように変更します。
pt_br: Altere o bloco <literal>RKE2ControlPlane</literal> no <literal>capi-provisioning-example.yaml</literal> mostrado na seguinte seção (<xref linkend="single-node-provision"/>):
zh_cn: 按照<xref linkend="single-node-provision"/>中所述更改 <literal>capi-provisioning-example.yaml</literal> 中的 <literal>RKE2ControlPlane</literal> 块：

source: Specify the desired <literal>rolloutStrategy</literal>.
es: Especifique la estrategia <literal>rolloutStrategy</literal> deseada.
ja: 目的の<literal>rolloutStrategy</literal>を指定します。
pt_br: Especifique a <literal>rolloutStrategy</literal> desejada.
zh_cn: 指定所需的 <literal>rolloutStrategy</literal>。

source: Change the version of the <literal>RKE2</literal> cluster to the new version replacing <literal>${RKE2_NEW_VERSION}</literal>.
es: Cambie la versión del clúster <literal>RKE2</literal> a la nueva versión sustituyendo <literal>${RKE2_NEW_VERSION}</literal>.
ja: <literal>${RKE2_NEW_VERSION}</literal>を置き換えて、<literal>RKE2</literal>クラスタのバージョンを新しいバージョンに変更します。
pt_br: Altere a versão do cluster <literal>RKE2</literal> para a nova versão, substituindo <literal>${RKE2_NEW_VERSION}</literal>.
zh_cn: 将 <literal>RKE2</literal> 群集的版本更改为新版本（请替换以下代码中的 <literal>${RKE2_NEW_VERSION}</literal>）。

source: Change the block <literal>Metal3MachineTemplate</literal> in the <literal>capi-provisioning-example.yaml</literal> shown in the following section (<xref linkend="single-node-provision"/>):
es: Cambie el bloque <literal>Metal3MachineTemplate</literal> del archivo <literal>capi-provisioning-example.yaml</literal> que se muestra en la siguiente sección (<xref linkend="single-node-provision"/>):
ja: 次のセクション(<xref linkend="single-node-provision"/>)に示す<literal>capi-provisioning-example.yaml</literal>のブロック<literal>Metal3MachineTemplate</literal>を次のように変更します。
pt_br: Altere o bloco <literal>Metal3MachineTemplate</literal> no <literal>capi-provisioning-example.yaml</literal> mostrado na seguinte seção (<xref linkend="single-node-provision"/>):
zh_cn: 按照<xref linkend="single-node-provision"/>中所述更改 <literal>capi-provisioning-example.yaml</literal> 中的 <literal>Metal3MachineTemplate</literal> 块：

source: Change the image name and checksum to the new version generated in the previous step.
es: Cambie el nombre de la imagen y la suma de comprobación a la nueva versión generada en el paso anterior.
ja: イメージ名およびチェックサムを、前の手順で生成した新しいバージョンに変更します。
pt_br: Altere o nome e o checksum da imagem para a nova versão gerada na etapa anterior.
zh_cn: 将映像名称与校验和更改为在上一步骤中生成的新版本。

source: Add the directive <literal>nodeReuse</literal> to <literal>true</literal> to avoid creating a new node.
es: En la directiva <literal>nodeReuse</literal> defina el valor <literal>true</literal> para evitar crear un nuevo nodo.
ja: ディレクティブ<literal>nodeReuse</literal>を追加して<literal>true</literal>に設定し、新しいノードが作成されないようにします。
pt_br: Adicione a diretiva <literal>nodeReuse</literal> a <literal>true</literal> para evitar a criação de um novo nó.
zh_cn: 将指令 <literal>nodeReuse</literal> 设置为 <literal>true</literal>，以避免创建新节点。

source: Add the directive <literal>automatedCleaningMode</literal> to <literal>metadata</literal> to enable the automated cleaning for the node.
es: En la directiva <literal>automatedCleaningMode</literal> defina <literal>metadata</literal> para habilitar la limpieza automática del nodo.
ja: ディレクティブ<literal>automatedCleaningMode</literal>を追加して<literal>metadata</literal>に設定し、ノードの自動クリーニングを有効にします。
pt_br: Adicione a diretiva <literal>automatedCleaningMode</literal> a <literal>metadata</literal> para habilitar a limpeza automatizada do nó.
zh_cn: 将指令 <literal>automatedCleaningMode</literal> 设置为 <literal>metadata</literal>，以启用节点自动清理。

source: After making these changes, the <literal>capi-provisioning-example.yaml</literal> file can be applied to the cluster using the following command:
es: Después de realizar estos cambios, el archivo <literal>capi-provisioning-example.yaml</literal> se puede aplicar al clúster con este comando:
ja: これらの変更を行った後、次にコマンドを使用して<literal>capi-provisioning-example.yaml</literal>ファイルをクラスタに適用できます。
pt_br: Depois de fazer essas alterações, o arquivo <literal>capi-provisioning-example.yaml</literal> poderá ser aplicado ao cluster usando o seguinte comando:
zh_cn: 完成这些更改后，可以使用以下命令将 <literal>capi-provisioning-example.yaml</literal> 文件应用于群集：

source: This section provides guidance to diagnose and resolve common issues with SUSE Edge deployments and operations. It covers various topics, offering component-specific troubleshooting steps, key tools, and relevant log locations.
es: En esta sección se proporcionan instrucciones para diagnosticar y resolver problemas comunes relacionados con los despliegues y operaciones de SUSE Edge. Abarca diversos temas y ofrece pasos específicos para la resolución de problemas de componentes, herramientas clave y la ubicación de los registros relevantes.
ja: このセクションでは、SUSE Edgeのデプロイメントと操作に関する一般的な問題を診断し、解決するためのガイダンスを提供します。さまざまなトピックを網羅していて、コンポーネント固有のトラブルシューティング手順、主要ツール、関連するログの場所を説明しています。
pt_br: Esta seção orienta no diagnóstico e na solução dos problemas comuns às implantações e operações do SUSE Edge. Ela aborda vários tópicos, incluindo as etapas de solução de problemas específicas do componente, as ferramentas importantes e os locais relevantes dos registros.
zh_cn: 本节提供诊断和解决常见 SUSE Edge 部署及操作问题的指导。内容涵盖多个主题，包括针对特定组件的查错步骤、关键工具及相关日志位置。

source: General Troubleshooting Principles
es: Principios generales para resolver problemas
ja: 一般的なトラブルシューティングの原則
pt_br: Princípios gerais da solução de problemas
zh_cn: 通用查错原则

source: Before diving into component-specific issues, consider these general principles:
es: Antes de profundizar en cuestiones específicas de los componentes, tenga en cuenta estos principios generales:
ja: コンポーネント固有の問題に取りかかる前に、以下の一般的な原則を考慮してください。
pt_br: Antes de entrar nos detalhes dos problemas específicos dos componentes, avalie estes princípios gerais:
zh_cn: 在深入了解特定组件问题之前，请考虑以下通用原则：
