Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: See <link xl:href="https://documentation.suse.com/sle-micro/6.1/">SUSE Linux Micro official documentation</link>
es: Consulte la <link xl:href="https://documentation.suse.com/sle-micro/6.1/">documentación oficial de SUSE Linux Micro</link>
ja: <link xl:href="https://documentation.suse.com/sle-micro/6.1/">SUSE Linux Micro公式ドキュメント</link>を参照してください。
pt_br: Consulte a <link xl:href="https://documentation.suse.com/sle-micro/6.1/">documentação oficial do SUSE Linux Micro</link>
zh_cn: 请参见 <link xl:href="https://documentation.suse.com/sle-micro/6.1/">SUSE Linux Micro 官方文档</link>

source: SUSE Linux Micro is a lightweight and secure operating system for the edge. It merges the enterprise-hardened components of SUSE Linux Enterprise with the features that developers want in a modern, immutable operating system. As a result, you get a reliable infrastructure platform with best-in-class compliance that is also simple to use.
es: SUSE Linux Micro es un sistema operativo ligero y seguro para el perímetro. Combina los componentes reforzados para empresas de SUSE Linux Enterprise con las características que los desarrolladores desean en un sistema operativo moderno e inmutable. Como resultado, se obtiene una plataforma de infraestructura fiable con el mejor cumplimiento normativo de su clase y que, además, es fácil de usar.
ja: SUSE Linux Microは、エッジ向けの軽量でセキュアなオペレーティングシステムです。SUSE Linux Microには、SUSE Linux Enterpriseのエンタープライズ向けに強化されたコンポーネントと、開発者が最新のイミュータブルオペレーティングシステムに求める機能が統合されています。その結果、クラス最高のコンプライアンスを備えた信頼性の高いインフラストラクチャプラットフォームが実現し、使いやすさも向上しています。
pt_br: O SUSE Linux Micro é um sistema operacional leve e seguro para a borda. Ele combina os componentes protegidos da empresa do SUSE Linux Enterprise com os recursos que os desenvolvedores desejam em um sistema operacional moderno e imutável. Como resultado, você tem uma plataforma de infraestrutura confiável com a mais alta conformidade, porém fácil de usar.
zh_cn: SUSE Linux Micro 是一个安全的轻量级边缘操作系统。它将 SUSE Linux Enterprise 强化组件与开发人员需要的各种功能融入一套不可变的新式操作系统，从而形成一个可靠的基础架构平台，不仅具有同类最佳的合规性，而且易于使用。

source: How does SUSE Edge use SUSE Linux Micro?
es: ¿Cómo se usa SUSE Linux Micro en SUSE Edge?
ja: SUSE EdgeでのSUSE Linux Microの用途
pt_br: Como o SUSE Edge usa o SUSE Linux Micro?
zh_cn: SUSE Edge 如何使用 SUSE Linux Micro？

source: We use SUSE Linux Micro as the base operating system for our platform stack. This provides us with a secure, stable and minimal base for building upon.
es: Utilizamos SUSE Linux Micro como sistema operativo base para nuestra plataforma. Proporciona una base segura, estable y mínima sobre la que construir.
ja: SUSEでは、SUSE Linux Microをプラットフォームスタックのベースオペレーティングシステムとして使用します。これにより、構築基盤となる、安全で安定した最小限のベースが提供されます。
pt_br: O SUSE Linux Micro é usado como o sistema operacional de base para a nossa pilha de plataforma. Desse modo, contamos com uma base segura, estável e mínima para criação.
zh_cn: 我们使用 SUSE Linux Micro 作为平台堆栈的基础操作系统。它为我们提供了安全、稳定且精简的构建基础。

source: SUSE Linux Micro is unique in its use of file system (Btrfs) snapshots to allow for easy rollbacks in case something goes wrong with an upgrade. This allows for secure remote upgrades for the entire platform even without physical access in case of issues.
es: El uso de instantáneas del sistema de archivos (Btrfs) para permitir reversiones sencillas en caso de que algo salga mal con una actualización es único en SUSE Linux Micro. Esto permite actualizaciones remotas seguras para toda la plataforma, incluso sin acceso físico en caso de que surjan problemas.
ja: SUSE Linux Microでは、独自の方法でファイルシステム(Btrfs)スナップショットを使用しており、アップグレードで問題が発生した場合に簡単にロールバックできます。これにより、問題が発生した場合、物理的にアクセスしなくてもプラットフォーム全体をリモートで安全にアップグレードできます。
pt_br: O SUSE Linux Micro é exclusivo na questão do uso de instantâneos do sistema de arquivos (Btrfs) para facilitar as reversões se houver qualquer erro no upgrade. Esse recurso protege os upgrades remotos de toda a plataforma mesmo sem acesso físico em caso de problemas.
zh_cn: SUSE Linux Micro 的独特之处在于它使用了文件系统 (Btrfs) 快照，一旦在升级期间出错，我们就可以轻松回滚。这样，在出现问题时，即使无法进行物理访问，也可以对整个平台安全地进行远程升级。

source: Installation media
es: Medios de instalación
ja: インストールメディア
pt_br: Mídia de instalação
zh_cn: 安装媒体

source: SUSE Edge uses the Edge Image Builder (<xref linkend="components-eib"/>) to preconfigure the SUSE Linux Micro self-install installation image.
es: SUSE Edge usa Edge Image Builder (<xref linkend="components-eib"/>) para preconfigurar la imagen de autoinstalación de SUSE Linux Micro.
ja: SUSE Edgeは、Edge Image Builder (<xref linkend="components-eib"/>)を使用して、SUSE Linux Microのセルフインストールのインストールイメージを事前設定します。
pt_br: O SUSE Edge usa o Edge Image Builder (<xref linkend="components-eib"/>) para pré-configurar a imagem de autoinstalação do SUSE Linux Micro.
zh_cn: SUSE Edge 使用 Edge Image Builder（<xref linkend="components-eib"/>）来预配置 SUSE Linux Micro 自安装映像。

source: Local administration
es: Administración local
ja: ローカル管理
pt_br: Administração local
zh_cn: 本地管理

source: SUSE Linux Micro comes with Cockpit to allow the local management of the host through a Web application.
es: SUSE Linux Micro incluye Cockpit para la gestión local del host a través de una aplicación web.
ja: SUSE Linux Microには、Webアプリケーションでホストをローカルに管理できるCockpitが付属しています。
pt_br: O SUSE Linux Micro vem com o Cockpit, que permite o gerenciamento local do host por meio de um aplicativo web.
zh_cn: SUSE Linux Micro 附带 Cockpit，让您可以通过 Web 应用程序对主机进行本地管理。

source: This service is disabled by default but can be started by enabling the systemd service <literal>cockpit.socket</literal>.
es: Este servicio está desactivado de forma predeterminada, pero se puede iniciar habilitando el servicio <literal>cockpit.socket</literal> de systemd.
ja: このサービスはデフォルトでは無効になっていますが、systemdサービス<literal>cockpit.socket</literal>を有効にすることで開始できます。
pt_br: Por padrão, esse serviço está desabilitado, mas é possível habilitar o serviço <literal>cockpit.socket</literal> do systemd para iniciá-lo.
zh_cn: 此服务默认已禁用，但可以通过启用 systemd 服务 <literal>cockpit.socket</literal> 来启动。

source: There is no desktop environment available in SUSE Linux Micro at the moment but a containerized solution is in development.
es: Por el momento, SUSE Linux Micro no dispone de ningún entorno de escritorio, pero se está desarrollando una solución en contenedores.
ja: 現時点では、SUSE Linux Microで利用可能なデスクトップ環境はありませんが、コンテナ化されたソリューションが開発中です。
pt_br: No momento, não existe um ambiente de área de trabalho disponível no SUSE Linux Micro, mas há uma solução conteinerizada em desenvolvimento.
zh_cn: SUSE Linux Micro 目前不提供桌面环境，但我们正在开发容器化解决方案。

source: <link xl:href="https://metal3.io/">Metal<superscript>3</superscript></link> is a CNCF project which provides bare-metal infrastructure management capabilities for Kubernetes.
es: <link xl:href="https://metal3.io/">Metal<superscript>3</superscript></link> es un proyecto de la CNCF que proporciona capacidades de gestión de infraestructura bare metal para Kubernetes.
ja: <link xl:href="https://metal3.io/">Metal<superscript>3</superscript></link>は、Kubernetesにベアメタルインフラストラクチャ管理機能を提供するCNCFプロジェクトです。
pt_br: <link xl:href="https://metal3.io/">Metal<superscript>3</superscript></link> é um projeto da CNCF que oferece recursos de gerenciamento de infraestrutura bare metal para Kubernetes.
zh_cn: <link xl:href="https://metal3.io/">Metal<superscript>3</superscript></link> 是一个 CNCF 项目，它为 Kubernetes 提供裸机基础架构管理功能。

source: How does SUSE Edge use Metal<superscript>3</superscript>?
es: ¿Cómo se usa Metal<superscript>3</superscript> en SUSE Edge?
ja: SUSE EdgeでのMetal<superscript>3</superscript>の用途
pt_br: Como o SUSE Edge usa o Metal<superscript>3</superscript>?
zh_cn: SUSE Edge 如何使用 Metal<superscript>3</superscript>？

source: This method provides declarative APIs that enable inventory and state management of bare-metal servers, including automated inspection, cleaning and provisioning/deprovisioning.
es: Este método proporciona API declarativas que permiten la gestión del inventario y el estado de los servidores bare metal, incluyendo la inspección, la limpieza y el aprovisionamiento/desaprovisionamiento automatizados.
ja: この方法では宣言型APIが提供されており、このAPIを使用することで、検査、クリーニング、プロビジョニング/プロビジョニング解除の自動化を含む、ベアメタルサーバのインベントリと状態の管理が可能になります。
pt_br: Esse método fornece APIs declarativas que permitem o gerenciamento de inventário e de estado dos servidores bare metal, incluindo inspeção, limpeza e provisionamento/desprovisionamento automatizados.
zh_cn: 此方法提供声明性 API 来对裸机服务器进行清单和状态管理，包括自动检查、清理和置备/取消置备。

source: The upstream <link xl:href="https://github.com/metal3-io/ip-address-manager">IP Address Management controller</link> is currently not supported, because it is not yet compatible with our choice of network configuration tooling.
es: Actualmente, no se admite el <link xl:href="https://github.com/metal3-io/ip-address-manager">controlador de gestión de direcciones IP </link> original, ya que aún no es compatible con las herramientas de configuración de red que hemos elegido.
ja: アップストリームの<link xl:href="https://github.com/metal3-io/ip-address-manager">IPアドレス管理コントローラ</link>は、SUSEが選択したネットワーク設定ツールとの互換性がまだないため、現在はサポートされていません。
pt_br: No momento, não há suporte para o <link xl:href="https://github.com/metal3-io/ip-address-manager">controlador de gerenciamento de endereços IP</link> upstream, pois ele ainda não é compatível com a nossa seleção de ferramentas de configuração de rede.
zh_cn: 上游 <link xl:href="https://github.com/metal3-io/ip-address-manager">IP 地址管理控制器</link>目前不受支持，因为它与我们选择的网络配置工具尚不兼容。

source: Relatedly, the IPAM resources and Metal3DataTemplate networkData fields are not supported.
es: Del mismo modo, tampoco se admiten los recursos IPAM ni los campos networkData Metal3DataTemplate.
ja: 関連して、IPAMリソースとMetal3DataTemplateのnetworkDataフィールドはサポートされていません。
pt_br: Da mesma forma, os recursos do IPAM e os campos networkData do Metal3DataTemplate não são suportados.
zh_cn: 相关的 IPAM 资源和 Metal3DataTemplate networkData 字段也不受支持。

source: See the <link xl:href="https://github.com/suse-edge/edge-image-builder">Official Repository</link>.
es: Consulte el <link xl:href="https://github.com/suse-edge/edge-image-builder">repositorio oficial</link>.
ja: <link xl:href="https://github.com/suse-edge/edge-image-builder">公式リポジトリ</link>を参照してください。
pt_br: Consulte o <link xl:href="https://github.com/suse-edge/edge-image-builder">repositório oficial</link>.
zh_cn: 请参见<link xl:href="https://github.com/suse-edge/edge-image-builder">官方储存库</link>。

source: Edge Image Builder (EIB) is a tool that streamlines the generation of Customized, Ready-to-Boot (CRB) disk images for bootstrapping machines. These images enable the end-to-end deployment of the entire SUSE software stack with a single image.
es: Edge Image Builder (EIB) es una herramienta que optimiza la generación de imágenes de disco personalizadas y listas para arrancar (CRB) para equipos de arranque. Estas imágenes permiten el despliegue integral de toda la pila de software de SUSE con una sola imagen.
ja: Edge Image Builder (EIB)は、マシンをブートストラップするためのCustomized, Ready-to-Boot (CRB)ディスクイメージの生成を効率化するツールです。これらのイメージにより、SUSEソフトウェアスタック全体を単一のイメージでエンドツーエンドにデプロイできます。
pt_br: O Edge Image Builder (EIB) é uma ferramenta que simplifica a geração das imagens de disco personalizadas e prontas para inicialização (CRB) para máquinas de inicialização. Essas imagens permitem a implantação de ponta a ponta da pilha de software completa do SUSE com uma única imagem.
zh_cn: Edge Image Builder (EIB) 工具可以简化为引导计算机生成自定义的随时可引导 (CRB) 磁盘映像的过程。使用一个这样的映像就能实现整个 SUSE 软件堆栈的端到端部署。

source: Whilst EIB can create CRB images for all provisioning scenarios, EIB demonstrates a tremendous value in air-gapped deployments with limited or completely isolated networks.
es: Si bien EIB puede crear imágenes listas para arrancar para cualquier escenario de aprovisionamiento, resulta especialmente útil en despliegues en entornos aislados (air-gapped) con redes limitadas o completamente aisladas.
ja: EIBはあらゆるプロビジョニングシナリオ向けのCRBイメージを作成できますが、EIBが非常に大きな価値を発揮するのは、ネットワークが制限されているか、完全に分離されているエアギャップデプロイメントにおいてです。
pt_br: O EIB cria imagens CRB para todos os cenários de provisionamento e ainda demonstra um enorme valor para as implantações air-gapped com redes limitadas ou totalmente isoladas.
zh_cn: 虽然 EIB 能够为所有置备场景创建 CRB 映像，但 EIB 在网络受限或完全隔离的隔离式部署中展现出极大价值。

source: How does SUSE Edge use Edge Image Builder?
es: ¿Cómo se usa Edge Image Builder en SUSE Edge?
ja: SUSE EdgeでのEdge Image Builderの用途
pt_br: Como o SUSE Edge usa o Edge Image Builder?
zh_cn: SUSE Edge 如何使用 Edge Image Builder？

source: SUSE Edge uses EIB for the simplified and quick configuration of customized SUSE Linux Micro images for a variety of scenarios. These scenarios include the bootstrapping of virtual and bare-metal machines with:
es: SUSE Edge utiliza EIB para la configuración simplificada y rápida de imágenes de SUSE Linux Micro personalizadas en distintas situaciones. Por ejemplo, para el arranque de máquinas virtuales y bare metal con lo siguiente:
ja: SUSE Edgeでは、さまざまなシナリオ用にカスタマイズされたSUSE Linux Microイメージをシンプルかつ迅速に設定するためにEIBを使用します。これらのシナリオには、以下を使用する仮想マシンとベアメタルマシンのブートストラップが含まれます。
pt_br: O SUSE Edge usa o EIB para configuração rápida e simplificada de imagens personalizadas do SUSE Linux Micro para diversos cenários, incluindo inicialização de máquinas virtuais e bare metal com:
zh_cn: SUSE Edge 使用 EIB 来简化和快速配置适用于多种场景的自定义 SUSE Linux Micro 映像。这些场景包括为虚拟机和裸机引导部署，具体如下：

source: Fully air-gapped deployments of K3s/RKE2 Kubernetes (single &amp; multi-node)
es: Despliegues de K3s/RKE2 de Kubernetes (de un solo nodo y de varios nodos) en entornos totalmente aislados
ja: K3s/RKE2 Kubernetesの完全なエアギャップデプロイメント(シングルノードとマルチノード)
pt_br: Implantações totalmente air-gapped do Kubernetes K3s/RKE2 (nó único e vários nós)
zh_cn: K3s/RKE2 Kubernetes 的完全隔离式部署（单节点和多节点）

source: Fully air-gapped Helm chart and Kubernetes manifest deployments
es: Despliegues de chart de Helm y de manifiestos de Kubernetes en entornos totalmente aislados
ja: HelmチャートとKubernetesマニフェストの完全なエアギャップデプロイメント
pt_br: Implantações totalmente air-gapped de gráficos Helm e manifestos do Kubernetes
zh_cn: 完全隔离式 Helm chart和 Kubernetes 清单部署

source: Registration to Rancher via Elemental API
es: Registro en Rancher mediante la API de Elemental
ja: Elemental APIを介したRancherへの登録
pt_br: Registro no Rancher pela API Elemental
zh_cn: 通过 Elemental API 注册到 Rancher

source: Customized networking (for example, static IP, host name, VLAN’s, bonding, etc.)
es: Configuración de red personalizada (por ejemplo, IP estática, nombre de host, VLAN, vinculación, etc.)
ja: カスタマイズされたネットワーキング(静的IP、ホスト名、VLAN、ボンディングなど)
pt_br: Rede personalizada (por exemplo, IP estático, nome de host, VLANs, vinculação etc.)
zh_cn: 自定义网络（例如静态 IP、主机名、VLAN、绑定等）

source: Customized operating system configurations (for example, users, groups, passwords, SSH keys, proxies, NTP, custom SSL certificates, etc.)
es: Configuraciones personalizadas del sistema operativo (por ejemplo, usuarios, grupos, contraseñas, claves SSH, proxies, NTP, certificados SSL personalizados, etc.)
ja: カスタマイズされたオペレーティングシステム設定(ユーザ、グループ、パスワード、SSHキー、プロキシ、NTP、カスタムSSL証明書など)
pt_br: Configurações personalizadas de sistema operacional (por exemplo, usuários, grupos, senhas, chaves SSH, proxies, NTP, certificados SSL personalizados etc.)
zh_cn: 自定义操作系统配置（例如用户、组、口令、SSH 密钥、代理、NTP、自定义 SSL 证书等）

source: Air-gapped installation of host-level and side-loaded RPM packages (including dependency resolution)
es: Instalación en entornos aislados de paquetes RPM a nivel de host y locales (incluida la resolución de dependencias)
ja: ホストレベルおよびサイドロードRPMパッケージのエアギャップインストール(依存関係の解決を含む)
pt_br: Instalação air-gapped de pacotes RPM no nível do host e sideloaded (com resolução de dependências)
zh_cn: 主机级和侧载 RPM 软件包的隔离式安装（包括依赖项解析）

source: Registration to SUSE Multi-Linux Manager for OS management
es: Registro en SUSE Multi-Linux Manager para la gestión del sistema operativo
ja: OS管理のためのSUSE Multi-Linux Managerへの登録
pt_br: Registro do SUSE Multi-Linux Manager para gerenciamento de sistema operacional
zh_cn: 注册到 SUSE Multi-Linux Manager 以进行操作系统管理

source: Embedded container images
es: Imágenes de contenedor integradas
ja: 組み込みコンテナイメージ
pt_br: Imagens de contêiner incorporadas
zh_cn: 嵌入式容器映像

source: Kernel command-line arguments
es: Argumentos de línea de comando del kernel
ja: カーネルコマンドライン引数
pt_br: Argumentos de linha de comando do Kernel
zh_cn: 内核命令行参数

source: Systemd units to be enabled/disabled at boot time
es: Unidades de systemd que se deben habilitar/inhabilitar en el arranque
ja: ブート時に有効化/無効化されるsystemdユニット
pt_br: Unidades do Systemd para habilitação/desabilitação no momento da inicialização
zh_cn: 引导时启用/禁用的 Systemd 单元

source: Custom scripts and files for any manual tasks
es: Guiones y archivos personalizados para cualquier tarea manual
ja: 手動タスク用のカスタムスクリプトとファイル
pt_br: Scripts e arquivos personalizados para tarefas manuais
zh_cn: 用于任何手动任务的自定义脚本和文件

source: Getting started
es: Inicio
ja: はじめに
pt_br: Introdução
zh_cn: 入门

source: Comprehensive documentation for the usage and testing of Edge Image Builder can be found <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.3/docs">here</link>.
es: Encontrará la documentación completa sobre el uso y las pruebas de Edge Image Builder <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.3/docs">aquí</link>.
ja: Edge Image Builderの使用とテストに関する包括的なドキュメントについては、<link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.3/docs">こちら</link>を参照してください。
zh_cn: 有关 Edge Image Builder 用法和测试的综合文档，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.3/docs">此处</link>。

source: Additionally, see <xref linkend="quickstart-eib"/> covering a basic deployment scenario.
es: Asimismo, en el <xref linkend="quickstart-eib"/> se explica un escenario básico de despliegue.
ja: また、基本的なデプロイメントシナリオを説明している<xref linkend="quickstart-eib"/>を参照してください。
pt_br: Consulte também o <xref linkend="quickstart-eib"/> que apresenta um cenário de implantação básica.
zh_cn: 另外请参见<xref linkend="quickstart-eib"/>，其中介绍了一种基本部署场景。

source: Once you are familiar with this tool, please find some more useful information on our EIB Tips and Tricks section (<xref linkend="tips-and-tricks"/>) page.
es: Cuando se haya familiarizado con esta herramienta, encontrará más información útil en la página Consejos y trucos de EIB (<xref linkend="tips-and-tricks"/>).
ja: このツールに慣れたら、EIBの「ヒントとコツ」セクション(<xref linkend="tips-and-tricks"/>)ページでさらに役立つ情報を見つけてください。
zh_cn: 当您熟悉此工具后，可在我们的 EIB 提示和技巧（<xref linkend="tips-and-tricks"/>）页面中查找一些更有用的信息。

source: EIB air-gaps Helm charts through templating the Helm charts and parsing all the images within the template. If a Helm chart does not keep all of its images within the template and instead side-loads the images, EIB will not be able to air-gap those images automatically. The solution to this is to manually add any undetected images to the <literal>embeddedArtifactRegistry</literal> section of the definition file.
es: EIB crea plantillas de charts de Helm y analiza todas las imágenes de la plantilla para aislar los charts de Helm. Si un chart de Helm no tiene todas sus imágenes dentro de la plantilla y, en su lugar, carga las imágenes de forma local, EIB no podrá aislar esas imágenes automáticamente. La solución es añadir manualmente cualquier imagen no detectada a la sección <literal>embeddedArtifactRegistry</literal> del archivo de definición.
ja: EIBは、Helmチャートをテンプレート化してテンプレート内のすべてのイメージを解析することで、Helmチャートをエアギャップ化します。Helmチャートですべてのイメージをテンプレート内に保持せず、代わりにイメージをサイドロードする場合、EIBではそれらのイメージを自動的にエアギャップ化できません。これを解決するには、検出されないイメージを定義ファイルの<literal>embeddedArtifactRegistry</literal>セクションに手動で追加します。
pt_br: O EIB cria gabaritos dos gráficos Helm para isolá-los e analisa todas as imagens dentro dos gabaritos. Se um gráfico Helm não incluir todas as suas imagens dentro de um gabarito e, em vez disso, fizer sideload das imagens, o EIB não poderá isolar essas imagens automaticamente. Nesse caso, a solução é adicionar manualmente as imagens não detectadas à seção <literal>embeddedArtifactRegistry</literal> do arquivo de definição.
zh_cn: EIB 通过模板化 Helm chart 并分析模板中的所有映像来隔离 Helm chart。如果 Helm chart 未将其所有映像保留在模板中，而是侧载映像，则 EIB 将无法自动隔离这些映像。可通过手动将任何未检测到的映像添加到定义文件的 <literal>embeddedArtifactRegistry</literal> 部分，来解决此问题。

source: Edge Networking
es: Conexiones de red de Edge
ja: Edgeネットワーキング
pt_br: Rede de borda
zh_cn: 边缘网络

source: This section describes the approach to network configuration in the SUSE Edge solution. We will show how to configure NetworkManager on SUSE Linux Micro in a declarative manner, and explain how the related tools are integrated.
es: En esta sección se describe el enfoque de la configuración de redes en la solución SUSE Edge. Se explica cómo configurar NetworkManager en SUSE Linux Micro de forma declarativa y cómo se integran las herramientas relacionadas.
ja: このセクションでは、SUSE Edgeソリューションにおけるネットワーク設定へのアプローチについて説明します。宣言的な方法でSUSE Linux Micro上でNetworkManagerを設定する方法を示し、関連ツールの統合方法について説明します。
pt_br: Esta seção descreve a abordagem de configuração de rede na solução SUSE Edge. Vamos mostrar como configurar o NetworkManager no SUSE Linux Micro de maneira declarativa e explicar como as ferramentas relacionadas são integradas.
zh_cn: 本章介绍 SUSE Edge 解决方案中的网络配置方法。我们将展示如何以声明方式在 SUSE Linux Micro 上配置 NetworkManager，并说明如何集成相关的工具。

source: Overview of NetworkManager
es: Descripción general de NetworkManager
ja: NetworkManagerの概要
pt_br: Visão geral do NetworkManager
zh_cn: NetworkManager 概述

source: NetworkManager is a tool that manages the primary network connection and other connection interfaces.
es: NetworkManager es una herramienta que gestiona la conexión de red principal y otras interfaces de conexión.
ja: NetworkManagerは、プライマリネットワーク接続と他の接続インタフェースを管理するツールです。
pt_br: O NetworkManager é uma ferramenta que gerencia a conexão de rede principal e outras interfaces de conexão.
zh_cn: NetworkManager 是用于管理主网络连接和其他连接接口的工具。

source: NetworkManager stores network configurations as connection files that contain the desired state. These connections are stored as files in the <literal>/etc/NetworkManager/system-connections/</literal> directory.
es: NetworkManager almacena las configuraciones de redes como archivos de conexión que contienen el estado deseado en el directorio <literal>/etc/NetworkManager/system-connections/</literal>.
ja: NetworkManagerは、ネットワーク設定を、望ましい状態が含まれる接続ファイルとして保存します。これらの接続は、<literal>/etc/NetworkManager/system-connections/</literal>ディレクトリにファイルとして保存されます。
pt_br: O NetworkManager armazena as configurações de rede como arquivos de conexão que contêm o estado desejado. Essas conexões são armazenadas como arquivos no diretório <literal>/etc/NetworkManager/system-connections/</literal>.
zh_cn: NetworkManager 将网络配置存储为包含期望状态的连接文件。这些连接以文件的形式存储在 <literal>/etc/NetworkManager/system-connections/</literal> 目录中。

source: Details about NetworkManager can be found in the <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-network-configuration/index.html">SUSE Linux Micro documentation</link>.
es: Encontrará más información sobre NetworkManager en la <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-network-configuration/index.html">documentación de SUSE Linux Micro</link>.
ja: NetworkManagerの詳細については、<link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-network-configuration/index.html">SUSE Linux Microのドキュメント</link>を参照してください。
pt_br: Os detalhes sobre o NetworkManager estão disponíveis na <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-network-configuration/index.html">documentação do SUSE Linux Micro</link>.
zh_cn: 有关 NetworkManager 的详细信息，请参见 <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-network-configuration/index.html">SUSE Linux Micro 文档</link>。

source: Overview of nmstate
es: Descripción general de nmstate
ja: nmstateの概要
pt_br: Visão geral do nmstate
zh_cn: nmstate 概述
