Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: View the logs of the component specific pod:
es: Consulte los registros del pod específico del componente:
ja: コンポーネント固有のPodのログを表示します。
pt_br: Exiba os registros do pod específico do componente:
zh_cn: 查看特定组件 Pod 的日志：

source: Known Limitations
es: Limitaciones conocidas
ja: 既知の制限事項
pt_br: Limitações conhecidas
zh_cn: 已知限制

source: Downstream cluster upgrades are not yet managed by the Upgrade Controller. For information on how to upgrade downstream clusters, refer to <xref linkend="day2-downstream-clusters"/>.
es: Las actualizaciones de clústeres descendentes aún no se gestionan mediante Upgrade Controller. Para obtener información sobre cómo actualizar clústeres descendentes, consulte el <xref linkend="day2-downstream-clusters"/>.
ja: ダウンストリームクラスタのアップグレードはUpgrade Controllerによってまだ管理されていません。ダウンストリームクラスタをアップグレードする方法については、<xref linkend="day2-downstream-clusters"/>を参照してください。
pt_br: Os upgrades de clusters downstream ainda não são gerenciados pelo Controller de upgrade. Para obter mais informações sobre como fazer upgrade de clusters downstream, consulte o <xref linkend="day2-downstream-clusters"/>.
zh_cn: 下游群集的升级目前还不受升级控制器管理。有关如何升级下游群集的信息，请参见<xref linkend="day2-downstream-clusters"/>。

source: The Upgrade Controller expects any additional SUSE Edge Helm charts that are deployed through EIB (<xref linkend="components-eib"/>) to have their <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link> deployed in the <literal>kube-system</literal> namespace. To do this, configure the <literal>installationNamespace</literal> property in your EIB definition file. For more information, see the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">upstream</link> documentation.
es: Upgrade Controller espera que cualquier chart de Helm de SUSE Edge adicional que se despliegue a través de EIB (<xref linkend="components-eib"/>) tenga su <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">CR de HelmChart</link> desplegada en el espacio de nombres <literal>kube-system</literal>. Para ello, configure la propiedad <literal>installationNamespace</literal> en su archivo de definición de EIB. Para obtener más información, consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">documentación original</link>.
ja: Upgrade Controllerは、 EIB (<xref linkend="components-eib"/>)を通じてデプロイされる追加のSUSE Edge Helmチャートについて、その<link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link>が<literal>kube-system</literal>ネームスペースにデプロイされていることを想定しています。これを実行するには、EIB定義ファイルで<literal>installationNamespace</literal>プロパティを設定します。詳細については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">アップストリーム</link>ドキュメントを参照してください。
pt_br: O Controller de upgrade espera que os gráficos Helm adicionais do SUSE Edge implantados pelo EIB (<xref linkend="components-eib"/>) tenham o <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link> implantado no namespace <literal>kube-system</literal>. Para isso, configure a propriedade <literal>installationNamespace</literal> no arquivo de definição do EIB. Para obter mais informações, consulte a documentação <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">upstream</link>.
zh_cn: 升级控制器希望通过 EIB（<xref linkend="components-eib"/>）部署的任何其他 SUSE Edge Helm chart 将其 <link xl:href="https://docs.rke2.io/helm#using-the-helm-crd">HelmChart CR</link> 部署在 <literal>kube-system</literal> 名称空间中。为此，请在 EIB 定义文件中配置 <literal>installationNamespace</literal> 属性。有关详细信息，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">上游</link>文档。

source: Currently the Upgrade Controller has no way to determine the current running Edge release version on the management cluster. Ensure to provide an Edge release version that is greater than the currently running Edge release version on the cluster.
es: Actualmente, Upgrade Controller no tiene forma de determinar la versión actual de Edge que se está ejecutando en el clúster de gestión. Asegúrese de proporcionar una versión de Edge superior a la versión actual que se está ejecutando en el clúster.
ja: 現在、Upgrade Controllerには、管理クラスタで現在実行中のEdgeリリースバージョンを判断する方法がありません。クラスタで現在実行しているEdgeリリースバージョンより大きいEdgeリリースバージョンを指定するようにしてください。
pt_br: Atualmente, o Controller de upgrade não tem como determinar a versão de lançamento do Edge que está em execução no cluster de gerenciamento. Insira uma versão de lançamento do Edge superior àquela que está em execução no cluster.
zh_cn: 目前，升级控制器无法确定管理群集上当前运行的 Edge 版本。请确保提供的 Edge 版本高于群集上当前运行的 Edge 版本。

source: Currently the Upgrade Controller supports <emphasis role="strong">non air-gapped</emphasis> environment upgrades only. <emphasis role="strong">Air-gapped</emphasis> upgrades are not yet possible.
es: Actualmente, Upgrade Controller solo admite actualizaciones en entornos <emphasis role="strong">no aislados</emphasis>. Aún no es posible realizar actualizaciones en <emphasis role="strong">entornos aislados</emphasis>.
ja: 現在、Upgrade Controllerは、<emphasis role="strong">非エアギャップ</emphasis>環境のアップグレードのみをサポートしています。<emphasis role="strong">エアギャップ</emphasis>アップグレードは、まだ可能ではありません。
pt_br: Atualmente, o Controller de upgrade oferece suporte apenas a upgrades de ambientes <emphasis role="strong">não air-gapped</emphasis>. Os upgrades <emphasis role="strong">air-gapped</emphasis> ainda não são possíveis.
zh_cn: 目前，升级控制器仅支持<emphasis role="strong">非隔离</emphasis>环境升级，还不支持<emphasis role="strong">隔离式</emphasis>升级。

source: SUSE Multi-Linux Manager is included in SUSE Edge to provide automation and control for keeping SUSE Linux Micro as the underlying operating system consistently up-to-date on all nodes of your edge deployment.
es: SUSE Multi-Linux Manager está incluido en SUSE Edge y proporciona automatización y control con el fin de mantener el sistema operativo subyacente SUSE Linux Micro constantemente actualizado en todos los nodos de su despliegue periférico.
ja: SUSE Multi-Linux ManagerはSUSE Edgeに含まれており、エッジデプロイメントのすべてのノードでSUSE Linux Microを基盤となるオペレーティングシステムとして常に最新の状態に保つための自動化と制御を提供します。
pt_br: O SUSE Multi-Linux Manager está incluído no SUSE Edge para oferecer a automação e o controle que mantêm o sistema operacional SUSE Linux Micro subjacente sempre atualizado em todos os nós da implantação de borda.
zh_cn: SUSE Edge 中包含 SUSE Multi-Linux Manager，其作用是提供自动化与控制能力，确保边缘部署的所有节点上作为底层操作系统的 SUSE Linux Micro 始终保持最新状态。

source: For more information please refer to the <xref linkend="quickstart-suma"/> and the <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUSE Multi-Linux Manager Documentation</link>.
es: Para obtener más información, consulte el <xref linkend="quickstart-suma"/> y la <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">documentación de SUSE Multi-Linux Manager</link>.
ja: 詳細については、<xref linkend="quickstart-suma"/>と<link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUSE Multi-Linux Managerのドキュメント</link>を参照してください。
pt_br: Para obter mais informações, consulte o <xref linkend="quickstart-suma"/> e a <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">documentação do SUSE Multi-Linux Manager</link>.
zh_cn: 有关详细信息，请参见<xref linkend="quickstart-suma"/>和 <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUSE Multi-Linux Manager 文档</link>。

source: How-To Guides
es: Guías prácticas
ja: ハウツーガイド
pt_br: Guias de procedimentos
zh_cn: 操作指南

source: How-to guides and best practices
es: Guías y prácticas recomendadas
ja: ハウツーガイドとベストプラクティス
pt_br: Guias de procedimentos e melhores práticas
zh_cn: 操作指南和最佳实践

source: MetalLB on K3s (using Layer 2 Mode)
es: MetalLB en K3s (con el modo de capa 2)
ja: K3s上のMetalLB (レイヤ2モードを使用)
pt_br: MetalLB no K3s (usando o modo de camada 2)
zh_cn: K3s 上的 MetalLB（使用第 2 层模式）

source: In this guide, we demonstrate how to deploy MetalLB in layer 2 (L2) mode.
es: En esta guía se explica cómo desplegar MetalLB en el modo de capa 2 (L2).
ja: このガイドでは、MetalLBをレイヤ2 (L2)モードでデプロイする方法について説明します。
pt_br: Neste guia, demonstramos como implantar o MetalLB no modo de camada 2 (L2).
zh_cn: 本指南将展示如何以第 2 层 (L2) 模式部署 MetalLB。

source: Why use MetalLB
es: Por qué usar MetalLB
ja: MetalLBを使用する理由
zh_cn: 为何使用 MetalLB

source: MetalLB is a compelling choice for load balancing in bare-metal Kubernetes clusters for several reasons:
es: MetalLB es una opción conveniente para el equilibrio de carga en clústeres bare metal de Kubernetes por varias razones:
ja: MetalLBは、いくつかの理由により、ベアメタルKubernetesクラスタでの負荷分散に最適な選択肢です。
pt_br: O MetalLB é uma opção atrativa para balanceamento de carga em clusters Kubernetes bare metal por vários motivos:
zh_cn: 由于以下原因，MetalLB 成为了用来实现裸机 Kubernetes 群集负载平衡的较佳选择：

source: Native Integration with Kubernetes: MetalLB seamlessly integrates with Kubernetes, making it easy to deploy and manage using familiar Kubernetes tools and practices.
es: Integración nativa con Kubernetes: MetalLB se integra a la perfección con Kubernetes, lo que facilita el despliegue y la gestión mediante las herramientas y prácticas habituales de Kubernetes.
ja: Kubernetesとのネイティブ統合: MetalLBはKubernetesとシームレスに統合されており、使い慣れたKubernetesツールとプラクティスを使用して簡単にデプロイおよび管理できます。
pt_br: Integração nativa com o Kubernetes: o MetalLB se integra perfeitamente ao Kubernetes, o que facilita a implantação e o gerenciamento usando as ferramentas e práticas conhecidas do Kubernetes.
zh_cn: 与 Kubernetes 本机集成：MetalLB 可无缝与 Kubernetes 集成，让用户可使用熟悉的 Kubernetes 工具和方法轻松进行部署和管理。

source: Bare-Metal Compatibility: Unlike cloud-based load balancers, MetalLB is designed specifically for on-premises deployments where traditional load balancers might not be available or feasible.
es: Compatibilidad bare metal: a diferencia de los equilibradores de carga basados en la nube, MetalLB se ha diseñado específicamente para despliegues locales en las que los sistemas de equilibrio de carga tradicionales podrían no estar disponibles o no ser viables.
ja: ベアメタルとの互換性: クラウドベースのロードバランサとは異なり、MetalLBは、従来のロードバランサが利用できない、または実現できないオンプレミスデプロイメント向けに特別に設計されています。
pt_br: Compatibilidade com bare metal: ao contrário dos balanceadores de carga com base na nuvem, o MetalLB foi especificamente projetado para implantações no local, em que os balanceadores de carga tradicionais podem não estar disponíveis ou ser viáveis.
zh_cn: 裸机兼容性：与基于云的负载平衡器不同，MetalLB 专门用于本地部署，在这种部署中，可能无法使用传统负载平衡器或使用传统负载平衡器不现实。

source: Supports Multiple Protocols: MetalLB supports both Layer 2 and BGP (Border Gateway Protocol) modes, providing flexibility for different network architectures and requirements.
es: Compatibilidad con múltiples protocolos: MetalLB admite el modo de capa 2 y BGP (Border Gateway Protocol, protocolo de gateway de frontera), lo que proporciona flexibilidad para diferentes arquitecturas y requisitos de red.
ja: 複数のプロトコルをサポート: MetalLBはレイヤ2モードとBGP (Border Gateway Protocol)モードの両方をサポートし、さまざまなネットワークアーキテクチャと要件に柔軟に対応します。
pt_br: Compatível com vários protocolos: o MetalLB é compatível com os modos de camada 2 e BGP (Border Gateway Protocol), proporcionando flexibilidade de acordo com as diferentes arquiteturas e requisitos de rede.
zh_cn: 支持多种协议：MetalLB 支持 Layer 2 和 BGP（边界网关协议）模式，提供了很大的灵活性，适合不同的网络架构并可满足不同的要求。

source: High Availability: By distributing load-balancing responsibilities across multiple nodes, MetalLB ensures high availability and reliability for your services.
es: Alta disponibilidad: dado que distribuye el equilibrio de carga entre varios nodos, MetalLB garantiza una alta disponibilidad y fiabilidad para sus servicios.
ja: 高可用性: MetalLBは、負荷分散の責任を複数のノードに分散することで、サービスの高可用性と信頼性を保証します。
pt_br: Alta disponibilidade: ao distribuir as responsabilidades de balanceamento de carga por vários nós, o MetalLB garante alta disponibilidade e confiabilidade aos seus serviços.
zh_cn: 高可用性：MetalLB 可以将负载平衡负担分散在多个节点中，从而确保服务的高可用性和可靠性。

source: Scalability: MetalLB can handle large-scale deployments, scaling alongside your Kubernetes cluster to meet increasing demand.
es: Escalabilidad: MetalLB puede manejar despliegues a gran escala, y se va adaptando con su clúster de Kubernetes para satisfacer la demanda creciente.
ja: スケーラビリティ: MetalLBは大規模なデプロイメントに対応し、Kubernetesクラスタに合わせてスケーリングして需要の増加に対応します。
pt_br: Escalabilidade: o MetalLB processa implantações de grande escala, ajustando a escala no cluster Kubernetes para atender à crescente demanda.
zh_cn: 可伸缩性：MetalLB 可以处理大规模部署，并且能够将 Kubernetes 群集扩容来满足日益增长的需求。

source: In layer 2 mode, one node assumes the responsibility of advertising a service to the local network. From the network’s perspective, it simply looks like that machine has multiple IP addresses assigned to its network interface.
es: En el modo de capa 2 (L2), un nodo asume la responsabilidad de anunciar un servicio a la red local. Desde la perspectiva de la red, simplemente parece que esa máquina tiene varias direcciones IP asignadas a su interfaz de red.
ja: レイヤ2モードでは、1つのノードがローカルネットワークにサービスをアドバタイズする責任を負います。ネットワークの視点からは、マシンのネットワークインタフェースに複数のIPアドレスが割り当てられているように見えます。
pt_br: No modo de camada 2, um nó assume a responsabilidade de anunciar um serviço para a rede local. Da perspectiva da rede, simplesmente parece que a máquina tem vários endereços IP atribuídos à interface de rede.
zh_cn: 在第 2 层模式下，一个节点负责向本地网络播发服务。从网络的角度看，似乎为该计算机的网络接口分配了多个 IP 地址。

source: The major advantage of the layer 2 mode is its universality: it works on any Ethernet network, with no special hardware required, not even fancy routers.
es: La mayor ventaja del modo de capa 2 es su universalidad: funciona en cualquier red Ethernet sin necesidad de hardware especial, ni siquiera de routers sofisticados.
ja: レイヤ2モードの主な利点は、その汎用性です。あらゆるEthernetネットワークで動作し、特別なハードウェアも、高価なルータも必要ありません。
pt_br: A maior vantagem do modo de camada 2 é a sua universalidade: ele funciona em qualquer rede Ethernet, sem a necessidade de hardware especial nem de roteadores sofisticados.
zh_cn: 第 2 层模式的主要优势在于其通用性：它可以在任何以太网上正常工作，不需要任何特殊硬件，甚至不需要各种形式的路由器。

source: MetalLB on K3s (using L2)
es: MetalLB en K3s (con L2)
ja: K3s上のMetalLB (L2を使用)
pt_br: MetalLB no K3s (usando L2)
zh_cn: K3s 上的 MetalLB（使用 L2）

source: In this quick start, L2 mode will be used. This means we do not need any special network equipment but three free IPs within the network range.
es: En este inicio rápido, se utilizará el modo L2. Esto significa que no se necesita equipo de red especial, solo tres IP libres dentro del rango de red.
ja: このクイックスタートではL2モードを使用します。つまり、特別なネットワーク機器は必要ありませんが、ネットワーク範囲内の空きIPが3つ必要です。
pt_br: Neste início rápido, o modo L2 será usado. Isso significa que não precisamos de nenhum equipamento de rede especial, mas de três IPs livres no intervalo de rede.
zh_cn: 本快速入门将使用 L2 模式。这意味着我们不需要任何特殊网络设备，只需使用网络范围内的三个空闲 IP。

source: A K3s cluster where MetalLB is going to be deployed.
es: Un clúster K3s donde se vaya a desplegar MetalLB.
ja: MetalLBがデプロイされるK3sクラスタ。
pt_br: Um cluster K3s no qual o MetalLB será implantado.
zh_cn: 要部署 MetalLB 的 K3s 群集。

source: K3S comes with its own service load balancer named Klipper. You <link xl:href="https://metallb.universe.tf/configuration/k3s/">need to disable it to run MetalLB</link>. To disable Klipper, K3s needs to be installed using the <literal>--disable=servicelb</literal> flag.
es: K3S incluye su propio equilibrador de carga de servicios llamado Klipper. <link xl:href="https://metallb.universe.tf/configuration/k3s/">Debe inhabilitarlo para ejecutar MetalLB</link>. Para inhabilitar Klipper, hay que instalar K3s mediante el indicador <literal>--disable=servicelb</literal>.
ja: K3sには、Klipperという名前の独自のサービスロードバランサが付属しています。<link xl:href="https://metallb.universe.tf/configuration/k3s/">MetalLBを実行するにはKlipperを無効にする必要があります</link>。Klipperを無効にするには、<literal>--disable=servicelb</literal>フラグを使用してK3sをインストールする必要があります。
pt_br: O K3S vem com o próprio balanceador de carga de serviço chamado Klipper. Você <link xl:href="https://metallb.universe.tf/configuration/k3s/">precisa desabilitá-lo para executar o MetalLB</link>. Para desabilitar o Klipper, o K3s precisa ser instalado com o sinalizador <literal>--disable=servicelb</literal>.
zh_cn: K3S 自身附带服务负载平衡器（名为 Klipper）。需要<link xl:href="https://metallb.universe.tf/configuration/k3s/">禁用 Klipper 才能运行 MetalLB</link>。要禁用 Klipper，需使用 <literal>--disable=servicelb</literal> 标志安装 K3s。

source: Three free IP adressess within the network range. In this example <literal>192.168.122.10-192.168.122.12</literal>
es: Tres direcciones IP libres dentro del rango de red. En este ejemplo <literal>192.168.122.10-192.168.122.12</literal>
ja: ネットワーク範囲内の3つの空きIPアドレス。この例では <literal>192.168.122.10-192.168.122.12</literal>
pt_br: Três endereços IP livres dentro do intervalo de rede. Neste exemplo, <literal>192.168.122.10-192.168.122.12</literal>
zh_cn: 网络范围内的三个空闲 IP 地址。在本示例中为 <literal>192.168.122.10-192.168.122.12</literal>

source: You must make sure these IP addresses are unassigned. In a DHCP environment these addresses must not be part of the DHCP pool to avoid dual assignments.
es: Debe asegurarse de que esas direcciones IP no están asignadas. En un entorno DHCP esas direcciones no deben formar parte del pool DHCP para evitar dobles asignaciones.
ja: これらのIPアドレスが未割り当てであることを確認する必要があります。DHCP環境では、二重割り当てを避けるため、これらのアドレスをDHCPプールに含めないでください。
pt_br: Garanta que esses endereços IP não estejam atribuídos. Em um ambiente DHCP, esses endereços não devem fazer parte do pool DHCP para evitar atribuições duplas.
zh_cn: 必须确保这三个 IP 地址未被分配。在 DHCP 环境中，为了避免出现双重分配情况，不得将这些地址添加到 DHCP 池中。

source: We will be using the MetalLB Helm chart published as part of the SUSE Edge solution:
es: Utilizaremos el chart de Helm de MetalLB publicado como parte de la solución SUSE Edge:
ja: SUSEでは、SUSE Edgeソリューションの一部として公開されているMetalLB Helmチャートを使用します。
pt_br: Vamos usar o gráfico Helm do MetalLB publicado como parte da solução SUSE Edge:
zh_cn: 我们将使用作为 SUSE Edge 解决方案一部分发布的 MetalLB Helm chart：

source: Configuration
es: Configuración
ja: 設定
pt_br: Configuração
zh_cn: 配置

source: At this point, the installation is completed. Now it is time to <link xl:href="https://metallb.universe.tf/configuration/">configure</link> using our example values:
es: En este punto, la instalación ya está completa. Ahora hay que <link xl:href="https://metallb.universe.tf/configuration/">configurarla</link> con nuestros valores de ejemplo:
ja: この時点でインストールは完了しています。次に、サンプル値を使用して<link xl:href="https://metallb.universe.tf/configuration/">設定</link>を行います。
pt_br: Neste ponto, a instalação foi concluída. Agora é hora de <link xl:href="https://metallb.universe.tf/configuration/">configurar</link> usando nossos valores de exemplo:
zh_cn: 安装现已完成。接下来请使用示例值进行<link xl:href="https://metallb.universe.tf/configuration/">配置</link>：

source: Now, it is ready to be used. You can customize many things for L2 mode, such as:
es: Ahora, está lista para usarse. Es posible personalizar muchas cosas en el modo L2, por ejemplo:
ja: これで、MetalLBを使用する準備ができました。L2モードでは、次のようにさまざまな設定をカスタマイズできます。
pt_br: Agora ele está pronto para uso. É possível personalizar vários componentes no modo L2, por exemplo:
zh_cn: 现在，MetalLB 可供您使用。可以自定义 L2 模式的许多设置，例如：

source: <link xl:href="https://metallb.universe.tf/usage/#ipv6-and-dual-stack-services">IPv6 And Dual Stack Services</link>
es: <link xl:href="https://metallb.universe.tf/usage/#ipv6-and-dual-stack-services">La IPv6 y los servicios de doble pila</link>
ja: <link xl:href="https://metallb.universe.tf/usage/#ipv6-and-dual-stack-services">IPv6とデュアルスタックサービス</link>
pt_br: <link xl:href="https://metallb.universe.tf/usage/#ipv6-and-dual-stack-services">Serviços IPv6 e de pilha dupla</link>
zh_cn: <link xl:href="https://metallb.universe.tf/usage/#ipv6-and-dual-stack-services">IPv6 和双栈服务</link>

source: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#controlling-automatic-address-allocation">Control automatic address allocation</link>
es: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#controlling-automatic-address-allocation">El control de la asignación automática de direcciones</link>
ja: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#controlling-automatic-address-allocation">アドレスの自動割り当てを制御する</link>
pt_br: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#controlling-automatic-address-allocation">Controlar a alocação de endereços automática</link>
zh_cn: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#controlling-automatic-address-allocation">控制自动地址分配</link>

source: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">Reduce the scope of address allocation to specific namespaces and services</link>
es: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">La reducción del alcance de la asignación de direcciones a espacios de nombres y servicios específicos</link>
ja: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">アドレス割り当ての範囲を特定のネームスペースとサービスに縮小する</link>
pt_br: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">Reduzir o escopo da alocação de endereços para namespaces e serviços específicos</link>
zh_cn: <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">将地址分配范围缩小为特定的名称空间和服务</link>

source: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#limiting-the-set-of-nodes-where-the-service-can-be-announced-from">Limiting the set of nodes where the service can be announced from</link>
es: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#limiting-the-set-of-nodes-where-the-service-can-be-announced-from">La limitación del conjunto de nodos desde los que se puede anunciar el servicio</link>
ja: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#limiting-the-set-of-nodes-where-the-service-can-be-announced-from">サービスをアナウンスできるノードのセットを制限する</link>
pt_br: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#limiting-the-set-of-nodes-where-the-service-can-be-announced-from">Limitando o conjunto de nós dos quais o serviço pode ser anunciado</link>
zh_cn: <link xl:href="https://metallb.universe.tf/configuration/_advanced_l2_configuration/#limiting-the-set-of-nodes-where-the-service-can-be-announced-from">限制可从中声明服务的节点集</link>
