Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The <literal>RKE2ControlPlane</literal> object specifies the control-plane configuration to be used and the <literal>Metal3MachineTemplate</literal> object specifies the control-plane image to be used. Also, it contains the information about the number of replicas to be used (in this case, one) and the <literal>CNI</literal> plug-in to be used (in this case, <literal>Cilium</literal>). The agentConfig block contains the <literal>Ignition</literal> format to be used and the <literal>additionalUserData</literal> to be used to configure the <literal>RKE2</literal> node with information like a systemd named <literal>rke2-preinstall.service</literal> to replace automatically the <literal>BAREMETALHOST_UUID</literal> and <literal>node-name</literal> during the provisioning process using the Ironic information. To enable multus with cilium a file is created in the <literal>rke2</literal> server manifests directory named <literal>rke2-cilium-config.yaml</literal> with the configuration to be used. The last block of information contains the Kubernetes version to be used. <literal>${RKE2_VERSION}</literal> is the version of <literal>RKE2</literal> to be used replacing this value (for example, <literal>v1.33.3+rke2r1</literal>).
es: El objeto <literal>RKE2ControlPlane</literal> especifica la configuración de plano de control que se va a utilizar y el objeto <literal>Metal3MachineTemplate</literal> especifica la imagen de plano de control que se va a utilizar. Además, contiene la información sobre el número de réplicas que se utilizarán (en este caso, una) y el complemento de <literal>CNI</literal> que se usará (en este caso, <literal>Cilium</literal>). El bloque agentConfig contiene el formato de <literal>Ignition</literal> que se va a usar y el objeto <literal>additionalUserData</literal> que se va a usar para configurar el nodo <literal>RKE2</literal> con información como un servicio systemd denominado <literal>rke2-preinstall.service</literal> para sustituir automáticamente <literal>BAREMETALHOST_UUID</literal> y <literal>node-name</literal> durante el proceso de aprovisionamiento utilizando la información de Ironic. Para habilitar Multus con Cilium, se crea un archivo en el directorio de manifiestos del servidor <literal>rke2</literal> llamado <literal>rke2-cilium-config.yaml</literal> con la configuración que se va a usar. El último bloque de información contiene la versión de Kubernetes que se va a usar. <literal>${RKE2_VERSION}</literal> es la versión de <literal>RKE2</literal> que se va a usar en sustitución de este valor (por ejemplo, <literal>v1.33.3+rke2r1</literal>).
ja: <literal>RKE2ControlPlane</literal>オブジェクトには、使用するコントロールプレーン設定を指定し、<literal>Metal3MachineTemplate</literal>オブジェクトには、使用するコントロールプレーンのイメージを指定します。また、ここには使用するレプリカの数(ここでは1)と、使用する<literal>CNI</literal>プラグイン(ここでは<literal>Cilium</literal>)に関する情報が含まれています。agentConfigブロックには、使用する <literal>Ignition</literal>形式と、使用する<literal>additionalUserData</literal>が含まれます。これを使用して<literal>RKE2</literal>ノードに<literal>rke2-preinstall.service</literal>という名前のsystemdサービスを設定し、プロビジョニングプロセス中にIronicの情報を使用して<literal>BAREMETALHOST_UUID</literal>と<literal>node-name</literal>を自動的に置き換えます。ciliumでmultusを有効にするには、使用する設定を含むファイルを <literal>rke2</literal>サーバマニフェストディレクトリに<literal>rke2-cilium-config.yaml</literal>という名前で作成します。最後の情報ブロックには、使用するKubernetesバージョンが含まれています。<literal>${RKE2_VERSION}</literal>は使用する<literal>RKE2</literal>のバージョンであり、この値は置き換えます(例: <literal>v1.33.3+rke2r1</literal>)。
zh_cn: <literal>RKE2ControlPlane</literal> 对象指定要使用的控制平面配置，<literal>Metal3MachineTemplate</literal> 对象指定要使用的控制平面映像。此外，它还包含有关要使用的复本数（在本示例中为 1）以及要使用的 <literal>CNI</literal> 插件（在本示例中为 <literal>Cilium</literal>）的信息。agentConfig 块包含要使用的 <literal>Ignition</literal> 格式，以及用于配置 <literal>RKE2</literal> 节点的 <literal>additionalUserData</literal>，其中包含诸如 systemd 服务（名为 <literal>rke2-preinstall.service</literal>）之类的信息，该服务会在置备过程中使用 Ironic 信息自动替换 <literal>BAREMETALHOST_UUID</literal> 和 <literal>node-name</literal>。为了启用 Cilium 相关的 Multus 功能，需在 <literal>rke2</literal> 服务器清单目录中创建名为 <literal>rke2-cilium-config.yaml</literal> 的文件，并在其中包含要使用的配置。最后一部分信息包含要使用的 Kubernetes 版本。<literal>${RKE2_VERSION}</literal> 是要使用的 <literal>RKE2</literal> 版本，请替换此值（例如替换为 <literal>v1.33.3+rke2r1</literal>）。

source: The <literal>Metal3MachineTemplate</literal> object specifies the following information:
es: El objeto <literal>Metal3MachineTemplate</literal> especifica la información siguiente:
ja: <literal>Metal3MachineTemplate</literal>オブジェクトには次の情報を指定します。
pt_br: O objeto <literal>Metal3MachineTemplate</literal> especifica as seguintes informações:
zh_cn: <literal>Metal3MachineTemplate</literal> 对象指定以下信息：

source: The <literal>dataTemplate</literal> to be used as a reference to the template.
es: La plantilla de datos (<literal>dataTemplate</literal>) que se usará como referencia para la plantilla.
ja: テンプレートへの参照として使用する<literal>dataTemplate</literal>。
pt_br: O <literal>dataTemplate</literal> para usar como referência para o gabarito.
zh_cn: <literal>dataTemplate</literal>，用作对模板的引用。

source: The <literal>hostSelector</literal> to be used matching with the label created during the enrollment process.
es: El selector de host (<literal>hostSelector</literal>) que se usará que coincida con la etiqueta creada durante el proceso de inscripción.
ja: 登録プロセス中に作成されたラベルとの一致に使用する<literal>hostSelector</literal>。
pt_br: O <literal>hostSelector</literal> a ser usado correspondente ao rótulo criado durante o processo de registro.
zh_cn: <literal>hostSelector</literal>，在与登记过程中创建的标签匹配时使用。

source: The <literal>image</literal> to be used as a reference to the image generated using <literal>EIB</literal> on the previous section (<xref linkend="eib-edge-image-connected"/>), and the <literal>checksum</literal> and <literal>checksumType</literal> to be used to validate the image.
es: La imagen (<literal>image</literal>) que se usará como referencia para la imagen generada mediante <literal>EIB</literal> en la sección anterior (<xref linkend="eib-edge-image-connected"/>), y la suma de comprobación (<literal>checksum</literal>) y el tipo de suma (<literal>checksumType</literal>) que se usarán para validar la imagen.
ja: 前のセクション(<xref linkend="eib-edge-image-connected"/>)で<literal>EIB</literal>を使用して生成されたイメージへの参照として使用する<literal>image</literal>、およびそのイメージを検証するために使用する<literal>checksum</literal>と<literal>checksumType</literal>。
pt_br: A <literal>image</literal> que será usada como referência à imagem gerada pelo <literal>EIB</literal> na seção anterior (<xref linkend="eib-edge-image-connected"/>), e o <literal>checksum</literal> e o <literal>checksumType</literal> usados para validar a imagem.
zh_cn: <literal>image</literal>，用作对上一节（<xref linkend="eib-edge-image-connected"/>）中使用 <literal>EIB</literal> 生成的映像的引用；<literal>checksum</literal> 和 <literal>checksumType</literal>，用于验证映像。

source: The <literal>Metal3DataTemplate</literal> object specifies the <literal>metaData</literal> for the downstream cluster.
es: El objeto <literal>Metal3DataTemplate</literal> especifica los metadatos (<literal>metaData</literal>) para el clúster descendente.
ja: <literal>Metal3DataTemplate</literal>オブジェクトには、ダウンストリームクラスタの<literal>metaData</literal>を指定します。
pt_br: O objeto <literal>Metal3DataTemplate</literal> especifica o <literal>metaData</literal> para o cluster downstream.
zh_cn: <literal>Metal3DataTemplate</literal> 对象指定下游群集的 <literal>metaData</literal>。

source: Once the file is created by joining the previous blocks, the following command must be executed in the management cluster to start provisioning the new bare-metal host:
es: Una vez creado el archivo uniendo los bloques anteriores, se debe ejecutar el comando siguiente en el clúster de gestión para iniciar el aprovisionamiento del nuevo host bare metal:
ja: 前のブロックを結合してファイルを作成したら、管理クラスタで次のコマンドを実行して、新しいベアメタルホストのプロビジョニングを開始する必要があります。
pt_br: Após a criação do arquivo unindo os blocos anteriores, execute o seguinte comando no cluster de gerenciamento para iniciar o provisionamento do novo host bare metal:
zh_cn: 通过合并上述块创建该文件后，必须在管理群集中执行以下命令才能开始置备新的裸机主机：

source: Downstream cluster provisioning with Directed network provisioning (multi-node)
es: Aprovisionamiento de clústeres descendentes con aprovisionamiento de red dirigida (varios nodos)
ja: ダイレクトネットワークプロビジョニングを使用したダウンストリームクラスタのプロビジョニング(マルチノード)
pt_br: Provisionamento de cluster downstream com provisionamento de rede direcionado (vários nós)
zh_cn: 使用定向网络置备来置备下游群集（多节点）

source: This section describes the workflow used to automate the provisioning of a multi-node downstream cluster using directed network provisioning and <literal>MetalLB</literal> as a load-balancer strategy. This is the simplest way to automate the provisioning of a downstream cluster. The following diagram shows the workflow used to automate the provisioning of a multi-node downstream cluster using directed network provisioning and <literal>MetalLB</literal>.
es: En esta sección se describe el flujo de trabajo usado para automatizar el aprovisionamiento de un clúster descendente de varios nodos con el método de aprovisionamiento de red dirigida y <literal>MetalLB</literal> como equilibrador de carga. Esta es la forma más sencilla de automatizar el aprovisionamiento de un clúster descendente. El siguiente diagrama muestra el flujo de trabajo utilizado para automatizar el aprovisionamiento de un clúster descendente de varios nodos con el método de aprovisionamiento de red dirigida y <literal>MetalLB</literal>.
ja: このセクションでは、ダイレクトネットワークプロビジョニングと<literal>MetalLB</literal>をロードバランサ戦略として使用して、マルチノードのダウンストリームクラスタのプロビジョニングを自動化するために使用するワークフローについて説明します。これはダウンストリームクラスタのプロビジョニングを自動化する最もシンプルな方法です。次の図は、ダイレクトネットワークプロビジョニングと<literal>MetalLB</literal>を使用してマルチノードのダウンストリームクラスタのプロビジョニングを自動化するためのワークフローを示しています。
pt_br: Esta seção descreve o fluxo de trabalho usado para automatizar o provisionamento de um cluster downstream de vários nós usando o provisionamento de rede direcionado e o <literal>MetalLB</literal> como estratégia de balanceador de carga. Essa é a maneira mais simples de automatizar o provisionamento de clusters downstream. O diagrama abaixo mostra o fluxo de trabalho usado para automatizar o provisionamento de um cluster downstream de vários nós usando o provisionamento de rede direcionado e o <literal>MetalLB</literal>.
zh_cn: 本节介绍用于通过定向网络置备和 <literal>MetalLB</literal>（用作负载平衡器策略）自动置备多节点下游群集的工作流程。这是自动置备下游群集的最简单的方法。下图显示了用于通过定向网络置备和 <literal>MetalLB</literal> 自动置备多节点下游群集的工作流程。

source: The management server created and available to be used on the following sections. For more information, refer to the Management Cluster section: <xref linkend="atip-management-cluster"/>.
es: El servidor de gestión creado y disponible para su uso en las siguientes secciones. Para obtener más información, consulte la sección Clúster de gestión ( <xref linkend="atip-management-cluster"/>).
ja: 管理サーバが作成されていて、次の各セクションで使用できるようになっている。詳細については、管理クラスタに関するセクション<xref linkend="atip-management-cluster"/>を参照してください。
pt_br: O servidor de gerenciamento criado e disponível para uso nas seções a seguir. Para obter mais informações, consulte a seção sobre o cluster de gerenciamento: <xref linkend="atip-management-cluster"/>.
zh_cn: 管理服务器已创建并可在后续章节中使用。有关详细信息，请参见管理群集相关的一章：<xref linkend="atip-management-cluster"/>。

source: The following diagram shows the workflow used to automate the provisioning of a multi-node downstream cluster using directed network provisioning:
es: El diagrama siguiente muestra el flujo de trabajo usado para automatizar el aprovisionamiento de un clúster descendente de varios nodos con el método de aprovisionamiento de red dirigida:
ja: 次の図は、ダイレクトネットワークプロビジョニングを使用してマルチノードのダウンストリームクラスタのプロビジョニングを自動化するために使用するワークフローを示しています。
pt_br: O diagrama a seguir mostra o fluxo de trabalho usado para automatizar o provisionamento de um cluster downstream de vários nós por meio do provisionamento de rede direcionado:
zh_cn: 下图显示了用于通过定向网络置备自动置备多节点下游群集的工作流程：

source: atip automate multinode1
es: atip automatizado de varios nodos 1
ja: atip自動化マルチノード1
pt_br: váriosnós1 automatizar atip
zh_cn: ATIP 多节点群集自动置备 1

source: Enroll the three bare-metal hosts to make them available for the provisioning process.
es: Inscriba los tres hosts bare metal para que estén disponibles para el proceso de aprovisionamiento.
ja: 3つのベアメタルホストを登録し、プロビジョニングプロセスで使用できるようにする。
pt_br: Registre os três hosts bare metal para disponibilizá-los ao processo de provisionamento.
zh_cn: 登记三个裸机主机，使其在置备过程中可用。

source: Provision the three bare-metal hosts to install and configure the operating system and the Kubernetes cluster using <literal>MetalLB</literal>.
es: Aprovisione los tres hosts bare metal para instalar y configurar el sistema operativo y el clúster de Kubernetes con <literal>MetalLB</literal>.
ja: 3つのベアメタルホストをプロビジョニングし、オペレーティングシステムと、<literal>MetalLB</literal>を使用するKubernetesクラスタをインストールして設定する。
pt_br: Provisione os três hosts bare metal para instalar e configurar o sistema operacional e o cluster Kubernetes usando o <literal>MetalLB</literal>.
zh_cn: 置备三个裸机主机，以使用 <literal>MetalLB</literal> 安装并配置操作系统和 Kubernetes 群集。

source: <emphasis role="strong">Enroll the bare-metal hosts</emphasis>
es: <emphasis role="strong">Inscripción de los hosts bare metal</emphasis>
ja: <emphasis role="strong">ベアメタルホストの登録</emphasis>
pt_br: <emphasis role="strong">Registrar os hosts bare metal</emphasis>
zh_cn: <emphasis role="strong">登记裸机主机</emphasis>

source: The first step is to enroll the three bare-metal hosts in the management cluster to make them available to be provisioned. To do that, the following files (<literal>bmh-example-node1.yaml</literal>, <literal>bmh-example-node2.yaml</literal> and <literal>bmh-example-node3.yaml</literal>) must be created in the management cluster, to specify the <literal>BMC</literal> credentials to be used and the <literal>BaremetalHost</literal> object to be enrolled in the management cluster.
es: El primer paso es inscribir los tres hosts bare metal en el clúster de gestión para que estén disponibles para su aprovisionamiento. Para ello, se deben crear los archivos <literal>bmh-example-node1.yaml</literal>, <literal>bmh-example-node2.yaml</literal> y <literal>bmh-example-node3.yaml</literal> en el clúster de gestión para especificar las credenciales de <literal>BMC</literal> que se van a utilizar y el objeto <literal>BaremetalHost</literal> que se va a inscribir en el clúster de gestión.
ja: 最初の手順では、管理クラスタに3つのベアメタルホストを登録してプロビジョニングできるようにします。そのためには、管理クラスタにファイル<literal>bmh-example-node1.yaml</literal>、<literal>bmh-example-node2.yaml</literal>、および<literal>bmh-example-node3.yaml</literal>を作成して、使用する<literal>BMC</literal>資格情報と、管理クラスタに登録する<literal>BaremetalHost</literal>オブジェクトを指定する必要があります。
pt_br: A primeira etapa é registrar os três hosts bare metal no cluster de gerenciamento para disponibilizá-los para provisionamento. Para fazer isso, é necessário criar estes arquivos (<literal>bmh-example-node1.yaml</literal>, <literal>bmh-example-node2.yaml</literal> e <literal>bmh-example-node3.yaml</literal>) no cluster de gerenciamento, para especificar as credenciais que serão usadas do <literal>BMC</literal> e o objeto <literal>BaremetalHost</literal> para registro no cluster de gerenciamento.
zh_cn: 第一步是在管理群集中登记三个裸机主机，使其可供置备。为此，必须在管理群集中创建以下文件（<literal>bmh-example-node1.yaml</literal>、<literal>bmh-example-node2.yaml</literal> 和 <literal>bmh-example-node3.yaml</literal>），以指定要使用的 <literal>BMC</literal> 身份凭证，以及要在管理群集中登记的 <literal>BaremetalHost</literal> 对象。

source: Only the values between <literal>$\{…​\}</literal> have to be replaced with the real values.
es: Solo los valores entre <literal>$\{…​\}</literal> deben sustituirse por los valores reales.
ja: 実際の値に置き換える必要があるのは、<literal>$\{…​\}</literal>の中の値だけです。
pt_br: Apenas os valores entre <literal>$\{…​\}</literal> devem ser substituídos pelos valores reais.
zh_cn: 只需将 <literal>${...}</literal> 中的值替换为实际值。

source: We will walk you through the process for only one host. The same steps apply to the other two nodes.
es: Le guiaremos por el proceso para un solo host. Los mismos pasos se aplican a los otros dos nodos.
ja: 1つのホストのプロセスについてのみ説明します。他の2つのノードにも同じ手順が適用されます。
pt_br: Vamos orientar você apenas pelo processo de um host. As mesmas etapas são válidas para os outros dois nós.
zh_cn: 本节只会指导您完成一个主机的置备过程。这些步骤同样适用于另外两个节点。

source: Where:
es: Donde:
ja: 各項目の内容は次のとおりです。
pt_br: Em que:
zh_cn: 其中:

source: <literal>${BMC_NODE1_USERNAME}</literal> — The username for the BMC of the first bare-metal host.
es: <literal>${BMC_NODE1_USERNAME}</literal>: es el nombre de usuario para el BMC del primer host bare metal.
ja: <literal>${BMC_NODE1_USERNAME}</literal> — 最初のベアメタルホストのBMCのユーザ名。
pt_br: <literal>${BMC_NODE1_USERNAME}</literal>: o nome de usuário para o BMC do primeiro host bare metal.
zh_cn: <literal>${BMC_NODE1_USERNAME}</literal> — 第一个裸机主机的 BMC 用户名。

source: <literal>${BMC_NODE1_PASSWORD}</literal> — The password for the BMC of the first bare-metal host.
es: <literal>${BMC_NODE1_PASSWORD}</literal>: es la contraseña para el BMC del primer host bare metal.
ja: <literal>${BMC_NODE1_PASSWORD}</literal> — 最初のベアメタルホストのBMCのパスワード。
pt_br: <literal>${BMC_NODE1_PASSWORD}</literal>: a senha para o BMC do primeiro host bare metal.
zh_cn: <literal>${BMC_NODE1_PASSWORD}</literal> — 第一个裸机主机的 BMC 口令。

source: <literal>${BMC_NODE1_MAC}</literal> — The MAC address of the first bare-metal host to be used.
es: <literal>${BMC_NODE1_MAC}</literal>: es la dirección MAC del primer host bare metal que se utilizará.
ja: <literal>${BMC_NODE1_MAC}</literal> — 使用する最初のベアメタルホストのMACアドレス。
pt_br: <literal>${BMC_NODE1_MAC}</literal>: o endereço MAC do primeiro host bare metal que será usado.
zh_cn: <literal>${BMC_NODE1_MAC}</literal> — 第一个裸机主机的要使用的 MAC 地址。

source: <literal>${BMC_NODE1_ADDRESS}</literal> — The URL for the first bare-metal host BMC (for example, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). The host part of the URL can be an IP address (v4 or v6) or a domain name, where the existing infrastructure allows. To learn more about the different options available depending on your hardware provider, check the following <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">link</link>.
es: <literal>${BMC_NODE1_ADDRESS}</literal>: es la URL del primer host BMC bare metal (por ejemplo, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). La parte del host de la URL puede ser una dirección IP (v4 o v6) o un nombre de dominio, si la infraestructura existente lo permite. Para obtener más información sobre las opciones disponibles en función de su proveedor de hardware, consulte el siguiente <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">enlace</link>.
ja: <literal>${BMC_NODE1_ADDRESS}</literal> — 最初のベアメタルホストのBMCのURL (例: <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>)。URLのホスト部分は、既存のインフラストラクチャで許可されている場合、IPアドレス(v4またはv6)またはドメイン名とすることができます。ハードウェアプロバイダに応じて使用できる各種のオプションの詳細については、<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">こちらのリンク</link>を確認してください。
zh_cn: <literal>${BMC_NODE1_ADDRESS}</literal> — 第一个裸机主机 BMC 的 URL（例如 <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>）。URL 的主机部分可以是 IP 地址（v4 或 v6），也可以是域名（取决于现有体系结构是否支持）。要了解有关硬件提供商支持的不同选项的详细信息，请访问此<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">链接</link>。

source: Single-stack IPv6 clusters are in tech preview status and not yet officially supported.
es: Los clústeres de una sola pila IPv6 están en estado de tecnología en fase preliminar y aún no se admiten oficialmente.
ja: シングルスタックIPv6クラスタは技術プレビュー状態であり、まだ公式にはサポートされていません。
zh_cn: 单栈 IPv6 群集目前处于技术预览阶段，暂未提供正式支持。

source: All modern servers come with a dual-stack capable BMC, however IPv6 support (and possibly the option of using hostnames for the VirtualMedia capability) should be verified before use in production in a dual-stack environment.
es: Todos los servidores modernos incluyen un BMC compatible con doble pila, pero la compatibilidad con IPv6 (y, posiblemente, la opción de usar nombres de host para la capacidad de VirtualMedia) se debe verificar antes de usarse en producción en entornos de doble pila.
ja: すべての最新サーバにはデュアルスタック対応のBMCが搭載されていますが、デュアルスタック環境で運用する前に、IPv6のサポート(および仮想メディア機能にホスト名を使用するオプション)を確認する必要があります。
zh_cn: 所有现代服务器都配备支持双栈的 BMC，但在双栈环境中投入生产使用前，应验证其 IPv6 支持情况（以及虚拟媒体功能是否可能支持使用主机名）。

source: Once the file is created, the following command must be executed in the management cluster to start enrolling the bare-metal hosts in the management cluster:
es: Una vez creado el archivo, se debe ejecutar el comando siguiente en el clúster de gestión para comenzar a inscribir los hosts bare metal en el clúster de gestión:
ja: ファイルを作成したら、管理クラスタで次のコマンドを実行して、管理クラスタへのベアメタルホストの登録を開始する必要があります。
pt_br: Depois que o arquivo for criado, execute o seguinte comando no cluster de gerenciamento para iniciar o registro dos hosts bare metal:
zh_cn: 创建该文件后，必须在管理群集中执行以下命令，才能在管理群集中开始登记裸机主机：

source: The new bare-metal host objects are enrolled, changing their state from registering to inspecting and available. The changes can be checked using the following command:
es: Los nuevos objetos host bare metal se inscriben y cambian su estado de "registering" (en registro) a "inspecting" (en inspección) y "available" (disponible). Los cambios se pueden comprobar con el siguiente comando:
ja: 新しいベアメタルホストオブジェクトが登録され、その状態が「Registering (登録中)」から「Inspecting (検査中)」に変わり、「Available (使用可能)」になります。この変更は次のコマンドを使用して確認できます。
pt_br: Os novos objetos host bare metal serão registrados, o que altera o estado deles de "registrando" para "inspecionando" e "disponíveis". Para verificar as alterações, use o seguinte comando:
zh_cn: 随后会登记新裸机主机对象，其状态将从正在注册依次变为正在检查和可用。可使用以下命令检查状态变化：

source: Once the three bare-metal hosts are enrolled and available, the next step is to provision the bare-metal hosts to install and configure the operating system and the Kubernetes cluster, creating a load balancer to manage them. To do that, the following file (<literal>capi-provisioning-example.yaml</literal>) must be created in the management cluster with the following information (the `capi-provisioning-example.yaml can be generated by joining the following blocks).
es: Una vez que los tres hosts bare metal se han inscrito y están disponibles, el siguiente paso es aprovisionar los hosts bare metal para instalar y configurar el sistema operativo y el clúster de Kubernetes, creando un equilibrador de carga para gestionarlos. Para ello, se debe crear el archivo <literal>capi-provisioning-example.yaml</literal> en el clúster de gestión con la siguiente información (el archivo capi-provisioning-example.yaml se puede generar uniendo los siguientes bloques).
ja: 3つのベアメタルホストが登録されて使用可能になったら、次の手順は、ベアメタルホストをプロビジョニングしてオペレーティングシステムとKubernetesクラスタをインストールして設定し、ロードバランサを作成して3つのベアメタルホストを管理することです。そのためには、次の情報を使用して管理クラスタにファイル<literal>capi-provisioning-example.yaml</literal>を作成する必要があります(capi-provisioning-example.yamlは、次のブロックを結合して生成できます)。
pt_br: Depois que os três hosts bare metal forem registrados e estiverem disponíveis, a próxima etapa será provisioná-los para instalar e configurar o sistema operacional e o cluster Kubernetes, criando um balanceador de carga para gerenciá-los. Para fazer isso, é necessário criar este arquivo (<literal>capi-provisioning-example.yaml</literal>) no cluster de gerenciamento com as seguintes informações (é possível gerar o `capi-provisioning-example.yaml unindo os blocos abaixo).
zh_cn: 三个裸机主机已登记并可供使用后，下一步是置备裸机主机，以安装和配置操作系统与 Kubernetes 群集，并创建用于管理该操作系统和群集的负载平衡器。为此，必须在管理群集中创建以下文件 (<literal>capi-provisioning-example.yaml</literal>) 并在其中包含以下信息（可以通过合并以下块来生成 capi-provisioning-example.yaml）。
