Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <literal>${CONTROLPLANE_INTERFACE}</literal> — The control-plane interface to be used for the edge cluster (for example, <literal>eth0</literal>). Including <literal>identifier: mac-address</literal> the naming is inspected automatically by the MAC address so any interface name can be used.
es: <literal>${CONTROLPLANE_INTERFACE}</literal>: es la interfaz de plano de control que se usará para el clúster periférico (por ejemplo, <literal>eth0</literal>). Si se incluye <literal>identificador: dirección MAC</literal>, el nombre se comprueba automáticamente por su dirección MAC, por lo que se puede utilizar cualquier nombre de interfaz.
ja: <literal>${CONTROLPLANE1_INTERFACE}</literal> — エッジクラスタに使用するコントロールプレーンインタフェース(例: <literal>eth0</literal>)。<literal>identifier: mac-address</literal>を含めると、名前がMACアドレスに基づいて自動的に検査されるため、任意のインタフェース名を使用できます。
zh_cn: <literal>${CONTROLPLANE_INTERFACE}</literal> — 用于边缘群集的控制平面接口（例如 <literal>eth0</literal>）。包含 <literal>identifier: mac-address</literal> 后，系统会通过 MAC 地址自动检查命名，因此可使用任何接口名称。

source: <literal>${CONTROLPLANE_IP}</literal> — The IP address to be used as an endpoint for the edge cluster (must match with the kubeapi-server endpoint).
es: <literal>${CONTROLPLANE_IP}</literal>: es la dirección IP que se usará como punto final para el clúster periférico (debe coincidir con el punto final kubeapi-server).
ja: <literal>${CONTROLPLANE_IP}</literal> — エッジクラスタのエンドポイントとして使用するIPアドレス(kubeapiサーバのエンドポイントと一致する必要があります)。
zh_cn: <literal>${CONTROLPLANE_IP}</literal> — 用作边缘群集端点的 IP 地址（必须与 kubeapi-server 端点匹配）。

source: <literal>${CONTROLPLANE_PREFIX}</literal> — The CIDR to be used for the edge cluster (for example, <literal>24</literal> if you want <literal>/24</literal> or <literal>255.255.255.0</literal>).
es: <literal>${CONTROLPLANE_PREFIX}</literal>: es el CIDR que se usará para el clúster periférico (por ejemplo, <literal>24</literal> si desea <literal>/24</literal> o <literal>255.255.255.0</literal>).
ja: <literal>${CONTROLPLANE_PREFIX}</literal> — エッジクラスタに使用するCIDR (例: <literal>/24</literal>または<literal>255.255.255.0</literal>を使用する場合には<literal>24</literal>)。
zh_cn: <literal>${CONTROLPLANE_PREFIX}</literal> — 用于边缘群集的 CIDR（例如，如果要使用 <literal>/24</literal> 或 <literal>255.255.255.0</literal>，请设为 <literal>/24</literal>）。

source: <literal>${CONTROLPLANE_GATEWAY}</literal> — The gateway to be used for the edge cluster (for example, <literal>192.168.100.1</literal>).
es: <literal>${CONTROLPLANE_GATEWAY}</literal>: es el gateway que se usará para el clúster periférico (por ejemplo, <literal>192.168.100.1</literal>).
ja: <literal>${CONTROLPLANE_GATEWAY}</literal> — エッジクラスタに使用するゲートウェイ(例: <literal>192.168.100.1</literal>)。
zh_cn: <literal>${CONTROLPLANE_GATEWAY}</literal> — 用于边缘群集的网关（例如 <literal>192.168.100.1</literal>）。

source: <literal>${CONTROLPLANE_MAC}</literal> — The MAC address to be used for the control-plane interface (for example, <literal>00:0c:29:3e:3e:3e</literal>).
es: <literal>${CONTROLPLANE_MAC}</literal>: es la dirección MAC que se usará para la interfaz de plano de control (por ejemplo, <literal>00:0c:29:3e:3e:3e</literal>).
ja: <literal>${CONTROLPLANE_MAC}</literal> — コントロールプレーンインタフェースに使用するMACアドレス(例: <literal>00:0c:29:3e:3e:3e</literal>)。
zh_cn: <literal>${CONTROLPLANE_MAC}</literal> — 用于控制平面接口的 MAC 地址（例如 <literal>00:0c:29:3e:3e:3e</literal>）。

source: <literal>${DNS_SERVER}</literal> — The DNS to be used for the edge cluster (for example, <literal>192.168.100.2</literal>).
es: <literal>${DNS_SERVER}</literal>: es el servidor DNS que se usará para el clúster periférico (por ejemplo, <literal>192.168.100.2</literal>).
ja: <literal>${DNS_SERVER}</literal> — エッジクラスタに使用するDNS (例: <literal>192.168.100.2</literal>)。
pt_br: <literal>${DNS_SERVER}</literal>: o DNS usado para o cluster de borda (por exemplo, <literal>192.168.100.2</literal>).
zh_cn: <literal>${DNS_SERVER}</literal> — 用于边缘群集的 DNS（例如 <literal>192.168.100.2</literal>）。

source: <literal>${VLAN_ID}</literal> — The VLAN ID to be used for the edge cluster (for example, <literal>100</literal>).
es: <literal>${VLAN_ID}</literal>: es el ID de VLAN que se usará para el clúster periférico (por ejemplo, <literal>100</literal>).
ja: <literal>${VLAN_ID}</literal> — エッジクラスタに使用するVLAN ID (例: <literal>100</literal>)。
pt_br: <literal>${VLAN_ID}</literal>: o ID da VLAN usado para o cluster de borda (por exemplo, <literal>100</literal>).
zh_cn: <literal>${VLAN_ID}</literal> — 用于边缘群集的 VLAN ID（例如 <literal>100</literal>）。

source: Any other <literal>nmstate</literal>-compliant definition can be used to configure the network for the downstream cluster to adapt to the specific requirements. For example, it is possible to specify a static dual-stack configuration:
es: Se puede usar cualquier otra definición compatible con <literal>nmstate</literal> para configurar la red del clúster descendente y adaptarla a los requisitos específicos. Por ejemplo, es posible especificar una configuración estática de doble pila:
ja: 他の<literal>nmstate</literal>準拠の定義を使用して、ダウンストリームクラスタのネットワークを特定の要件に適合するように設定できます。たとえば、静的デュアルスタック設定を指定できます。
pt_br: É possível usar qualquer outra definição adequada a <literal>nmstate</literal> para configurar a rede do cluster downstream de acordo com os requisitos específicos. Por exemplo, é possível especificar uma configuração de pilha dupla estática:
zh_cn: 任何其他符合 <literal>nmstate</literal> 标准的定义都可用于配置下游群集的网络，以适应特定要求。例如，可以指定静态双栈配置：

source: As for the previous example, replace the following variables with actual values, according to your infrastructure:
es: En el ejemplo anterior, sustituya las variables siguientes por los valores reales de su infraestructura:
ja: 前の例と同様に、インフラストラクチャに応じて、以下の変数を実際の値に置き換えてください。
pt_br: Assim como no exemplo anterior, substitua as seguintes variáveis pelos valores reais, de acordo com a sua infraestrutura:
zh_cn: 与前面的示例一样，请根据您的基础架构将以下变量替换为实际值：

source: <literal>${CONTROLPLANE_IP_V4}</literal> - the IPv4 address to assign to the host
es: <literal>${CONTROLPLANE_IP_V4}</literal>: la dirección IPv4 que se asignará al host
ja: <literal>${CONTROLPLANE_IP_V4}</literal> - ホストに割り当てるIPv4アドレス
pt_br: <literal>${CONTROLPLANE_IP_V4}</literal>: o endereço IPv4 para atribuir ao host
zh_cn: <literal>${CONTROLPLANE_IP_V4}</literal> - 分配给主机的 IPv4 地址

source: <literal>${CONTROLPLANE_PREFIX_V4}</literal> - the IPv4 prefix of the network to which the host IP belongs
es: <literal>${CONTROLPLANE_PREFIX_V4}</literal>: el prefijo IPv4 de la red a la que pertenece la IP del host
ja: <literal>${CONTROLPLANE_PREFIX_V4}</literal> - ホストIPが属するネットワークのIPv4プレフィックス
pt_br: <literal>${CONTROLPLANE_PREFIX_V4}</literal>: o prefixo IPv4 da rede à qual pertence o IP do host
zh_cn: <literal>${CONTROLPLANE_PREFIX_V4}</literal> - 主机 IP 所属网络的 IPv4 前缀

source: <literal>${CONTROLPLANE_IP_V6}</literal> - the IPv6 address to assign to the host
es: <literal>${CONTROLPLANE_IP_V6}</literal>: la dirección IPv6 que se asignará al host
ja: <literal>${CONTROLPLANE_IP_V6}</literal> - ホストに割り当てるIPv6アドレス
pt_br: <literal>${CONTROLPLANE_IP_V6}</literal>: o endereço IPv6 para atribuir ao host
zh_cn: <literal>${CONTROLPLANE_IP_V6}</literal> - 分配给主机的 IPv6 地址

source: <literal>${CONTROLPLANE_PREFIX_V6}</literal> - the IPv6 prefix of the network to which the host IP belongs
es: <literal>${CONTROLPLANE_PREFIX_V6}</literal>: el prefijo IPv6 de la red a la que pertenece la IP del host
ja: <literal>${CONTROLPLANE_PREFIX_V6}</literal> - ホストIPが属するネットワークのIPv6プレフィックス
pt_br: <literal>${CONTROLPLANE_PREFIX_V6}</literal>: o prefixo IPv6 da rede à qual pertence o IP do host
zh_cn: <literal>${CONTROLPLANE_PREFIX_V6}</literal> - 主机 IP 所属网络的 IPv6 前缀

source: <literal>${CONTROLPLANE_GATEWAY_V4}</literal> - the IPv4 address of the gateway for the traffic matching the default route
es: <literal>${CONTROLPLANE_GATEWAY_V4}</literal>: la dirección IPv4 del gateway para el tráfico que coincide con la ruta predeterminada
ja: <literal>${CONTROLPLANE_GATEWAY_V4}</literal> - デフォルトルートに一致するトラフィック用のゲートウェイのIPv4アドレス
pt_br: <literal>${CONTROLPLANE_GATEWAY_V4}</literal>: o endereço IPv4 do gateway para o tráfego correspondente à rota padrão
zh_cn: <literal>${CONTROLPLANE_GATEWAY_V4}</literal> - 与默认路由匹配的流量所用网关的 IPv4 地址

source: <literal>${CONTROLPLANE_GATEWAY_V6}</literal> - the IPv6 address of the gateway for the traffic matching the default route
es: <literal>${CONTROLPLANE_GATEWAY_V6}</literal>: la dirección IPv6 del gateway para el tráfico que coincide con la ruta predeterminada
ja: <literal>${CONTROLPLANE_GATEWAY_V6}</literal> - デフォルトルートに一致するトラフィック用のゲートウェイのIPv6アドレス
pt_br: <literal>${CONTROLPLANE_GATEWAY_V6}</literal>: o endereço IPv6 do gateway para o tráfego correspondente à rota padrão
zh_cn: <literal>${CONTROLPLANE_GATEWAY_V6}</literal> - 与默认路由匹配的流量所用网关的 IPv6 地址

source: <literal>${CONTROLPLANE_INTERFACE}</literal> - the name of the interface to assign the addresses to and to use for egress traffic matching the default route, for both IPv4 and IPv6
es: <literal>${CONTROLPLANE_INTERFACE}</literal>: el nombre de la interfaz a la que se asignarán las direcciones y que se usará para el tráfico de salida que coincida con la ruta predeterminada, tanto para IPv4 como para IPv6
ja: <literal>${CONTROLPLANE_INTERFACE}</literal> - IPv4とIPv6の両方で、デフォルトルートに一致する出力トラフィックにアドレスを割り当て、使用するインタフェースの名前
pt_br: <literal>${CONTROLPLANE_INTERFACE}</literal>: o nome da interface à qual atribuir os endereços e que será usada para o tráfego de saída correspondente à rota padrão, para ambos IPv4 e IPv6
zh_cn: <literal>${CONTROLPLANE_INTERFACE}</literal> - 地址要分配到的接口的名称，该接口同时供与默认路由匹配的出站流量使用（适用于 IPv4 和 IPv6）

source: <literal>${DNS_SERVER_V4}</literal> and/or <literal>${DNS_SERVER_V6}</literal> - the IP address(es) of the DNS server(s) to use, which can be specified as single or multiple entries. Both IPv4 and/or IPv6 addresses are supported
es: <literal>${DNS_SERVER_V4}</literal> y/o <literal>${DNS_SERVER_V6}</literal>: las direcciones IP de los servidores DNS que se van a usar, que pueden especificarse como entradas únicas o múltiples. Se admiten direcciones IPv4 y/o IPv6
ja: <literal>${DNS_SERVER_V4}</literal>および/または<literal>${DNS_SERVER_V6}</literal> - 使用するDNSサーバのIPアドレス。単一または複数のエントリとして指定できます。IPv4および/またはIPv6アドレスがサポートされています。
pt_br: <literal>${DNS_SERVER_V4}</literal> e/ou <literal>${DNS_SERVER_V6}</literal>: os endereços IP dos servidores DNS, que podem ser especificados como uma única ou várias entradas. Há suporte para os endereços tanto IPv4 quanto IPv6
zh_cn: <literal>${DNS_SERVER_V4}</literal> 和/或 <literal>${DNS_SERVER_V6}</literal> - 要使用的 DNS 服务器的 IP 地址（可指定单项或多项，支持 IPv4 和/或 IPv6 地址）

source: You can refer to <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/edge-clusters">SUSE Telco Cloud examples repo</link> for more complex examples, including IPv6 only and dual-stack configurations.
es: En el <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/edge-clusters">repositorio de ejemplos de SUSE Telco Cloud</link> encontrará ejemplos más complejos, incluidas configuraciones solo de IPv6 y de doble pila.
ja: IPv6専用設定およびデュアルスタック設定を含む、より複雑な例については、<link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/edge-clusters">SUSE Telco Cloud例のリポジトリ</link>を参照してください。
zh_cn: 您可访问 <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/edge-clusters">SUSE Telco Cloud 示例代码库</link>获取复杂示例，包括仅 IPv6 和双栈配置。

source: Lastly, regardless of the network configuration details, ensure that the secret is referenced by appending <literal>preprovisioningNetworkDataName</literal> to the <literal>BaremetalHost</literal> object to successfully enroll the host in the management cluster.
es: Por último, independientemente de los detalles de la configuración de red, asegúrese de que se haga referencia al secreto añadiendo <literal>preprovisioningNetworkDataName</literal> al objeto <literal>BaremetalHost</literal> para inscribir correctamente el host en el clúster de gestión.
ja: 最後に、ネットワーク設定の詳細に関わらず、ホストを管理クラスタに正常に登録するために、<literal>BaremetalHost</literal>オブジェクトに<literal>preprovisioningNetworkDataName</literal>を追加してシークレットが参照されるようにします。
pt_br: Por fim, sejam quais forem os detalhes da configuração de rede, garanta que o segredo seja referenciado anexando <literal>preprovisioningNetworkDataName</literal> ao objeto <literal>BaremetalHost</literal> para registrar o host no cluster de gerenciamento com sucesso.
zh_cn: 最后，无论网络配置详细信息如何，都要确保通过在 <literal>BaremetalHost</literal> 对象中附加 <literal>preprovisioningNetworkDataName</literal> 来引用该机密，以便成功在管理群集中登记主机。

source: If you need to deploy a multi-node cluster, the same process must be done for each node.
es: Si necesita desplegar un clúster de varios nodos, debe realizar el mismo proceso para cada nodo.
ja: マルチノードクラスタをデプロイする必要がある場合は、同じプロセスを各ノードに対して実行する必要があります。
pt_br: Se você precisa implantar um cluster de vários nós, siga o mesmo processo para cada nó.
zh_cn: 如果需要部署多节点群集，必须对每个节点执行相同的过程。

source: The <literal>Metal3DataTemplate</literal>, <literal>networkData</literal> and <literal>Metal3 IPAM</literal> are currently not supported; only the configuration via static secrets is fully supported.
es: Actualmente, <literal>Metal3DataTemplate</literal>, <literal>networkData</literal> y <literal>Metal3 IPAM</literal> no se admiten; solo se admite plenamente la configuración mediante secretos estáticos.
ja: <literal>Metal3DataTemplate</literal>、<literal>networkData</literal>、および<literal>Metal3 IPAM</literal>は現在サポートされていません。静的シークレットを介した設定のみが完全にサポートされています。
pt_br: Atualmente, o <literal>Metal3DataTemplate</literal>, o <literal>networkData</literal> e o <literal>Metal3 IPAM</literal> não são suportados. Apenas a configuração por meio de segredos estáticos conta com suporte total.
zh_cn: 目前不支持 <literal>Metal3DataTemplate</literal>、<literal>networkData</literal> 和 <literal>Metal3 IPAM</literal>；只有通过静态机密进行的配置才完全受支持。

source: Telco features (DPDK, SR-IOV, CPU isolation, huge pages, NUMA, etc.)
es: Funciones para telecomunicaciones (DPDK, SR-IOV, aislamiento de CPU, páginas enormes, NUMA, etc.)
ja: 通信機能(DPDK、SR-IOV、CPUの分離、Huge Page、NUMAなど)
pt_br: Recursos de telecomunicações (DPDK, SR-IOV, isolamento de CPU, HugePages, NUMA etc.)
zh_cn: 电信功能（DPDK、SR-IOV、CPU 隔离、大页、NUMA 等）

source: The directed network provisioning workflow allows to automate the Telco features to be used in the downstream clusters to run Telco workloads on top of those servers.
es: El flujo de trabajo de aprovisionamiento de red dirigida permite automatizar las funciones de telecomunicaciones que se usarán en los clústeres descendentes para ejecutar cargas de trabajo de telecomunicaciones en esos servidores.
ja: ダイレクトネットワークプロビジョニングのワークフローでは、ダウンストリームクラスタで使用する通信機能を自動化して、そのサーバ上で通信ワークロードを実行できます。
pt_br: O fluxo de trabalho de provisionamento de rede direcionado permite automatizar os recursos de telecomunicações que serão usados nos clusters downstream para executar as cargas de trabalho de telecomunicações nesses servidores.
zh_cn: 定向网络置备工作流程允许将下游群集中使用的电信功能自动化，以便在这些服务器上运行电信工作负载。

source: The image generated using <literal>EIB</literal>, as described in the previous section (<xref linkend="eib-edge-image-connected"/>), has to be located in the management cluster exactly on the path you configured on this section (<xref linkend="metal3-media-server"/>).
es: La imagen generada con <literal>EIB</literal>, que se describe en la sección anterior (<xref linkend="eib-edge-image-connected"/>), debe estar en el clúster de gestión exactamente en la ruta que ha configurado en esa sección (<xref linkend="metal3-media-server"/>).
ja: 前のセクション(<xref linkend="eib-edge-image-connected"/>)で説明されているように、<literal>EIB</literal>を使用して生成したイメージが、こちらのセクション(<xref linkend="metal3-media-server"/>)で設定した正確なパス上の管理クラスタに配置されている。
pt_br: A imagem gerada por meio do <literal>EIB</literal>, conforme descrito na seção anterior (<xref linkend="eib-edge-image-connected"/>), deve estar localizada no cluster de gerenciamento exatamente no caminho configurado nesta seção (<xref linkend="metal3-media-server"/>).
zh_cn: 如前面的章节（<xref linkend="eib-edge-image-connected"/>）所述使用 <literal>EIB</literal> 生成的映像必须位于管理群集上您按照<xref linkend="metal3-media-server"/>一节所述配置的确切路径中。

source: The image generated using <literal>EIB</literal> has to include the specific Telco packages following this section (<xref linkend="add-telco-feature-eib"/>).
es: La imagen generada con <literal>EIB</literal> debe incluir los paquetes específicos de telecomunicaciones que se indican en esa sección (<xref linkend="add-telco-feature-eib"/>).
ja: こちらのセクション(<xref linkend="add-telco-feature-eib"/>)に従って、<literal>EIB</literal>を使用して生成したイメージに特定の通信機能を含める必要がある。
pt_br: A imagem gerada por meio do <literal>EIB</literal> deve incluir os pacotes de telecomunicações específicos de acordo com as instruções nesta seção (<xref linkend="add-telco-feature-eib"/>).
zh_cn: 使用 <literal>EIB</literal> 生成的映像必须包含<xref linkend="add-telco-feature-eib"/>一节中所述的特定电信软件包。

source: Use the following two sections as the base to enroll and provision the hosts:
es: Use las dos secciones siguientes como base para inscribir y aprovisionar los hosts:
ja: 次の2つのセクションをベースとして使用し、ホストを登録してプロビジョニングします。
pt_br: Use as duas seções a seguir como base para registrar e provisionar os hosts:
zh_cn: 基于以下两个章节的内容登记和置备主机：

source: The Telco features covered in this section are the following:
es: Las funciones de telecomunicaciones que se tratan en esta sección son las siguientes:
ja: このセクションで説明する通信機能を次に示します。
pt_br: Os recursos de telecomunicações abordados nesta seção são:
zh_cn: 本节将介绍以下电信功能：

source: DPDK and VFs creation
es: DPDK y creación de funciones virtuales
ja: DPDKとVFの作成
pt_br: DPDK e criação de VFs
zh_cn: DPDK 和 VF 创建

source: SR-IOV and VFs allocation to be used by the workloads
es: Asignación de SR-IOV y funciones virtuales que usarán las cargas de trabajo
ja: ワークロードで使用されるSR-IOVとVFの割り当て
pt_br: Alocação de SR-IOV e VFs para as cargas de trabalho usarem
zh_cn: 工作负载使用的 SR-IOV 和 VF 分配

source: CPU isolation and performance tuning
es: Aislamiento de CPU y optimización del rendimiento
ja: CPUの分離とパフォーマンスの調整
pt_br: Isolamento de CPU e ajuste de desempenho
zh_cn: CPU 隔离和性能调优

source: Huge pages configuration
es: Configuración de páginas enormes
ja: Huge Pageの設定
pt_br: Configuração do HugePages
zh_cn: 大页配置

source: Kernel parameters tuning
es: Optimización de los parámetros del kernel
ja: カーネルパラメータの調整
pt_br: Ajuste de parâmetros do kernel
zh_cn: 内核参数调优

source: For more information about the Telco features, see <xref linkend="atip-features"/>.
es: Para obtener más información sobre las funciones de telecomunicaciones, consulte el <xref linkend="atip-features"/>.
ja: 通信機能の詳細については、<xref linkend="atip-features"/>を参照してください。
pt_br: Para obter mais informações sobre os recursos de telecomunicações, consulte o <xref linkend="atip-features"/>.
zh_cn: 有关电信功能的详细信息，请参见<xref linkend="atip-features"/>。

source: The changes required to enable the Telco features shown above are all inside the <literal>RKE2ControlPlane</literal> block in the provision file <literal>capi-provisioning-example.yaml</literal>. The rest of the information inside the file <literal>capi-provisioning-example.yaml</literal> is the same as the information provided in the provisioning section (<xref linkend="single-node-provision"/>).
es: Todos los cambios necesarios para habilitar las funciones de telecomunicaciones indicados arriba se encuentran en el bloque <literal>RKE2ControlPlane</literal> del archivo de aprovisionamiento <literal>capi-provisioning-example.yaml</literal>. El resto de la información contenida en el archivo <literal>capi-provisioning-example.yaml</literal> es la misma que se proporciona en la sección sobre aprovisionamiento (<xref linkend="single-node-provision"/>).
ja: 上記の通信機能を有効にするために必要な変更はすべて、プロビジョニングファイル<literal>capi-provisioning-example.yaml</literal>の<literal>RKE2ControlPlane</literal>ブロック内にあります。ファイル<literal>capi-provisioning-example.yaml</literal>内の残りの情報は、プロビジョニングに関するセクション(<xref linkend="single-node-provision"/>)で指定した情報と同じです。
pt_br: As alterações necessárias para habilitar os recursos de telecomunicações mostrados acima estão todas no bloco <literal>RKE2ControlPlane</literal> do arquivo de provisionamento <literal>capi-provisioning-example.yaml</literal>. O restante das informações no arquivo <literal>capi-provisioning-example.yaml</literal> é o mesmo que as informações apresentadas na seção de provisionamento (<xref linkend="single-node-provision"/>).
zh_cn: 启用上述电信功能所需做出的更改都可以在 <literal>capi-provisioning-example.yaml</literal> 置备文件的 <literal>RKE2ControlPlane</literal> 块中完成。<literal>capi-provisioning-example.yaml</literal> 文件中的其余信息与置备相关章节（<xref linkend="single-node-provision"/>）中提供的信息相同。

source: To make the process clear, the changes required on that block (<literal>RKE2ControlPlane</literal>) to enable the Telco features are the following:
es: Para que el proceso quede claro, los cambios necesarios en ese bloque (<literal>RKE2ControlPlane</literal>) para habilitar las funciones de telecomunicaciones son los siguientes:
ja: このプロセスを明確にするために、通信機能を有効にするためにそのブロック(<literal>RKE2ControlPlane</literal>)で必要な変更を次に示します。
pt_br: Para esclarecer o processo, as alterações necessárias neste bloco (<literal>RKE2ControlPlane</literal>) para habilitar os recursos de telecomunicações são:
zh_cn: 明确地说，为启用电信功能而需在该块 (<literal>RKE2ControlPlane</literal>) 中进行的更改如下：

source: The <literal>preRKE2Commands</literal> to be used to execute the commands before the <literal>RKE2</literal> installation process. In this case, use the <literal>modprobe</literal> command to enable the <literal>vfio-pci</literal> and the <literal>SR-IOV</literal> kernel modules.
es: Los comandos <literal>preRKE2Commands</literal> que se usarán para ejecutar los comandos antes del proceso de instalación de <literal>RKE2</literal>. En este caso, use el comando <literal>modprobe</literal> para habilitar los módulos del kernel <literal>vfio-pci</literal> y <literal>SR-IOV</literal>.
ja: <literal>RKE2</literal>インストールプロセスの前にコマンドを実行するために使用する<literal>preRKE2Commands</literal>。ここでは、<literal>modprobe</literal>コマンドを使用して、<literal>vfio-pci</literal>と<literal>SR-IOV</literal>のカーネルモジュールを有効にします。
pt_br: Os <literal>preRKE2Commands</literal> usados para executar os comandos antes do processo de instalação do <literal>RKE2</literal>. Neste caso, use o comando <literal>modprobe</literal> para habilitar os módulos do kernel <literal>vfio-pci</literal> e <literal>SR-IOV</literal>.
zh_cn: 指定 <literal>preRKE2Commands</literal>，该参数用于在 <literal>RKE2</literal> 安装过程开始之前执行命令。本例使用 <literal>modprobe</literal> 命令启用 <literal>vfio-pci</literal> 和 <literal>SR-IOV</literal> 内核模块。

source: The ignition file <literal>/var/lib/rancher/rke2/server/manifests/configmap-sriov-custom-auto.yaml</literal> to be used to define the interfaces, drivers and the number of <literal>VFs</literal> to be created and exposed to the workloads.
es: El archivo de Ignition <literal>/var/lib/rancher/rke2/server/manifests/configmap-sriov-custom-auto.yaml</literal> se usará para definir las interfaces, los controladores y el número de <literal>funciones virtuales</literal> que se crearán y expondrán a las cargas de trabajo.
ja: 作成してワークロードに公開するインタフェース、ドライバ、および<literal>VF</literal>の数を定義するために使用するIgnitionファイル<literal>/var/lib/rancher/rke2/server/manifests/configmap-sriov-custom-auto.yaml</literal>。
pt_br: O arquivo do Ignition <literal>/var/lib/rancher/rke2/server/manifests/configmap-sriov-custom-auto.yaml</literal> que será usado para definir as interfaces, os drivers e o número de <literal>VFs</literal> que será criado e exposto às cargas de trabalho.
zh_cn: 指定 ignition 文件 <literal>/var/lib/rancher/rke2/server/manifests/configmap-sriov-custom-auto.yaml</literal>，该文件用于定义要创建且向工作负载公开的接口、驱动程序及 <literal>VF</literal> 数量。
