Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The following diagram shows the high-level architecture of SUSE Edge for Telco:
pt_br: O diagrama abaixo mostra a arquitetura de alto nível do SUSE Edge for Telco:

source: <emphasis role="strong">Management stack</emphasis>: This is the part of SUSE Edge for Telco that is used to manage the provision and lifecycle of the runtime stacks. It includes the following components:
pt_br: <emphasis role="strong">Pilha de gerenciamento</emphasis>: trata-se da parte do SUSE Edge for Telco usada para gerenciar o provisionamento e o ciclo de vida das pilhas de runtime. Ela inclui os seguintes componentes:

source: <emphasis role="strong">Runtime stack</emphasis>: This is the part of SUSE Edge for Telco that is used to run the workloads.
pt_br: <emphasis role="strong">Pilha de runtime</emphasis>: trata-se da parte do SUSE Edge for Telco usada para executar as cargas de trabalho.

source: Kubernetes with secure and lightweight distributions like K3s (<xref linkend="components-k3s"/>) and RKE2 (<xref linkend="components-rke2"/>) (<literal>RKE2</literal> is hardened, certified and optimized for government use and regulated industries).
pt_br: Kubernetes com distribuições seguras e leves como K3s (<xref linkend="components-k3s"/>) e RKE2 (<xref linkend="components-rke2"/>) (o <literal>RKE2</literal> é protegido, certificado e otimizado para uso em órgãos governamentais e setores regulamentados).

source: For more information about how to deploy a new management cluster, see the SUSE Edge for Telco Management Cluster guide (<xref linkend="atip-management-cluster"/>).
pt_br: Para obter mais informações sobre como implantar um novo cluster de gerenciamento, consulte o guia sobre cluster de gerenciamento do SUSE Edge for Telco (<xref linkend="atip-management-cluster"/>).

source: For more information about how to deploy a downstream cluster, see the SUSE Edge for Telco Automated Provisioning guide. (<xref linkend="atip-automated-provisioning"/>)
pt_br: Para obter mais informações sobre como implantar um cluster downstream, consulte o guia sobre provisionamento automatizado do SUSE Edge for Telco (<xref linkend="atip-automated-provisioning"/>).

source: For more information about Telco features, see the SUSE Edge for Telco Telco Features guide. (<xref linkend="atip-features"/>)
pt_br: Para obter mais informações sobre os recursos de telecomunicações, consulte o guia sobre recursos de telecomunicações do SUSE Edge for Telco (<xref linkend="atip-features"/>).

source: The hardware requirements SUSE Edge for Telco are as follows:
pt_br: Veja a seguir os requisitos de hardware para o SUSE Edge for Telco:

source: The management cluster is the part of SUSE Edge for Telco that is used to manage the provision and lifecycle of the runtime stacks. From a technical point of view, the management cluster contains the following components:
pt_br: O cluster de gerenciamento é a parte do SUSE Edge for Telco usada para gerenciar o provisionamento e o ciclo de vida das pilhas de runtime. Do ponto de vista técnico, esse cluster contém os seguintes componentes:

source: The <literal>nodes</literal> section contains the list of nodes to be used in the cluster. The <literal>nodes</literal> section contains the list of nodes to be used in the cluster. In this example, a single-node cluster is being used, but it can be extended to a multi-node cluster by adding more nodes to the list (by uncommenting the lines).
pt_br: A seção <literal>nodes</literal> contém a lista dos nós usados no cluster. Neste exemplo, usamos um cluster de nó único, mas é possível estendê-lo para um cluster de vários nós adicionando nós à lista (removendo o marcador de comentário das linhas).

source: In case you want to deploy arm64 downstream clusters using this x86_64 management cluster, you need to add the following <literal>deployArchitecture: arm64</literal> to the <literal>global</literal> section of the <literal>metal3.yaml</literal> file:
pt_br: Para implantar clusters downstream arm64 usando esse cluster de gerenciamento x86_64, você precisa adicionar a seguinte <literal>deployArchitecture: arm64</literal> à seção <literal>global</literal> do arquivo <literal>metal3.yaml</literal>:

source: In the current version, a limitation exists regarding the use of <literal>deployArchitecture: arm64</literal>. Specifically, if you enable the deployment of downstream arm64 clusters using this directive, the management cluster will subsequently only be able to deploy this architecture. To deploy clusters on both architectures (x86_64 and arm64), you will need to provision two separate management clusters. This limitation will be removed in a future version.
pt_br: Na versão atual, existe uma limitação referente ao uso da <literal>deployArchitecture: arm64</literal>. Especificamente, se você permitir a implantação de clusters downstream arm64 usando essa diretiva, o cluster de gerenciamento apenas poderá implantar essa arquitetura no futuro. Para implantar clusters nas duas arquiteturas (x86_64 e arm64), provisione dois clusters de gerenciamento separados. Essa limitação será removida em uma versão futura.

source: This section documents and explains the configuration of Telco-specific features on clusters deployed via SUSE Edge for Telco.
pt_br: Esta seção documenta e explica a configuração dos recursos específicos de telecomunicações nos clusters implantados pelo SUSE Edge for Telco.

source: <literal>nohz_full=&lt;cpu-cores&gt;</literal>: Stops the period timer tick on specified CPUs that are dedicated for real-time applications.
pt_br: <literal>nohz_full=&lt;núcleos-cpu&gt;</literal>: interrompe o tick periódico do temporizador nas CPUs especificadas que são dedicadas a aplicativos em tempo real.

source: The script is available at <link xl:href="https://raw.githubusercontent.com/suse-edge/atip/refs/heads/release-3.3/telco-examples/edge-clusters/dhcp-less/eib/custom/files/performance-settings.sh">SUSE Edge for Telco Examples repository</link>.
pt_br: O script está disponível no <link xl:href="https://raw.githubusercontent.com/suse-edge/atip/refs/heads/release-3.3/telco-examples/edge-clusters/dhcp-less/eib/custom/files/performance-settings.sh">repositório de exemplos do SUSE Edge for Telco</link>.

source: <literal>Cilium</literal> is the default CNI plug-in for SUSE Edge for Telco. To enable Cilium on RKE2 cluster as the default plug-in, the following configurations are required in the <literal>/etc/rancher/rke2/config.yaml</literal> file:
pt_br: <literal>Cilium</literal> é o plug-in de CNI padrão para o SUSE Edge for Telco. Para habilitar o Cilium no cluster RKE2 como plug-in padrão, as seguintes configurações são necessárias no arquivo <literal>/etc/rancher/rke2/config.yaml</literal>:

source: For more information about CNI plug-ins, visit <link xl:href="https://docs.rke2.io/install/network_options">Network Options</link>.
pt_br: Para obter mais informações sobre os plug-ins de CNI, visite <link xl:href="https://docs.rke2.io/install/network_options">Network Options</link> (Opções de rede).

source: The following sections will provide guidance on how to install and configure PTP on SUSE Edge specifically, but familiarity with basic PTP concepts is expected. For a brief overview of PTP and the implementation included in SUSE Edge for Telco, refer to <link xl:href="https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html">https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html</link>.
pt_br: As seções a seguir orientam como instalar e configurar o PTP especificamente no SUSE Edge, mas deve haver uma familiaridade com os conceitos básicos do PTP. Para uma breve visão geral do PTP e a implementação incluída no SUSE Edge for Telco, acesse <link xl:href="https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html">https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html</link>.

source: In SUSE Edge for Telco, the PTP implementation is provided by the <literal>linuxptp</literal> package, which includes two components:
pt_br: No SUSE Edge for Telco, a implementação do PTP é fornecida pelo pacote <literal>linuxptp</literal>, que inclui dois componentes:

source: The <literal>linuxptp</literal> package included in SUSE Edge for Telco does not enable <literal>ptp4l</literal> and <literal>phc2sys</literal> by default. If their system-specific configuration files are deployed at provisioning time (see <xref linkend="ptp-capi"/>), they should be enabled. Do so by adding them to the <literal>systemd</literal> section of the manifest, as in the example above.
pt_br: O pacote <literal>linuxptp</literal> incluído no SUSE Edge for Telco não habilita o <literal>ptp4l</literal> e o <literal>phc2sys</literal> por padrão. Se os arquivos de configuração específicos do sistema forem implantados no momento do provisionamento (consulte a <xref linkend="ptp-capi"/>), eles deverão ser habilitados. Para isso, adicione-os à seção <literal>systemd</literal> do manifesto, conforme o exemplo acima.

source: Whenever a cluster is deployed through a management cluster and directed provisioning, both the configuration file and the two configuration variables in <literal>/etc/sysconfig</literal> can be deployed on the host at provisioning time. Below is an excerpt from a cluster definition, focusing on a modified <literal>RKE2ControlPlane</literal> object that deploys the same G.8275.1 configuration file on all hosts:
pt_br: Sempre que um cluster é implantado por cluster de gerenciamento e provisionamento de rede direcionado, tanto o arquivo de configuração quanto as duas variáveis de configuração em <literal>/etc/sysconfig</literal> podem ser implantados no host no momento do provisionamento. Veja abaixo o trecho de uma definição de cluster, com foco no objeto <literal>RKE2ControlPlane</literal> modificado que implanta o mesmo arquivo de configuração G.8275.1 em todos os hosts:

source: The following sections show how to prepare the different scenarios for the directed network provisioning workflow using SUSE Edge for Telco. For examples of the different configurations options for deployment (incl. air-gapped environments, DHCP and DHCP-less networks, private container registries, etc.), see the <link xl:href="https://github.com/suse-edge/atip/tree/release-3.3/telco-examples/edge-clusters">SUSE SUSE Edge for Telco repository</link>.
pt_br: As seções a seguir mostram como preparar os diversos cenários para o fluxo de trabalho de provisionamento de rede direcionado usando o SUSE Edge for Telco. Para ver exemplos de opções de configurações diferentes para implantação (incluindo ambientes air-gapped, redes DHCP e sem DHCP, registros de contêiner particulares etc.), consulte o <link xl:href="https://github.com/suse-edge/atip/tree/release-3.3/telco-examples/edge-clusters">repositório SUSE do SUSE Edge for Telco</link>.

source: To deploy aarch64 downstream clusters, you must set before the management cluster deployment the <literal>deployArchitecture: arm64</literal> parameter in the <literal>metal3.yaml</literal> file explained in Management Cluster Documentation (<xref linkend="arm64-mgmt-cluster"/>). This is required to ensure that the correct architecture is used for the downstream cluster.
pt_br: Para implantar clusters downstream aarch64, você deve definir o parâmetro <literal>deployArchitecture: arm64</literal> no arquivo <literal>metal3.yaml</literal> antes da implantação do cluster de gerenciamento, o que está explicado na documentação sobre o cluster de gerenciamento (<xref linkend="arm64-mgmt-cluster"/>). Isso é necessário para garantir o uso da arquitetura correta para o cluster downstream.

source: The content of <literal>custom/files/performance-settings.sh</literal> is a script that can be used to configure the system for performance tuning and can be downloaded from the following <link xl:href="https://github.com/suse-edge/atip/blob/release-3.3/telco-examples/edge-clusters/dhcp/eib/custom/files/performance-settings.sh">link</link>.
pt_br: O conteúdo do <literal>custom/files/performance-settings.sh</literal> é um script que pode ser usado para configurar o sistema para ajuste de desempenho e pode ser baixado acessando este <link xl:href="https://github.com/suse-edge/atip/blob/release-3.3/telco-examples/edge-clusters/dhcp/eib/custom/files/performance-settings.sh">link</link>.

source: The content of <literal>custom/files/sriov-auto-filler.sh</literal> is a script that can be used to configure the system for SR-IOV and can be downloaded from the following <link xl:href="https://github.com/suse-edge/atip/blob/release-3.3/telco-examples/edge-clusters/dhcp/eib/custom/files/sriov-auto-filler.sh">link</link>.
pt_br: O conteúdo do <literal>custom/files/sriov-auto-filler.sh</literal> é um script que pode ser usado para configurar o sistema para SR-IOV e pode ser baixado acessando este <link xl:href="https://github.com/suse-edge/atip/blob/release-3.3/telco-examples/edge-clusters/dhcp/eib/custom/files/sriov-auto-filler.sh">link</link>.

source: The <literal>custom/files</literal> directory contains the <literal>rke2</literal> and the <literal>cni</literal> images to be copied to the image during the image creation process. To easily generate the images, prepare them locally using following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-save-images.sh">script</link> and the list of images <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-release-rke2-images.txt">here</link> to generate the artifacts required to be included in <literal>custom/files</literal>. Also, you can download the latest <literal>rke2-install</literal> script from <link xl:href="https://get.rke2.io/">here</link>.
pt_br: O diretório <literal>custom/files</literal> contém as imagens do <literal>rke2</literal> e <literal>cni</literal> que devem ser copiadas para a imagem durante o processo de criação dela. Para gerar as imagens com facilidade, prepare-as no local usando o seguinte <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-save-images.sh">script</link> e a lista de imagens <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-release-rke2-images.txt">aqui</link> para gerar os artefatos necessários para incluir em <literal>custom/files</literal>. Você também pode fazer download do script <literal>rke2-install</literal> mais recente <link xl:href="https://get.rke2.io/">aqui</link>.

source: Generate a local tarball file using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-save-oci-artefacts.sh">script</link> and the list created above:
pt_br: Gere um arquivo tarball local usando o seguinte <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-save-oci-artefacts.sh">script</link> e a lista criada acima:

source: Upload your tarball file to your private registry (e.g. <literal>myregistry:5000</literal>) using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-load-oci-artefacts.sh">script</link> to preload your registry with the helm chart OCI images downloaded in the previous step:
pt_br: Faça upload do arquivo tarball para seu registro particular (por exemplo, <literal>myregistry:5000</literal>) usando o seguinte <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-load-oci-artefacts.sh">script</link> para pré-carregar o registro com as imagens OCI do gráfico Helm baixadas na etapa anterior:

source: Using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-save-images.sh">script</link> and the list created above, you must generate locally the tarball file with the images required:
pt_br: Usando o seguinte <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-save-images.sh">script</link> e a lista criada acima, você deve gerar localmente o arquivo tarball com as imagens necessárias:

source: Upload your tarball file to your private registry (e.g. <literal>myregistry:5000</literal>) using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-load-images.sh">script</link> to preload your private registry with the images downloaded in the previous step:
pt_br: Faça upload do arquivo tarball para seu registro particular (por exemplo, <literal>myregistry:5000</literal>) usando o seguinte <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.3.0/scripts/day2/edge-load-images.sh">script</link> para pré-carregar o registro particular com as imagens baixadas na etapa anterior:

source: For a deployment with dual-stack Pods and Services, the following definition can be used instead:
pt_br: Para uma implantação com pods e serviços de pilha dupla, a alternativa é usar a seguinte definição:

source: IPv6 and dual-stack deployments are in tech preview status and are not officially supported.
pt_br: As implantações de IPv6 e pilha dupla estão com status de prévia de tecnologia e não contam com suporte oficial.

source: The <literal>Metal3Cluster</literal> object specifies the control-plane endpoint (replacing the <literal>${DOWNSTREAM_CONTROL_PLANE_IP}</literal>) to be configured and the <literal>noCloudProvider</literal> because a bare-metal node is used.
pt_br: O objeto <literal>Metal3Cluster</literal> especifica o endpoint do plano de controle (para substituir o <literal>${DOWNSTREAM_CONTROL_PLANE_IP}</literal>) que será configurado e o <literal>noCloudProvider</literal>, pois é usado um nó bare metal.

source: The <literal>RKE2ControlPlane</literal> object specifies the control-plane configuration to be used and the <literal>Metal3MachineTemplate</literal> object specifies the control-plane image to be used. Also, it contains the information about the number of replicas to be used (in this case, one) and the <literal>CNI</literal> plug-in to be used (in this case, <literal>Cilium</literal>). The agentConfig block contains the <literal>Ignition</literal> format to be used and the <literal>additionalUserData</literal> to be used to configure the <literal>RKE2</literal> node with information like a systemd named <literal>rke2-preinstall.service</literal> to replace automatically the <literal>BAREMETALHOST_UUID</literal> and <literal>node-name</literal> during the provisioning process using the Ironic information. To enable multus with cilium a file is created in the <literal>rke2</literal> server manifests directory named <literal>rke2-cilium-config.yaml</literal> with the configuration to be used. The last block of information contains the Kubernetes version to be used. <literal>${RKE2_VERSION}</literal> is the version of <literal>RKE2</literal> to be used replacing this value (for example, <literal>v1.32.4+rke2r1</literal>).
pt_br: O objeto <literal>RKE2ControlPlane</literal> especifica a configuração do plano de controle e o objeto <literal>Metal3MachineTemplate</literal> especifica a imagem do plano de controle que serão usadas. Ele também contém as informações sobre o número de réplicas (neste caso, uma) e o plug-in de <literal>CNI</literal> (neste caso, <literal>Cilium</literal>) que serão usados. O bloco agentConfig contém o formato do <literal>Ignition</literal> e o <literal>additionalUserData</literal> a serem usados para configurar o nó <literal>RKE2</literal>, com informações como um systemd chamado <literal>rke2-preinstall.service</literal> para substituir automaticamente o <literal>BAREMETALHOST_UUID</literal> e o <literal>node-name</literal> durante o processo de provisionamento usando as informações do Ironic. Para permitir o multus com o cilium, um arquivo é criado no diretório de manifestos do servidor <literal>rke2</literal> chamado <literal>rke2-cilium-config.yaml</literal> com a configuração que será usada. O último bloco de informações inclui a versão do Kubernetes a ser usada. <literal>${RKE2_VERSION}</literal> é a versão do <literal>RKE2</literal> que substituirá esse valor (por exemplo, <literal>v1.32.4+rke2r1</literal>).

source: <literal>${BMC_NODE1_ADDRESS}</literal> — The URL for the first bare-metal host BMC (for example, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). To learn more about the different options available depending on your hardware provider, check the following <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">link</link>.
pt_br: <literal>${BMC_NODE1_ADDRESS}</literal>: o URL do primeiro host bare metal BMC (por exemplo, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). Para saber mais sobre as diversas opções disponíveis de acordo com o seu provedor de hardware, acesse este <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">link</link>.

source: Multi-node dual-stack or IPv6 only clusters are not yet supported.
pt_br: Ainda não há suporte para clusters de pilha dupla de vários nós ou somente IPv6.

source: The <literal>VIP</literal> address is a reserved IP address that is not assigned to any node and is used to configure the load balancer.
pt_br: O endereço <literal>VIP</literal> é um IP reservado não atribuído a nenhum nó e usado para configurar o balanceador de carga.

source: The <literal>Metal3Cluster</literal> object specifies the control-plane endpoint that uses the <literal>VIP</literal> address already reserved (replacing the <literal>${DOWNSTREAM_VIP_ADDRESS}</literal>) to be configured and the <literal>noCloudProvider</literal> because the three bare-metal nodes are used.
pt_br: O objeto <literal>Metal3Cluster</literal> especifica o endpoint do plano de controle que usa o endereço <literal>VIP</literal> já reservado (para substituir o <literal>${DOWNSTREAM_VIP_ADDRESS}</literal>) que será configurado e o <literal>noCloudProvider</literal>, pois são usados três nós bare metal.

source: The <literal>serverConfig</literal> with the <literal>CNI</literal> plug-in to be used (in this case, <literal>Cilium</literal>), and the <literal>tlsSan</literal> to be used to configure the <literal>VIP</literal> address.
pt_br: O <literal>serverConfig</literal> com o plug-in de <literal>CNI</literal> usado (neste caso, <literal>Cilium</literal>) e o <literal>tlsSan</literal> usado para configurar o endereço <literal>VIP</literal>.

source: The <literal>metalLB</literal> custom resource file with the <literal>IPaddressPool</literal> and the <literal>L2Advertisement</literal> to be used (replacing <literal>${EDGE_VIP_ADDRESS}</literal> with the <literal>VIP</literal> address).
pt_br: O arquivo de recurso personalizado <literal>metalLB</literal> com o <literal>IPaddressPool</literal> e o <literal>L2Advertisement</literal> que serão usados (substituindo <literal>${EDGE_VIP_ADDRESS}</literal> pelo endereço <literal>VIP</literal>).

source: The last block of information contains the Kubernetes version to be used. The <literal>${RKE2_VERSION}</literal> is the version of <literal>RKE2</literal> to be used replacing this value (for example, <literal>v1.32.4+rke2r1</literal>).
pt_br: Os último bloco de informações contém a versão do Kubernetes que será usada. A <literal>${RKE2_VERSION}</literal> é a versão do <literal>RKE2</literal> que será usada no lugar desse valor (por exemplo, <literal>v1.32.4+rke2r1</literal>).
