Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Make sure that SUC Plan tolerations match node tolerations</emphasis> - If your Kubernetes cluster nodes have custom <emphasis role="strong">taints</emphasis>, make sure to add <link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">tolerations</link> for those taints in the <emphasis role="strong">SUC Plans</emphasis>. By default <emphasis role="strong">SUC Plans</emphasis> have tolerations only for <emphasis role="strong">control-plane</emphasis> nodes. Default tolerations include:
es: <emphasis role="strong">Asegúrese de que las tolerancias del plan de SUC coincidan con las tolerancias de los nodos</emphasis>. Si los nodos del clúster de Kubernetes tienen <emphasis role="strong">intolerancias (taints)</emphasis> personalizadas, asegúrese de añadir <link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">tolerancias (tolerations)</link> para ellas en los <emphasis role="strong">planes de SUC</emphasis>. Por defecto, los <emphasis role="strong">planes de SUC</emphasis> solo tienen tolerancias para los nodos de <emphasis role="strong">plano de control</emphasis>. Las tolerancias predeterminadas son:
ja: <emphasis role="strong">SUC PlanのTolerationがノードのTolerationと一致すること</emphasis> - Kubernetesクラスタノードにカスタムの<emphasis role="strong">Taint</emphasis>が設定されている場合は、<emphasis role="strong">SUC Plan</emphasis>にそのTaintに対する<link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">Toleration</link>を追加してください。デフォルトでは、<emphasis role="strong">SUC Plan</emphasis>には、<emphasis role="strong">control-plane</emphasis>ノードのTolerationのみが含まれます。デフォルトのTolerationは次のとおりです。
pt_br: <emphasis role="strong">Garantir que as tolerâncias do plano do SUC correspondam às do nó</emphasis>: se os nós do cluster Kubernetes têm <emphasis role="strong">taints</emphasis> personalizados, adicione <link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">tolerâncias</link> a esses taints nos <emphasis role="strong">planos do SUC</emphasis>. Por padrão, os <emphasis role="strong">planos do SUC</emphasis> têm tolerâncias apenas para nós do <emphasis role="strong">plano de controle</emphasis>. As tolerâncias padrão incluem:
zh_cn: <emphasis role="strong">确保 SUC 计划容忍度与节点容忍度相匹配</emphasis> - 如果您的 Kubernetes 群集节点具有自定义<emphasis role="strong">污点</emphasis>，请确保在 <emphasis role="strong">SUC 计划</emphasis>中为这些污点添加<link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">容忍度</link>。默认情况下，<emphasis role="strong">SUC 计划</emphasis>仅包含<emphasis role="strong">控制平面</emphasis>节点的容忍度。默认容忍度包括：

source: Any additional tolerations must be added under the <literal>.spec.tolerations</literal> section of each Plan. <emphasis role="strong">SUC Plans</emphasis> related to the Kubernetes version upgrade can be found in the <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> repository under:
es: Cualquier tolerancia adicional debe añadirse en la sección <literal>.spec.tolerations</literal> de cada plan. Los <emphasis role="strong">planes de SUC</emphasis> relacionados con la actualización de la versión de Kubernetes se encuentran en el repositorio <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> en:
ja: 追加のTolerationは、各Planの<literal>.spec.tolerations</literal>セクションに追加する必要があります。Kubernetesバージョンアップグレードに関する<emphasis role="strong">SUC Plan</emphasis>は、次の場所の<link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>リポジトリにあります。
pt_br: As tolerâncias adicionais devem ser incluídas na seção <literal>.spec.tolerations</literal> de cada plano. Os <emphasis role="strong">planos do SUC</emphasis> relacionados ao upgrade de versões do Kubernetes estão disponíveis no repositório <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> em:
zh_cn: 其他任何容忍度必须添加到每个计划的 <literal>.spec.tolerations</literal> 部分下。与 Kubernetes 版本升级相关的 <emphasis role="strong">SUC 计划</emphasis>可以在 <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> 储存库中的以下位置找到：

source: For <emphasis role="strong">RKE2</emphasis> - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade</literal>
es: Para <emphasis role="strong">RKE2</emphasis>: <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade</literal>
ja: <emphasis role="strong">RKE2</emphasis> - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade</literal>
pt_br: Para o <emphasis role="strong">RKE2</emphasis>: <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade</literal>
zh_cn: 对于 <emphasis role="strong">RKE2</emphasis> - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade</literal>

source: For <emphasis role="strong">K3s</emphasis> - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade</literal>
es: Para <emphasis role="strong">K3s</emphasis>: <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade</literal>
ja: <emphasis role="strong">K3s</emphasis> - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade</literal>
pt_br: Para o <emphasis role="strong">K3s</emphasis>: <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade</literal>
zh_cn: 对于 <emphasis role="strong">K3s</emphasis> - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade</literal>

source: <emphasis role="strong">Make sure you use the Plans from a valid repository <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag.</emphasis>
es: <emphasis role="strong">Asegúrese de usar los planes de una etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> del repositorio válida.</emphasis>
ja: <emphasis role="strong">必ず、有効なリポジトリ<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグからのPlanを使用してください。</emphasis>
pt_br: <emphasis role="strong">Use os planos de uma tag de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> válida do repositório.</emphasis>
zh_cn: <emphasis role="strong">请确保使用有效储存库<link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记中的计划。</emphasis>

source: An example of defining custom tolerations for the RKE2 <emphasis role="strong">control-plane</emphasis> SUC Plan, would look like this:
es: Este es un ejemplo de definición de tolerancias personalizadas para el plan de SUC de <emphasis role="strong">plano de control</emphasis> de RKE2:
ja: RKE2 <emphasis role="strong">control-plane</emphasis> SUC PlanのカスタムTolerationの定義例は次のようになります。
pt_br: Um exemplo de definição de tolerâncias personalizadas para o plano do SUC de <emphasis role="strong">plano de controle</emphasis> do RKE2 tem esta aparência:
zh_cn: 为 RKE2 <emphasis role="strong">控制平面</emphasis> SUC 计划定义自定义容忍度的示例如下：

source: K8s upgrade - SUC plan deployment
es: Actualización de K8s - Despliegue del plan de SUC
ja: K8sアップグレード - SUC Planのデプロイメント
pt_br: Upgrade do K8s: implantação do plano do SUC
zh_cn: K8s 升级 - SUC 计划部署

source: As mentioned in <xref linkend="management-day2-fleet-k8s-upgrade-overview"/>, Kubernetes upgrades are done by shipping <literal>SUC plans</literal> to the desired cluster through one of the following ways:
es: Como se menciona en la <xref linkend="management-day2-fleet-k8s-upgrade-overview"/>, las actualizaciones de Kubernetes se realizan incluyendo <literal>planes de SUC</literal> en el clúster deseado de las siguientes formas:
ja: <xref linkend="management-day2-fleet-k8s-upgrade-overview"/>で説明したように、Kubernetesアップグレードは、次のいずれかの方法を使用して<literal>SUC Plan</literal>を目的のクラスタに配布することで実行されます。
pt_br: Conforme mencionado na <xref linkend="management-day2-fleet-k8s-upgrade-overview"/>, os upgrades do Kubernetes são feitos enviando os <literal>planos do SUC</literal> para o cluster desejado de uma destas maneiras:
zh_cn: 如<xref linkend="management-day2-fleet-k8s-upgrade-overview"/>中所述，可以通过以下任意一种方式将 <literal>SUC 计划</literal>分发到目标群集来完成 Kubernetes 升级：

source: Fleet GitRepo resource (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
es: Recurso GitRepo de Fleet (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
ja: Fleet GitRepoリソース(<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
pt_br: Recurso GitRepo do Fleet (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>)
zh_cn: Fleet GitRepo 资源（<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo"/>）

source: Fleet Bundle resource (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
es: Recurso Bundle de Fleet (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
ja: Fleetバンドルリソース(<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
pt_br: Recurso Bundle do Fleet (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>)
zh_cn: Fleet 捆绑包资源（<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle"/>）

source: For use-cases where you wish to deploy the <literal>K8s SUC plans</literal> from a third-party GitOps tool, refer to <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>
es: Si desea desplegar los <literal>planes de SUC de K8s</literal> desde una herramienta GitOps de terceros, consulte la <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>.
ja: <literal>K8s SUC Plan</literal>をサードパーティのGitOpsツールからデプロイするユースケースの場合は、<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>を参照してください。
pt_br: Para casos de uso de implantação dos <literal>planos do SUC do K8s</literal> de uma ferramenta GitOps de terceiros, consulte a <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>.
zh_cn: 对于希望通过第三方 GitOps 工具部署 <literal>K8s SUC 计划</literal>的使用场景，请参见<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-third-party"/>。

source: A <emphasis role="strong">GitRepo</emphasis> resource, that ships the needed <literal>K8s SUC plans</literal>, can be deployed in one of the following ways:
es: Es posible desplegar un recurso <emphasis role="strong">GitRepo</emphasis>, que incluye los <literal>planes de SUC de K8s</literal> necesarios, de las siguientes formas:
ja: 必要な<literal>K8s SUC Plan</literal>を配布する、<emphasis role="strong">GitRepo</emphasis>リソースは、次の方法のいずれかでデプロイできます。
pt_br: Um recurso <emphasis role="strong">GitRepo</emphasis>, que distribui os <literal>planos do SUC do K8s</literal> necessários, pode ser implantado de uma das seguintes maneiras:
zh_cn: 提供所需 <literal>K8s SUC 计划</literal>的 <emphasis role="strong">GitRepo</emphasis> 资源可通过以下方式之一进行部署：

source: Through the <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/>を通じて(<literal>Rancher</literal>が利用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-gitrepo-manual"/>）到<literal>管理群集</literal>。

source: Once deployed, to monitor the Kubernetes upgrade process of the nodes of your targeted cluster, refer to <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
es: Una vez desplegado, para supervisar el proceso de actualización de Kubernetes de los nodos del clúster de destino, consulte la <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
ja: デプロイ後に、ターゲットクラスタのノードのKubernetesアップグレードプロセスを監視するには、<xref linkend="components-system-upgrade-controller-monitor-plans"/>を参照してください。
pt_br: Após a implantação, para monitorar o processo de upgrade do Kubernetes dos nós do cluster de destino, consulte a <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
zh_cn: 部署后，要监控目标群集节点的 Kubernetes 升级过程，请参见<xref linkend="components-system-upgrade-controller-monitor-plans"/>。

source: The Edge team maintains ready to use fleets for both <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/rke2-upgrade">rke2</link> and <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/k3s-upgrade">k3s</link> Kubernetes distributions. Depending on your environment, this fleet could be used directly or as a template.
es: El equipo de Edge mantiene flotas listas para usar para las distribuciones de Kubernetes <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/rke2-upgrade">rke2</link> y <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/k3s-upgrade">k3s</link>. Según su entorno, estas flotas se pueden usar directamente o como plantilla.
ja: Edgeチームは、<link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/rke2-upgrade">rke2</link>と<link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/k3s-upgrade">k3s</link> Kubernetesディストリビューションの両方のすぐに使用できるフリートを維持しています。環境によっては、このフリートを直接使用することも、テンプレートとして使用することもできます。
zh_cn: Edge 团队为 <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/rke2-upgrade">rke2</link> 和 <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/k3s-upgrade">k3s</link> 这两种 Kubernetes 发行版维护着即用型 Fleet。根据您的环境的不同，这些 Fleet 可以直接使用或用作模板。

source: Always use these fleets from a valid Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag.
es: Utilice siempre estas flotas desde una etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de Edge válida.
ja: 常に、これらのフリートは有効なEdge<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグから使用してください。
pt_br: Sempre use as instâncias do Fleet de uma tag de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> válida do Edge.
zh_cn: 请务必通过有效的 Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记使用这些 Fleet。

source: For use-cases where no custom changes need to be included to the <literal>SUC plans</literal> that these fleets ship, users can directly refer the fleets from the <literal>suse-edge/fleet-examples</literal> repository.
es: Cuando no sea necesario incluir cambios personalizados en los <literal>planes de SUC</literal> que incluyen estas flotas, los usuarios pueden consultar directamente las flotas en el repositorio <literal>suse-edge/fleet-examples</literal>.
ja: これらのフリートが配布する<literal>SUC Plan</literal>にカスタム変更を含める必要がないユースケースの場合、ユーザは<literal>suse-edge/fleet-examples</literal>リポジトリからフリートを直接参照できます。
pt_br: Para casos de uso em que não há necessidade de incluir alterações personalizadas nos <literal>planos do SUC</literal> que as instâncias do Fleet envia, os usuários podem fazer referência a essas instâncias do Fleet diretamente do repositório <literal>suse-edge/fleet-examples</literal>.
zh_cn: 对于不需要在这些 Fleet 附带的 <literal>SUC 计划</literal>中包含自定义更改的使用场景，用户可以直接引用 <literal>suse-edge/fleet-examples</literal> 储存库中的 Fleet。

source: In cases where custom changes are needed (e.g. to add custom tolerations), users should refer the fleets from a separate repository, allowing them to add the changes to the SUC plans as required.
es: Si fuera necesario realizar cambios personalizados (por ejemplo, para añadir tolerancias personalizadas), los usuarios deben consultar las flotas desde un repositorio independiente, lo que les permitirá añadir los cambios a los planes de SUC según sea necesario.
ja: カスタム変更(カスタム許容値の追加など)が必要な場合、ユーザは別のリポジトリからフリートを参照して、必要に応じてSUC Planに変更を追加できるようにする必要があります。
pt_br: Nos casos em que as alterações personalizadas são necessárias (por exemplo, para adicionar tolerâncias personalizadas), os usuários devem fazer referência às instâncias do Fleet de um repositório separado, para que possam adicionas as alterações aos planos do SUC conforme necessário.
zh_cn: 如果需要自定义更改（例如添加自定义容忍度），用户应从单独的储存库中引用 Fleet，以便能够根据需要将更改添加到 SUC 计划中。

source: Configuration examples for a <literal>GitRepo</literal> resource using the fleets from <literal>suse-edge/fleet-examples</literal> repository:
es: Ejemplos de configuración para un recurso <literal>GitRepo</literal> utilizando las flotas del repositorio <literal>suse-edge/fleet-examples</literal>:
ja: <literal>suse-edge/fleet-examples</literal>リポジトリからフリートを使用した<literal>GitRepo</literal>リソースの設定例は、次のとおりです。
pt_br: Exemplos de configuração do recurso <literal>GitRepo</literal> usando as instâncias do Fleet do repositório <literal>suse-edge/fleet-examples</literal>:
zh_cn: 使用 <literal>suse-edge/fleet-examples</literal> 储存库中的 Fleet 配置 <literal>GitRepo</literal> 资源的示例：

source: For <emphasis role="strong">RKE2</emphasis> clusters:
es: Para clústeres <emphasis role="strong">RKE2</emphasis>:
ja: <emphasis role="strong">RKE2</emphasis>クラスタの場合:
pt_br: Para clusters <emphasis role="strong">RKE2</emphasis>:
zh_cn: 对于 <emphasis role="strong">RKE2</emphasis> 群集：

source: For <emphasis role="strong">K3s</emphasis> clusters:
es: Para clústeres <emphasis role="strong">K3s</emphasis>:
ja: <emphasis role="strong">K3s</emphasis>クラスタの場合:
pt_br: Para clusters <emphasis role="strong">K3s</emphasis>:
zh_cn: 对于 <emphasis role="strong">K3s</emphasis> 群集：

source: Apply the <emphasis role="strong">GitRepo</emphasis> resources to your <literal>management cluster</literal>:
es: Aplique los recursos <emphasis role="strong">GitRepo</emphasis> a su <literal>clúster de gestión</literal>:
ja: <emphasis role="strong">GitRepo</emphasis>リソースを<literal>管理クラスタ</literal>に適用します。
pt_br: Aplique os recursos <emphasis role="strong">GitRepo</emphasis> ao <literal>cluster de gerenciamento</literal>:
zh_cn: 将 <emphasis role="strong">GitRepo</emphasis> 资源应用于<literal>管理群集</literal>：

source: A <emphasis role="strong">Bundle</emphasis> resource, that ships the needed <literal>Kubernetes upgrade SUC Plans</literal>, can be deployed in one of the following ways:
es: Es posible desplegar un recurso <emphasis role="strong">Bundle</emphasis>, que incluye los <literal>planes de SUC de actualización de Kubernetes</literal> necesarios, de una de estas formas:
ja: 必要な<literal>KubernetesアップグレードSUC Plan</literal>を配布する、<emphasis role="strong">バンドル</emphasis>リソースは、次の方法のいずれかでデプロイできます。
pt_br: O recurso <emphasis role="strong">Bundle</emphasis>, que envia os <literal>planos do SUC de upgrade do Kubernetes</literal> necessários, pode ser implantado de uma das seguintes maneiras:
zh_cn: 可通过以下方式之一部署<emphasis role="strong">捆绑包</emphasis>资源，该资源中附带了所需的 <literal>Kubernetes 升级 SUC 计划</literal>：

source: Through the <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/>を通じて( <literal>Rancher</literal> が利用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="management-day2-fleet-k8s-upgrade-plan-deployment-bundle-manual"/>）到<literal>管理群集</literal>。

source: The Edge team maintains ready to use bundles for both <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">rke2</link> and <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">k3s</link> Kubernetes distributions. Depending on your environment these bundles could be used directly or as a template.
es: El equipo de Edge mantiene bundles listos para usar para las distribuciones de Kubernetes <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">rke2</link> y <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">k3s</link>. Dependiendo de su entorno, estos bundles se pueden utilizar directamente o como plantilla.
ja: Edgeチームは、<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">rke2</link>と<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">k3s</link> Kubernetesディストリビューションの両方のすぐに使用できるバンドルを維持しています。環境によっては、これらのバンドルを直接使用することも、テンプレートとして使用することもできます。
zh_cn: Edge 团队为 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">rke2</link> 和 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">k3s</link> 这两种 Kubernetes 发行版维护着即用型捆绑包。根据您的环境的不同，这些捆绑包可以直接使用或用作模板。
