Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: This definition specifies that we’re generating an output image for an AMD64/Intel 64 based system. The image that will be used as the base for further modification is an <literal>iso</literal> image named <literal>slemicro.iso</literal>, expected to be located at <literal>$CONFIG_DIR/base-images/slemicro.iso</literal>. It also outlines that after EIB finishes modifying the image, the output image will be named <literal>eib-image.iso</literal>, and by default will reside in <literal>$CONFIG_DIR</literal>.
es: Esta definición especifica que estamos generando una imagen de salida para un sistema basado en AMD64/Intel 64. Para modificaciones posteriores, se utilizará como base una imagen <literal>iso</literal> denominada <literal>slemicro.iso</literal>, que se espera que se encuentre en <literal>$CONFIG_DIR/base-images/slemicro.iso</literal>. También indica que, una vez que EIB haya terminado de modificarla, la imagen de salida se llamará <literal>eib-image.iso</literal> y, por defecto, se ubicará en <literal>$CONFIG_DIR</literal>.
ja: この定義では、AMD64/Intel 64ベースのシステム用の出力イメージを生成するように指定しています。さらに変更を加えるためのベースとして使用するイメージは、<literal>slemicro.iso</literal>という名前の<literal>iso</literal>イメージであり、<literal>$CONFIG_DIR/base-images/slemicro.iso</literal>にあることが想定されています。また、EIBがイメージの変更を完了すると、出力イメージは<literal>eib-image.iso</literal>という名前になり、デフォルトでは<literal>$CONFIG_DIR</literal>に存在することも記述されています。
pt_br: Essa definição especifica que estamos gerando uma imagem de saída para um sistema baseado em AMD64/Intel 64. A imagem que será usada como base para modificação posterior é uma imagem <literal>iso</literal> chamada <literal>slemicro.iso</literal>, que esperamos que esteja no local <literal>$CONFIG_DIR/base-images/slemicro.iso</literal>. Ela também descreve que, depois que o EIB terminar de modificar a imagem, a imagem de saída se chamará <literal>eib-image.iso</literal> e, por padrão, residirá em <literal>$CONFIG_DIR</literal>.
zh_cn: 此定义指定我们要为基于 AMD64/Intel 64 的系统生成输出映像。用作基础需要进一步修改的映像是名为 <literal>slemicro.iso</literal> 的 <literal>iso</literal> 映像，应该位于 <literal>$CONFIG_DIR/base-images/slemicro.iso</literal>。此定义还概述了在 EIB 修改完映像后，输出映像将命名为 <literal>eib-image.iso</literal>，默认情况下，该输出映像驻留在 <literal>$CONFIG_DIR</literal> 中。

source: Now our directory structure should look like:
es: Ahora, nuestra estructura de directorio debe tener este aspecto:
ja: これで、ディレクトリ構造は次のようになります。
pt_br: Agora a estrutura do nosso diretório deve ter esta aparência:
zh_cn: 现在，我们的目录结构应如下所示：

source: In the following sections we’ll walk through a few examples of common operations:
es: En las siguientes secciones veremos algunos ejemplos de operaciones comunes:
ja: 以降のセクションでは、一般的な操作の例をいくつか紹介していきます。
pt_br: Nas seções a seguir, vamos analisar alguns exemplos de operações comuns:
zh_cn: 下面的章节将介绍几个常见操作的示例：

source: Configuring OS Users
es: Configuración de usuarios del sistema operativo
ja: OSユーザの設定
pt_br: Configurando usuários do sistema operacional
zh_cn: 配置操作系统用户

source: EIB allows you to preconfigure users with login information, such as passwords or SSH keys, including setting a fixed root password. As part of this example we’re going to fix the root password, and the first step is to use <literal>OpenSSL</literal> to create a one-way encrypted password:
es: EIB permite preconfigurar la información de inicio de sesión de los usuarios, como las contraseñas o las claves SSH, incluyendo la configuración de una contraseña raíz fija. Como parte de este ejemplo, vamos a fijar la contraseña raíz, y el primer paso es utilizar <literal>OpenSSL</literal> para crear una contraseña cifrada unidireccional:
ja: EIBを使用すると、パスワードやSSHキーなどのログイン情報を事前にユーザに設定できます(固定されたルートパスワードの設定も含む)。この例の一部として、ルートパスワードを修正します。最初の手順は、<literal>OpenSSL</literal>を使用して一方向暗号化パスワードを作成することです。
pt_br: O EIB permite pré-configurar usuários com informações de login, como senhas ou chaves SSH, incluindo a definição de uma senha de root fixa. Como parte deste exemplo, vamos corrigir a senha de root, e o primeiro passo é usar o <literal>OpenSSL</literal> para criar uma senha criptografada unidirecional:
zh_cn: EIB 允许您为用户预先配置登录信息（例如口令或 SSH 密钥），包括设置固定的 root 口令。在此示例中，我们将修复 root 口令，而第一步是使用 <literal>OpenSSL</literal> 创建一次性的已加密口令：

source: This will output something similar to:
es: Se obtendrá un resultado similar a:
ja: これは次のような出力になります。
pt_br: A saída será semelhante a esta:
zh_cn: 此命令将输出如下所示的内容：

source: We can then add a section in the definition file called <literal>operatingSystem</literal> with a <literal>users</literal> array inside it. The resulting file should look like:
es: A continuación, podemos añadir una sección en el archivo de definición llamada <literal>operatingSystem</literal> con una matriz <literal>users</literal> en su interior. El archivo resultante debería tener el siguiente aspecto:
ja: 次に、定義ファイルに<literal>operatingSystem</literal>というセクションを追加し、その中に<literal>users</literal>配列を含めます。作成したファイルは次のようになります。
pt_br: Em seguida, podemos adicionar uma seção chamada <literal>operatingSystem</literal> ao arquivo de definição com uma matriz <literal>users</literal> dentro dela. O arquivo resultante terá esta aparência:
zh_cn: 然后，我们可以在定义文件中添加一个名为 <literal>operatingSystem</literal> 的部分，其中包含 <literal>users</literal> 数组。最终的文件应如下所示：

source: It’s also possible to add additional users, create the home directories, set user-id’s, add ssh-key authentication, and modify group information. Please refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">upstream building images guide</link> for further examples.
es: También es posible añadir usuarios adicionales, crear los directorios de inicio, establecer identificadores de usuario, añadir autenticación mediante claves SSH y modificar la información de los grupos. Consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">guía original sobre creación de imágenes</link> para ver más ejemplos.
ja: ユーザの追加、ホームディレクトリの作成、ユーザIDの設定、ssh-key認証の追加、グループ情報の変更も行うことができます。他の例については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">アップストリームのイメージ構築ガイド</link>を参照してください。
zh_cn: 您还可以添加其他用户、创建主目录、设置用户 ID、添加 SSH 密钥身份验证，以及修改组信息。请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">上游构建映像指南</link>获取更多示例。

source: Configuring OS time
es: Configuración de la hora del sistema operativo
ja: OSの時刻の設定
pt_br: Configurando o horário do sistema operacional
zh_cn: 配置操作系统时间

source: The <literal>time</literal> section is optional but it is highly recommended to be configured to avoid potential issues with certificates and clock skew. EIB will configure chronyd and <literal>/etc/localtime</literal> depending on the parameters here.
es: La sección <literal>time</literal> es opcional, pero se recomienda encarecidamente configurarla para evitar posibles problemas con los certificados y la desviación del reloj. EIB configurará chronyd y <literal>/etc/localtime</literal> en función de los parámetros aquí indicados.
ja: <literal>time</literal>セクションはオプションですが、証明書とクロックスキューに関する潜在的な問題を避けるために、設定することを強くお勧めします。EIBは、chronydと<literal>/etc/localtime</literal>をここのパラメータに応じて設定します。
pt_br: A seção <literal>time</literal> é opcional, mas sua configuração é altamente recomendada para evitar possíveis problemas com certificados e divergência do relógio. O EIB configura o chronyd e o <literal>/etc/localtime</literal> dependendo desses parâmetros.
zh_cn: 虽然 <literal>time</literal> 部分是可选的，但强烈建议配置该部分，以免出现证书和时钟偏差方面的潜在问题。EIB 将根据此处的参数配置 chronyd 和 <literal>/etc/localtime</literal>。

source: The <literal>timezone</literal> specifies the timezone in the format of "Region/Locality" (e.g. "Europe/London"). The full list may be found by running <literal>timedatectl list-timezones</literal> on a Linux system.
es: <literal>timezone</literal>: especifica la zona horaria en el formato "Región/Localidad" (por ejemplo, "Europa/Madrid"). Para ver la lista completa, ejecute <literal>timedatectl list-timezones</literal> en un sistema Linux.
ja: <literal>timezone</literal>では、タイムゾーンを「地域/都市」(例: 「Europe/London」)の形式で指定します。完全なリストを確認するには、Linuxシステム上で<literal>timedatectl list-timezones</literal>を実行します。
pt_br: O <literal>timezone</literal> especifica o fuso horário no formato "região/localidade" (por exemplo, "Europa/Londres"). É possível ver a lista completa executando o comando <literal>timedatectl list-timezones</literal> no sistema Linux.
zh_cn: <literal>timezone</literal> 以“区域/地点”格式指定时区（例如“欧洲/伦敦”）。在 Linux 系统上运行 <literal>timedatectl list-timezones</literal> 命令即可查看完整列表。

source: ntp - Defines attributes related to configuring NTP (using chronyd):
es: ntp: define los atributos relacionados con la configuración de NTP (usando chronyd).
ja: ntp - NTPの設定(chronydを使用)に関連する属性を定義します。
pt_br: ntp: define atributos relacionados à configuração do NTP (usando o chronyd).
zh_cn: ntp：定义与（使用 chronyd）配置 NTP 相关的属性：

source: forceWait - Requests that chronyd attempts to synchronize timesources before starting other services, with a 180s timeout.
es: forceWait: solicita que chronyd intente sincronizar las fuentes de tiempo antes de iniciar otros servicios, con un tiempo de espera de 180 segundos.
ja: forceWait - 他のサービスを開始する前にchronydが時刻ソースの同期を試行するよう要求します。タイムアウトは180秒です。
pt_br: forceWait: solicita que o chronyd tente sincronizar as fontes de horário antes de iniciar outros serviços, com um tempo limite de 180 segundos.
zh_cn: forceWait：要求 chronyd 在启动其他服务前尝试同步时间源，超时时间为 180 秒。

source: pools - Specifies a list of pools that chronyd will use as data sources (using <literal>iburst</literal> to improve the time taken for initial synchronization).
es: pools: especifica una lista de grupos que chronyd usará como fuentes de datos (utilizando <literal>iburst</literal> para mejorar el tiempo que tarda la sincronización inicial).
ja: pools - chronydがデータソースとして使用するプールのリストを指定します(<literal>iburst</literal>を使用すると、最初の同期にかかる時間を短縮できます)。
pt_br: pools: especifica uma lista de pools que o chronyd usará como fontes de dados (usando o <literal>iburst</literal> para melhorar o tempo gasto na sincronização inicial).
zh_cn: pools：指定 chronyd 将用作数据源的池列表（使用 <literal>iburst</literal> 缩短初始同步耗时）。

source: servers - Specifies a list of servers that chronyd will use as data sources (using <literal>iburst</literal> to improve the time taken for initial synchronization).
es: servers: especifica una lista de servidores que chronyd usará como fuentes de datos (utilizando <literal>iburst</literal> para mejorar el tiempo que tarda la sincronización inicial).
ja: servers - chronydがデータソースとして使用するサーバのリストを指定します(<literal>iburst</literal>を使用すると、最初の同期にかかる時間を短縮できます)。
pt_br: servers: especifica uma lista de servidores que o chronyd usará como fontes de dados (usando o <literal>iburst</literal> para melhorar o tempo gasto na sincronização inicial).
zh_cn: servers：指定 chronyd 将用作数据源的服务器列表（使用 <literal>iburst</literal> 缩短初始同步耗时）。

source: The values provided in this example are for illustrative purposes only. Please adjust them to fit your specific requirements.
es: Los valores proporcionados en este ejemplo son solo ilustrativos. Ajústelos para que se adapten a sus necesidades específicas.
ja: この例で指定されている値は説明のみを目的としています。ご自身の特定の要件に合わせて調整してください。
pt_br: Os valores apresentados neste exemplo são apenas para fins ilustrativos. Ajuste-os de acordo com seus requisitos específicos.
zh_cn: 本示例中提供的值仅作说明之用，请根据您的具体要求相应调整。

source: Adding certificates
es: Adición de certificados
ja: 証明書の追加
pt_br: Adicionando certificados
zh_cn: 添加证书

source: Certificate files with the extension ".pem" or ".crt" stored in the <literal>certificates</literal> directory will be installed in the node system-wide certificate store:
es: Los archivos de certificado con la extensión .pem o .crt almacenados en el directorio <literal>certificates</literal> se instalarán en el almacén de certificados del sistema del nodo:
ja: <literal>certificates</literal>ディレクトリに保存された拡張子「.pem」または「.crt」の証明書ファイルは、ノードのシステム全体の証明書ストアにインストールされます。
pt_br: Arquivos de certificado com a extensão ".pem" ou ".crt" armazenados no diretório <literal>certificates</literal> serão instalados no armazenamento de certificados global do sistema do nó:
zh_cn: <literal>certificates</literal> 目录中存储的扩展名为“.pem”或“.crt”的证书文件将安装在节点系统范围的证书存储区内：

source: See the <link xl:href="https://documentation.suse.com/smart/security/html/tls-certificates/index.html#tls-adding-new-certificates">"Securing Communication with TLS Certificate" guide</link> for more information.
es: Consulte la guía <link xl:href="https://documentation.suse.com/smart/security/html/tls-certificates/index.html#tls-adding-new-certificates">Securing Communication with TLS Certificate</link> (Protección de las comunicaciones con un certificado TLS) para obtener más información.
ja: 詳細については、<link xl:href="https://documentation.suse.com/smart/security/html/tls-certificates/index.html#tls-adding-new-certificates">「Securing Communication with TLS Certificate (TLS証明書による通信のセキュリティ保護)」ガイド</link>を参照してください。
pt_br: Consulte o <link xl:href="https://documentation.suse.com/smart/security/html/tls-certificates/index.html#tls-adding-new-certificates">guia "Securing Communication with TLS Certificate"</link> (Protegendo a comunicação com o certificado TLS) para obter mais informações.
zh_cn: 有关详细信息，请参见<link xl:href="https://documentation.suse.com/smart/security/html/tls-certificates/index.html#tls-adding-new-certificates">《Securing Communication with TLS Certificate》指南</link>。

source: Configuring RPM packages
es: Configuración de paquetes RPM
ja: RPMパッケージの設定
pt_br: Configurando pacotes RPM
zh_cn: 配置 RPM 软件包

source: One of the major features of EIB is to provide a mechanism to add additional software packages to the image, so when the installation completes the system is able to leverage the installed packages right away. EIB permits users to specify the following:
es: Una de las principales características de EIB es que proporciona un mecanismo para añadir paquetes de software adicionales a la imagen, de modo que, una vez completada la instalación, el sistema puede aprovechar los paquetes instalados de inmediato. EIB permite a los usuarios especificar lo siguiente:
ja: EIBの主な特徴の1つは、イメージにソフトウェアパッケージを追加するメカニズムを備えていることです。このため、インストールが完了した時点で、システムはインストールされたパッケージをすぐに利用できます。EIBでは、ユーザは以下を行うことができます。
pt_br: Um dos principais recursos do EIB é o mecanismo para adicionar outros pacotes de software à imagem, dessa forma, o sistema pode aproveitar os pacotes instalados assim que a instalação é concluída. O EIB permite que os usuários especifiquem o seguinte:
zh_cn: EIB 的主要功能之一是提供相关机制来向映像添加更多软件包，以便在安装完成时，系统能够立即利用已安装的软件包。EIB 允许用户指定以下信息：

source: Packages by their name within a list in the image definition
es: Paquetes por su nombre dentro de una lista en la definición de imagen
ja: イメージ定義のリスト内の名前でパッケージを指定する
pt_br: Pacotes por nome em uma lista na definição da imagem
zh_cn: 映像定义中按名称列出的软件包

source: Network repositories to search for these packages in
es: Repositorios de red para buscar estos paquetes
ja: これらのパッケージを検索するネットワークリポジトリを指定する
pt_br: Repositórios de rede nos quais pesquisar os pacotes
zh_cn: 要从中搜索这些软件包的网络储存库

source: SUSE Customer Center (SCC) credentials to search official SUSE repositories for the listed packages
es: Credenciales del Centro de servicios al cliente de SUSE (SCC) para buscar los paquetes mostrados en los repositorios oficiales de SUSE
ja: 一覧にされたパッケージをSUSEの公式リポジトリで検索するためのSUSE Customer Center (SCC)資格情報を指定する
pt_br: Credenciais do SUSE Customer Center (SCC) para pesquisar os pacotes listados em repositórios oficiais da SUSE
zh_cn: SUSE Customer Center (SCC) 身份凭证，用于在官方 SUSE 储存库中搜索列出的软件包

source: Via an <literal>$CONFIG_DIR/rpms</literal> directory, side-load custom RPM’s that don’t exist in network repositories
es: Mediante un directorio <literal>$CONFIG_DIR/rpms</literal>, paquetes RPM personalizados y locales que no existen en los repositorios de red
ja: <literal>$CONFIG_DIR/rpms</literal>ディレクトリ経由で、ネットワークリポジトリに存在しないカスタムRPMをサイドロードする
pt_br: Por um diretório <literal>$CONFIG_DIR/rpms</literal>, fazer sideload dos RPMs personalizados que não existem nos repositórios de rede
zh_cn: 通过 <literal>$CONFIG_DIR/rpms</literal> 目录侧载网络储存库中不存在的自定义 RPM

source: Via the same directory (<literal>$CONFIG_DIR/rpms/gpg-keys</literal>), GPG-keys to enable validation of third party packages
es: Mediante el mismo directorio (<literal>$CONFIG_DIR/rpms/gpg-keys</literal>), claves GPG para habilitar la validación de paquetes de terceros
ja: 同じディレクトリ(<literal>$CONFIG_DIR/rpms/gpg-keys</literal>)経由で、サードパーティ製パッケージの検証を有効にするためにGPGキーを指定する
pt_br: Pelo mesmo diretório (<literal>$CONFIG_DIR/rpms/gpg-keys</literal>), chaves GPG para habilitar a validação de pacotes de terceiros
zh_cn: 通过同一目录 (<literal>$CONFIG_DIR/rpms/gpg-keys</literal>) 指定 GPG 密钥，以便可以验证第三方软件包

source: EIB will then run through a package resolution process at image build time, taking the base image as the input, and attempts to pull and install all supplied packages, either specified via the list or provided locally. EIB downloads all of the packages, including any dependencies into a repository that exists within the output image and instructs the system to install these during the first boot process. Doing this process during the image build guarantees that the packages will successfully install during first-boot on the desired platform, e.g. the node at the edge. This is also advantageous in environments where you want to bake the additional packages into the image rather than pull them over the network when in operation, e.g. for air-gapped or restricted network environments.
es: EIB ejecuta un proceso de resolución de paquetes en el momento de la creación de la imagen, tomando la imagen base como entrada, e intentará extraer e instalar todos los paquetes suministrados, ya sea especificados a través de la lista o proporcionados localmente. EIB descarga todos los paquetes, incluidas las dependencias, en un repositorio que existe dentro de la imagen de salida e indica al sistema que los instale durante el primer proceso de arranque. Realizar este proceso durante la creación de la imagen garantiza que los paquetes se instalarán correctamente durante el primer arranque en la plataforma deseada, por ejemplo, el nodo del perímetro. Esto también es útil en entornos en los que se desea integrar los paquetes adicionales en la imagen en lugar de descargarlos a través de la red durante el funcionamiento, por ejemplo, en entornos de red restringidos o aislados.
ja: これにより、EIBは、イメージの構築時にパッケージ解決プロセスを実行し、ゴールデンイメージを入力として受け取り、提供されているパッケージ(リストで指定されているか、ローカルで提供されているパッケージ)をすべてプルしてインストールしようと試みます。EIBは、依存関係を含むすべてのパッケージを出力イメージ内に存在するリポジトリにダウンロードし、そのパッケージを初回ブートプロセス中にインストールするようにシステムに指示します。イメージの構築中にこのプロセスを実行することで、初回ブート時にパッケージが目的のプラットフォーム(エッジのノードなど)に正常にインストールされることが保証されます。これは、操作時に追加パッケージをネットワーク経由でプルするのではなく、イメージに事前に書き込んでおきたい環境でも便利です。たとえば、エアギャップ環境や、ネットワークが制限された環境です。
pt_br: Em seguida, o EIB é executado por um processo de resolução de pacote no momento da criação da imagem, usando a imagem base como entrada, e tenta obter e instalar todos os pacotes fornecidos, especificados pela lista ou fornecidos localmente. O EIB faz download de todos os pacotes, incluindo as dependências, em um repositório existente na imagem de saída, e instrui o sistema a instalá-los durante o processo da primeira inicialização. A execução desse processo durante a criação da imagem garante que os pacotes sejam devidamente instalados na plataforma desejada, por exemplo, o nó de borda, durante a primeira inicialização. Isso também é vantajoso em ambientes nos quais você deseja fazer bake dos pacotes adicionais na imagem, em vez de extraí-los pela rede durante a operação, por exemplo, em ambientes air-gapped ou de rede restrita.
zh_cn: 然后，EIB 将在映像构建时运行软件包解析过程，将基础映像用作输入，并尝试提取和安装所有提供的软件包（通过列表指定或在本地提供）。EIB 将所有软件包（包括所有依赖项）下载到输出映像中存在的储存库，并指示系统在首次引导过程中安装这些软件包。在映像构建期间执行此过程可确保在首次引导期间成功将软件包安装在所需平台（例如边缘节点）上。这对于需要将其他软件包嵌入映像，而非在运行时通过网络提取的环境（例如隔离环境或网络受限环境）而言，同样具有优势。

source: As a simple example to demonstrate this, we are going to install the <literal>nvidia-container-toolkit</literal> RPM package found in the third party vendor-supported NVIDIA repository:
es: Como ejemplo de demostración simple, vamos a instalar el paquete RPM <literal>nvidia-container-toolkit</literal> que se encuentra en el repositorio NVIDIA de terceros:
ja: これを示すシンプルな例として、サードパーティベンダがサポートするNVIDIAリポジトリにある<literal>nvidia-container-toolkit</literal> RPMパッケージをインストールします。
pt_br: Como um exemplo simples para demonstrar esse procedimento, vamos instalar o pacote RPM <literal>nvidia-container-toolkit</literal> encontrado no repositório NVIDIA mantido por fornecedor terceirizado:
zh_cn: 我们通过一个简单的示例来演示这一点：我们将安装由第三方供应商提供支持的 NVIDIA 储存库中的 <literal>nvidia-container-toolkit</literal> RPM 软件包：

source: The resulting definition file looks like the following:
es: El archivo de definición resultante tiene el siguiente aspecto:
ja: 生成される定義ファイルは次のようになります。
pt_br: O arquivo de definição resultante terá esta aparência:
zh_cn: 最终的定义文件如下所示：

source: The above is a simple example, but for completeness, download the NVIDIA package signing key before running the image generation:
es: Este es un ejemplo sencillo. Si necesita uno más detallad, descargue la clave de firma del paquete NVIDIA antes de ejecutar la generación de la imagen:
ja: 上記はシンプルな例ですが、完全を期するために、イメージ生成を実行する前にNVIDIAパッケージ署名キーをダウンロードしてください。
pt_br: O exemplo acima é simples, mas para uma totalidade, faça download da chave de assinatura do pacote NVIDIA antes de gerar a imagem:
zh_cn: 上面是一个简单的示例，但为了完整性，请在运行映像生成过程之前先下载 NVIDIA 软件包签名密钥：
