Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Downstream clusters</emphasis>: The downstream clusters are the clusters deployed to run Telco workloads. Specific requirements are needed to enable certain Telco capabilities like <literal>SR-IOV</literal>, <literal>CPU Performance Optimization</literal>, etc.
es: <emphasis role="strong">Clústeres descendentes</emphasis>: los clústeres descendentes son los clústeres desplegados para ejecutar cargas de trabajo de telecomunicaciones. Hay requisitos específicos para habilitar ciertas capacidades de telecomunicaciones como <literal>SR-IOV</literal>, <literal>Optimización del rendimiento de la CPU</literal>, etc.
ja: <emphasis role="strong">ダウンストリームクラスタ</emphasis>: ダウンストリームクラスタは、通信ワークロードを実行するためにデプロイされるクラスタです。<literal>SR-IOV</literal>、<literal>CPUパフォーマンス最適化</literal>などの特定の通信機能を有効にするには、固有の要件が必要になります。
pt_br: <emphasis role="strong">Clusters downstream</emphasis>: trata-se dos clusters implantados para executar as cargas de trabalho de telecomunicações. Requisitos específicos são necessários para habilitar determinados recursos de telecomunicações, como <literal>SR-IOV</literal>, <literal>otimização de desempenho da CPU</literal> etc.
zh_cn: <emphasis role="strong">下游群集</emphasis>：下游群集是用于运行电信工作负载的群集。需要满足特定的要求才能启用 <literal>SR-IOV</literal>、<literal>CPU 性能优化</literal>等特定电信功能。

source: SR-IOV: to attach VFs (Virtual Functions) in pass-through mode to CNFs/VNFs, the NIC must support SR-IOV and VT-d/AMD-Vi be enabled in the BIOS.
es: SR-IOV: para adjuntar funciones virtuales (VF) en modo de encaminamiento a varias CNF/VNF, la tarjeta de interfaz de red debe admitir SR-IOV y VT-d/AMD-Vi debe estar habilitado en el BIOS.
ja: SR-IOV: VF (仮想機能)をCNF/VNFにパススルーモードでアタッチするには、NICがSR-IOVをサポートしていて、BIOSでVT-d/AMD-Viが有効化されている必要があります。
pt_br: SR-IOV: para anexar funções virtuais (VFs, Virtual Functions) no modo de passagem a CNFs/VNFs, a NIC deve permitir que SR-IOV e VT-d/AMD-Vi sejam habilitados no BIOS.
zh_cn: SR-IOV：要以直通模式将 VF（虚拟功能）附加到 CNF/VNF，NIC 必须支持 SR-IOV，并且必须在 BIOS 中启用 VT-d/AMD-Vi。

source: CPU Processors: To run specific Telco workloads, the CPU Processor model should be adapted to enable most of the features available in this reference table (<xref linkend="atip-features"/>).
es: Procesadores CPU: para ejecutar cargas de trabajo específicas de telecomunicaciones, el modelo de procesador CPU debe adaptarse para permitir la mayoría de las funciones disponibles en esta tabla de referencia (<xref linkend="atip-features"/>).
ja: CPUプロセッサ: 特定の通信ワークロードを実行するには、こちらの参照表(<xref linkend="atip-features"/>)に記載されているほとんどの機能を利用できるようにCPUプロセッサモデルを適応させる必要があります。
pt_br: Processadores de CPU: para executar cargas de trabalho de telecomunicações, o modelo de processador da CPU deve ser adaptado para disponibilizar a maior parte dos recursos nesta tabela de referência (<xref linkend="atip-features"/>).
zh_cn: CPU 处理器：要运行特定的电信工作负载，应该适配 CPU 处理器型号，以启用此参考表格（<xref linkend="atip-features"/>）中所述的大多数功能。

source: Firmware requirements for installing with virtual media:
es: Requisitos de firmware para la instalación con medios virtuales:
ja: 仮想メディアでインストールするためのファームウェア要件:
pt_br: Requisitos de firmware para instalação com mídia virtual:
zh_cn: 使用虚拟媒体进行安装所要满足的固件要求：

source: Server Hardware
es: Hardware del servidor
ja: サーバハードウェア
pt_br: Hardware de servidor
zh_cn: 服务器硬件

source: BMC Model
es: Modelo de BMC
ja: BMCモデル
pt_br: Modelo de BMC
zh_cn: BMC 型号

source: Management
es: Gestión
ja: 管理
pt_br: Gerenciamento
zh_cn: 管理

source: Dell hardware
es: Hardware Dell
ja: Dell製ハードウェア
pt_br: Hardware Dell
zh_cn: Dell 硬件

source: 15th Generation
es: 15.ª generación
ja: 第15世代
pt_br: 15ª geração
zh_cn: 第 15 代

source: Supermicro hardware
es: Hardware Supermicro
ja: Supermicro製ハードウェア
pt_br: Hardware Supermicro
zh_cn: Supermicro 硬件

source: HPE hardware
es: Hardware HPE
ja: HPE製ハードウェア
pt_br: Hardware HPE
zh_cn: HPE 硬件

source: Network
es: Red
ja: ネットワーク
pt_br: Rede
zh_cn: 网络

source: As a reference for the network architecture, the following diagram shows a typical network architecture for a Telco environment:
es: Como referencia para la arquitectura de red, el siguiente diagrama muestra una arquitectura de red típica para un entorno de telecomunicaciones:
ja: ネットワークアーキテクチャの参考として、次の図に、通信事業者環境の一般的なネットワークアーキテクチャを示します。
pt_br: Como referência à arquitetura de rede, o seguinte diagrama mostra uma arquitetura de rede típica para um ambiente de telecomunicações:
zh_cn: 下图显示了电信环境的典型网络体系结构作为参考：

source: product atip requirements1
es: requisitos de producto atip 1
ja: 製品atip要件1
pt_br: requisitos1 produto atip
zh_cn: ATIP 产品要求 1

source: The network architecture is based on the following components:
es: La arquitectura de red se basa en los siguientes componentes:
ja: このネットワークアーキテクチャは次のコンポーネントに基づきます。
pt_br: A arquitetura de rede baseia-se nos seguintes componentes:
zh_cn: 网络体系结构基于以下组件：

source: <emphasis role="strong">Management network</emphasis>: This network is used for the management of downstream cluster nodes. It is used for the out-of-band management. Usually, this network is also connected to a separate management switch, but it can be connected to the same service switch using VLANs to isolate the traffic.
es: <emphasis role="strong">Red de gestión</emphasis>: esta red se usa para la gestión de los nodos del clúster descendentes. Se utiliza para la gestión fuera de banda. Por lo general, esta red también está conectada a un conmutador de gestión independiente, pero puede conectarse al mismo conmutador de servicio mediante VLAN para aislar el tráfico.
ja: <emphasis role="strong">管理ネットワーク</emphasis>: このネットワークは、ダウンストリームクラスタノードの管理や帯域外管理に使用されます。通常は独立した管理スイッチに接続しますが、同じサービススイッチに接続し、VLANを使ってトラフィックを分離することもできます。
pt_br: <emphasis role="strong">Rede de gerenciamento</emphasis>: essa rede é usada para gerenciamento de nós do cluster downstream. Ela é usada para gerenciamento fora da banda. Em geral, essa rede também é conectada a um comutador de gerenciamento separado, mas pode ser conectada ao mesmo comutador de serviço usando VLANs para isolar o tráfego.
zh_cn: <emphasis role="strong">管理网络</emphasis>：此网络用于管理下游群集节点。它用于进行带外管理。通常，此网络还会连接到独立的管理交换机，不过可以通过 VLAN 连接到同一服务交换机以隔离流量。

source: <emphasis role="strong">Control-plane network</emphasis>: This network is used for the communication between the downstream cluster nodes and the services that are running on them. This network is also used for the communication between the nodes and the external services, like the <literal>DHCP</literal> or <literal>DNS</literal> servers. In some cases, for connected environments, the switch/router can handle traffic through the Internet.
es: <emphasis role="strong">Red de plano de control</emphasis>: esta red se usa para la comunicación entre los nodos del clúster descendente y los servicios que se ejecutan en ellos. Esta red también se utiliza para la comunicación entre los nodos y los servicios externos, como los servidores <literal>DHCP</literal> o <literal>DNS</literal>. En algunos casos, para entornos conectados, el conmutador/enrutador puede gestionar el tráfico a través de Internet.
ja: <emphasis role="strong">コントロールプレーンネットワーク</emphasis>: このネットワークは、ダウンストリームクラスタノードと、そこで実行されているサービスとの間の通信に使用されます。また、ダウンストリームクラスタノードと外部サービス(<literal>DHCP</literal>サーバや<literal>DNS</literal>サーバなど)との間の通信にも使用されます。接続環境では、スイッチやルータでインターネット経由のトラフィックを処理できる場合もあります。
pt_br: <emphasis role="strong">Rede do plano de controle</emphasis>: essa rede é usada para comunicação entre os nós do cluster downstream e os serviços executados neles. Ela também é usada para comunicação entre os nós e os serviços externos, como servidores <literal>DHCP</literal> ou <literal>DNS</literal>. Em alguns casos, o comutador/roteador processa o tráfego pela Internet nos ambientes conectados.
zh_cn: <emphasis role="strong">控制平面网络</emphasis>：此网络用于下游群集节点与其上运行的服务之间的通信。此网络还用于这些节点与外部服务（例如 <literal>DHCP</literal> 或 <literal>DNS</literal> 服务器）之间的通信。在某些情况下，对于联网环境，交换机/路由器可以通过互联网处理流量。

source: <emphasis role="strong">Other networks</emphasis>: In some cases, nodes could be connected to other networks for specific purposes.
es: <emphasis role="strong">Otras redes</emphasis>: en algunos casos, los nodos podrían conectarse a otras redes con fines específicos.
ja: <emphasis role="strong">その他のネットワーク</emphasis>: 場合によっては、特定の目的に合わせてノードを他のネットワークに接続できます。
pt_br: <emphasis role="strong">Outras redes</emphasis>: em alguns casos, os nós podem se conectar a outras redes para finalidades específicas.
zh_cn: <emphasis role="strong">其他网络</emphasis>：在某些情况下，这些节点可以连接到其他网络以满足特定目的。

source: To use the directed network provisioning workflow, the management cluster must have network connectivity to the downstream cluster server Baseboard Management Controller (BMC) so that host preparation and provisioning can be automated.
es: Para utilizar el flujo de trabajo de aprovisionamiento de red dirigida, el clúster de gestión debe tener conectividad de red con el controlador de gestión de la placa base (BMC) del servidor del clúster descendente, de modo que se puedan automatizar la preparación y el aprovisionamiento del host.
ja: ダイレクトネットワークプロビジョニングワークフローを使用するには、管理クラスタがダウンストリームクラスタサーバのBaseboard Management Controller (BMC)とネットワークで接続されていて、ホストの準備とプロビジョニングを自動化できる必要があります。
pt_br: Para usar o fluxo de trabalho de provisionamento de rede direcionado, o cluster de gerenciamento deve ter conectividade de rede com o Baseboard Management Controller (BMC) do servidor de cluster downstream para que seja possível automatizar a preparação e o provisionamento do host.
zh_cn: 要使用定向网络置备工作流程，管理群集必须与下游群集服务器基板管理控制器 (BMC) 建立网络连接，以便可以自动准备和置备主机。

source: Port requirements
es: Requisitos de puertos
ja: ポート要件
zh_cn: 端口要求

source: To operate properly, a SUSE Telco Cloud deployment requires a number of ports to be reachable on the management and the downstream Kubernetes cluster nodes.
es: Para funcionar correctamente, un despliegue de SUSE Telco Cloud requiere que se pueda acceder a un número de puertos en los nodos de los clústeres de gestión y descendentes de Kubernetes.
ja: SUSE Telco Cloudのデプロイメントが適切に動作するには、管理ノードおよびダウンストリームKubernetesクラスタノードにアクセス可能な複数のポートが必要です。
zh_cn: 要使 SUSE Telco Cloud 部署正常运行，Kubernetes 管理群集和下游群集节点上需要开放多个可访问的端口。

source: The exact list depends on the deployed optional components and the selected deployment options (e.g., CNI plug-in).
es: La lista exacta depende de los componentes opcionales desplegados y de las opciones de despliegue seleccionadas (por ejemplo, el complemento de CNI).
ja: 正確なリストは、デプロイされているオプションコンポーネントと選択したデプロイメントオプション(CNIプラグインなど)によって異なります。
zh_cn: 具体端口列表取决于部署的可选组件和所选的部署选项（如 CNI 插件）。

source: Management Nodes
es: Nodos de gestión
ja: 管理ノード
zh_cn: 管理节点

source: The following table lists the opened ports in nodes running the management cluster:
es: En la tabla siguiente se muestran los puertos abiertos en los nodos en los que se ejecuta el clúster de gestión:
ja: 次の表は、管理クラスタを実行しているノードで開いているポートをリストしています。
zh_cn: 下表列出了运行管理群集的节点上开放的端口：

source: For CNI plug-in related ports, see CNI specific port requirements (<xref linkend="cni-specific-port-requirements"/>).
es: Para los puertos relacionados con el complemento de CNI, consulte los requisitos específicos de CNI (<xref linkend="cni-specific-port-requirements"/>).
ja: CNIプラグイン関連のポートについては、CNI固有のポート要件(<xref linkend="cni-specific-port-requirements"/>)を参照してください。
zh_cn: 有关 CNI 插件相关端口，请参见 CNI 特有的端口要求（<xref linkend="cni-specific-port-requirements"/>）。

source: Inbound Network Rules for Management Nodes
es: Reglas de red entrante para nodos de gestión
ja: 管理ノードの受信ネットワークルール
zh_cn: 管理节点的入站网络规则

source: Protocol
es: Protocolo
ja: プロトコル
zh_cn: 协议

source: Port
es: Puerto
ja: ポート
zh_cn: 端口

source: Source
es: Origen
ja: ソース
zh_cn: 来源

source: Description
es: Descripción
ja: 説明
pt_br: Descrição
zh_cn: 说明

source: Any source that requires SSH access
es: Cualquier fuente que requiera acceso SSH
ja: SSHアクセスを必要とする任意のソース
zh_cn: 需要 SSH 访问权限的任何来源

source: SSH access to management cluster nodes
es: Acceso SSH a los nodos del clúster de gestión
ja: 管理クラスタノードへのSSHアクセス
zh_cn: 对管理群集节点的 SSH 访问权限

source: Load balancer/proxy that does external TLS termination
es: Equilibrador de carga/proxy que realice una terminación TLS externa
ja: 外部TLS終端を行うロードバランサ/プロキシ
zh_cn: 执行外部 TLS 终止的负载平衡器/代理

source: Rancher UI/API when external TLS termination is used
es: Interfaz de usuario o API de Rancher si se usa terminación TLS externa
ja: 外部TLS終端が使用される場合はRancher UI/API
zh_cn: 使用外部 TLS 终止时的 Rancher UI/API

source: Any source that requires TLS access to Rancher UI/API
es: Cualquier fuente que requiera acceso TLS a la interfaz de usuario/API de Rancher
ja: Rancher UI/APIへのTLSアクセスを必要とする任意のソース
zh_cn: 需要通过 TLS 访问 Rancher UI/API 的任何来源

source: Rancher agent, Rancher UI/API
es: Agente de Rancher, interfaz de usuario/API de Rancher
ja: Rancherエージェント、Rancher UI/API
zh_cn: Rancher 代理、Rancher UI/API

source: RKE2 (management cluster) server nodes
es: Nodos de servidor RKE2 (clúster de gestión)
ja: RKE2 (管理クラスタ)サーバノード
zh_cn: RKE2（管理群集）服务器节点

source: <literal>etcd</literal> client port
es: Puerto cliente <literal>etcd</literal>
ja: <literal>etcd</literal>クライアントポート
zh_cn: <literal>etcd</literal> 客户端端口

source: <literal>etcd</literal> peer port
es: Puerto de par <literal>etcd</literal>
ja: <literal>etcd</literal>ピアポート
zh_cn: <literal>etcd</literal> 对等端口

source: Any BMC<superscript>(1)</superscript> previously instructed by <literal>Metal<superscript>3</superscript>/ironic</literal> to pull an IPA<superscript>(2)</superscript> ramdisk image from this exposed port (non-TLS)
es: Cualquier BMC<superscript>(1)</superscript> al que <literal>Metal<superscript>3</superscript>/ironic</literal> haya solicitado previamente que extraiga una imagen ramdisk de IPA<superscript>(2)</superscript> de su puerto expuesto (no TLS)
ja: この公開ポート(非TLS)からIPA<superscript>(2)</superscript> ramdiskイメージをプルするように <literal>Metal<superscript>3</superscript>/ironic</literal>によって以前に指示された任意のBMC<superscript>(1)</superscript>
zh_cn: 之前 <literal>Metal<superscript>3</superscript>/ironic</literal> 指示从该公开端口（非 TLS）拉取 IPA<superscript>(2)</superscript> 内存盘映像的任何 BMC<superscript>(1)</superscript>

source: <literal>Ironic</literal> httpd non-TLS web server serving IPA<superscript>(2)</superscript> ISO images for virtual media based boot <?asciidoc-br?> <?asciidoc-br?> In case this port is enabled, the functionally equivalent but TLS-enabled one (see below) is not opened
es: Servidor Web HTTPD <literal>Ironic</literal> que no sea TLS que proporcione imágenes ISO de IPA<superscript>(2)</superscript> para el arranque basado en medios virtuales.<?asciidoc-br?> <?asciidoc-br?> Si este puerto está habilitado, el equivalente funcional con TLS habilitado (consulte más abajo) no se abre.
ja: 仮想メディアベースのブート用のIPA<superscript>(2)</superscript> ISOイメージを提供する<literal>Ironic</literal> httpd非TLS Webサーバ。<?asciidoc-br?> <?asciidoc-br?>このポートが有効な場合、機能的に同等だがTLS対応のポート(下記参照)は開かれません
zh_cn: <literal>Ironic</literal> httpd 非 TLS Web 服务器，用于提供 IPA<superscript>(2)</superscript> ISO 映像，供基于虚拟媒体的引导使用。<?asciidoc-br?> <?asciidoc-br?>如果启用此端口，则不会开放功能等效但支持 TLS 的端口（请参见下文）

source: Any BMC<superscript>(1)</superscript> previously instructed by <literal>Metal<superscript>3</superscript>/ironic</literal> to pull an IPA<superscript>(2)</superscript> ramdisk image from this exposed port (TLS)
es: Cualquier BMC<superscript>(1)</superscript> al que <literal>Metal<superscript>3</superscript>/ironic</literal> haya solicitado previamente que extraiga una imagen ramdisk de IPA<superscript>(2)</superscript> de su puerto expuesto (TLS)
ja: この公開ポート(TLS)からIPA<superscript>(2)</superscript> ramdiskイメージをプルするように<literal>Metal<superscript>3</superscript>/ironic</literal>によって以前に指示された任意のBMC<superscript>(1)</superscript>
zh_cn: 之前 <literal>Metal<superscript>3</superscript>/ironic</literal> 指示从该公开端口 (TLS) 拉取 IPA<superscript>(2)</superscript> 内存盘映像的任何 BMC<superscript>(1)</superscript>

source: <literal>Ironic</literal> httpd TLS-enabled web server serving IPA<superscript>(2)</superscript> ISO images for virtual media based boot<?asciidoc-br?> <?asciidoc-br?> In case this port is enabled, the functionally equivalent but TLS-disabled one (see above) is not opened
es: Servidor Web HTTPD <literal>Ironic</literal> con TLS habilitado que proporcione imágenes ISO de IPA<superscript>(2)</superscript> para el arranque basado en medios virtuales.<?asciidoc-br?> <?asciidoc-br?> Si este puerto está habilitado, el equivalente funcional que no tenga TLS habilitado (consulte más arriba) no se abre.
ja: <?asciidoc-br?>仮想メディアベースのブート用のIPA<superscript>(2)</superscript> ISOイメージを提供する<literal>Ironic</literal> httpd TLS対応Webサーバ。<?asciidoc-br?> <?asciidoc-br?>このポートが有効な場合、機能的には同等だがTLSが無効なポート(上記参照)は開かれません
zh_cn: 支持 httpd TLS 的 <literal>Ironic</literal> Web 服务器，用于提供 IPA<superscript>(2)</superscript> ISO 映像，供基于虚拟媒体的引导使用。<?asciidoc-br?> <?asciidoc-br?>如果启用此端口，则不会开放功能等效但不支持 TLS 的端口（请参见上文）

source: Any <literal>Metal<superscript>3</superscript>/ironic</literal> IPA<superscript>(1)</superscript> ramdisk image deployed &amp; running in an "enrolled" <literal>BareMetalHost</literal> instance
es: Cualquier imagen ramdisk de IPA<superscript>(1)</superscript> de <literal>Metal<superscript>3</superscript>/ironic</literal> que se ejecute en una instancia de <literal>BareMetalHost</literal> "inscrita"
ja: 「登録済み」<literal>BareMetalHost</literal>インスタンスにデプロイされ実行されている任意の<literal>Metal<superscript>3</superscript>/ironic</literal> IPA<superscript>(1)</superscript> ramdiskイメージ
zh_cn: 在“已注册”<literal>BareMetalHost</literal> 实例中部署并运行的任何 <literal>Metal<superscript>3</superscript>/ironic</literal> IPA<superscript>(1)</superscript> 内存盘映像

source: Any management cluster node; any external (to the management cluster) Kubernetes client
es: Cualquier nodo de clúster de gestión; cualquier cliente de Kubernetes externo (al clúster de gestión)
ja: 任意の管理クラスタノード、(管理クラスタ)外部の任意のKubernetesクライアント
zh_cn: 任何管理群集节点；任何（管理群集外部的）Kubernetes 客户端

source: Any management cluster node
es: Cualquier nodo de clúster de gestión
ja: 任意の管理クラスタノード
zh_cn: 任何管理群集节点

source: Pull artifacts from OCI-compliant registry (Hauler)
es: Extrae artefactos del registro conforme con OCI (Hauler)
ja: OCI準拠レジストリ(Hauler)からアーティファクトをプルします
zh_cn: 从符合 OCI 标准的仓库 (Hauler) 拉取制品

source: RKE2 server and agent nodes (management cluster)
es: Servidor RKE2 y nodos de agente (clúster de gestión)
ja: RKE2サーバとエージェントノード(管理クラスタ)
zh_cn: RKE2 服务器和代理节点（管理群集）

source: RKE2 supervisor API for Node registration (opened port in all RKE2 server nodes)
es: API de supervisor de RKE2 para el registro de nodos (puerto abierto en todos los nodos de servidor RKE2)
ja: ノード登録用のRKE2スーパーバイザAPI (すべてのRKE2サーバノードで開かれたポート)
zh_cn: 用于节点注册的 RKE2 监督 API（所有 RKE2 服务器节点上开放的端口）

source: <literal>kubelet</literal> metrics
es: Métricas de <literal>kubelet</literal>
ja: <literal>kubelet</literal>メトリクス
zh_cn: <literal>kubelet</literal> 指标

source: Any external (to the management cluster) source accessing a service exposed on the primary network through a <literal>spec.type: NodePort</literal> or <literal>spec.type: LoadBalancer</literal> <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">Service API object</link>
es: Cualquier fuente externa (al clúster de gestión) que acceda a un servicio expuesto en la red principal a través de un <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">objeto API de servicio</link> <literal>spec.type: NodePort</literal> o <literal>spec.type: LoadBalancer</literal>
ja: <literal>spec.type: NodePort</literal>または<literal>spec.type: LoadBalancer</literal> <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">Service APIオブジェクト</link>を介してプライマリネットワークで公開されているサービスにアクセスする、(管理クラスタ)外部の任意のソース
zh_cn: 通过 <literal>spec.type: NodePort</literal> 或 <literal>spec.type: LoadBalancer</literal> <link xl:href="https://kubernetes.io/docs/concepts/services-networking/service/#publishing-services-service-types">Service API 对象</link>访问主网络上所公开服务的任何（管理群集外部的）来源

source: Available <literal>NodePort</literal> port range
es: Intervalo de puertos <literal>NodePort</literal> disponible
ja: 使用可能な <literal>NodePort</literal> ポート範囲
zh_cn: 可用的 <literal>NodePort</literal> 端口范围

source: <superscript>(1)</superscript> BMC: Baseboard Management Controller<?asciidoc-br?> <superscript>(2)</superscript> IPA: Ironic Python Agent
es: <superscript>(1)</superscript> BMC: Baseboard Management Controller (controlador de gestión de la placa base)<?asciidoc-br?> <superscript>(2)</superscript> IPA: Ironic Python Agent (agente Python de Ironic)
ja: <superscript>(1)</superscript> BMC: ベースボード管理コントローラ<?asciidoc-br?> <superscript>(2)</superscript> IPA: Ironic Python Agent
zh_cn: <superscript>(1)</superscript> BMC：基板管理控制器<?asciidoc-br?> <superscript>(2)</superscript> IPA：Ironic Python Agent

source: Downstream Nodes
es: Nodos descendentes
ja: ダウンストリームノード
zh_cn: 下游节点

source: In SUSE Telco Cloud, before any (downstream) server becomes part of a running downstream Kubernetes cluster (or runs itself a single-node downstream Kubernetes cluster), it is required to go through some of the <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/baremetalhost-states.md">BaremetalHost Provisioning states</link>.
es: En SUSE Telco Cloud, antes de que cualquier servidor (descendente) entre a formar parte de un clúster descendente de Kubernetes en ejecución (o que ejecute un clúster descendente de Kubernetes de un solo nodo), es necesario que pase por alguno de los <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/baremetalhost-states.md">estados de aprovisionamiento de BaremetalHost</link>.
ja: SUSE Telco Cloudでは、任意の(ダウンストリーム)サーバが実行中のダウンストリームKubernetesクラスタの一部となる前(または、それ自体が単一ノードのダウンストリームKubernetesクラスタとして実行される前)に、<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/baremetalhost-states.md">BaremetalHostのプロビジョニング状態</link>のいくつかを経由する必要があります。
zh_cn: 在 SUSE Telco Cloud 中，任何（下游）服务器要加入运行中的下游 Kubernetes 群集（或自身运行单节点下游 Kubernetes 群集），都必须经历某些 <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/baremetalhost-states.md">BaremetalHost 置备状态</link>。

source: The Baseboard Management Controller (BMC) for a just declared downstream server must be accessible through the out-of-band network. BMC is instructed (from the ironic service running on the management cluster) on the initial steps to take:
es: El controlador de gestión de la placa base (BMC) de un servidor descendente recién declarado debe ser accesible a través de la red fuera de banda. El BMC recibe instrucciones (del servicio Ironic que se ejecuta en el clúster de gestión) sobre los pasos iniciales que debe seguir:
ja: 宣言されたばかりのダウンストリームサーバのベースボード管理コントローラ(BMC)は、帯域外ネットワーク経由でアクセスできる必要があります。BMCは(管理クラスタ上で実行されているIronicサービスから)以下の初期実行手順について指示されます。
zh_cn: 新声明的下游服务器的基板管理控制器 (BMC) 必须可通过带外网络访问。管理群集上运行的 ironic 服务会指示 BMC 执行初始步骤：

source: Pull and load the indicated IPA ramdisk image in the BMC offered <literal>virtual media</literal>.
es: Extraer y cargar la imagen ramdisk de IPA indicada en el <literal>medio virtual</literal> ofrecido por el BMC.
ja: BMCで提供される<literal>仮想メディア</literal>内の指定されたIPA ramdiskイメージをプルしてロードします。
zh_cn: 在 BMC 提供的<literal>虚拟媒体</literal>中拉取并加载指定的 IPA 内存盘映像。

source: Power-on the server.
es: Encender el servidor.
ja: サーバの電源を入れます。
zh_cn: 启动服务器。

source: Following ports are expected to be exposed from the BMC (they could differ depending on the exact hardware):
es: Se espera que los siguientes puertos estén expuestos desde el BMC (pueden variar en función del hardware concreto):
ja: 以下のポートは、BMCから公開される予定です(実際のハードウェアによって異なる可能性があります)。
zh_cn: BMC 需公开以下端口（具体端口可能因硬件而异）：

source: Inbound Network Rules for Baseboard Management Controllers
es: Reglas de red entrante para controladores de gestión de la placa base
ja: ベースボード管理コントローラの受信ネットワークルール
zh_cn: 基板管理控制器的入站网络规则
