Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Prerequisites for air-gap scenarios
es: Requisitos previos para entornos aislados
ja: エアギャップシナリオの前提条件
pt_br: Pré-requisitos para cenários air-gapped
zh_cn: 隔离场景的先决条件

source: If you want to use SR-IOV or any other workload which require a container image, a local private registry must be deployed and already configured (with/without TLS and/or authentication). This registry will be used to store the images and the helm chart OCI images.
es: Si desea utilizar SR-IOV o cualquier otra carga de trabajo que requiera una imagen de contenedor, debe desplegar y configurar previamente un registro privado local (con o sin TLS y/o autenticación). Este registro se utilizará para almacenar las imágenes y las imágenes OCI del chart de Helm.
ja: コンテナイメージが必要なSR-IOVなどのワークロードを使用する場合、ローカルのプライベートレジストリをデプロイして設定済みである必要があります(TLSまたは認証、あるいはその両方を使用/不使用)。このレジストリを使用して、イメージとHelmチャートOCIイメージを保存します。
pt_br: Para usar SR-IOV ou qualquer outra carga de trabalho que exija uma imagem de contêiner, é necessário implantar e já configurar um registro particular local (com/sem TLS e/ou autenticação). Esse registro será usado para armazenar as imagens comuns e as imagens OCI de gráfico Helm.
zh_cn: 如果您要使用 SR-IOV 或任何其他需要容器映像的工作负载，则必须部署并事先配置一个本地专用仓库（设置/未设置 TLS 和/或身份验证）。此仓库用于存储 Helm chart OCI 映像及其他映像。

source: Image configuration for air-gap scenarios
es: Configuración de la imagen para entornos aislados
ja: エアギャップシナリオのイメージの設定
pt_br: Configuração da imagem para cenários air-gapped
zh_cn: 隔离场景的映像配置

source: <literal>downstream-cluster-airgap-config.yaml</literal> is the image definition file, see <xref linkend="quickstart-eib"/> for more details.
es: <literal>downstream-cluster-airgap-config.yaml</literal> es el archivo de definición de la imagen. Para obtener más información, consulte el <xref linkend="quickstart-eib"/>.
ja: <literal>downstream-cluster-airgap-config.yaml</literal>はイメージ定義ファイルです。詳細については、<xref linkend="quickstart-eib"/>を参照してください。
pt_br: <literal>downstream-cluster-airgap-config.yaml</literal> é o arquivo de definição da imagem, consulte o <xref linkend="quickstart-eib"/> para obter mais detalhes.
zh_cn: <literal>downstream-cluster-airgap-config.yaml</literal> 是映像定义文件，有关详细信息，请参见<xref linkend="quickstart-eib"/>。

source: <literal>01-fix-growfs.sh</literal> script is required to resize the OS root partition on deployment.
es: El guion <literal>01-fix-growfs.sh</literal> es necesario para cambiar el tamaño de la partición raíz del sistema operativo durante el despliegue.
ja: <literal>01-fix-growfs.sh</literal>スクリプトは、デプロイメント時にOSルートパーティションをサイズ変更するために必要です。
pt_br: O script <literal>01-fix-growfs.sh</literal> é necessário para redimensionar a partição raiz do sistema operacional na implantação.
zh_cn: <literal>01-fix-growfs.sh</literal> 脚本，用于在部署时调整操作系统根分区的大小。

source: <literal>02-airgap.sh</literal> script is required to copy the images to the right place during the image creation process for air-gapped environments.
es: El guion <literal>02-airgap.sh</literal> es necesario para copiar las imágenes en el lugar correcto durante el proceso de creación de imágenes para entornos aislados.
ja: <literal>02-airgap.sh</literal>スクリプトは、エアギャップ環境でのイメージ作成プロセス中にイメージを適切な場所にコピーするために必要です。
pt_br: O script <literal>02-airgap.sh</literal> é necessário para copiar as imagens no local certo durante o processo de criação da imagem para ambientes air-gapped.
zh_cn: <literal>02-airgap.sh</literal> 脚本，用于在为隔离环境创建映像时，将映像复制到正确的位置。

source: <literal>03-performance.sh</literal> script is optional and can be used to configure the system for performance tuning.
es: El guion <literal>03-performance.sh</literal> es opcional y se puede usar para configurar el sistema con el fin de optimizar su rendimiento.
ja: <literal>03-performance.sh</literal>スクリプトはオプションであり、パフォーマンス調整用にシステムを設定するために使用できます。
pt_br: O script <literal>03-performance.sh</literal> é opcional e pode ser usado para configurar o sistema para ajuste de desempenho.
zh_cn: <literal>03-performance.sh</literal> 脚本（可选），用于配置系统以调优性能。

source: <literal>04-sriov.sh</literal> script is optional and can be used to configure the system for SR-IOV.
es: El guion <literal>04-sriov.sh</literal> es opcional y se puede usar para configurar el sistema para SR-IOV.
ja: <literal>04-sriov.sh</literal>スクリプトはオプションであり、SR-IOV用にシステムを設定するために使用できます。
pt_br: O script <literal>04-sriov.sh</literal> é opcional e pode ser usado para configurar o sistema para SR-IOV.
zh_cn: <literal>04-sriov.sh</literal> 脚本（可选），用于为 SR-IOV 配置系统。

source: The <literal>custom/files</literal> directory contains the <literal>rke2</literal> and the <literal>cni</literal> images to be copied to the image during the image creation process. Also, the optional <literal>performance-settings.sh</literal> and <literal>sriov-auto-filler.sh</literal> files can be included.
es: El directorio <literal>custom/files</literal> contiene las imágenes <literal>rke2</literal> y <literal>cni</literal> que se copiarán en la imagen durante el proceso de creación de la imagen. Además, se pueden incluir los archivos opcionales <literal>performance-settings.sh</literal> y <literal>sriov-auto-filler.sh</literal>.
ja: <literal>custom/files</literal>ディレクトリには、イメージ作成プロセス中にイメージにコピーされる<literal>rke2</literal>および<literal>cni</literal>イメージが含まれています。また、オプションの<literal>performance-settings.sh</literal>および<literal>sriov-auto-filler.sh</literal>ファイルを含めることもできます。
pt_br: O diretório <literal>custom/files</literal> contém as imagens <literal>rke2</literal> e <literal>cni</literal> para copiar na imagem durante o processo de criação da imagem. É possível também incluir os arquivos opcionais <literal>performance-settings.sh</literal> e <literal>sriov-auto-filler.sh</literal>.
zh_cn: <literal>custom/files</literal> 目录包含在映像创建过程中要复制到映像的 <literal>rke2</literal> 和 <literal>cni</literal> 映像。此外，还可以包含可选的 <literal>performance-settings.sh</literal> 和 <literal>sriov-auto-filler.sh</literal> 文件。

source: The <literal>downstream-cluster-airgap-config.yaml</literal> file is the main configuration file for the downstream cluster image and the content has been described in the previous section (<xref linkend="add-telco-feature-eib"/>).
es: El archivo <literal>downstream-cluster-airgap-config.yaml</literal> es el archivo de configuración principal para la imagen del clúster descendente y su contenido se ha descrito en la sección anterior (<xref linkend="add-telco-feature-eib"/>).
ja: <literal>downstream-cluster-airgap-config.yaml</literal>ファイルは、ダウンストリームクラスタ用のメイン設定ファイルです。その内容については、前のセクション(<xref linkend="add-telco-feature-eib"/>)で説明されています。
pt_br: O <literal>downstream-cluster-airgap-config.yaml</literal> é o principal arquivo de configuração da imagem do cluster downstream, e o conteúdo foi descrito na seção anterior (<xref linkend="add-telco-feature-eib"/>).
zh_cn: <literal>downstream-cluster-airgap-config.yaml</literal> 文件是下游群集映像的主配置文件，上一节（<xref linkend="add-telco-feature-eib"/>）已介绍其内容。

source: Air-gap script
es: Guion air-gap
ja: エアギャップスクリプト
pt_br: Script air-gap
zh_cn: 隔离脚本

source: The following script (<literal>custom/scripts/02-airgap.sh</literal>) is required to copy the images to the right place during the image creation process:
es: El siguiente guion (<literal>custom/scripts/02-airgap.sh</literal>) es necesario para copiar las imágenes en el lugar correcto durante el proceso de creación de la imagen:
ja: イメージ作成プロセス中にイメージを正しい場所にコピーするために、次のスクリプト(<literal>custom/scripts/02-airgap.sh</literal>)が必要です。
pt_br: O seguinte script (<literal>custom/scripts/02-airgap.sh</literal>) é necessário para copiar as imagens no local certo durante o processo de criação da imagem:
zh_cn: 在映像创建过程中，需要使用以下脚本 (<literal>custom/scripts/02-airgap.sh</literal>) 将映像复制到正确的位置：

source: The following optional script (<literal>custom/scripts/03-performance.sh</literal>) can be used to configure the system for performance tuning:
es: El siguiente guion opcional (<literal>custom/scripts/03-performance.sh</literal>) se puede usar para configurar el sistema con el fin de optimizar su rendimiento:
ja: 次のオプションのスクリプト(<literal>custom/scripts/03-performance.sh</literal>)は、パフォーマンス調整用にシステムを設定するために使用できます。
pt_br: O seguinte script opcional (<literal>custom/scripts/03-performance.sh</literal>) pode ser usado para configurar o sistema para ajuste de desempenho:
zh_cn: 以下可选脚本（<literal>custom/scripts/03-performance.sh</literal>）可用于配置系统以调优性能：

source: The following optional script (<literal>custom/scripts/04-sriov.sh</literal>) can be used to configure the system for SR-IOV:
es: El siguiente guion opcional (<literal>custom/scripts/04-sriov.sh</literal>) se puede usar para configurar el sistema para SR-IOV:
ja: 次のオプションのスクリプト(<literal>custom/scripts/04-sriov.sh</literal>)は、SR-IOV用にシステムを設定するために使用できます。
pt_br: O seguinte script opcional (<literal>custom/scripts/04-sriov.sh</literal>) pode ser usado para configurar o sistema para SR-IOV:
zh_cn: 以下可选脚本 (<literal>custom/scripts/04-sriov.sh</literal>) 可用于为 SR-IOV 配置系统：

source: Custom files for air-gap scenarios
es: Archivos personalizados para entornos aislados
ja: エアギャップシナリオのカスタムファイル
pt_br: Arquivos personalizados para cenários air-gapped
zh_cn: 隔离场景的自定义文件

source: The <literal>custom/files</literal> directory contains the <literal>rke2</literal> and the <literal>cni</literal> images to be copied to the image during the image creation process. To easily generate the images, prepare them locally using following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">script</link> and the list of images <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-release-rke2-images.txt">here</link> to generate the artifacts required to be included in <literal>custom/files</literal>. Also, you can download the latest <literal>rke2-install</literal> script from <link xl:href="https://get.rke2.io/">here</link>.
es: El directorio <literal>custom/files</literal> contiene las imágenes <literal>rke2</literal> y <literal>cni</literal> que se copiarán en la imagen durante el proceso de creación de la imagen. Para generar fácilmente las imágenes, prepárelas localmente utilizando el siguiente <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">guion</link> y la lista de imágenes que encontrará <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-release-rke2-images.txt">aquí</link> para generar los artefactos que deben incluirse en <literal>custom/files</literal>. Además, puede descargar el guion <literal>rke2-install</literal> más reciente desde <link xl:href="https://get.rke2.io/">aquí</link>.
ja: <literal>custom/files</literal>ディレクトリには、イメージ作成プロセス中にそのイメージにコピーする<literal>rke2</literal>イメージと<literal>cni</literal>イメージが含まれています。イメージを簡単に生成するには、次の<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">スクリプト</link>と、<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-release-rke2-images.txt">こちら</link>にあるイメージのリストを使用してローカルでイメージを準備し、<literal>custom/files</literal>に含める必要があるアーティファクトを生成します。また、最新の<literal>rke2-install</literal>スクリプトを<link xl:href="https://get.rke2.io/">こちら</link>からダウンロードすることもできます。
zh_cn: <literal>custom/files</literal> 目录包含映像创建过程中要复制到该映像的 <literal>rke2</literal> 和 <literal>cni</literal> 映像。为了轻松生成映像，请使用以下<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">脚本</link>和<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-release-rke2-images.txt">此处</link>的映像列表在本地准备这些映像，以生成需要包含在 <literal>custom/files</literal> 中的制品。另外，可以从<link xl:href="https://get.rke2.io/">此处</link>下载最新的 <literal>rke2-install</literal> 脚本。

source: After downloading the images, the directory structure should look like this:
es: Después de descargar las imágenes, la estructura de directorios debería tener este aspecto:
ja: イメージをダウンロードした後、ディレクトリ構造は次のようになるはずです。
pt_br: Após o download das imagens, a estrutura de diretórios deve ter esta aparência:
zh_cn: 下载映像后，目录结构应如下所示：

source: Preload your private registry with images required for air-gap scenarios and SR-IOV (optional)
es: Carga previa del registro privado con las imágenes necesarias para situaciones de entornos aislados y SR-IOV (opcional)
ja: エアギャップシナリオおよびSR-IOV (オプション)に必要なイメージのプライベートレジストリへのプリロード
pt_br: Pré-carregar seu registro particular com as imagens necessárias para cenários air-gapped e SR-IOV (opcional)
zh_cn: 预加载包含隔离场景和 SR-IOV 所需映像的专用仓库（可选）

source: If you want to use SR-IOV in your air-gap scenario or any other workload images, you must preload your local private registry with the images following the next steps:
es: Si desea utilizar SR-IOV en un entorno aislado o en cualquier otra imagen de carga de trabajo, debe cargar previamente su registro privado local con las imágenes siguiendo estos pasos:
ja: エアギャップシナリオまたはその他のワークロードイメージでSR-IOVを使用する場合、次の各手順に従って、ローカルのプライベートレジストリにイメージをプリロードする必要があります。
pt_br: Para usar SR-IOV em seu cenário air-gapped ou qualquer outra imagem de carga de trabalho, você deve pré-carregar o registro particular local com as imagens seguindo as próximas etapas:
zh_cn: 如果您要在隔离场景中使用 SR-IOV 或要使用任何其他工作负载映像，必须按照以下步骤预加载包含这些映像的本地专用仓库：

source: Download, extract, and push the helm-chart OCI images to the private registry
es: Descargar, extraer y enviar las imágenes OCI del chart de Helm al registro privado
ja: HelmチャートOCIイメージをダウンロードして抽出し、プライベートレジストリにプッシュする
pt_br: Faça download, extraia e envie as imagens OCI de gráfico Helm ao registro particular
zh_cn: 下载、提取 helm-chart OCI 映像并将其推送到专用仓库

source: Download, extract, and push the rest of images required to the private registry
es: Descargar, extraer y enviar el resto de imágenes necesarias al registro privado
ja: 必要な残りのイメージをダウンロードして抽出し、プライベートレジストリにプッシュする
pt_br: Faça download, extraia e envie o restante das imagens necessárias ao registro particular
zh_cn: 下载、提取所需的其余映像并将其推送到专用仓库

source: The following scripts can be used to download, extract, and push the images to the private registry. We will show an example to preload the SR-IOV images, but you can also use the same approach to preload any other custom images:
es: Los guiones siguientes se pueden usar para descargar, extraer y enviar las imágenes al registro privado. Mostraremos un ejemplo para precargar las imágenes de SR-IOV, pero también puede usar el mismo método para cargar previamente cualquier otra imagen personalizada:
ja: 次のスクリプトを使用して、イメージをダウンロードして抽出し、プライベートレジストリにプッシュできます。これからSR-IOVイメージをプリロードする例を示しますが、その他のカスタムイメージも同じ方法でプリロードすることができます。
pt_br: É possível usar os seguintes scripts para fazer download, extrair e enviar as imagens ao registro particular. Vamos mostrar um exemplo para pré-carregar as imagens SR-IOV, mas você também pode usar a mesma abordagem para pré-carregar qualquer outra imagem personalizada:
zh_cn: 可使用以下脚本下载、提取映像并将其推送到专用仓库。本节将通过一个示例来说明如何预加载 SR-IOV 映像，但您也可以使用相同的方法来预加载任何其他自定义映像：

source: Preload with helm-chart OCI images for SR-IOV:
es: Realice la carga previa con imágenes OCI del chart de Helm para SR-IOV:
ja: SR-IOVのHelmチャートOCIイメージのプリロード:
pt_br: Pré-carregamento com imagens OCI de gráfico Helm para SR-IOV:
zh_cn: 预加载 SR-IOV 所需的 helm-chart OCI 映像：

source: You must create a list with the helm-chart OCI images required:
es: Debe crear una lista con las imágenes OCI del chart de Helm necesarias:
ja: 必要なHelmチャートOCIイメージが含まれるリストを作成する必要があります。
pt_br: Você deve criar uma lista com as imagens OCI de gráfico Helm necessárias:
zh_cn: 必须创建一个包含所需 helm-chart OCI 映像的列表：

source: Generate a local tarball file using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-oci-artefacts.sh">script</link> and the list created above:
es: Genere un archivo tarball local utilizando el siguiente <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-oci-artefacts.sh">guion</link> y la lista creada anteriormente:
ja: 次の<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-oci-artefacts.sh">スクリプト</link>と上記で作成したリストを使用してローカルtarballファイルを生成します。
zh_cn: 使用以下<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-oci-artefacts.sh">脚本</link>和上面创建的列表生成本地 tarball 文件：

source: Upload your tarball file to your private registry (e.g. <literal>myregistry:5000</literal>) using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-oci-artefacts.sh">script</link> to preload your registry with the helm chart OCI images downloaded in the previous step:
es: Suba el archivo tarball a su registro privado (por ejemplo, <literal>myregistry:5000</literal>) usando el <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-oci-artefacts.sh">guion</link> siguiente para cargar previamente su registro con las imágenes OCI del chart de Helm descargadas en el paso anterior:
ja: 次の<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-oci-artefacts.sh">スクリプト</link>を使用してtarballファイルをプライベートレジストリ(例: <literal>myregistry:5000</literal>)にアップロードし、前の手順でダウンロードしたHelmチャートOCIイメージをレジストリにプリロードします。
zh_cn: 使用以下<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-oci-artefacts.sh">脚本</link>将 tarball 文件上载到您的专用仓库（如 <literal>myregistry:5000</literal>），以便将上一步下载的 helm chart OCI 映像预加载到您的仓库中：

source: Preload with the rest of the images required for SR-IOV:
es: Realice la carga previa del resto de las imágenes necesarias para SR-IOV:
ja: SR-IOVに必要な残りのイメージをプリロードします。
pt_br: Pré-carregamento com o restante das imagens necessárias para SR-IOV:
zh_cn: 预加载 SR-IOV 所需的其余映像：

source: In this case, we must include the `sr-iov container images for telco workloads (e.g. as a reference, you could get them from <link xl:href="https://github.com/suse-edge/charts/blob/main/charts/sriov-network-operator/1.5.0/values.yaml">helm-chart values</link>)
es: En este caso, debemos incluir las imágenes de contenedor sr-iov para cargas de trabajo de telecomunicaciones (por ejemplo, como referencia, puede obtenerlas de los <link xl:href="https://github.com/suse-edge/charts/blob/main/charts/sriov-network-operator/1.5.0/values.yaml">valores del chart de Helm</link>).
ja: ここでは、通信ワークロードのために「sr-iov」コンテナイメージを含める必要があります(例: 参考として、これは <link xl:href="https://github.com/suse-edge/charts/blob/main/charts/sriov-network-operator/1.5.0/values.yaml">helmチャート値</link>から取得できます)。
pt_br: Nesse caso, devemos incluir as imagens do contêiner `sr-iov para cargas de trabalho de telecomunicações (por exemplo, como referência, você pode obtê-las dos <link xl:href="https://github.com/suse-edge/charts/blob/main/charts/sriov-network-operator/1.5.0/values.yaml">valores de gráfico Helm</link>)
zh_cn: 在这种情况下，必须包含电信工作负载的 sr-iov 容器映像（例如，作为参考，您可以从 <link xl:href="https://github.com/suse-edge/charts/blob/main/charts/sriov-network-operator/1.5.0/values.yaml">helm-chart 值</link>获取这些映像）

source: Using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">script</link> and the list created above, you must generate locally the tarball file with the images required:
es: Con el <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">guion</link> siguiente y la lista creada anteriormente, debe generar localmente el archivo tarball con las imágenes necesarias:
ja: 次の<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">スクリプト</link>と上記で作成したリストを使用して、必要なイメージを含む、tarballファイルをローカルで生成する必要があります。
zh_cn: 必须使用以下<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-save-images.sh">脚本</link>和上面创建的列表，在本地生成包含所需映像的 tarball 文件：

source: Upload your tarball file to your private registry (e.g. <literal>myregistry:5000</literal>) using the following <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-images.sh">script</link> to preload your private registry with the images downloaded in the previous step:
es: Suba el archivo tarball a su registro privado (por ejemplo, <literal>myregistry:5000</literal>) usando el <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-images.sh">guion</link> siguiente para precargar su registro privado con las imágenes descargadas en el paso anterior:
ja: 次の<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-images.sh">スクリプト</link>を使用してtarballファイルをプライベートレジストリ(例: <literal>myregistry:5000</literal>)にアップロードし、前の手順でダウンロードしたイメージをプライベートレジストリにプリロードします。
zh_cn: 使用以下<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/scripts/day2/edge-load-images.sh">脚本</link>将 tarball 文件上载到您的专用仓库（如 <literal>myregistry:5000</literal>），以便将上一步下载的映像预加载到您的专用仓库中：

source: Image creation for air-gap scenarios
es: Creación de la imagen para entornos aislados
ja: エアギャップシナリオのイメージの作成
pt_br: Criação da imagem para cenários air-gapped
zh_cn: 为隔离场景创建映像

source: The output image must then be made available via a webserver, either the media-server container enabled via the Management Cluster Documentation (<xref linkend="metal3-media-server"/>) or some other locally accessible server. In the examples below, we refer to this server as <literal>imagecache.local:8080</literal>.
es: La imagen resultante debe estar disponible a través de un servidor Web, ya sea el contenedor del servidor de medios habilitado siguiendo los pasos de la sección sobre el clúster de gestión (<xref linkend="metal3-media-server"/>) o algún otro servidor al que se pueda acceder localmente. En los ejemplos siguientes, nos referimos a este servidor como <literal>imagecache.local:8080</literal>.
ja: その後、この出力イメージをWebサーバ経由で利用できるようにする必要があります。その際、管理クラスタドキュメントを使用して有効にしたメディアサーバコンテナ(<xref linkend="metal3-media-server"/>)か、ローカルにアクセス可能な他のサーバのいずれかを使用します。以下の例では、このサーバを<literal>imagecache.local:8080</literal>として参照します。
pt_br: Em seguida, disponibilize a imagem de saída por um servidor web, ou o contêiner de servidor de mídia habilitado de acordo com as instruções na documentação sobre o cluster de gerenciamento (<xref linkend="metal3-media-server"/>) ou algum outro servidor acessível localmente. Nos exemplos abaixo, esse servidor é mencionado como <literal>imagecache.local:8080</literal>.
zh_cn: 然后必须通过 Web 服务器提供输出映像，该服务器可以是根据管理群集文档（<xref linkend="metal3-media-server"/>）启用的媒体服务器容器，也可以是其他某个本地可访问的服务器。在下面的示例中，此服务器是 <literal>imagecache.local:8080</literal>。

source: Downstream cluster provisioning with Directed network provisioning (single-node)
es: Aprovisionamiento de clústeres descendentes con aprovisionamiento de red dirigida (nodo único)
ja: ダイレクトネットワークプロビジョニングを使用したダウンストリームクラスタのプロビジョニング(シングルノード)
pt_br: Provisionamento de cluster downstream com provisionamento de rede direcionado (nó único)
zh_cn: 使用定向网络置备来置备下游群集（单节点）
