Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: By manually copying the bundle content for <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">RKE2</link> or <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">K3s</link> from <literal>suse-edge/fleet-examples</literal> to the <emphasis role="strong">Create from YAML</emphasis> page.
es: Copie manualmente el contenido del Bundle para <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">RKE2</link> o <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">K3s</link> desde <literal>suse-edge/fleet-examples</literal> en la página <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML).
ja: <literal>suse-edge/fleet-examples</literal>から<emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>ページに <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">RKE2</link>または<link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">K3s</link>のバンドルコンテンツを手動でコピーする。
zh_cn: 手动将 <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml">RKE2</link> 或 <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml">K3s</link> 的捆绑包内容从 <literal>suse-edge/fleet-examples</literal> 复制到 <emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）页面。

source: By cloning the <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> repository from the desired <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag and selecting the <emphasis role="strong">Read from File</emphasis> option in the <emphasis role="strong">Create from YAML</emphasis> page. From there, navigate to the bundle that you need (<literal>bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml</literal> for RKE2 and <literal>bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml</literal> for K3s). This will auto-populate the <emphasis role="strong">Create from YAML</emphasis> page with the bundle content.
es: Clone el repositorio <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> desde la etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> deseada y seleccione la opción <emphasis role="strong">Read from File</emphasis> (Leer desde archivo) en la página <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML). Desde ahí, diríjase al Bundle que necesita (<literal>bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml</literal> para RKE2 y <literal>bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml</literal> para K3s). La página <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML) se rellenará automáticamente con el contenido del paquete.
ja: 目的の<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグから<link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link>リポジトリのクローンを作成し、<emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>ページの<emphasis role="strong">［Read from File (ファイルから読み取り)］</emphasis>オプションを選択する。そこから、必要なバンドルに移動します(RKE2の場合は<literal>bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml</literal>、K3sの場合は<literal>bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml</literal>)。<emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>ページにバンドルコンテンツが自動的に入力されます。
pt_br: Clone o repositório <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> da tag da <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> desejada e selecione a opção <emphasis role="strong">Read from File</emphasis> (Ler arquivo) na página <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML). Dessa página, navegue até o bundle necessário (<literal>bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml</literal> para RKE2 e <literal>bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml</literal> para K3s). Esse procedimento preencherá automaticamente a página <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML) com o conteúdo do bundle.
zh_cn: 从所需的<link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记克隆 <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> 储存库，并在 <emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）页面中选择 <emphasis role="strong">Read from File</emphasis>（从文件读取）选项。然后导航到所需的捆绑包（对于 RKE2，为 <literal>bundles/day2/system-upgrade-controller-plans/rke2-upgrade/plan-bundle.yaml</literal>；对于 K3s，为 <literal>bundles/day2/system-upgrade-controller-plans/k3s-upgrade/plan-bundle.yaml</literal>）。这会在 <emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）页面中自动填充捆绑包内容。

source: Pull the <emphasis role="strong">Bundle</emphasis> resources:
es: Extraiga los recursos <emphasis role="strong">Bundle</emphasis>:
ja: <emphasis role="strong">バンドル</emphasis>リソースをプルします。
pt_br: Obtenha os recursos <emphasis role="strong">Bundle</emphasis>:
zh_cn: 提取<emphasis role="strong">捆绑包</emphasis>资源：

source: Apply the <emphasis role="strong">Bundle</emphasis> resources to your <literal>management cluster</literal>:
es: Aplique los recursos <emphasis role="strong">Bundle</emphasis> al <literal>clúster de gestión</literal>:
ja: <emphasis role="strong">バンドル</emphasis>リソースを<literal>管理クラスタ</literal>に適用します。
pt_br: Aplique os recursos <emphasis role="strong">Bundle</emphasis> ao <literal>cluster de gerenciamento</literal>:
zh_cn: 将<emphasis role="strong">捆绑包</emphasis>资源应用于<literal>管理群集</literal>：

source: There might be use-cases where users would like to incorporate the <literal>Kubernetes upgrade SUC plans</literal> to their own third-party GitOps workflow (e.g. <literal>Flux</literal>).
es: Puede haber casos prácticos en los que los usuarios deseen incorporar los <literal>planes de SUC de actualización de Kubernetes</literal> a su propio flujo de trabajo de GitOps de terceros (por ejemplo, <literal>Flux</literal>).
ja: ユーザが<literal>KubernetesアップグレードSUC Plan</literal>を独自のサードパーティGitOpsワークフロー(例: <literal>Flux</literal>)に組み込むユースケースがある場合があります。
pt_br: Em alguns casos de uso, talvez você queira incorporar os <literal>planos do SUC de upgrade do Kubernetes</literal> ao fluxo de trabalho do GitOps de terceiros (por exemplo, o <literal>Flux</literal>).
zh_cn: 在某些使用场景中，用户可能希望将 <literal>Kubernetes 升级 SUC 计划</literal>合并到自己的第三方 GitOps 工作流程（例如 <literal>Flux</literal>）中。

source: To get the K8s upgrade resources that you need, first determine the Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag of the <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> repository that you would like to use.
es: Para obtener los recursos de actualización de K8s que necesita, primero determine la etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de Edge del repositorio <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> que desea utilizar.
ja: 必要なK8sアップグレードリソースを取得するには、まず使用する<link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link>リポジトリのEdge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグを決定します。
pt_br: Para obter os recursos de upgrade do K8s upgrade que você precisa, primeiro determine a tag da <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> do Edge do repositório <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> que deseja usar.
zh_cn: 要获取所需的 K8s 升级资源，首先请确定您要使用的 <link xl:href="https://github.com/suse-edge/fleet-examples.git">suse-edge/fleet-examples</link> 储存库的 Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记。

source: After that, the resources can be found at:
es: Después, los recursos se encuentran en:
ja: その後、次の場所でリソースを確認できます。
pt_br: Depois disso, os recursos estarão em:
zh_cn: 然后，便可以在以下位置找到资源：

source: For a RKE2 cluster upgrade:
es: Para actualizar un clúster RKE2:
ja: RKE2クラスタのアップグレードの場合:
pt_br: Para ugrade do cluster RKE2:
zh_cn: 对于 RKE2 群集升级：

source: For <literal>control-plane</literal> nodes - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-control-plane.yaml</literal>
es: Para nodos <literal>control-plane</literal>: <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-control-plane.yaml</literal>
ja: <literal>control-plane</literal>ノード用 - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-control-plane.yaml</literal>
pt_br: Para os nós do <literal>plano de controle</literal>: <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-control-plane.yaml</literal>
zh_cn: 对于<literal>控制平面</literal>节点 - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-control-plane.yaml</literal>

source: For <literal>worker</literal> nodes - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-worker.yaml</literal>
es: Para nodos <literal>worker</literal>: <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-worker.yaml</literal>
ja: <literal>ワーカー</literal>ノードの場合 - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-worker.yaml</literal>
pt_br: Para os nós de <literal>worker</literal>: <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-worker.yaml</literal>
zh_cn: 对于<literal>工作</literal>节点 - <literal>fleets/day2/system-upgrade-controller-plans/rke2-upgrade/plan-agent.yaml</literal>

source: For a K3s cluster upgrade:
es: Para actualizar un clúster K3s:
ja: K3sクラスタのアップグレードの場合:
pt_br: Para upgrade do cluster K3s:
zh_cn: 对于 K3s 群集升级：

source: For <literal>control-plane</literal> nodes - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-control-plane.yaml</literal>
es: Para nodos <literal>control-plane</literal>: <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-control-plane.yaml</literal>
ja: <literal>control-plane</literal>ノード用 - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-control-plane.yaml</literal>
pt_br: Para os nós do <literal>plano de controle</literal>: <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-control-plane.yaml</literal>
zh_cn: 对于<literal>控制平面</literal>节点 - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-control-plane.yaml</literal>

source: For <literal>worker</literal> nodes - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-worker.yaml</literal>
es: Para nodos <literal>worker</literal>: <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-worker.yaml</literal>
ja: <literal>ワーカー</literal>ノードの場合 - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-worker.yaml</literal>
pt_br: Para os nós de <literal>worker</literal>: <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-worker.yaml</literal>
zh_cn: 对于<literal>工作</literal>节点 - <literal>fleets/day2/system-upgrade-controller-plans/k3s-upgrade/plan-agent.yaml</literal>

source: To better understand how your GitOps workflow can be used to deploy the <emphasis role="strong">SUC Plans</emphasis> for Kubernetes version upgrade, it can be beneficial to take a look at the overview (<xref linkend="management-day2-fleet-k8s-upgrade-overview"/>) of the update procedure using <literal>Fleet</literal>.
es: Para comprender mejor cómo usar su flujo de trabajo de GitOps para desplegar los <emphasis role="strong">planes de SUC</emphasis> para actualizar la versión de Kubernetes, puede resultar útil echar un vistazo a la descripción general (<xref linkend="management-day2-fleet-k8s-upgrade-overview"/>) del procedimiento de actualización mediante <literal>Fleet</literal>.
ja: GitOpsワークフローをKubernetesバージョンアップグレードの<emphasis role="strong">SUC Plan</emphasis>をデプロイするために使用する方法をよりよく理解するために、<literal>Fleet</literal>を使用する更新手順の概要(<xref linkend="management-day2-fleet-k8s-upgrade-overview"/>)を確認すると役立つ場合があります。
pt_br: Para entender melhor como usar o fluxo de trabalho do GitOps para implantar os <emphasis role="strong">planos do SUC</emphasis> para upgrade de versão do Kubernetes, consulte a visão geral (<xref linkend="management-day2-fleet-k8s-upgrade-overview"/>) do procedimento de atualização com o <literal>Fleet</literal>.
zh_cn: 为了更好地了解如何使用 GitOps 工作流程来部署 Kubernetes 版本升级的 <emphasis role="strong">SUC 计划</emphasis>，建议查看有关使用 <literal>Fleet</literal> 进行更新的过程概述（<xref linkend="management-day2-fleet-k8s-upgrade-overview"/>）。

source: Helm chart upgrade
es: Actualización de charts de Helm
ja: Helmチャートのアップグレード
pt_br: Upgrade do gráfico Helm
zh_cn: Helm chart 升级

source: This section covers the following parts:
es: Esta sección cubre lo siguiente:
ja: このセクションでは、次の内容について説明します。
pt_br: Esta seção aborda as seguintes partes:
zh_cn: 本节介绍如下内容：

source: <xref linkend="management-day2-fleet-helm-upgrade-air-gap"/> - holds information on how to ship Edge related OCI charts and images to your private registry.
es: <xref linkend="management-day2-fleet-helm-upgrade-air-gap"/>: contiene información sobre cómo incluir charts e imágenes OCI relacionados con Edge en su registro privado.
ja: <xref linkend="management-day2-fleet-helm-upgrade-air-gap"/> - Edgeに関連するOCIチャートとイメージをプライベートレジストリに配布する方法に関する情報を保持します。
pt_br: <xref linkend="management-day2-fleet-helm-upgrade-air-gap"/>: armazena informações sobre como enviar gráficos e imagens OCI relacionados ao Edge para seu registro particular.
zh_cn: <xref linkend="management-day2-fleet-helm-upgrade-air-gap"/> - 包含有关如何将与 Edge 相关的 OCI chart 和映像分发到您的专用仓库的信息。

source: <xref linkend="management-day2-fleet-helm-upgrade-procedure"/> - holds information on different Helm chart upgrade use-cases and their upgrade procedure.
es: <xref linkend="management-day2-fleet-helm-upgrade-procedure"/>: contiene información sobre diferentes casos de actualización de charts de Helm y su procedimiento de actualización.
ja: <xref linkend="management-day2-fleet-helm-upgrade-procedure"/> - 異なるHelmチャートアップグレードのユースケースとそのアップグレード手順に関する情報を保持します。
pt_br: <xref linkend="management-day2-fleet-helm-upgrade-procedure"/>: armazena informações sobre diversos casos de uso de upgrade de gráficos Helm e o respectivo procedimento de upgrade.
zh_cn: <xref linkend="management-day2-fleet-helm-upgrade-procedure"/> - 包含有关不同 Helm chart 升级情形及其升级过程的信息。

source: Preparation for air-gapped environments
es: Preparación para entornos aislados
ja: エアギャップ環境の準備
pt_br: Preparação para ambientes air-gapped
zh_cn: 为隔离环境做好准备

source: Ensure you have access to your Helm chart Fleet
es: Asegúrese de tener acceso a los recursos de Fleect del chart de Helm
ja: HelmチャートFleetにアクセスできることの確認
pt_br: Garantir que você tenha acesso ao Fleet por gráfico Helm
zh_cn: 确保您有权访问 Helm chart 的 Fleet

source: Depending on what your environment supports, you can take one of the following options:
es: Dependiendo de lo que admita su entorno, puede elegir una de estas opciones:
ja: 環境でサポートする内容によって、次のオプションのいずれかを選択できます。
pt_br: Dependendo da compatibilidade do seu ambiente, você poderá seguir uma destas opções:
zh_cn: 根据环境支持的情况，选择以下选项之一：

source: Host your chart’s Fleet resources on a local Git server that is accessible by your <literal>management cluster</literal>.
es: Aloje los recursos de Fleet de su chart en un servidor Git local al que pueda acceder su <literal>clúster de gestión</literal>.
ja: <literal>管理クラスタ</literal>からアクセス可能なローカルGitサーバでチャートのFleetリソースをホストします。
pt_br: Hospede os recursos do Fleet do seu gráfico em um servidor Git local que possa ser acessado pelo <literal>cluster de gerenciamento</literal>.
zh_cn: 将 chart 的 Fleet 资源托管在<literal>管理群集</literal>可访问的本地 git 服务器上。

source: Use Fleet’s CLI to <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">convert a Helm chart into a Bundle</link> that you can directly use and will not need to be hosted somewhere. Fleet’s CLI can be retrieved from their <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">release</link> page, for Mac users there is a <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulae.
es: Use la interfaz de línea de comandos de Fleet para <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">convertir un chart de Helm en un Bundle</link> que podrá utilizar directamente sin necesidad de alojarlo en ningún sitio. Puede descargar la interfaz de línea de comandos de la página de la <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">versión</link>. Para los usuarios de Mac, hay una versión propia de <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.
ja: FleetのCLIを使用して、直接使用可能でどこかにホストする必要のない<link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">バンドルにHelmチャートを変換</link>します。FleetのCLIは、<link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">リリース</link>ページから取得できます。Macユーザの場合は、<link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulaeがあります。
zh_cn: 使用 Fleet 的 CLI <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">将 Helm chart 转换为捆绑包</link>，您可直接使用该捆绑包，无需将其托管在其他位置。可从 Fleet 的 <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">版本</link>页面获取其 CLI；对于 Mac 用户，可通过 <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulae 获取。

source: Find the required assets for your Edge release version
es: Busque los recursos necesarios para su versión de Edge
ja: Edgeリリースバージョンに必要なアセットの検索
pt_br: Encontrar os ativos necessários à sua versão de lançamento do Edge
zh_cn: 找到 Edge 发行版本的所需资产

source: Go to the "Day 2" <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> page and find the Edge release that you want to upgrade your chart to and click <emphasis role="strong">Assets</emphasis>.
es: Vaya a la página de la <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de "día 2", busque la versión de Edge a la que desea actualizar su chart y haga clic en <emphasis role="strong">Assets</emphasis> (Recursos).
ja: 「Day 2」<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>のページに移動し、チャートのアップグレード先のEdgeリリースを見つけ、<emphasis role="strong">［Assets (アセット)］</emphasis>をクリックします。
pt_br: Vá para a página de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versões</link> do "dia 2" e localize a versão do Edge para a qual você quer fazer upgrade do gráfico e clique em <emphasis role="strong">Assets</emphasis> (Ativos).
zh_cn: 转到“Day 2”<link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>页面，找到您要将 chart 升级到的 Edge 版本，然后单击 <emphasis role="strong">Assets</emphasis>（资产）。

source: From the <emphasis role="strong">"Assets"</emphasis> section, download the following files:
es: En la sección <emphasis role="strong">Assets</emphasis> (Recursos), descargue los archivos siguientes:
ja: <emphasis role="strong">［Assets (アセット)］</emphasis>セクションから、次のファイルをダウンロードします。
pt_br: Na seção <emphasis role="strong">"Assets"</emphasis> (Ativos), faça download dos seguintes arquivos:
zh_cn: 从<emphasis role="strong">“Assets”</emphasis>（资产）部分下载以下文件：

source: <emphasis role="strong">Release File</emphasis>
es: <emphasis role="strong">Archivo de versión</emphasis>
ja: <emphasis role="strong">リリースファイル</emphasis>
pt_br: <emphasis role="strong">Arquivo de versão</emphasis>
zh_cn: <emphasis role="strong">版本文件</emphasis>

source: <emphasis role="strong">Description</emphasis>
es: <emphasis role="strong">Descripción</emphasis>
ja: <emphasis role="strong">説明</emphasis>
pt_br: <emphasis role="strong">Descrição</emphasis>
zh_cn: <emphasis role="strong">说明</emphasis>

source: Pulls the images specified in the <literal>edge-release-images.txt</literal> file and packages them inside of a '.tar.gz' archive.
es: Extrae las imágenes especificadas en el archivo <literal>edge-release-images.txt</literal> y las empaqueta en un archivo ".tar.gz".
ja: <literal>edge-release-images.txt</literal>ファイルで指定されたイメージを取得し、それらを「.tar.gz」アーカイブにパッケージ化します。
pt_br: Obtém as imagens especificadas no arquivo <literal>edge-release-images.txt</literal> e as compacta em um arquivo ".tar.gz".
zh_cn: 提取 <literal>edge-release-images.txt</literal> 文件中指定的映像，并将其封装到“.tar.gz”归档中。

source: Pulls the OCI chart images related to the specific Edge release and packages them inside of a '.tar.gz' archive.
es: Extrae las imágenes del chart OCI relacionadas con la versión específica de Edge y las empaqueta en un archivo ".tar.gz".
ja: 特定のEdgeリリースに関連するOCIチャートイメージを取得し、それらを「.tar.gz」アーカイブにパッケージ化します。
pt_br: Obtém as imagens de gráfico OCI relacionadas à versão especifica do Edge e as compacta em um arquivo ".tar.gz".
zh_cn: 提取与特定 Edge 版本相关的 OCI chart 映像，并将其封装到“.tar.gz”归档中。

source: Loads images from a '.tar.gz' archive, retags and pushes them to a private registry.
es: Carga imágenes desde un archivo ".tar.gz", las vuelve a etiquetar y las envía a un registro privado.
ja: 「.tar.gz」アーカイブからイメージをロードし、再タグ付けして、プライベートレジストリにプッシュします。
pt_br: Carrega as imagens de um arquivo ".tar.gz", faz a remarcação e as envia a um registro particular.
zh_cn: 从“.tar.gz”归档加载映像，将它们重新标记并推送到专用仓库。

source: Takes a directory containing Edge OCI '.tgz' chart packages and loads them to a private registry.
es: Toma un directorio que contiene paquetes de charts OCI ".tgz" de Edge y los carga en un registro privado.
ja: Edge OCI「.tgz」チャートパッケージを含むディレクトリを取得し、プライベートレジストリにロードします。
pt_br: Detecta o diretório que contém os pacotes ".tgz" de gráficos OCI do Edge e os carrega em um registro particular.
zh_cn: 接收包含 Edge OCI '.tgz' chart 软件包的目录作为参数，并将这些软件包加载到专用仓库中。

source: Contains a list of OCI chart images related to a specific Edge release.
es: Contiene una lista de imágenes de charts OCI relacionadas con una versión específica de Edge.
ja: 特定のEdgeリリースに関連するOCIチャートイメージのリストを含みます。
pt_br: Contém uma lista de imagens de gráfico OCI relacionadas a uma versão específica do Edge.
zh_cn: 包含与特定 Edge 版本相关的 OCI chart 映像的列表。

source: Contains a list of images related to a specific Edge release.
es: Contiene una lista de imágenes relacionadas con una versión específica de Edge.
ja: 特定のEdgeリリースに関連するイメージのリストを含みます。
pt_br: Contém uma lista de imagens relacionadas a uma versão específica do Edge.
zh_cn: 包含与特定 Edge 版本相关的映像列表。

source: Create the Edge release images archive
es: Cree el archivo de imágenes de la versión de Edge
ja: Edgeリリースイメージアーカイブの作成
pt_br: Criar o arquivo de imagens da versão do Edge
zh_cn: 创建 Edge 版本映像归档
