Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: On RKE2/K3s 1.31, 1.32 and 1.33 versions, the directory <literal>/etc/cni</literal> being used to store CNI configurations may not trigger a notification of the files being written there to <literal>containerd</literal> due to certain conditions related to <literal>overlayfs</literal> (see the <link xl:href="https://github.com/rancher/rke2/issues/8356">#8356 RKE2 issue</link>). This in turn results in the deployment of RKE2/K3s to get stuck waiting for the CNI to start, and the RKE2/K3s nodes to stay in <literal>NotReady</literal> state. This can be seen at node level with <literal>kubectl describe node &lt;affected_node&gt;</literal>:
es: En las versiones 1.31, 1.32 y 1.33 de RKE2/K3s, el directorio <literal>/etc/cni</literal> que se usa para almacenar las configuraciones de CNI no activa una notificación de que los archivos se están escribiendo en <literal>containerd</literal> debido a ciertas condiciones relacionadas con <literal>overlayfs</literal> (consulte el <link xl:href="https://github.com/rancher/rke2/issues/8356">problema n.º 8356 de RKE2</link>). Esto provoca que el despliegue de RKE2/K3s se quede atascado a la espera de que se inicie el CNI y los nodos RKE2/K3s permanecen en el estado <literal>NotReady</literal>. Puede verse a nivel de nodo con el comando <literal>kubectl describe node &lt;nodo_afectado&gt;</literal>:
ja: RKE2/K3s 1.31、1.32、1.33バージョンでは、CNI設定の保存に使用されるディレクトリ<literal>/etc/cni</literal>で、<literal>overlayfs</literal>に関連する特定の条件により、そこで書き込まれるファイルの通知を <literal>containerd</literal>にトリガされない場合があります(<link xl:href="https://github.com/rancher/rke2/issues/8356">#8356 RKE2の問題</link>)。この結果、RKE2/K3sのデプロイメントがCNIが起動するのを待機した状態で停止し、RKE2/K3sノードが<literal>NotReady</literal>状態のままになります。これは、<literal>kubectl describe node &lt;affected_node&gt;</literal>を使用してノードレベルで確認できます。
zh_cn: 在 RKE2/K3s 1.31、1.32 和 1.33 版本中，用于存储 CNI 配置的 <literal>/etc/cni</literal> 目录在某些与 <literal>overlayfs</literal> 相关的状况下，可能无法触发 <literal>containerd</literal> 感知该目录下文件的写入操作（请参见 <link xl:href="https://github.com/rancher/rke2/issues/8356">RKE2 问题 #8356</link>）。这会导致 RKE2/K3s 部署停滞在等待 CNI 启动的阶段，且 RKE2/K3s 节点持续处于 <literal>NotReady</literal> 状态。通过在节点上执行 <literal>kubectl describe node &lt;affected_node&gt;</literal> 可查看此问题：

source: As a workaround, a tmpfs volume can be mounted at the <literal>/etc/cni</literal> directory before RKE2 starts. It avoids the usage of overlayfs which results in containerd missing notifications and the configs should get rewritten every time the node is restarted and the pods initcontainers run again. If using EIB, this can be a <literal>04-tmpfs-cni.sh</literal> script in the <literal>custom/scripts</literal> directory (as explained here[<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom">https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom</link>]) that looks like:
es: Como solución alternativa, se puede montar un volumen tmpfs en el directorio <literal>/etc/cni</literal> antes de que se inicie RKE2. Esto evita el uso de overlayfs, lo que provoca que containerd pierda notificaciones y que las configuraciones deban reescribirse cada vez que se reinicia el nodo y se vuelven a ejecutar los contenedores de inicio de los pods. Si se utiliza EIB, esto puede hacerse con un guion <literal>04-tmpfs-cni.sh</literal> en el directorio <literal>custom/scripts</literal> (como se explica aquí [<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom">https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom</link>), que tiene el siguiente aspecto:
ja: 回避策として、RKE2が起動する前に、tmpfsボリュームを<literal>/etc/cni</literal>ディレクトリにマウントできます。これにより、overlayfsの使用が回避され、 containerdの通知が見つからない問題や、ノードが再起動されてPodのinitcontainerが再実行されるたびに設定が書き換えられる問題を回避できます。EIBを使用する場合、これは<literal>custom/scripts</literal>ディレクトリ内の<literal>04-tmpfs-cni.sh</literal>スクリプトになり(こちら[<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom">https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom</link>]で説明)、次のようになります。
pt_br: Como solução alternativa, é possível montar um volume tmpfs no diretório <literal>/etc/cni</literal> antes que o RKE2 seja iniciado. Isso evita o uso do overlayfs, que faz com que o containerd perca notificações e que as configurações sejam regravadas sempre que o nó é reiniciado e os initcontainers dos pods são novamente executados. Se você usa o EIB, isso pode ser um script <literal>04-tmpfs-cni.sh</literal> no diretório <literal>custom/scripts</literal> (conforme explicado aqui [<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom">https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom</link>]) com esta aparência:
zh_cn: 临时解决方法是在 RKE2 启动前将 tmpfs 卷挂载到 <literal>/etc/cni</literal> 目录。这会避免使用 overlayfs（overlayfs 会导致 containerd 漏收通知），且每次节点重启及 Pod 初始化容器重新运行时，配置都会被重写。如果使用 EIB，可在 <literal>custom/scripts</literal> 目录中添加 <literal>04-tmpfs-cni.sh</literal> 脚本（如此处[<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom">https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#custom</link>]所述），脚本内容如下：

source: When onboarding remote hosts using Elemental, a race condition between <literal>dbus.service</literal> and <literal>elemental-system-agent.service</literal> might occur, resulting in <literal>rancher-system-agent.service</literal> on remote host to fail starting with errors similar to the one below. (see the <link xl:href="https://github.com/suse-edge/edge-image-builder/issues/784">#784 Edge Image Builder issue</link> for details.)
es: Cuando se inscriben hosts remotos mediante Elemental, se puede producir una condición de carrera entre <literal>dbus.service</literal> y <literal>elemental-system-agent.service</literal> que impide que <literal>rancher-system-agent.service</literal> se inicie en el host remoto con errores similares al mostrado abajo. Para obtener más información, consulte el <link xl:href="https://github.com/suse-edge/edge-image-builder/issues/784">problema n.º 784 de Edge Image Builder</link>.
ja: Elementalを使用してリモートホストをオンボーディングする際に、<literal>dbus.service</literal>と<literal>elemental-system-agent.service</literal>の間に競合状態が発生し、リモートホスト上の<literal>rancher-system-agent.service</literal>が以下のようなエラーで起動に失敗する可能性があります(詳細については、<link xl:href="https://github.com/suse-edge/edge-image-builder/issues/784">#784 Edge Image Builderの問題</link>を参照してください)。
zh_cn: 使用 Elemental 接入远程主机时，<literal>dbus.service</literal> 与 <literal>elemental-system-agent.service</literal> 之间可能出现竞态条件，导致远程主机上的 <literal>rancher-system-agent.service</literal> 启动失败，并出现类似以下的错误。（详情请参见 <link xl:href="https://github.com/suse-edge/edge-image-builder/issues/784">Edge Image Builder 问题 #784</link>）

source: As a workaround, a systemd override file can be created as below
es: Como solución, se puede crear un archivo de anulación de systemd como este:
ja: 回避策として、systemdのオーバーライドファイルを以下のように作成できます。
zh_cn: 临时解决方法是创建如下 systemd 覆盖文件

source: and a custom script named <literal>30a-copy-elemental-system-agent-override.sh</literal> can be used to place the override to <literal>/etc/systemd/system/elemental-system-agent.service.d</literal> prior to EIB’s <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/pkg/combustion/templates/31-elemental-register.sh.tpl">31-elemental-register.sh</link> script runs during the combustion phase.
es: y se puede usar un guion personalizado denominado <literal>30a-copy-elemental-system-agent-override.sh</literal> para sustituir a <literal>/etc/systemd/system/elemental-system-agent.service.d</literal> antes de que el guion <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/pkg/combustion/templates/31-elemental-register.sh.tpl">31-elemental-register.sh</link> de EIB se ejecute durante la fase de Combustion.
ja: また、<literal>30a-copy-elemental-system-agent-override.sh</literal>というカスタムスクリプトを使用して、EIBの<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/pkg/combustion/templates/31-elemental-register.sh.tpl">31-elemental-register.sh</link>スクリプトが燃焼フェーズ中に実行される前に、オーバーライドを<literal>/etc/systemd/system/elemental-system-agent.service.d</literal>に配置できます。
zh_cn: 并使用名为 <literal>30a-copy-elemental-system-agent-override.sh</literal> 的自定义脚本，在 Combustion 阶段 EIB 的 <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/pkg/combustion/templates/31-elemental-register.sh.tpl">31-elemental-register.sh</link> 脚本运行之前，将该覆盖文件放置到 <literal>/etc/systemd/system/elemental-system-agent.service.d</literal> 中。

source: Component Versions
es: Versiones de componentes
ja: コンポーネントバージョン
pt_br: Versões dos componentes
zh_cn: 组件版本

source: The following table describes the individual components that make up the 3.4.0 release, including the version, the Helm chart version (if applicable), and from where the released artifact can be pulled in the binary format. Please follow the associated documentation for usage and deployment examples.
es: La siguiente tabla describe los componentes individuales que conforman la versión 3.4.0, incluyendo la versión, la versión del chart de Helm (si procede) y desde donde se puede obtener el artefacto publicado en formato binario. Consulte la documentación asociada para ver ejemplos de uso y despliegue.
ja: 以下の表は、3.4.0リリースを構成する個々のコンポーネントを示します。これには、バージョン、Helmチャートバージョン(該当する場合)、およびリリースされたアーティファクトをバイナリ形式でプルできる場所が含まれています。使用法とデプロイメントの例について、関連するドキュメントを参照してください。
zh_cn: 下表介绍了构成 3.4.0 版本的各个组件，包括组件版本、Helm chart 版本（如果适用），以及可从中拉取已发布二进制格式制品的来源。有关用法和部署示例，请参见相关文档。

source: Name
es: Nombre
ja: 名前
pt_br: Nome
zh_cn: 名称

source: Version
es: Versión
ja: バージョン
pt_br: Versão
zh_cn: 版本

source: Helm Chart Version
es: Versión del chart de Helm
ja: Helmチャートバージョン
pt_br: Versão do gráfico Helm
zh_cn: Helm Chart 版本

source: Artifact Location (URL/Image)
es: Ubicación del artefacto (URL/Imagen)
ja: アーティファクトの場所(URL/イメージ)
pt_br: Local do artefato (URL/imagem)
zh_cn: 制品位置（URL/映像）

source: 6.1 (latest)
es: 6.1 (más reciente)
ja: 6.1 (最新)
pt_br: 6.1 (mais recente)
zh_cn: 6.1（最新）

source: N/A
es: N/D
ja: 該当なし
zh_cn: 不适用

source: <link xl:href="https://www.suse.com/download/sle-micro/">SUSE Linux Micro Download Page</link><?asciidoc-br?> SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso (sha256 70b9be28f2d92bc3b228412e4fc2b1d5026e691874b728e530b8063522158854)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-SelfInstall-GM.install.iso (sha256 9ce83e4545d4b36c7c6a44f7841dc3d9c6926fe32dbff694832e0fbd7c496e9d)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-GM.raw.xz (sha256 36e3efa55822113840dd76fdf6914e933a7b7e88a1dce5cb20c424ccf2fb4430)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-GM.raw.xz (sha256 2ee66735da3e1da107b4878e73ae68f5fb7309f5ec02b5dfdb94e254fda8415e)<?asciidoc-br?>
es: <link xl:href="https://www.suse.com/download/sle-micro/">Página de descarga de SUSE Linux Micro</link><?asciidoc-br?> SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso (sha256 70b9be28f2d92bc3b228412e4fc2b1d5026e691874b728e530b8063522158854)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-SelfInstall-GM.install.iso (sha256 9ce83e4545d4b36c7c6a44f7841dc3d9c6926fe32dbff694832e0fbd7c496e9d)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-GM.raw.xz (sha256 36e3efa55822113840dd76fdf6914e933a7b7e88a1dce5cb20c424ccf2fb4430)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-GM.raw.xz (sha256 2ee66735da3e1da107b4878e73ae68f5fb7309f5ec02b5dfdb94e254fda8415e)<?asciidoc-br?>
ja: <link xl:href="https://www.suse.com/download/sle-micro/">SUSE Linux Microダウンロードページ</link><?asciidoc-br?> SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso (sha256 70b9be28f2d92bc3b228412e4fc2b1d5026e691874b728e530b8063522158854)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-SelfInstall-GM.install.iso (sha256 9ce83e4545d4b36c7c6a44f7841dc3d9c6926fe32dbff694832e0fbd7c496e9d)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-GM.raw.xz (sha256 36e3efa55822113840dd76fdf6914e933a7b7e88a1dce5cb20c424ccf2fb4430)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-GM.raw.xz (sha256 2ee66735da3e1da107b4878e73ae68f5fb7309f5ec02b5dfdb94e254fda8415e)<?asciidoc-br?>
pt_br: <link xl:href="https://www.suse.com/download/sle-micro/">Página de downloads do SUSE Linux Micro</link><?asciidoc-br?> SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso (sha256 70b9be28f2d92bc3b228412e4fc2b1d5026e691874b728e530b8063522158854)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-SelfInstall-GM.install.iso (sha256 9ce83e4545d4b36c7c6a44f7841dc3d9c6926fe32dbff694832e0fbd7c496e9d)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-GM.raw.xz (sha256 36e3efa55822113840dd76fdf6914e933a7b7e88a1dce5cb20c424ccf2fb4430)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-GM.raw.xz (sha256 2ee66735da3e1da107b4878e73ae68f5fb7309f5ec02b5dfdb94e254fda8415e)<?asciidoc-br?>
zh_cn: <link xl:href="https://www.suse.com/download/sle-micro/">SUSE Linux Micro 下载页面</link><?asciidoc-br?> SL-Micro.x86_64-6.1-Base-SelfInstall-GM.install.iso (sha256 70b9be28f2d92bc3b228412e4fc2b1d5026e691874b728e530b8063522158854)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-SelfInstall-GM.install.iso (sha256 9ce83e4545d4b36c7c6a44f7841dc3d9c6926fe32dbff694832e0fbd7c496e9d)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-GM.raw.xz (sha256 36e3efa55822113840dd76fdf6914e933a7b7e88a1dce5cb20c424ccf2fb4430)<?asciidoc-br?> SL-Micro.x86_64-6.1-Base-RT-GM.raw.xz (sha256 2ee66735da3e1da107b4878e73ae68f5fb7309f5ec02b5dfdb94e254fda8415e)<?asciidoc-br?>

source: <link xl:href="https://www.suse.com/download/suse-manager/">SUSE Multi-Linux Manager Download Page</link>
es: <link xl:href="https://www.suse.com/download/suse-manager/">Página de descarga de SUSE Multi-Linux Manager</link>
ja: <link xl:href="https://www.suse.com/download/suse-manager/">SUSE Multi-Linux Managerダウンロードページ</link>
pt_br: <link xl:href="https://www.suse.com/download/suse-manager/">Página de downloads do SUSE Multi-Linux Manager</link>
zh_cn: <link xl:href="https://www.suse.com/download/suse-manager/">SUSE Multi-Linux Manager 下载页面</link>

source: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.33.3%2Bk3s1">Upstream K3s Release</link>
es: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.33.3%2Bk3s1">Versión superior de K3s</link>
ja: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.33.3%2Bk3s1">アップストリームK3sリリース</link>
zh_cn: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.33.3%2Bk3s1">上游 K3s 版本</link>

source: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.33.3%2Brke2r1">Upstream RKE2 Release</link>
es: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.33.3%2Brke2r1">Versión superior de RKE2</link>
ja: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.33.3%2Brke2r1">アップストリームRKE2リリース</link>
zh_cn: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.33.3%2Brke2r1">上游 RKE2 版本</link>

source: <link xl:href="https://charts.rancher.com/server-charts/prime/index.yaml">Rancher Prime Helm Repository</link><?asciidoc-br?> <link xl:href="https://github.com/rancher/rancher/releases/download/v2.12.1/rancher-images.txt">Rancher 2.12.1 Container Images</link>
es: <link xl:href="https://charts.rancher.com/server-charts/prime/index.yaml">Repositorio de Helm de Rancher Prime</link><?asciidoc-br?> <link xl:href="https://github.com/rancher/rancher/releases/download/v2.12.1/rancher-images.txt">Imágenes de contenedor de Rancher 2.12.1</link>
ja: <link xl:href="https://charts.rancher.com/server-charts/prime/index.yaml">Rancher Prime Helmリポジトリ</link><?asciidoc-br?> <link xl:href="https://github.com/rancher/rancher/releases/download/v2.12.1/rancher-images.txt">Rancher 2.12.1コンテナイメージ</link>
zh_cn: <link xl:href="https://charts.rancher.com/server-charts/prime/index.yaml">Rancher Prime Helm 储存库</link><?asciidoc-br?> <link xl:href="https://github.com/rancher/rancher/releases/download/v2.12.1/rancher-images.txt">Rancher 2.12.1 容器映像</link>

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.9.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v5.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v8.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.16.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.61<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.9.1<?asciidoc-br?>
es: <link xl:href="https://charts.rancher.io/index.yaml">Repositorio de charts de Helm de Rancher</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.9.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v5.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v8.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.16.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.61<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.9.1<?asciidoc-br?>
ja: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helmリポジトリ</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.9.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v5.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v8.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.16.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.61<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.9.1<?asciidoc-br?>
zh_cn: <link xl:href="https://charts.rancher.io/index.yaml">Rancher chart Helm 储存库</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.9.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v5.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v8.3.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.14.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.16.0-20250709<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.9.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.61<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.9.1<?asciidoc-br?>

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/neuvector-controller:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-enforcer:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-manager:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-compliance-config:1.0.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.8<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> registry.suse.com/rancher/neuvector-updater:0.0.4
es: <link xl:href="https://charts.rancher.io/index.yaml">Repositorio de charts de Helm de Rancher</link><?asciidoc-br?> registry.suse.com/rancher/neuvector-controller:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-enforcer:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-manager:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-compliance-config:1.0.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.8<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> registry.suse.com/rancher/neuvector-updater:0.0.4
ja: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helmリポジトリ</link><?asciidoc-br?> registry.suse.com/rancher/neuvector-controller:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-enforcer:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-manager:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-compliance-config:1.0.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.8<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> registry.suse.com/rancher/neuvector-updater:0.0.4
zh_cn: <link xl:href="https://charts.rancher.io/index.yaml">Rancher chart Helm 储存库</link><?asciidoc-br?> registry.suse.com/rancher/neuvector-controller:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-enforcer:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-manager:5.4.5<?asciidoc-br?> registry.suse.com/rancher/neuvector-compliance-config:1.0.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.8<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> registry.suse.com/rancher/neuvector-updater:0.0.4
