Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: To change the flags for RKE2 or K3s servers, you need to modify either the <literal>/etc/systemd/system/rke2.service</literal> or <literal>/etc/systemd/system/k3s.service</literal> file on all the VMs in the cluster, depending on the distribution.
es: Para cambiar los indicadores de los servidores RKE2 o K3s, es necesario modificar el archivo <literal>/etc/systemd/system/rke2.service</literal> o el archivo <literal>/etc/systemd/system/k3s.service</literal> en todas las máquinas virtuales del clúster, en función de la distribución.
ja: RKE2またはK3sサーバのフラグを変更するには、ディストリビューションに応じて、クラスタのすべてのVM上で<literal>/etc/systemd/system/rke2.service</literal>または<literal>/etc/systemd/system/k3s.service</literal>ファイルを変更する必要があります。
pt_br: Para alterar os sinalizadores dos servidores RKE2 ou K3s, você precisa modificar o arquivo <literal>/etc/systemd/system/rke2.service</literal> ou <literal>/etc/systemd/system/k3s.service</literal> em todas as VMs no cluster, dependendo da distribuição.
zh_cn: 要更改 RKE2 或 K3s 服务器的标志，需要修改群集所有 VM 上的 <literal>/etc/systemd/system/rke2.service</literal> 或 <literal>/etc/systemd/system/k3s.service</literal> 文件，具体取决于发行版。

source: The flags should be inserted in the <literal>ExecStart</literal>. For example:
es: Los indicadores deben insertarse en <literal>ExecStart</literal>. Por ejemplo:
ja: フラグは<literal>ExecStart</literal>に挿入する必要があります。例:
pt_br: Insira os sinalizadores em <literal>ExecStart</literal>. Por exemplo:
zh_cn: 应在 <literal>ExecStart</literal> 中插入标志。例如：

source: Then the following commands should be executed to load the new configurations:
es: A continuación, se deben ejecutar los siguientes comandos para cargar las nuevas configuraciones:
ja: 次に、次のコマンドを実行して、新しい設定をロードする必要があります。
pt_br: Na sequência, os seguintes comandos devem ser executados para carregar as novas configurações:
zh_cn: 然后应执行以下命令来加载新配置：

source: Installing MetalLB
es: Instalación de MetalLB
ja: MetalLBのインストール
pt_br: Instalando o MetalLB
zh_cn: 安装 MetalLB

source: To deploy <literal>MetalLB</literal>, the MetalLB on K3s (<xref linkend="guides-metallb-k3s"/>) guide can be used.
es: Para desplegar <literal>MetalLB</literal>, se puede usar la guía de MetalLB en K3s (<xref linkend="guides-metallb-k3s"/>).
ja: <literal>MetalLB</literal>をデプロイするには、K3s上のMetalLB (<xref linkend="guides-metallb-k3s"/>)のガイドを使用できます。
pt_br: Para implantar o <literal>MetalLB</literal>, use o guia do MetalLB no K3s (<xref linkend="guides-metallb-k3s"/>).
zh_cn: 要部署 <literal>MetalLB</literal>，可以使用 K3s 上的 MetalLB（<xref linkend="guides-metallb-k3s"/>）指南。

source: <emphasis role="strong">NOTE:</emphasis> Ensure that the <literal>VIP_SERVICE_IP</literal> IP address does not overlap with the existing <literal>IPAddressPools</literal> in the cluster.
es: <emphasis role="strong">NOTA:</emphasis> asegúrese de que la dirección IP <literal>VIP_SERVICE_IP</literal> no se superpone a los <literal>IPAddressPools</literal> existentes en el clúster.
ja: <emphasis role="strong">メモ:</emphasis> <literal>VIP_SERVICE_IP</literal> IPアドレスがクラスタ内の既存の<literal>IPAddressPools</literal>と重複していないことを確認してください。
zh_cn: <emphasis role="strong">注意：</emphasis>请确保 <literal>VIP_SERVICE_IP</literal> IP 地址与群集中现有的 <literal>IPAddressPools</literal> 不重叠。

source: Create a separate <literal>IpAddressPool</literal> and <literal>L2Advertisement</literal> that will be used only for the managed Service.
es: Cree una <literal>IpAddressPool</literal> y un <literal>L2Advertisement</literal> independientes que se usarán únicamente para el servicio gestionado.
ja: 管理対象のServiceにのみ使用される個別の<literal>IpAddressPool</literal>と<literal>L2Advertisement</literal>を作成します。
zh_cn: 创建单独的 <literal>IpAddressPool</literal> 和 <literal>L2Advertisement</literal>，仅用于受管理的服务。

source: <emphasis role="strong">NOTE:</emphasis> The IPAddressPool below will be assigned to a Service of type <literal>LoadBalancer</literal> in the <literal>default</literal> Namespace. If multiple <literal>LoadBalancer</literal> services exist there, additional <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">ServiceSelectors</link> may be configured to match this VIP service explicitly.
es: <emphasis role="strong">NOTA:</emphasis> el IPAddressPool siguiente se asignará a un servicio de tipo <literal>LoadBalancer</literal> en el espacio de nombres <literal>default</literal>. Si en ese espacio hay varios servicios <literal>LoadBalancer</literal>, podría haber <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">ServiceSelectors</link> adicionales configurados que coincidan explícitamente con este servicio de IP virtual.
ja: <emphasis role="strong">メモ:</emphasis> 以下のIPAddressPoolは、<literal>default</literal>ネームスペースの<literal>LoadBalancer</literal>タイプのServiceに割り当てられます。複数の<literal>LoadBalancer</literal>サービスがそこに存在する場合、追加の<link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">ServiceSelectors</link>をこのVIPサービスと明示的に一致するように設定できます。
zh_cn: <emphasis role="strong">注意：</emphasis>下面的 IPAddressPool 将分配给 <literal>default</literal> 命名空间中类型为 <literal>LoadBalancer</literal> 的服务。如果该命名空间中存在多个 <literal>LoadBalancer</literal> 服务，可能需要配置额外的 <link xl:href="https://metallb.universe.tf/configuration/_advanced_ipaddresspool_configuration/#reduce-scope-of-address-allocation-to-specific-namespace-and-service">ServiceSelectors</link>，以明确匹配此 VIP 服务。

source: Installing the Endpoint Copier Operator
es: Instalación de Endpoint Copier Operator
ja: Endpoint Copier Operatorのインストール
pt_br: Instalando o Endpoint Copier Operator
zh_cn: 安装 Endpoint Copier Operator

source: The command above will deploy the <literal>endpoint-copier-operator</literal> operator Deployment with two replicas. One will be the leader and the other will take over the leader role if needed.
es: El comando de arriba desplegará el operador <literal>endpoint-copier-operator</literal> con dos réplicas. Una será la líder y la otra asumirá el papel de líder si fuera necesario.
ja: 上記のコマンドは2つのレプリカを持つ<literal>endpoint-copier-operator</literal>オペレータのデプロイメントをデプロイします。一方がリーダーとなり、他方は必要に応じてリーダーの役割を引き継ぎます。
pt_br: O comando acima implanta o operador <literal>endpoint-copier-operator</literal> com duas réplicas: uma será a líder e a outra assumirá a função de líder se necessário.
zh_cn: 以上命令会部署包含两个复本的 <literal>endpoint-copier-operator</literal> 操作器部署。其中一个复本是领导者，另一个复本在需要时接管领导者角色。

source: Now, the <literal>kubernetes-vip</literal> Service should be deployed, which will be reconciled by the operator and an EndpointSlices with the configured ports and IP will be created.
es: Ahora, se debe desplegar el servicio <literal>kubernetes-vip</literal>, que el operador reconciliará, y se creará un EndpointSlices con los puertos y la IP configurados.
ja: これで、<literal>kubernetes-vip</literal> Serviceがデプロイされ、オペレータによって調整され、設定されたポートとIPを持つEndpointSlicesが作成されます。
zh_cn: 现在应部署 <literal>kubernetes-vip</literal> 服务，这将由操作器来协调，另外需创建具有所配置端口和 IP 的 EndpointSlices。

source: Verify that the <literal>kubernetes-vip</literal> Service has the correct IP address:
es: Verifique que el servicio <literal>kubernetes-vip</literal> tenga la dirección IP correcta:
ja: <literal>kubernetes-vip</literal>サービスのIPアドレスが正しいことを確認します。
pt_br: Verifique se o serviço <literal>kubernetes-vip</literal> tem o endereço IP correto:
zh_cn: 校验 <literal>kubernetes-vip</literal> 服务是否使用正确的 IP 地址：

source: Ensure that the <literal>kubernetes-vip-*</literal> and <literal>kubernetes</literal> EndpointSlices resources in the <literal>default</literal> namespace point to the same IPs.
es: Asegúrese de que los recursos EdnpointSlices <literal>kubernetes-vip-*</literal> y <literal>kubernetes</literal> del espacio de nombres <literal>default</literal> señalan a las mismas IP.
ja: <literal>default</literal>ネームスペースの<literal>kubernetes-vip-*</literal>および<literal>kubernetes</literal>のEndpointSlicesリソースが同じIPを指していることを確認します。
zh_cn: 确保 <literal>default</literal> 名称空间中的 <literal>kubernetes-vip</literal> 和 <literal>kubernetes</literal> EndpointSlices 资源指向相同的 IP。

source: If everything is correct, the last thing left is to use the <literal>VIP_SERVICE_IP</literal> in our <literal>Kubeconfig</literal>.
es: Si todo está correcto, lo último que queda por hacer es usar <literal>VIP_SERVICE_IP</literal> en nuestro <literal>Kubeconfig</literal>.
ja: すべて問題なければ、最後に<literal>Kubeconfig</literal>で<literal>VIP_SERVICE_IP</literal>を使用します。
pt_br: Se tudo estiver correto, a última coisa a se fazer é usar o <literal>VIP_SERVICE_IP</literal> no <literal>Kubeconfig</literal>.
zh_cn: 如果所有设置正确，剩下的最后一项操作就是在 <literal>Kubeconfig</literal> 中使用 <literal>VIP_SERVICE_IP</literal>。

source: From now on, all the <literal>kubectl</literal> will go through the <literal>kubernetes-vip</literal> service.
es: A partir de ahora, todo <literal>kubectl</literal> pasará por el servicio <literal>kubernetes-vip</literal>.
ja: これ以降、<literal>kubectl</literal>はすべて<literal>kubernetes-vip</literal>サービスを経由するようになります。
pt_br: A partir de agora, o <literal>kubectl</literal> sempre vai passar pelo serviço <literal>kubernetes-vip</literal>.
zh_cn: 从现在开始，所有 <literal>kubectl</literal> 命令都将通过 <literal>kubernetes-vip</literal> 服务运行。

source: Adding control-plane nodes
es: Adición de nodos de plano de control
ja: コントロールプレーンノードの追加
pt_br: Adicionando nós do plano de controle
zh_cn: 添加控制平面节点

source: To monitor the entire process, two more terminal tabs can be opened.
es: Para supervisar todo el proceso, se pueden abrir dos pestañas de terminal más.
ja: プロセス全体を監視するため、端末タブを2つ以上開くことができます。
pt_br: Para monitorar o processo inteiro, é possível abrir mais duas guias do terminal.
zh_cn: 要监控整个过程，可以打开另外两个终端选项卡。

source: First terminal:
es: Primer terminal:
ja: 最初の端末:
pt_br: Primeiro terminal:
zh_cn: 第一个终端：

source: Second terminal:
es: Segundo terminal:
ja: 2つ目の端末:
pt_br: Segundo terminal:
zh_cn: 第二个终端：

source: Now execute the commands below on the second and third nodes.
es: Ahora, ejecute los comandos siguientes en el segundo y el tercer nodo.
ja: 次に、以下のコマンドを2つ目のノードと3つ目のノードで実行します。
pt_br: Agora execute os comandos a seguir no segundo e no terceiro nó.
zh_cn: 现在，在第二和第三个节点上执行以下命令。

source: Air-gapped deployments with Edge Image Builder
es: Despliegues en entornos aislados con Edge Image Builder
ja: Edge Image Builderを使用したエアギャップデプロイメント
pt_br: Implantações air-gapped com o Edge Image Builder
zh_cn: 使用 Edge Image Builder 进行隔离式部署

source: Intro
es: Introducción
ja: 概要
pt_br: Introdução
zh_cn: 简介

source: This guide will show how to deploy several of the SUSE Edge components completely air-gapped on SUSE Linux Micro 6.1 utilizing Edge Image Builder(EIB) (<xref linkend="components-eib"/>). With this, you’ll be able to boot into a customized, ready to boot (CRB) image created by EIB and have the specified components deployed on either a RKE2 or K3s cluster without an Internet connection or any manual steps. This configuration is highly desirable for customers that want to pre-bake all artifacts required for deployment into their OS image, so they are immediately available on boot.
es: Esta guía explica cómo desplegar varios componentes de SUSE Edge en entornos completamente aislados en SUSE Linux Micro 6.1 utilizando Edge Image Builder(EIB) (<xref linkend="components-eib"/>). De este modo, podrá arrancar en una imagen personalizada lista para arrancar (CRB) creada por EIB y desplegar los componentes especificados en un clúster RKE2 o K3s sin conexión a Internet ni pasos manuales. Esta configuración es muy conveniente para los clientes que desean preparar de antemano todos los artefactos necesarios para el despliegue en su imagen del sistema operativo para que estén disponible de inmediato en el arranque.
ja: このガイドでは、Edge Image Builder (EIB) (<xref linkend="components-eib"/>)を使用し、完全にエアギャップされた環境で複数のSUSE EdgeコンポーネントをSUSE Linux Micro 6.1上にデプロイする方法を示します。これにより、EIBで作成したCustomized, Ready to Boot (CRB)イメージでブートし、指定したコンポーネントをインターネット接続や手動手順なしにRKE2クラスタまたはK3sクラスタにデプロイできます。この設定は、デプロイメントに必要なアーティファクトをすべてOSイメージにプリベイクし、ブート後すぐに利用できるようにしたいお客様にとって非常に便利です。
pt_br: Este guia mostra como implantar vários componentes do SUSE Edge totalmente air-gapped no SUSE Linux Micro 6.1 usando o Edge Image Builder (EIB) (<xref linkend="components-eib"/>). Dessa forma, você pode inicializar em uma imagem personalizada e pronta para uso (CRB) criada pelo EIB e ter os componentes especificados implantados em um cluster RKE2 ou K3s, sem conexão com a Internet nem qualquer etapa manual. Essa configuração é extremamente prática para clientes que desejam fazer bake prévio de todos os artefatos necessários para implantação na imagem do sistema operacional, assim eles ficam disponíveis logo após a inicialização.
zh_cn: 本指南将介绍如何使用 Edge Image Builder (EIB)（<xref linkend="components-eib"/>）在 SUSE Linux Micro 6.1 上以完全隔离的方式部署多个 SUSE Edge 组件。使用此方法可以引导至 EIB 所创建的随时可引导 (CRB) 的自定义映像，并在 RKE2 或 K3s 群集上部署指定的组件，而无需连接到互联网，也无需执行任何手动步骤。对于想要将部署所需的所有制品预先嵌入其操作系统映像的客户而言，此配置非常理想，这样就可以在引导时立即使用这些制品。

source: We will cover an air-gapped installation of:
es: Muestra una instalación en un entorno aislado de:
ja: ここでは、以下のエアギャップインストールについて説明します。
pt_br: Vamos abordar a instalação air-gapped do:
zh_cn: 本指南将介绍以下组件的隔离式安装：

source: EIB will parse and pre-download all images referenced in the provided Helm charts and Kubernetes manifests. However, some of those may be attempting to pull container images and create Kubernetes resources based on those at runtime. In these cases we have to manually specify the necessary images in the definition file if we want to set up a completely air-gapped environment.
es: EIB analizará y descargará previamente todas las imágenes a las que se haga referencia en los charts de Helm y los manifiestos de Kubernetes proporcionados. Sin embargo, es posible que algunos de ellos intenten extraer imágenes de contenedores y crear recursos de Kubernetes basados en estas imágenes en el entorno de ejecución. Si se dieran estos casos, para configurar un entorno completamente aislado, habrá que especificar manualmente las imágenes necesarias en el archivo de definición.
ja: EIBは、指定したHelmチャートとKubernetesマニフェストで参照されているイメージをすべて解析し、事前にダウンロードします。ただし、その一部がコンテナイメージをプルし、そのイメージに基づいて実行時にKubernetesリソースを作成しようとする場合があります。このような場合、完全なエアギャップ環境を設定するには、必要なイメージを定義ファイルに手動で指定する必要があります。
pt_br: O EIB analisa e faz pré-download de todas as imagens referenciadas nos gráficos Helm e nos manifestos do Kubernetes fornecidos. No entanto, alguns deles podem tentar obter as imagens do contêiner e criar recursos do Kubernetes com base nas imagens em runtime. Nesses casos, precisamos especificar manualmente as imagens necessárias no arquivo de definição para configurar um ambiente completamente air-gapped.
zh_cn: EIB 将分析并预先下载提供的 Helm chart 和 Kubernetes 清单中引用的所有映像。但是，其中一些操作可能会尝试提取容器映像并在运行时基于这些映像创建 Kubernetes 资源。在这种情况下，如果我们想要设置完全隔离的环境，则必须在定义文件中手动指定所需的映像。

source: If you’re following this guide, it’s assumed that you are already familiar with EIB (<xref linkend="components-eib"/>). If not, please follow the quick start guide (<xref linkend="quickstart-eib"/>) to better understand the concepts shown in practice below.
es: Si sigue esta guía, se entiende que ya está familiarizado con EIB (<xref linkend="components-eib"/>). Si no es así, siga la guía de inicio rápido (<xref linkend="quickstart-eib"/>) para comprender mejor los conceptos que se muestran en la práctica de abajo.
ja: このガイドに従って操作を進める場合、すでにEIB (<xref linkend="components-eib"/>)に精通していることを想定しています。まだEIBに精通していない場合は、クイックスタートガイド(<xref linkend="quickstart-eib"/>)に従って、以下の演習で示されている概念の理解を深めてください。
pt_br: Se você está seguindo este guia, consideramos que já esteja familiarizado com o EIB (<xref linkend="components-eib"/>). Do contrário, consulte o Guia de Início Rápido (<xref linkend="quickstart-eib"/>) para entender melhor os conceitos apresentados na prática a seguir.
zh_cn: 我们假设本指南的读者已事先熟悉 EIB（<xref linkend="components-eib"/>）。如果您不熟悉，请阅读快速入门指南（<xref linkend="quickstart-eib"/>），以便更好地理解下面实际操作中涉及的概念。

source: Libvirt Network Configuration
es: Configuración de red de Libvirt
ja: Libvirtのネットワーク設定
pt_br: Configuração da rede libvirt
zh_cn: Libvirt 网络配置

source: To demo the air-gapped deployment, this guide will be done using a simulated air-gapped <literal>libvirt</literal> network and the following configuration will be tailored to that. For your own deployments, you may have to modify the <literal>host1.local.yaml</literal> configuration that will be introduced in the next step.
es: Como ejemplo de un despliegue en entorno aislado, en esta guía se usa una red <literal>libvirt</literal> aislada simulada, por lo que la configuración que se muestra se adapta en consecuencia. Para sus despliegues, puede que tenga que modificar la configuración de <literal>host1.local.yaml</literal> que se introducirá en el siguiente paso.
ja: エアギャップデプロイメントのデモを示すため、このガイドはシミュレートされたエアギャップ<literal>libvirt</literal>ネットワークを使用して実施し、それに合わせて以下の設定を調整します。ご自身のデプロイメントでは、<literal>host1.local.yaml</literal>の設定の変更が必要になる場合があります。これについては、次の手順で説明します。
pt_br: Para demonstrar a implantação air-gapped, este guia usa a rede air-gapped simulada <literal>libvirt</literal> e a configuração a seguir é adaptada a ela. Em suas próprias implantações, você pode precisar modificar a configuração <literal>host1.local.yaml</literal> que será introduzida na etapa seguinte.
zh_cn: 为了演示隔离式部署，本指南将使用模拟的 <literal>libvirt</literal> 隔离网络，并根据该网络定制以下配置。对于您自己的部署，可能需要修改下一步骤中将介绍的 <literal>host1.local.yaml</literal> 配置。

source: If you would like to use the same <literal>libvirt</literal> network configuration, follow along. If not, skip to <xref linkend="config-dir-creation"/>.
es: Si desea utilizar la misma configuración de red de <literal>libvirt</literal>, siga adelante. Si no, salte a la <xref linkend="config-dir-creation"/>.
ja: 同じ<literal>libvirt</literal>ネットワーク設定を使用する場合は、このまま読み進めてください。そうでない場合は、<xref linkend="config-dir-creation"/>までスキップしてください。
pt_br: Se você prefere usar a mesma configuração de rede <literal>libvirt</literal>, siga adiante. Do contrário, pule para a <xref linkend="config-dir-creation"/>.
zh_cn: 如果您要使用相同的 <literal>libvirt</literal> 网络配置，请继续阅读。否则请跳到<xref linkend="config-dir-creation"/>。

source: Let’s create an isolated network configuration with an IP address range <literal>192.168.100.2/24</literal> for DHCP:
es: Vamos a crear una configuración de red aislada con un rango de direcciones IP <literal>192.168.100.2/24</literal> para DHCP:
ja: DHCPのIPアドレス範囲<literal>192.168.100.2/24</literal>で、分離されたネットワーク設定を作成してみましょう。
pt_br: Vamos criar uma configuração de rede isolada com o intervalo de endereços IP <literal>192.168.100.2/24</literal> para DHCP:
zh_cn: 我们来为 DHCP 创建 IP 地址范围为 <literal>192.168.100.2/24</literal> 的隔离网络配置：

source: Now, the only thing left is to create the network and start it:
es: Ahora, solo queda crear la red y ponerla en marcha:
ja: あとはネットワークを作成して起動するだけです。
pt_br: Agora resta apenas criar e iniciar a rede:
zh_cn: 现在，唯一剩下的操作就是创建并启动网络：

source: Base Directory Configuration
es: Configuración del directorio base
ja: ベースディレクトリの設定
pt_br: Configuração do diretório base
zh_cn: 基础目录配置

source: The base directory configuration is the same across all different components, so we will set it up here.
es: La configuración del directorio base es la misma para todos los componentes, así que la configuraremos aquí.
ja: ベースディレクトリの設定は、各種のコンポーネントすべてで同じであるため、ここで設定します。
pt_br: A configuração do diretório base é igual em todos os diversos componentes, portanto, vamos defini-la aqui.
zh_cn: 基础目录配置在所有组件中都相同，现在我们就设置此配置。

source: We will first create the necessary subdirectories:
es: Primero, creamos los subdirectorios necesarios:
ja: まず、必要なサブディレクトリを作成します。
pt_br: Vamos primeiro criar os subdiretórios necessários:
zh_cn: 首先创建所需的子目录：

source: Make sure to add whichever base image you plan to use into the <literal>base-images</literal> directory. This guide will focus on the Self Install ISO found <link xl:href="https://www.suse.com/download/sle-micro/">here</link>.
es: Asegúrese de añadir la imagen base que tenga previsto utilizar en el directorio <literal>base-images</literal>. Esta guía se centra en la imagen ISO de autoinstalación que se encuentra <link xl:href="https://www.suse.com/download/sle-micro/">aquí</link>.
ja: 必ず、使用する予定のゴールデンイメージを<literal>base-images</literal>ディレクトリに追加してください。このガイドでは、<link xl:href="https://www.suse.com/download/sle-micro/">こちら</link>にあるセルフインストールISOに焦点を当てて説明します。
pt_br: Adicione qualquer imagem base que você queira usar ao diretório <literal>base-images</literal>. O foco deste guia é a autoinstalação da ISO disponível <link xl:href="https://www.suse.com/download/sle-micro/">aqui</link>.
zh_cn: 请确保将您要使用的任何基础映像添加到 <literal>base-images</literal> 目录中。本指南将重点介绍<link xl:href="https://www.suse.com/download/sle-micro/">此处</link>提供的自安装 ISO 映像。

source: Let’s copy the downloaded image:
es: Copiemos la imagen descargada:
ja: ダウンロードしたイメージをコピーしましょう。
pt_br: Vamos copiar a imagem baixada:
zh_cn: 我们来复制已下载的映像：

source: EIB is never going to modify the base image input.
es: EIB nunca modifica la entrada de la imagen base.
ja: EIBは、ゴールデンイメージの入力を変更することはありません。
pt_br: O EIB nunca modifica a entrada da imagem base.
zh_cn: EIB 永远不会修改基础映像输入。

source: Let’s create a file containing the desired network configuration:
es: Vamos a crear un archivo que contenga la configuración de red deseada:
ja: 目的のネットワーク設定を含むファイルを作成しましょう。
pt_br: Vamos criar um arquivo com a configuração de rede desejada:
zh_cn: 我们来创建一个包含所需网络配置的文件：

source: This configuration ensures the following are present on the provisioned systems (using the specified MAC address):
es: Esta configuración garantiza la presencia de los siguientes elementos en los sistemas aprovisionados (utilizando la dirección MAC especificada):
ja: この設定により、プロビジョニングされたシステムに以下が確実に存在するようになります(指定されたMACアドレスを使用)。
pt_br: Esta configuração garante que os seguintes elementos estejam presentes nos sistemas provisionados (usando o endereço MAC especificado):
zh_cn: 此配置确保置备的系统上存在以下设置（使用指定的 MAC 地址）：

source: an Ethernet interface with a static IP address
es: una interfaz Ethernet con una dirección IP estática
ja: 静的IPアドレスを持つEthernetインタフェース
pt_br: uma interface Ethernet com endereço IP estático
zh_cn: 采用静态 IP 地址的以太网接口

source: routing
es: enrutamiento
ja: ルーティング
pt_br: roteamento
zh_cn: 路由

source: hostname (<literal>host1.local</literal>)
es: nombre de host (<literal>host1.local</literal>)
ja: ホスト名(<literal>host1.local</literal>)
pt_br: nome de host (<literal>host1.local</literal>)
zh_cn: 主机名 (<literal>host1.local</literal>)

source: The resulting file structure should now look like:
es: La estructura de archivos resultante debería tener el siguiente aspecto:
ja: 結果のファイル構造は次のようになります。
pt_br: A estrutura do arquivo resultante deve ter a seguinte aparência:
zh_cn: 最终的文件结构现在应如下所示：

source: Base Definition File
es: Archivo de definición base
ja: ベース定義ファイル
pt_br: Arquivo de definição de base
zh_cn: 基础定义文件
