Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The names of the files under the <literal>network/</literal> directory are intentional. They correspond to the hostnames which will be set during the provisioning process.
es: Los nombres de los archivos del directorio <literal>network/</literal> son intencionados. Corresponden a los nombres de host que se establecerán durante el proceso de aprovisionamiento.
ja: <literal>network/</literal>ディレクトリにあるファイル名は意図的なものです。これらの名前は、プロビジョニングプロセス中に設定されるホスト名に対応しています。
pt_br: Os nomes dos arquivos no diretório <literal>network/</literal> são intencionais e correspondem aos nomes de host que serão definidos durante o processo de provisionamento.
zh_cn: <literal>network/</literal> 目录下的文件名是特意设定的，它们与置备过程中将要设置的主机名相对应。

source: Building the OS image
es: Creación de la imagen del sistema operativo
ja: OSイメージの構築
pt_br: Criando a imagem de sistema operacional
zh_cn: 构建操作系统映像

source: Now that all the necessary configurations are in place, we can build the image by simply running:
es: Ahora que todas las configuraciones necesarias están listas, podemos crear la imagen ejecutando:
ja: これで必要な設定はすべて完了したので、次のコマンドを実行するだけでイメージを構築できます。
pt_br: Agora que todas as configurações necessárias foram definidas, podemos criar a imagem executando simplesmente:
zh_cn: 完成所有必要配置后，接下来我们只需运行以下命令来构建映像：

source: The output should be similar to the following:
es: El resultado debe ser parecido a esto:
ja: 出力は次のようになります。
pt_br: A saída deve ter uma aparência semelhante a esta:
zh_cn: 输出应如下所示：

source: The snippet above tells us that the <literal>Network</literal> component has successfully been configured, and we can proceed with provisioning our edge nodes.
es: El fragmento anterior nos indica que el componente <literal>Network</literal> se ha configurado correctamente y que podemos continuar con el aprovisionamiento de nuestros nodos periféricos.
ja: 上のスニペットから<literal>Network</literal>コンポーネントが正常に設定されていることがわかるので、エッジノードのプロビジョニングに進むことができます。
pt_br: O trecho acima nos informa que o componente <literal>Network</literal> foi configurado com sucesso, e podemos prosseguir com o provisionamento dos nós de borda.
zh_cn: 以上输出片段告诉我们<literal>网络</literal>组件已成功配置，我们可以继续置备边缘节点。

source: A log file (<literal>network-config.log</literal>) and the respective NetworkManager connection files can be inspected in the resulting <literal>_build</literal> directory under a timestamped directory for the image run.
es: Es posible inspeccionar un archivo de registro (<literal>network-config.log</literal>) y los respectivos archivos de conexión de NetworkManager en el directorio <literal>_build</literal> resultante, dentro de un directorio con marca de hora de la ejecución de la imagen.
ja: ログファイル(<literal>network-config.log</literal>)とそれぞれのNetworkManager接続ファイルは、イメージ実行のタイムスタンプ付きディレクトリの下にある、結果の<literal>_build</literal>ディレクトリで検査できます。
pt_br: É possível inspecionar um arquivo de registro (<literal>network-config.log</literal>) e os respectivos arquivos de conexão do NetworkManager no diretório <literal>_build</literal> resultante abaixo do diretório com a marcação de data e hora da execução da imagem.
zh_cn: 可以在所运行映像的带时间戳目录下生成的 <literal>_build</literal> 目录中，检查日志文件 (<literal>network-config.log</literal>) 和相应的 NetworkManager 连接文件。

source: Provisioning the edge nodes
es: Aprovisionamiento de los nodos periféricos
ja: エッジノードのプロビジョニング
pt_br: Provisionando os nós de borda
zh_cn: 置备边缘节点

source: Let’s copy the resulting RAW image:
es: Vamos a copiar la imagen RAW resultante:
ja: 作成されたRAWイメージをコピーしてみましょう。
pt_br: Vamos copiar a imagem RAW resultante:
zh_cn: 我们来复制生成的原始映像：

source: You will notice that we copied the built image four times but only specified the network configurations for three nodes. This is because we also want to showcase what will happen if we provision a node which does not match any of the desired configurations.
es: Notará que hemos copiado la imagen creada cuatro veces, pero solo especificamos las configuraciones de redes para tres nodos. Esto se debe a que también queremos mostrar lo que sucederá si aprovisionamos un nodo que no coincide con ninguna de las configuraciones deseadas.
ja: 構築されたイメージを4回コピーしましたが、3つのノードのネットワーク設定しか指定していません。これは、どの目的の設定にも一致しないノードをプロビジョニングするとどうなるかも紹介したいためです。
pt_br: Veja que copiamos a imagem criada quatro vezes, mas especificamos apenas as configurações de rede para três nós. O motivo para isso é que também queremos demonstrar o que acontece quando provisionamos um nó que não corresponde a nenhuma das configurações desejadas.
zh_cn: 您会发现，我们复制了构建的映像四次，但仅指定了三个节点的网络配置。这是因为，我们还想展示当置备的节点与任何期望的配置都不匹配时会发生什么。

source: This guide will use virtualization for the node provisioning examples. Ensure the necessary extensions are enabled in the BIOS (see <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">here</link> for details).
es: En esta guía se usará virtualización para los ejemplos de aprovisionamiento de nodos. Asegúrese de que estén habilitadas las extensiones necesarias en el BIOS (consulte <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">este documento</link> para obtener más detalles).
ja: このガイドでは、ノードプロビジョニングの例に仮想化を使用します。必要な拡張機能がBIOSで有効になっていることを確認してください(詳細については <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">こちら</link>を参照してください)。
pt_br: Este guia usará a virtualização nos exemplos de provisionamento de nós. Assegure que as extensões necessárias estejam habilitadas no BIOS (consulte <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">aqui</link> para obter detalhes).
zh_cn: 本指南将为节点置备示例使用虚拟化。请确保在 BIOS 中启用必要的扩展（有关详细信息，请参见<link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/cha-virt-support.html#sec-kvm-requires-hardware">此处</link>）。

source: We will be using <literal>virt-install</literal> to create virtual machines using the copied raw disks. Each virtual machine will be using 10 GB of RAM and 6 vCPUs.
es: Utilizaremos <literal>virt-install</literal> para crear máquinas virtuales utilizando los discos sin procesar copiados. Cada máquina virtual utilizará 10 GB de RAM y 6 CPU virtuales.
ja: <literal>virt-install</literal>を使用し、コピーしたRAWディスクを使用して仮想マシンを作成します。各仮想マシンは10GBのRAMと6個のvCPUを使用します。
pt_br: Vamos usar <literal>virt-install</literal> para criar máquinas virtuais por meio dos discos brutos copiados. Cada máquina virtual usará 10 GB de RAM e 6 vCPUs.
zh_cn: 我们将运行 <literal>virt-install</literal> 并使用复制的原始磁盘来创建虚拟机。每个虚拟机使用 10 GB RAM 和 6 个 vCPU。

source: Provisioning the first node
es: Aprovisionamiento del primer nodo
ja: 1つ目のノードのプロビジョニング
pt_br: Provisionando o primeiro nó
zh_cn: 置备第一个节点

source: Let’s create the virtual machine:
es: Vamos a crear la máquina virtual:
ja: 仮想マシンを作成しましょう。
pt_br: Vamos criar a máquina virtual:
zh_cn: 我们来创建虚拟机：

source: It is important that we create the network interfaces with the same MAC addresses as the ones in the desired state we described above.
es: Es importante que creemos las interfaces de red con las mismas direcciones MAC que las del estado deseado que hemos descrito anteriormente.
ja: 上記で説明した望ましい状態のMACアドレスと同じMACアドレスを持つネットワークインタフェースを作成することが重要です。
pt_br: É importante criar as interfaces de rede com os mesmos endereços MAC daqueles no estado desejado descrito acima.
zh_cn: 要创建的网络接口的 MAC 地址必须与上述期望的状态中使用的 MAC 地址相同。

source: Once the operation is complete, we will see something similar to the following:
es: Una vez completada la operación, veremos algo similar a lo siguiente:
ja: 操作が完了すると、次のような内容が表示されます。
pt_br: Após o término da operação, veremos algo semelhante ao seguinte:
zh_cn: 操作完成后，我们将看到如下所示的输出：

source: We’re now able to log in with the <literal>root:eib</literal> credentials pair. We’re also able to SSH into the host if we prefer that over the <literal>virsh console</literal> we’re presented with here.
es: Ahora podemos iniciar sesión con el par de credenciales <literal>root:eib</literal>. Si lo preferimos, también podemos conectarnos por SSH al host, en lugar de a la <literal>consola virsh</literal> que se presenta aquí.
ja: これで、<literal>root:eib</literal>の資格情報ペアを使用してログインできます。ここで提示されている<literal>virsh console</literal>よりもSSHでホストに接続したい場合は、SSHで接続することもできます。
pt_br: Agora podemos fazer login com o par de credenciais <literal>root:eib</literal> e também usar SSH para entrar no host, se for a preferência no lugar de <literal>virsh console</literal> apresentado aqui.
zh_cn: 现在我们可以使用 <literal>root:eib</literal> 身份凭证对登录。如果需要，我们也可以通过 SSH 连接到主机，而不是如此处所示使用 <literal>virsh 控制台</literal>进行连接。

source: Once logged in, let’s confirm that all the settings are in place.
es: Cuando haya iniciado sesión, confirmaremos que todos los ajustes estén correctos.
ja: ログインしたら、すべての設定が完了していることを確認しましょう。
pt_br: Após o login, vamos confirmar se todas as configurações estão corretas.
zh_cn: 登录后，我们需要确认是否正确完成了所有设置。

source: Verify that the hostname is properly set:
es: Verifique que el nombre de host esté configurado correctamente:
ja: ホスト名が適切に設定されていることを確認します。
pt_br: Verifique se o nome de host foi devidamente definido:
zh_cn: 校验是否正确设置了主机名：

source: Verify that the routing is properly configured:
es: Verifique que la configuración de enrutamiento sea correcta:
ja: ルーティングが適切に設定されていることを確認します。
pt_br: Verifique se o roteamento foi devidamente configurado:
zh_cn: 校验是否正确配置了路由：

source: Verify that Internet connection is available:
es: Verifique que la conexión a Internet esté disponible:
ja: インターネット接続が利用できることを確認します。
pt_br: Verifique se a conexão com a Internet está disponível:
zh_cn: 校验互联网连接是否可用：

source: Verify that exactly two Ethernet interfaces are configured and only one of those is active:
es: Verifique que haya exactamente dos interfaces Ethernet configuradas y que solo una de ellas esté activa:
ja: 2つのEthernetインタフェースが設定されていて、そのうちの1つだけがアクティブであることを確認します。
pt_br: Verifique se exatamente duas interfaces Ethernet foram configuradas e apenas uma delas está ativa:
zh_cn: 校验是否刚好配置了两个以太网接口，并且只有其中的一个接口处于活动状态：

source: You’ll notice that the second interface is <literal>eth1</literal> instead of the predefined <literal>eth3</literal> in our desired networking state. This is the case because the NetworkManager Configurator (<emphasis>nmc</emphasis>) is able to detect that the OS has given a different name for the NIC with MAC address <literal>34:8a:b1:4b:16:e2</literal> and it adjusts its settings accordingly.
es: Notará que la segunda interfaz es <literal>eth1</literal> en lugar de la predefinida en nuestro estado de red deseado, <literal>eth3</literal>. Esto se debe a que NetworkManager Configurator (<emphasis>nmc</emphasis>) es capaz de detectar que el sistema operativo ha asignado un nombre diferente a la tarjeta de red con la dirección MAC <literal>34:8a:b1:4b:16:e2</literal> y ajusta su configuración en consecuencia.
ja: 2つ目のインタフェースが、目的のネットワーキング状態で指定されている定義済みの<literal>eth3</literal>ではなく、<literal>eth1</literal>になっていることがわかります。これは、NetworkManager Configurator (<emphasis>nmc</emphasis>)が、MACアドレス<literal>34:8a:b1:4b:16:e2</literal>を持つNICにOSによって別の名前が付けられていることを検出し、それに応じて設定を調整しているためです。
pt_br: Veja que a segunda interface é <literal>eth1</literal> em vez do <literal>eth3</literal> predefinido em nosso estado de rede desejado. O motivo é que o NetworkManager Configurator (<emphasis>nmc</emphasis>) é capaz de detectar que o sistema operacional forneceu um nome diferente para o NIC com o endereço MAC <literal>34:8a:b1:4b:16:e2</literal> e ele ajusta suas configurações de maneira apropriada.
zh_cn: 您会发现，在期望的网络状态中，第二个接口是 <literal>eth1</literal>，而不是预定义的 <literal>eth3</literal>。之所以出现这种情况，是因为 NetworkManager Configurator (<emphasis>nmc</emphasis>) 能够检测到操作系统为 MAC 地址为 <literal>34:8a:b1:4b:16:e2</literal> 的 NIC 指定了不同的名称，并相应地调整了其设置。

source: Verify this has indeed happened by inspecting the Combustion phase of the provisioning:
es: Verifique que, efectivamente, esto sea así inspeccionando la fase de Combustion del aprovisionamiento:
ja: プロビジョニングのCombustionのフェーズを検査して、この調整が実際に行われたことを確認します。
pt_br: Verifique se foi isso mesmo que aconteceu analisando a fase Combustion do provisionamento:
zh_cn: 通过检查置备的 Combustion 阶段来校验是否确实发生了这种情况：

source: We will now provision the rest of the nodes, but we will only show the differences in the final configuration. Feel free to apply any or all of the above checks for all nodes you are about to provision.
es: Ahora, aprovisionaremos el resto de los nodos, pero solo mostraremos las diferencias en la configuración final. No dude en aplicar cualquiera de las comprobaciones anteriores, o todas ellas, a todos los nodos que vaya a aprovisionar.
ja: 続いて残りのノードをプロビジョニングしますが、ここでは最終的な設定の違いのみを示します。これからプロビジョニングするすべてのノードに対して、上記のチェックのいずれか、またはすべてを自由に適用してください。
pt_br: Vamos agora provisionar o restante dos nós, mas vamos mostrar apenas as diferenças na configuração final. Aplique qualquer uma ou todas as verificações acima a todos os nós que você vai provisionar.
zh_cn: 我们现在将置备其余节点，但只会显示最终配置中的差异。您可以对即将置备的所有节点应用上述任意检查或所有检查。

source: Provisioning the second node
es: Aprovisionamiento del segundo nodo
ja: 2つ目のノードのプロビジョニング
pt_br: Provisionando o segundo nó
zh_cn: 置备第二个节点

source: Once the virtual machine is up and running, we can confirm that this node is using bonded interfaces:
es: Cuando la máquina virtual esté activa y en funcionamiento, se puede confirmar que este nodo está utilizando interfaces vinculadas:
ja: 仮想マシンが稼働したら、このノードがボンディングされたインタフェースを使用しているかどうかを確認できます。
pt_br: Com a máquina virtual em funcionamento, podemos confirmar se esse nó usa as interfaces vinculadas:
zh_cn: 虚拟机启动并运行后，我们可以确认此节点是否正在使用绑定的接口：

source: Confirm that the routing is using the bond:
es: Confirme que el enrutamiento utiliza la vinculación de interfaces:
ja: ルーティングでボンディングが使用されていることを確認します。
pt_br: Confirme se o roteamento usa o vínculo:
zh_cn: 确认路由是否正在使用绑定：

source: Ensure that the static connection files are properly utilized:
es: Asegúrese de que los archivos de conexión estática se utilicen correctamente:
ja: 静的な接続ファイルが適切に利用されていることを確認します。
pt_br: Garanta que os arquivos de conexão estáticos sejam devidamente utilizados:
zh_cn: 确保正确利用静态连接文件：

source: Provisioning the third node
es: Aprovisionamiento del tercer nodo
ja: 3つ目のノードのプロビジョニング
pt_br: Provisionando o terceiro nó
zh_cn: 置备第三个节点

source: Once the virtual machine is up and running, we can confirm that this node is using a network bridge:
es: Cuando la máquina virtual está activa y en funcionamiento, se puede confirmar que este nodo está utilizando un puente de red:
ja: 仮想マシンが稼働したら、このノードがネットワークブリッジを使用していることを確認できます。
pt_br: Com a máquina virtual em funcionamento, podemos confirmar se esse nó usa uma ponte de rede:
zh_cn: 虚拟机启动并运行后，我们可以确认此节点是否正在使用网桥：

source: Confirm that the routing is using the bridge:
es: Confirme que el enrutamiento utiliza el puente:
ja: ルーティングでブリッジが使用されていることを確認します。
pt_br: Confirme se o roteamento usa a ponte:
zh_cn: 确认路由是否正在使用网桥：

source: Provisioning the fourth node
es: Aprovisionamiento del cuarto nodo
ja: 4つ目のノードのプロビジョニング
pt_br: Provisionando o quarto nó
zh_cn: 置备第四个节点

source: Lastly, we will provision a node which will not match any of the predefined configurations by a MAC address. In these cases, we will default to DHCP to configure the network interfaces.
es: Por último, se aprovisionará un nodo que no coincida con ninguna de las configuraciones predefinidas por una dirección MAC. En estos casos, utilizaremos DHCP de forma predeterminada para configurar las interfaces de red.
ja: 最後に、事前定義されたどの設定ともMACアドレスが一致しないノードをプロビジョニングします。このような場合は、DHCPをデフォルトにしてネットワークインタフェースを設定します。
pt_br: Por fim, vamos provisionar um nó que não corresponderá a nenhuma das configurações predefinidas por um endereço MAC. Nesse caso, vamos usar DHCP como padrão para configurar as interfaces de rede.
zh_cn: 最后，我们将置备 MAC 地址与任何预定义配置都不匹配的节点。在这种情况下，我们将默认使用 DHCP 来配置网络接口。

source: Once the virtual machine is up and running, we can confirm that this node is using a random IP address for its network interface:
es: Cuando la máquina virtual esté activa y en funcionamiento, podemos confirmar que este nodo utiliza una dirección IP aleatoria para su interfaz de red:
ja: 仮想マシンが稼働したら、このノードがそのネットワークインタフェースにランダムなIPアドレスを使用していることを確認できます。
pt_br: Com a máquina virtual em funcionamento, podemos confirmar se esse nó usa um endereço IP aleatório para a interface de rede:
zh_cn: 虚拟机启动并运行后，我们可以确认此节点是否正在为其网络接口使用随机 IP 地址：

source: Verify that nmc failed to apply static configurations for this node:
es: Verifique que nmc no ha podido aplicar configuraciones estáticas para este nodo:
ja: nmcがこのノードに静的な設定を適用できなかったことを確認します。
pt_br: Verifique se o NMC não consegue aplicar configurações estáticas a esse nó:
zh_cn: 校验 nmc 是否无法为此节点应用静态配置：

source: Verify that the Ethernet interface was configured via DHCP:
es: Verifique que la interfaz Ethernet se haya configurado mediante DHCP:
ja: EthernetインタフェースがDHCPを介して設定されていることを確認します。
pt_br: Verifique se a interface Ethernet foi configurada por DHCP:
zh_cn: 校验是否通过 DHCP 配置了以太网接口：

source: Unified node configurations
es: Configuraciones unificadas de nodos
ja: 統合されたノード設定
pt_br: Configurações unificadas de nós
zh_cn: 统一节点配置

source: There are occasions where relying on known MAC addresses is not an option. In these cases we can opt for the so-called <emphasis>unified configuration</emphasis> which allows us to specify settings in an <literal>_all.yaml</literal> file which will then be applied across all provisioned nodes.
es: Hay ocasiones en las que no es posible basarse en direcciones MAC conocidas. En esos casos, podemos optar por la denominada <emphasis>configuración unificada</emphasis>, que permite especificar los ajustes en un archivo <literal>_all.yaml</literal> que luego se aplicará a todos los nodos aprovisionados.
ja: 既知のMACアドレスに依存できない場合もあります。このような場合は、いわゆる<emphasis>統合設定</emphasis>を選択できます。これにより、<literal>_all.yaml</literal>ファイルで設定を指定し、プロビジョニングされたノードすべてに適用することができます。
pt_br: Há situações em que não é possível usar endereços MAC conhecidos. Nesses casos, podemos recorrer à <emphasis>configuração unificada</emphasis>, que permite especificar as configurações em um arquivo <literal>_all.yaml</literal> que será aplicado a todos os nós provisionados.
zh_cn: 有时我们无法依赖已知的 MAC 地址。在这种情况下，我们可以选择所谓的<emphasis>统一配置</emphasis>，这样就可以在 <literal>_all.yaml</literal> 文件中指定设置，然后将这些设置应用于所有已置备的节点。

source: We will build and provision an edge node using different configuration structure. Follow all steps starting from <xref linkend="image-config-dir-creation"/> up until <xref linkend="default-network-definition"/>.
es: Crearemos y aprovisionaremos un nodo periférico con una estructura de configuración diferente. Siga todos los pasos desde la <xref linkend="image-config-dir-creation"/> hasta la <xref linkend="default-network-definition"/>.
ja: 異なる設定構造を使用して、エッジノードを構築およびプロビジョニングします。<xref linkend="image-config-dir-creation"/>から<xref linkend="default-network-definition"/>のすべての手順に従います。
pt_br: Vamos criar e provisionar um nó de borda usando uma estrutura de configuração diferente. Siga todas as etapas, desde a <xref linkend="image-config-dir-creation"/> até a <xref linkend="default-network-definition"/>.
zh_cn: 我们将使用不同的配置结构来构建和置备边缘节点。请按照从<xref linkend="image-config-dir-creation"/>到<xref linkend="default-network-definition"/>的所有步骤进行操作。

source: In this example we define a desired state of two Ethernet interfaces (eth0 and eth1) - one using DHCP, and one assigned a static IP address.
es: En este ejemplo, definimos un estado deseado de dos interfaces Ethernet (eth0 y eth1): una utiliza DHCP y a la otra se le asigna una dirección IP estática.
ja: この例では、2つのEthernetインタフェース(eth0とeth1)の望ましい状態を定義します。一方ではDHCPを使用し、他方には静的IPアドレスを割り当てます。
pt_br: Neste exemplo, definimos um estado desejado de duas interfaces Ethernet (eth0 e eth1): uma usando DHCP e outra que recebeu um endereço IP estático.
zh_cn: 在此示例中，我们将定义两个以太网接口（eth0 和 eth1）的期望状态 - 一个接口使用 DHCP，另一个接口使用静态 IP 地址。

source: Let’s build the image:
es: Vamos a crear la imagen:
ja: イメージを構築してみましょう。
pt_br: Vamos criar a imagem:
zh_cn: 我们来构建映像：

source: Once the image is successfully built, let’s create a virtual machine using it:
es: Cuando la imagen se haya creado correctamente, crearemos una máquina virtual con dicha imagen:
ja: イメージが正常に構築されたら、それを使用して仮想マシンを作成しましょう。
pt_br: Depois que a imagem for criada com sucesso, vamos criar uma máquina virtual com base nela:
zh_cn: 成功构建映像后，我们将使用它来创建虚拟机：

source: The provisioning process might take a few minutes. Once it’s finished, log in to the system with the provided credentials.
es: El proceso de aprovisionamiento puede tardar unos minutos. Una vez finalizado, inicie sesión en el sistema con las credenciales proporcionadas.
ja: プロビジョニングプロセスには数分かかる場合があります。終了したら、指定された資格情報でシステムにログインします。
pt_br: O processo de provisionamento pode levar alguns minutos. Depois que ele for concluído, faça login no sistema com as credenciais fornecidas.
zh_cn: 置备过程可能需要几分钟时间。完成后，使用提供的身份凭证登录到系统。

source: Verify that the Ethernet interfaces are configured and active:
es: Verifique que las interfaces Ethernet estén configuradas y activas:
ja: Ethernetインタフェースが設定され、アクティブであることを確認します。
pt_br: Verifique se as interfaces Ethernet estão configuradas e ativas:
zh_cn: 校验以太网接口是否已配置并处于活动状态：

source: Custom network configurations
es: Configuraciones de red personalizadas
ja: カスタムネットワーク設定
pt_br: Configurações de rede personalizadas
zh_cn: 自定义网络配置

source: We have already covered the default network configuration for Edge Image Builder which relies on the NetworkManager Configurator. However, there is also the option to modify it via a custom script. Whilst this option is very flexible and is also not MAC address dependant, its limitation stems from the fact that using it is much less convenient when bootstrapping multiple nodes with a single image.
es: Ya hemos tratado la configuración de red predeterminada para Edge Image Builder, que se basa en NetworkManager Configurator. Sin embargo, también existe la opción de modificarla mediante un guion personalizado. Aunque esta opción es muy flexible y tampoco depende de la dirección MAC, su limitación radica en el hecho de que su uso resulta mucho menos práctico cuando se arrancan varios nodos con una sola imagen.
ja: ここまでは、NetworkManager Configuratorを利用した、Edge Image Builderのデフォルトのネットワーク設定について説明してきました。一方で、カスタムスクリプトを使用してネットワーク設定を変更するオプションもあります。このオプションは非常に柔軟性が高く、MACアドレスにも依存しませんが、1つのイメージで複数のノードをブートストラップする場合に使用してもあまり便利ではないという制限があります。
pt_br: Já abordamos a configuração de rede padrão do Edge Image Builder que usa o NetworkManager Configurator. No entanto, há também a opção de modificá-la por meio de um script personalizado. Essa opção é muito flexível e independente de endereço MAC, mas tem a limitação de que seu uso não é tão prático para inicializar vários nós com uma única imagem.
zh_cn: 我们已介绍 Edge Image Builder 的默认网络配置，这种配置依赖于 NetworkManager Configurator。不过，我们还可以选择通过自定义脚本来修改这种配置。虽然这种方法非常灵活而且不依赖于 MAC 地址，但它的局限性在于，在使用单个映像引导多个节点时，这种方法不太方便。
