Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: That’s it! Once we have the <literal>PersistentVolumeClaim</literal> created, we can proceed with attaching it to a <literal>Pod</literal>. When the <literal>Pod</literal> is deployed, Kubernetes creates the Longhorn volume and binds it to the <literal>Pod</literal> if storage is available.
es: Tras crear la <literal>PersistentVolumeClaim</literal>, podemos adjuntarla a un <literal>pod</literal>. Cuando se despliega el <literal>pod</literal>, Kubernetes crea el volumen de Longhorn y lo vincula al <literal>ood</literal> si hay almacenamiento disponible.
ja: 完了です。<literal>PersistentVolumeClaim</literal>を作成したら、それを<literal>Pod</literal>にアタッチする手順に進むことができます。<literal>Pod</literal>がデプロイされると、KubernetesはLonghornボリュームを作成し、ストレージが利用可能な場合は<literal>Pod</literal>にバインドします。
pt_br: Pronto! Com a criação do <literal>PersistentVolumeClaim</literal>, podemos prosseguir e anexá-lo a um <literal>Pod</literal>. Quando o <literal>Pod</literal> é implantado, o Kubernetes cria o volume do Longhorn e o vincula ao <literal>Pod</literal> quando há armazenamento disponível.
zh_cn: 大功告成！创建 <literal>PersistentVolumeClaim</literal> 后，我们可以继续将其挂接到 <literal>Pod</literal>。部署 <literal>Pod</literal> 时，如果有可用存储空间，Kubernetes 会创建 Longhorn 卷并将其绑定到 <literal>Pod</literal>。

source: The concept of storage in Kubernetes is a complex, but important topic. We briefly mentioned some of the most common Kubernetes resources, however, we suggest to familiarize yourself with the <link xl:href="https://longhorn.io/docs/1.9.1/terminology/">terminology documentation</link> that Longhorn offers.
es: El concepto de almacenamiento en Kubernetes es un tema complejo, pero importante. Hemos mencionado brevemente algunos de los recursos más comunes de Kubernetes, sin embargo, le sugerimos que se familiarice con la <link xl:href="https://longhorn.io/docs/1.9.1/terminology/">terminología específica</link> en la documentación de Longhorn.
ja: Kubernetesにおけるストレージの概念は複雑であると同時に重要なトピックです。最も一般的なKubernetesリソースのいくつかを簡単に説明しましたが、Longhornが提供している<link xl:href="https://longhorn.io/docs/1.9.1/terminology/">用語のドキュメント</link>をよく理解しておくことをお勧めします。
zh_cn: Kubernetes 中的存储概念复杂但重要。我们简要介绍了一些最常见的 Kubernetes 资源，不过建议您熟悉 Longhorn 提供的<link xl:href="https://longhorn.io/docs/1.9.1/terminology/">术语文档</link>。

source: In this example, the result should look something like this:
es: En este ejemplo, el resultado debería ser similar a esto:
ja: この例では、結果は次のようになります。
pt_br: Neste exemplo, o resultado deve ter esta aparência:
zh_cn: 对于此示例，结果应如下所示：

source: Accessing the UI
es: Acceso a la interfaz del usuario
ja: UIへのアクセス
pt_br: Acessando a IU
zh_cn: 访问 UI

source: If you installed Longhorn with kubectl or Helm, you need to set up an Ingress controller to allow external traffic into the cluster. Authentication is not enabled by default. If the Rancher catalog app was used, Rancher automatically created an Ingress controller with access control (the rancher-proxy).
es: Si ha instalado Longhorn con kubectl o Helm, debe configurar un controlador Ingress para permitir el tráfico externo hacia el clúster. La autenticación no está habilitada de forma predeterminada. Si se ha usado la aplicación de catálogo de Rancher, Rancher habrá creado automáticamente un controlador Ingress con control de acceso (el proxy de rancher).
ja: kubectlまたはHelmを使用してLonghornをインストールした場合は、クラスタへの外部トラフィックを許可するようにIngressコントローラを設定する必要があります。認証はデフォルトでは有効になっていません。Rancherカタログアプリを使用していた場合、IngressコントローラはRancherによって自動的に作成され、アクセス制御が設定されています(rancher-proxy)。
pt_br: Se você instalou o Longhorn com o kubectl ou o Helm, precisa configurar um controle de entrada para permitir o tráfego externo no cluster. A autenticação não está habilitada por padrão. Se o app de catálogo do Rancher foi usado, o Rancher criou automaticamente um controlador de entrada com controle de acesso (rancher-proxy).
zh_cn: 如果您使用 kubectl 或 Helm 安装了 Longhorn，则需要设置入口控制器，使外部流量能够进入群集。默认不会启用身份验证。如果使用了 Rancher 目录应用程序，Rancher 已自动创建一个提供访问控制的入口控制器 (rancher-proxy)。

source: Get the Longhorn’s external service IP address:
es: Obtenga la dirección IP del servicio externo de Longhorn:
ja: Longhornの外部サービスのIPアドレスを取得します。
pt_br: Obtenha o endereço IP do serviço externo do Longhorn:
zh_cn: 获取 Longhorn 的外部服务 IP 地址：

source: Once you have retrieved the <literal>longhorn-frontend</literal> IP address, you can start using the UI by navigating to it in your browser.
es: Cuando haya recuperado la dirección IP de <literal>longhorn-frontend</literal>, puede acceder a la interfaz de usuario en su navegador y empezar a usarla.
ja: <literal>longghorn-frontend</literal>のIPアドレスを取得したら、ブラウザでそのアドレスに移動してUIの使用を開始できます。
pt_br: Depois que você recuperar o endereço IP do <literal>longhorn-frontend</literal>, poderá começar a usar a IU navegando até ela pelo navegador.
zh_cn: 检索到 <literal>longhorn-frontend</literal> IP 地址后，您可以通过在浏览器中导航到该前端来开始使用 UI。

source: SUSE Edge is using <xref linkend="components-eib"/> in order to customize base SUSE Linux Micro OS images. We are going to demonstrate how to do so for provisioning an RKE2 cluster with Longhorn on top of it.
es: SUSE Edge utiliza <xref linkend="components-eib"/> para personalizar las imágenes del sistema operativo SUSE Linux Micro base. Vamos a mostrar cómo hacerlo para aprovisionar un clúster RKE2 con Longhorn sobre él.
ja: SUSE Edgeは、<xref linkend="components-eib"/>を使用して、ベースとなるSUSE Linux Micro OSイメージをカスタマイズしています。ここでは、イメージをカスタマイズしてRKE2クラスタとLonghornをSUSE Linux Micro上にプロビジョニングする方法について説明します。
pt_br: O SUSE Edge usa o <xref linkend="components-eib"/> para personalizar as imagens base do sistema operacional SUSE Linux Micro. Vamos demonstrar como fazer isso para provisionar um cluster RKE2 junto com o Longhorn.
zh_cn: SUSE Edge 使用<xref linkend="components-eib"/>来自定义基础 SUSE Linux Micro 操作系统映像。本节将展示如何执行自定义操作，以置备 RKE2 群集并在其上安装 Longhorn。

source: Let’s create the definition file:
es: Vamos a crear el archivo de definición:
ja: 定義ファイルを作成しましょう。
pt_br: Vamos criar o arquivo de definição:
zh_cn: 我们来创建定义文件：

source: Customizing any of the Helm chart values is possible via a separate file provided under <literal>helm.charts[].valuesFile</literal>. Refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md#kubernetes">upstream documentation</link> for details.
es: Es posible personalizar cualquiera de los valores del chart de Helm mediante un archivo independiente proporcionado en <literal>helm.charts[].valuesFile</literal>. Consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md#kubernetes">documentación original</link> para obtener más detalles.
ja: Helmチャートの値のカスタマイズは、<literal>helm.charts[].valuesFile</literal>で提供されている別個のファイルを使用して実行できます。詳細については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md#kubernetes">アップストリームドキュメント</link>を参照してください。
zh_cn: 可以通过 <literal>helm.charts[].valuesFile</literal> 下提供的独立文件自定义任何 Helm chart 值。有关详细信息，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md#kubernetes">上游文档</link>。

source: After the image is built, you can use it to install your OS on a physical or virtual host. Once the provisioning is complete, you are able to log in to the system using the <literal>root:eib</literal> credentials pair.
es: Una vez creada la imagen, puede usarla para instalar su sistema operativo en un host físico o virtual. Tras completar el aprovisionamiento, podrá iniciar sesión en el sistema utilizando el par de credenciales <literal>root:eib</literal>.
ja: イメージが構築されたら、それを使用して物理ホストまたは仮想ホストにOSをインストールできます。プロビジョニングが完了すると、<literal>root:eib</literal>の資格情報ペアを使用してシステムにログインできます。
pt_br: Após a criação da imagem, você poderá usá-la para instalar o sistema operacional em um host físico ou virtual. Depois que o provisionamento é concluído, é possível fazer login no sistema usando o par de credenciais <literal>root:eib</literal>.
zh_cn: 构建映像后，可以使用它在物理主机或虚拟主机上安装操作系统。置备完成后，可以使用 <literal>root:eib</literal> 身份凭证对登录到系统。

source: Ensure that Longhorn has been successfully deployed:
es: Asegúrese de que Longhorn se haya desplegado correctamente:
ja: Longhornが正常にデプロイされていることを確認します。
pt_br: Verifique se o Longhorn foi implantado com sucesso:
zh_cn: 确保 Longhorn 已成功部署：

source: This installation will not work for completely air-gapped environments. In those cases, please refer to <xref linkend="suse-storage-install"/>.
es: Esta instalación no funciona en entornos completamente aislados. Para esos casos, consulte la <xref linkend="suse-storage-install"/>.
ja: このインストールは、完全なエアギャップ環境では動作しません。このような場合は、<xref linkend="suse-storage-install"/>を参照してください。
pt_br: Essa instalação não funciona em ambientes totalmente air-gapped. Para esses casos, consulte a <xref linkend="suse-storage-install"/>.
zh_cn: 此安装不适用于完全隔离的环境。对于这种情况，请参见<xref linkend="suse-storage-install"/>。

source: SUSE Security is a security solution for Kubernetes that provides L7 network security, runtime security, supply chain security, and compliance checks in a cohesive package.
es: SUSE Security es una solución de seguridad para Kubernetes que proporciona seguridad de red L7, seguridad en el entorno de ejecución, seguridad en la cadena de suministro y comprobaciones de cumplimiento en un paquete cohesionado.
ja: SUSE SecurityはKubernetes向けのセキュリティソリューションであり、L7ネットワークセキュリティ、ランタイムセキュリティ、サプライチェーンセキュリティ、およびコンプライアンスチェックを1つの統合パッケージで提供します。
pt_br: O SUSE Security é uma solução de segurança para Kubernetes que proporciona segurança de rede L7, de runtime e da cadeia de suprimento, e verificações de conformidade, em um pacote consistente.
zh_cn: SUSE Security 是适用于 Kubernetes 的安全解决方案，它在统一的软件包中提供 L7 网络安全性、运行时安全性、供应链安全性与合规性检查。

source: SUSE Security is a product that is deployed as a platform of multiple containers, each communicating over various ports and interfaces. Under the hood, it uses NeuVector as its underlying container security component. The following containers make up the SUSE Security platform:
es: SUSE Security es un producto que se despliega como una plataforma de múltiples contenedores, que se comunican entre sí a través de varios puertos e interfaces. En segundo plano, utiliza NeuVector como componente de seguridad de contenedores subyacente. La plataforma SUSE Security está formada por siguientes contenedores:
ja: SUSE Securityは、複数のコンテナのプラットフォームとしてデプロイされ、各コンテナがさまざまなポートやインタフェースを介して通信する製品です。内部的には、その基礎となるコンテナセキュリティコンポーネントとしてNeuVectorを使用しています。SUSE Securityプラットフォームを構成するコンテナは次のとおりです。
pt_br: O SUSE Security é um produto implantado como uma plataforma de vários contêineres, cada um se comunicando por diversas portas e interfaces. Internamente, ele usa o NeuVector como componente de segurança do contêiner subjacente. Os seguintes contêineres compõem a plataforma SUSE Security:
zh_cn: SUSE Security 是一款作为多容器平台部署的产品，各个容器通过不同端口和接口进行通信。其底层采用 NeuVector 作为容器安全组件。构成 SUSE Security 平台的容器如下：

source: Manager. A stateless container which presents the Web-based console. Typically, only one is needed and this can run anywhere. Failure of the Manager does not affect any of the operations of the controller or enforcer. However, certain notifications (events) and recent connection data are cached in memory by the Manager so viewing of these would be affected.
es: Manager (Administrador). Un contenedor sin estado que presenta el panel de control basado en web. Normalmente, solo se necesita uno y puede ejecutarse en cualquier lugar. Si el administrador falla, ninguna de las operaciones del controlador o del ejecutor se ven afectadas. Sin embargo, el administrador almacena en la memoria caché ciertas notificaciones (eventos) y datos de conexiones recientes, por lo que su visualización sí se vería afectada.
ja: Manager 。Webベースのコンソールを提供するステートレスコンテナです。通常、Managerは1つだけ必要で、どこでも実行できます。Managerにエラーが発生しても、ControllerやEnforcerの動作には影響しません。ただし、特定の通知(イベント)と最近の接続データはManagerによってメモリ内にキャッシュされているため、これらの表示には影響があります。
pt_br: Gerenciador. Um contêiner sem estado com console baseado na web. Normalmente, apenas um é necessário e pode ser executado em qualquer local. Uma falha no gerenciador não afeta as operações do controlador ou do executor. No entanto, determinadas notificações (eventos) e dados de conexão recentes são armazenados em cache na memória pelo gerenciador, portanto, a visualização deles pode ser afetada.
zh_cn: 管理器：提供基于 Web 的控制台的无状态容器。通常只需一个，可在任何位置运行。管理器发生故障不会影响控制器或执行器的任何操作。但是，某些通知（事件）和最近的连接数据将由管理器缓存在内存中，因此这些信息的查看操作会受到影响。

source: Controller. The ‘control plane’ for SUSE Security must be deployed in an HA configuration, so configuration is not lost in a node failure. These can run anywhere, although customers often choose to place these on ‘management’, master or infra nodes because of their criticality.
es: Controller (Controlador). El "plano de control" de SUSE Security debe desplegarse en una configuración HA (de alta disponibilidad), de modo que la configuración no se pierda en caso de fallo de un nodo. Los controladores se pueden ejecutar en cualquier lugar, aunque se suele optar por colocarlos en nodos de "gestión", maestros o de infraestructura debido a su importancia crítica.
ja: Controller。SUSE Securityの「コントロールプレーン」は必ずHA設定でデプロイされるため、ノードのエラーで設定が失われることはありません。Controllerはどこでも実行できますが、その重要性から、顧客はほとんどの場合、「管理」ノード、マスタノード、またはインフラノードに配置することを選択します。
pt_br: Controlador. O "plano de controle" do SUSE Security deve ser implantado em uma configuração de alta disponibilidade, assim a configuração não se perde em caso de falha no nó. Ele pode ser executado em qualquer local, embora os clientes geralmente prefiram colocá-los em nós de "gerenciamento", mestre ou de infraestrutura devido à sua criticidade.
zh_cn: 控制器：SUSE Security 的“控制平面”必须部署在 HA 配置中，这样，配置就不会在节点发生故障时丢失。这些容器可在任何位置运行，不过，由于它们的重要性，客户通常会将它们放在“管理”节点、主节点或基础架构节点上。

source: Enforcer. This container is deployed as a DaemonSet so one Enforcer is on every node to be protected. Typically deploys to every worker node but scheduling can be enabled for master and infra nodes to deploy there as well. Note: If the Enforcer is not on a cluster node and connections come from a pod on that node, SUSE Security labels them as ‘unmanaged’ workloads.
es: Enforcer (Aplicador). Este contenedor se despliega como conjunto de daemons, por lo que hay un aplicador en cada nodo que se vaya a proteger. Normalmente, se despliega en todos los nodos de trabajador, pero es posible programar que también se despliegue en los nodos maestros y de infraestructura. Nota: si el aplicador no está en un nodo del clúster y las conexiones provienen de un pod en ese nodo, SUSE Security las etiqueta como cargas de trabajo "no gestionadas".
ja: Enforcer。このコンテナはDaemonSetとしてデプロイされるため、保護する各ノードに1つのEnforcerが存在します。通常はすべてのワーカーノードにデプロイされますが、スケジュールを有効にしてマスタノードやインフラノードにデプロイすることもできます。メモ: Enforcerがクラスタノードに存在しない状況で、そのノード上のPodから接続が行われた場合、その接続はSUSE Securityによって「unmanaged」ワークロードとしてラベル付けされます。
pt_br: Executor. Esse contêiner é implantado como um DaemonSet para que haja um executor em cada nó que será protegido. Em geral, a implantação é feita em cada nó do worker, mas é possível permitir a programação para que os nós mestre e de infraestrutura também sejam implantados lá. Nota: Se o executor não estiver em um nó do cluster e as conexões vierem de um pod nesse nó, o SUSE Security os identificará como cargas de trabalho "não gerenciadas".
zh_cn: 执行器：此容器部署为 DaemonSet，因此每个要保护的节点上都有一个执行器。通常会部署到每个工作节点，但可为主节点和基础架构节点启用调度，以便将这些容器同时部署到这些节点。注意：如果执行器不在群集节点上，并且连接来自该节点上的 Pod，则 SUSE Security 会将这些容器标记为“不受管”工作负载。

source: Scanner. Performs the vulnerability scanning using the built-in CVE database, as directed by the Controller. Multiple scanners can be deployed to increase scanning capacity. Scanners can run anywhere but are often run on the nodes where the controllers run. See below for sizing considerations of scanner nodes. A scanner can also be invoked independently when used for build-phase scanning, for example, within a pipeline that triggers a scan, retrieves the results, and stops the scanner. The scanner contains the latest CVE database so should be updated daily.
es: Scanner (Escáner). Realiza el análisis de vulnerabilidades utilizando la base de datos de CVE integrada, según las instrucciones del controlador. Se pueden desplegar varios escáneres para aumentar la capacidad de análisis. Los escáneres pueden ejecutarse en cualquier lugar, pero es habitual que sea en los nodos donde se ejecutan los controladores. Tenga en cuenta las consideraciones sobre el tamaño de los nodos del escáner expuestas a continuación. También es posible invocar un escáner de forma independiente para el análisis de la fase de creación, por ejemplo, dentro de un canal que activa un análisis, recupera los resultados y detiene el escáner. El escáner contiene la base de datos de CVE más reciente, por lo que debe actualizarse a diario.
ja: Scanner。コントローラの指示に従って、ビルトインCVEデータベースを使用して脆弱性スキャンを実行します。複数のScannerをデプロイしてスキャン能力を拡張できます。Scannerはどこでも実行できますが、コントローラが実行されるノードで実行されることがほとんどです。Scannerノードのサイジングに関する考慮事項については、以下を参照してください。ビルドフェーズのスキャンに使用する場合、Scannerを独立して呼び出すこともできます。たとえば、スキャンをトリガし、結果を取得してScannerを停止するパイプライン内で使用する場合などです。Scannerには最新のCVEデータベースが含まれているため、毎日更新する必要があります。
pt_br: Verificador. Faz a verificação de vulnerabilidades usando o banco de dados CVE incorporado, conforme direcionado pelo controlador. É possível implantar vários verificadores para aumentar a capacidade de verificação. Os verificadores podem ser executados em qualquer local, mas costumam executar em nós onde os controladores são executados. Veja a seguir as considerações de dimensionamento dos nós do verificador. Também é possível invocar um verificador de forma independente, quando usado para verificação de fase de compilação, por exemplo, em um pipeline que aciona a verificação, recupera os resultados e interrompe o verificador. O verificador inclui o banco de dados CVE mais recente, portanto, ele deve ser atualizado diariamente.
zh_cn: 扫描器：根据控制器的指示，使用内置 CVE 数据库执行漏洞扫描。可以部署多个扫描器来提高扫描能力。扫描器可在任何位置运行，但通常在运行控制器的节点上运行。请参见下文了解扫描器节点的大小调整注意事项。在用于构建阶段的扫描时，还可以独立调用扫描器，例如，在触发扫描、检索结果和停止扫描器的管道中。扫描器包含最新的 CVE 数据库，因此应每日更新。

source: Updater. The updater triggers an update of the scanner through a Kubernetes cron job when an update of the CVE database is desired. Please be sure to configure this for your environment.
es: Updater (Actualizador). El actualizador activa una actualización del escáner mediante una tarea programada de Kubernetes cuando se desea actualizar la base de datos de CVE. Asegúrese de adaptarlo a su entorno.
ja: Updater。Updaterは、CVEデータベースの更新が必要な場合に、Kubernetes cronジョブを通じてScannerの更新をトリガします。必ず使用環境に合わせて設定してください。
pt_br: Atualizador. Aciona uma atualização do verificador pelo cron job do Kubernetes quando uma atualização do banco de dados CVE é desejada. Faça essa configuração em seu ambiente.
zh_cn: 更新器：需要更新 CVE 数据库时，更新器会通过 Kubernetes cron 作业触发扫描器的更新。请务必根据您的环境配置此设置。

source: A more in-depth SUSE Security onboarding and best practices documentation can be found <link xl:href="https://open-docs.neuvector.com/">here</link>.
es: Encontrará documentación más detallada sobre la incorporación de SUSE Security y las prácticas recomendadas <link xl:href="https://open-docs.neuvector.com/">aquí</link>.
ja: SUSE Securityのオンボーディングの詳細とベストプラクティスのドキュメントについては、<link xl:href="https://open-docs.neuvector.com/">こちら</link>をご覧ください。
pt_br: Você encontra a documentação mais detalhada sobre a integração e as melhores práticas do SUSE Security <link xl:href="https://open-docs.neuvector.com/">aqui</link>.
zh_cn: 在<link xl:href="https://open-docs.neuvector.com/">此处</link>可以找到更深入的 SUSE Security 初始配置信息和最佳实践文档。

source: How does SUSE Edge use SUSE Security?
es: ¿Cómo se usa SUSE Security en SUSE Edge?
ja: SUSE EdgeでのSUSE Securityの用途
pt_br: Como o SUSE Edge usa o SUSE Security?
zh_cn: SUSE Edge 如何使用 SUSE Security？

source: SUSE Edge provides a leaner configuration of SUSE Security as a starting point for edge deployments.
es: SUSE Edge proporciona una configuración más ágil de SUSE Security como punto de partida para despliegues periféricos.
ja: SUSE Edgeは、エッジデプロイメントの開始点として簡潔なSUSE Security設定を提供します。
pt_br: O SUSE Edge oferece uma configuração mais simples do SUSE Security como ponto de partida para implantações de borda.
zh_cn: SUSE Edge 提供了更为精简的 SUSE Security 配置，方便您着手进行边缘部署。

source: Important notes
es: Notas importantes
ja: 重要なメモ
pt_br: Observações importantes
zh_cn: 重要注意事项

source: The <literal>Scanner</literal> container must have enough memory to pull the image to be scanned into memory and expand it. To scan images exceeding 1 GB, increase the scanner’s memory to slightly above the largest expected image size.
es: El contenedor <literal>Scanner</literal> debe tener suficiente memoria para cargar la imagen que se va a escanear en la memoria y ampliarla. Para escanear imágenes de más de 1 GB, aumente la memoria del escáner hasta un poco más del tamaño máximo previsto de la imagen.
ja: <literal>Scanner</literal>コンテナには、スキャンするイメージをメモリに取り込んで解凍するのに十分なメモリが必要です。1GBを超えるイメージをスキャンするには、Scannerのメモリを、予想される最大イメージサイズをわずかに上回るサイズまで増やしてください。
pt_br: O contêiner <literal>Scanner</literal> deve ter memória suficiente para extrair a imagem que será verificada na memória e expandi-la. Para verificar imagens com mais de 1 GB, aumente a memória do verificador um pouco acima do maior tamanho esperado da imagem.
zh_cn: <literal>扫描器</literal>容器必须有充足的内存，以便能够将要扫描的映像提取到内存并对其进行扩展。要扫描 1 GB 以上的映像，请将扫描器的内存增加至略高于最大预期映像大小。

source: High network connections expected in Protect mode. The <literal>Enforcer</literal> requires CPU and memory when in Protect (inline firewall blocking) mode to hold and inspect connections and possible payload (DLP). Increasing memory and dedicating a CPU core to the <literal>Enforcer</literal> can ensure adequate packet filtering capacity.
es: En el modo de protección, se espera un gran número de conexiones de red. El contenedor <literal>Enforcer</literal> requiere CPU y memoria cuando se encuentra en ese modo (bloqueo de firewall en línea) para conservar e inspeccionar las conexiones y la posible carga útil (DLP). Aumentar la memoria y dedicar un núcleo de CPU a <literal>Enforcer</literal> puede garantizar una capacidad de filtrado de paquetes adecuada.
ja: 保護モードでは、大量のネットワーク接続が予想されます。保護(インラインファイアウォールでのブロック)モードの場合、<literal>Enforcer</literal>では、接続および想定されるペイロードを保持して検査(DLP)するためにCPUとメモリが必要です。メモリを増やし、1つのCPUコアを<literal>Enforcer</literal>専用にすることで、十分なパケットフィルタリング容量を確保できます。
pt_br: O modo de proteção espera grandes volumes de conexões de rede. O <literal>Enforcer</literal> requer CPU e memória no modo de proteção (bloqueio de firewall integrado) para armazenar e inspecionar as conexões e a possível carga (DLP). Aumentar a memória e dedicar um núcleo de CPU ao <literal>Enforcer</literal> garantem a capacidade de filtragem de pacotes adequada.
zh_cn: 在保护模式下需要高速网络连接。处于保护（内联防火墙阻止）模式的<literal>执行器</literal>需要占用 CPU 和内存来保持和检查连接以及可能的有效负载 (DLP)。增加内存并专门分配一个 CPU 核心供<literal>执行器</literal>使用可确保拥有充足的数据包过滤能力。
