Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Then, all systems registered with this <literal>MachineRegistration</literal> will automatically receive the <literal>elemental.cattle.io/resettable: 'true'</literal> annotation in their configuration. If you wish to do this manually on individual nodes, e.g. because you’ve got an existing <literal>MachineInventory</literal> that doesn’t have this annotation, or you have already deployed nodes, you can modify the <literal>MachineInventory</literal> and add the <literal>resettable</literal> configuration, for example:
es: A continuación, todos los sistemas registrados con este registro <literal>MachineRegistration</literal> recibirán automáticamente la anotación <literal>elemental.cattle.io/resettable: “true”</literal> en su configuración. Si desea hacerlo manualmente en nodos individuales, por ejemplo, porque tiene un <literal>MachineInventory</literal> que no tiene esa anotación o porque ya ha desplegado nodos, puede modificar <literal>MachineInventory</literal> y añadir la configuración <literal>resettable</literal>. Por ejemplo:
ja: その後、この<literal>MachineRegistration</literal>に登録されているすべてのシステムが自動的に<literal>elemental.cattle.io/resettable:'true'</literal>のアノテーションを受け取って設定に反映します。既存の<literal>MachineInventory</literal>にこのアノテーションがない場合や、すでにノードをデプロイ済みである場合などに、個々のノードで手動でこの操作を実行する場合は、<literal>MachineInventory</literal>を変更し、<literal>resettable</literal>設定を追加します。例:
pt_br: Na sequência, todos os sistemas registrados com esse <literal>MachineRegistration</literal> receberão automaticamente a anotação <literal>elemental.cattle.io/resettable: 'true'</literal> na respectiva configuração. Para fazer isso manualmente em nós individuais, por exemplo, porque obteve um <literal>MachineInventory</literal> existente que não tem essa anotação ou já implantou os nós, você pode modificar o <literal>MachineInventory</literal> e adicionar a configuração <literal>resettable</literal>, por exemplo:
zh_cn: 然后，所有使用此 <literal>MachineRegistration</literal> 注册的系统将自动在其配置中收到 <literal>elemental.cattle.io/resettable: 'true'</literal> 注解。如果您希望在各个节点上手动执行此操作（例如，您的现有 <literal>MachineInventory</literal> 没有此注解，或者您已部署节点），可以修改 <literal>MachineInventory</literal> 并添加 <literal>resettable</literal> 配置，例如：

source: In SUSE Edge 3.1, the Elemental Operator puts down a marker on the operating system that will trigger the cleanup process automatically; it will stop all Kubernetes services, remove all persistent data, uninstall all Kubernetes services, cleanup any remaining Kubernetes/Rancher directories, and force a re-registration to Rancher via the original Elemental <literal>MachineRegistration</literal> configuration. This happens automatically, there is no need for any manual intervention. The script that gets called can be found in <literal>/opt/edge/elemental_node_cleanup.sh</literal> and is triggered via <literal>systemd.path</literal> upon the placement of the marker, so its execution is immediate.
es: En SUSE Edge 3.1, el operador de Elemental coloca un marcador en el sistema operativo que activará automáticamente el proceso de limpieza, detendrá todos los servicios de Kubernetes, eliminará todos los datos persistentes, desinstalará todos los servicios de Kubernetes, limpiará cualquier directorio restante de Kubernetes/Rancher y forzará un nuevo registro en Rancher a través de la configuración original de <literal>MachineRegistration</literal> de Elemental. Esto ocurre automáticamente, sin necesidad de intervención manual. El guion que se ejecuta se encuentra en <literal>/opt/edge/elemental_node_cleanup.sh</literal> y se activa a través de <literal>systemd.path</literal> al colocar el marcador, por lo que su ejecución es inmediata.
ja: SUSE Edge 3.1では、Elemental Operatorによってオペレーティングシステム上にマーカが配置され、これによってクリーンアッププロセスが自動的にトリガされます。クリーンアッププロセスは、すべてのKubernetesサービスを停止して永続データをすべて削除し、すべてのKubernetesサービスをアンインストールして、残っているKubernetes/Rancherディレクトリをクリーンアップし、元のElemental <literal>MachineRegistration</literal>設定を使用して強制的にRancherに再登録します。これは自動的に行われるため、手動での操作は必要ありません。呼び出されるスクリプトは<literal>/opt/edge/elemental_node_cleanup.sh</literal>にあり、マーカが配置されるとすぐに<literal>systemd.path</literal>を介してトリガされるため、直ちに実行されます。
pt_br: No SUSE Edge 3.1, o operador Elemental insere um marcador no sistema operacional que aciona o processo de limpeza automaticamente; ele interrompe todos os serviços do Kubernetes, remove todos os dados persistentes, desinstala todos os serviços do Kubernetes, limpa os diretórios restantes do Kubernetes/Rancher e força o novo registro no Rancher por meio da configuração original <literal>MachineRegistration</literal> do Elemental. Isso é feito automaticamente, não há necessidade de intervenção manual. O script chamado está disponível em <literal>/opt/edge/elemental_node_cleanup.sh</literal> e é acionado pelo <literal>systemd.path</literal> depois de inserir o marcador, portanto, sua execução é imediata.
zh_cn: 在 SUSE Edge 3.1 中，Elemental Operator 会在操作系统上设置一个标记，该标记将自动触发清理过程；它会停止所有 Kubernetes 服务、去除所有持久性数据、卸装所有 Kubernetes 服务、清理所有剩余 Kubernetes/Rancher 目录，并通过原始 Elemental <literal>MachineRegistration</literal> 配置强制重新注册到 Rancher。此过程会自动发生，无需任何手动干预。调用的脚本存放在 <literal>/opt/edge/elemental_node_cleanup.sh</literal> 中。一旦设置了标记，脚本便会通过 <literal>systemd.path</literal> 触发，因此会立即执行。

source: Using the <literal>resettable</literal> functionality assumes that the desired behavior when removing a node/cluster from Rancher is to wipe data and force a re-registration. Data loss is guaranteed in this situation, so only use this if you’re sure that you want automatic reset to be performed.
es: El uso de la función <literal>resettable</literal> presupone que el comportamiento deseado al eliminar un nodo/clúster de Rancher es borrar los datos y forzar un nuevo registro. En esta situación, la pérdida de datos está garantizada, por lo que solo debe utilizarla si está seguro de que desea que se realice un restablecimiento automático.
ja: <literal>resettable</literal>機能を使用する場合、Rancherからノード/クラスタを削除する際の望ましい動作は、データを消去して再登録を強制することであると想定されています。この状況ではデータが確実に失われるため、この機能は、自動リセットを実行することがわかっている場合にのみ使用してください。
pt_br: Com o uso do <literal>resettable</literal>, a funcionalidade assume que o comportamento desejado ao remover um nó/cluster do Rancher é limpar os dados e forçar um novo registro. A perda de dados é certa nessa situação, portanto, use essa funcionalidade apenas se tiver certeza de que deseja executar a redefinição automática.
zh_cn: 使用 <literal>resettable</literal> 功能的假设条件是，预期在从 Rancher 去除节点/群集时执行的行为是擦除数据并强制重新注册。在这种情况下，必然会丢失数据，因此，请仅在您确定要执行自动重置时才使用此功能。

source: Next steps
es: Pasos siguientes
ja: 次の手順
pt_br: Próximas etapas
zh_cn: 后续步骤

source: Here are some recommended resources to research after using this guide:
es: Se recomienda estudiar los siguientes recursos después de utilizar esta guía:
ja: このガイドの使用後に調べるべき推奨リソースを次に示します。
pt_br: Veja alguns recursos recomendados para pesquisa depois de usar este guia:
zh_cn: 下面是使用本指南后建议阅读的一些资源：

source: End-to-end automation in <xref linkend="components-fleet"/>
es: Automatización de extremo a extremo en el <xref linkend="components-fleet"/>
ja: <xref linkend="components-fleet"/>のエンドツーエンドの自動化
pt_br: Automação de ponta a ponta no <xref linkend="components-fleet"/>
zh_cn: <xref linkend="components-fleet"/>中的端到端自动化

source: Additional network configuration options in <xref linkend="components-nmc"/>
es: Opciones de configuración de red adicionales en el <xref linkend="components-nmc"/>
ja: <xref linkend="components-nmc"/>の追加のネットワーク設定オプション
pt_br: Mais opções de configuração de rede no <xref linkend="components-nmc"/>
zh_cn: <xref linkend="components-nmc"/>中的其他网络配置选项

source: Standalone clusters with Edge Image Builder
es: Clústeres independientes con Edge Image Builder
ja: Edge Image Builderを使用したスタンドアロンクラスタ
pt_br: Clusters independentes com o Edge Image Builder
zh_cn: 使用 Edge Image Builder 配置独立群集

source: Edge Image Builder (EIB) is a tool that streamlines the process of generating Customized, Ready-to-Boot (CRB) disk images for bootstrapping machines, even in fully air-gapped scenarios. EIB is used to create deployment images for use in all three of the SUSE Edge deployment footprints, as it’s flexible enough to offer the smallest customizations, e.g. adding a user or setting the timezone, through offering a comprehensively configured image that sets up, for example, complex networking configurations, deploys multi-node Kubernetes clusters, deploys customer workloads, and registers to the centralized management platform via Rancher/Elemental and SUSE Multi-Linux Manager. EIB runs as in a container image, making it incredibly portable across platforms and ensuring that all of the required dependencies are self-contained, having a very minimal impact on the installed packages of the system that’s being used to operate the tool.
es: Edge Image Builder (EIB) es una herramienta que agiliza el proceso de generación de imágenes de disco personalizadas y listas para arrancar (CRB) para equipos de arranque, incluso en entornos totalmente aislados. EIB se utiliza para crear imágenes de despliegue para su uso en las tres huellas de despliegue de SUSE Edge, ya que es lo suficientemente flexible como para ofrecer las personalizaciones más pequeñas, como añadir un usuario o configurar la zona horaria, a través de una imagen configurada de forma integral que establece, por ejemplo, configuraciones de red complejas, despliega clústeres de Kubernetes de varios nodos, despliega cargas de trabajo de clientes y se registra en la plataforma de gestión centralizada a través de Rancher/Elemental y SUSE Multi-Linux Manager. EIB se ejecuta como una imagen de contenedor, lo que lo hace increíblemente portátil entre plataformas y garantiza que todas las dependencias necesarias sean autónomas, con un impacto mínimo en los paquetes instalados del sistema que se utiliza para operar la herramienta.
ja: Edge Image Builder (EIB)は、完全なエアギャップシナリオでもマシンをブートストラップできるCustomized, Ready-to-Boot (CRB)ディスクイメージの生成プロセスを効率化するツールです。EIBを使用すると、SUSE Edgeの3つのデプロイメントフットプリントすべてで使用するデプロイメントイメージを作成できます。これは、EIBが十分に柔軟であり、最小限のカスタマイズ(例: ユーザの追加やタイムゾーンの設定)から、あらゆる設定を網羅したイメージ(例: 複雑なネットワーク設定を行い、マルチノードKubernetesクラスタをデプロイして、顧客ワークロードをデプロイし、Rancher/ElementalとSUSE Multi-Linux Managerを介して集中管理プラットフォームに登録するイメージ)までを提供できるためです。EIBはコンテナイメージ内で動作するため、プラットフォーム間できわめて容易に移植可能です。さらに、必要な依存関係をすべて備えた自己完結型であるため、EIBツールの操作に使用するシステムにインストールされているパッケージに及ぼす影響が最小限に抑えられます。
pt_br: O Edge Image Builder (EIB) é uma ferramenta que simplifica o processo de geração de imagens de disco personalizadas e prontas para inicialização (CRB) para inicializar máquinas, mesmo em cenários totalmente air-gapped. O EIB é usado para criar imagens de implantação para uso em todas as três áreas de implantação do SUSE Edge, já que é flexível o suficiente para oferecer desde as menores personalizações, como adicionar um usuário ou definir o fuso horário, até uma imagem amplamente configurada que comporta, por exemplo, configurações de redes complexas, implantações de clusters Kubernetes de vários nós, implantações de cargas de trabalho de clientes e registros na plataforma de gerenciamento centralizado pelo Rancher/Elemental e SUSE Multi-Linux Manager. O EIB é executado como uma imagem de contêiner, o que o torna incrivelmente portátil entre as plataformas e garante que todas as dependências necessárias sejam autossuficientes, exercendo um impacto muito mínimo sobre os pacotes instalados do sistema usado para operar a ferramenta.
zh_cn: Edge Image Builder (EIB) 工具可以简化为引导计算机生成随时可引导 (CRB) 的自定义磁盘映像的过程，即使在完全隔离场景中也能做到这一点。EIB 用于创建所有三个 SUSE Edge 部署空间中使用的部署映像，因为它足够灵活，可以提供最简单的自定义过程，例如通过提供全面配置的映像来添加用户或设置时区。例如，该映像可以设置复杂的网络配置、部署多节点 Kubernetes 群集、部署客户工作负载，并通过 Rancher/Elemental 和 SUSE Multi-Linux Manager 注册到集中式管理平台。EIB 以容器映像的形式运行，因此具有极高的跨平台可移植性，可确保所有必需的依赖项都是独立的，对系统中所安装用于操作该工具的软件包的影响极小。

source: For multi-node scenarios, EIB automatically deploys MetalLB and Endpoint Copier Operator in order for hosts provisioned using the same built image to automatically join a Kubernetes cluster.
es: En escenarios de varios nodos, EIB despliega automáticamente MetalLB y Endpoint Copier Operator para que los hosts aprovisionados con la misma imagen compilada se unan automáticamente a un clúster de Kubernetes.
ja: マルチノードシナリオの場合、同じ構築されたイメージを使用してプロビジョニングされたホストが Kubernetesクラスタに自動的に参加できるように、EIBははMetalLBとEndpoint Copier Operatorを自動的にデプロイします。
pt_br: Nos cenários de vários nós, o EIB implanta automaticamente o MetalLB e o Endpoint Copier Operator para que os hosts provisionados que usam a mesma imagem criada ingressem em um cluster Kubernetes de maneira automática.
zh_cn: 对于多节点场景，EIB 会自动部署 MetalLB 和 Endpoint Copier Operator，以便让使用构建的同一映像置备的主机自动加入 Kubernetes 群集。

source: For more information, read the Edge Image Builder Introduction (<xref linkend="components-eib"/>).
es: Para obtener más información, lea la introducción de Edge Image Builder (<xref linkend="components-eib"/>).
ja: 詳細については、Edge Image Builderの紹介(<xref linkend="components-eib"/>)を参照してください。
pt_br: Para obter mais informações, leia a introdução do Edge Image Builder (<xref linkend="components-eib"/>).
zh_cn: 有关详细信息，请阅读 Edge Image Builder 简介（<xref linkend="components-eib"/>）。

source: Edge Image Builder 1.3.0 supports customizing SUSE Linux Micro 6.1 images. Older versions, such as SUSE Linux Enterprise Micro 5.5, or 6.0 are not supported.
es: Edge Image Builder 1.3.0 admite la personalización de imágenes de SUSE Linux Micro 6.1. No se admiten versiones anteriores, como SUSE Linux Enterprise Micro 5.5 o 6.0.
ja: Edge Image Builder 1.3.0は、SUSE Linux Micro 6.1イメージのカスタマイズをサポートしています。SUSE Linux Enterprise Micro 5.5や6.0などの古いバージョンはサポートされていません。
zh_cn: Edge Image Builder 1.3.0 支持自定义 SUSE Linux Micro 6.1 映像，但不支持 SUSE Linux Enterprise Micro 5.5 或 6.0 等旧版本。

source: An AMD64/Intel 64 build host machine (physical or virtual) running SLES 15 SP6.
es: Un equipo host AMD64/Intel 64 (físico o virtual) en el que se ejecute SLES 15 SP6.
ja: SLES 15 SP6を実行しているAMD64/Intel 64ビルドホストマシン(物理または仮想)
pt_br: Uma máquina host de build AMD64/Intel 64 (física ou virtual) com o SLES 15 SP6.
zh_cn: 运行 SLES 15 SP6 的 AMD64/Intel 64 构建主机（物理机或虚拟机）。

source: The Podman container engine
es: El motor de contenedores Podman
ja: Podmanコンテナエンジン
pt_br: O mecanismo de contêiner Podman
zh_cn: Podman 容器引擎

source: A SUSE Linux Micro 6.1 SelfInstall ISO image created using the Kiwi Builder procedure (<xref linkend="guides-kiwi-builder-images"/>)
es: Una imagen ISO de autoinstalación de SUSE Linux Micro 6.1 creada mediante el procedimiento Kiwi Builder (<xref linkend="guides-kiwi-builder-images"/>)
ja: Kiwi Builder手順を使用して作成されたSUSE Linux Micro 6.1 SelfInstall ISOイメージ(<xref linkend="guides-kiwi-builder-images"/>)
pt_br: Uma imagem ISO SelfInstall do SUSE Linux Micro 6.1 criada pelo procedimento do construtor Kiwi (<xref linkend="guides-kiwi-builder-images"/>)
zh_cn: 通过 Kiwi 构建器过程（<xref linkend="guides-kiwi-builder-images"/>）创建的 SUSE Linux Micro 6.1 自安装 ISO 映像

source: For non-production purposes, openSUSE Leap 15.6, or openSUSE Tumbleweed may be used as a build host machine. Other operating systems may function, so long as a compatible container runtime is available.
es: Para fines no relacionados con la producción, se puede utilizar openSUSE Leap 15.6 u openSUSE Tumbleweed como equipo host de creación. Otros sistemas operativos pueden funcionar, siempre que se disponga de un entorno de ejecución de contenedores compatible.
ja: 非運用目的の場合は、openSUSE Leap 15.6、またはopenSUSE Tumbleweedをビルドホストマシンとして使用できます。互換性のあるコンテナランタイムが利用できれば、その他のオペレーティングシステムでも機能します。
pt_br: Para fins que não sejam de produção, é possível usar o openSUSE Leap 15.6 ou o openSUSE Tumbleweed como máquina host de build. Outros sistemas operacionais podem funcionar, desde que um tempo de execução do contêiner compatível esteja disponível.
zh_cn: 对于非生产用途，可将 openSUSE Leap 15.6 或 openSUSE Tumbleweed 用作构建主机。其他操作系统也可能正常运行，前提是存在兼容的容器运行时。

source: Getting the EIB Image
es: Obtención de la imagen de EIB
ja: EIBイメージの取得
pt_br: Obtendo a imagem do EIB
zh_cn: 获取 EIB 映像

source: The EIB container image is publicly available and can be downloaded from the SUSE Edge registry by running the following command on your image build host:
es: La imagen del contenedor de EIB está disponible públicamente y se puede descargar desde el registro de SUSE Edge ejecutando el siguiente comando en el host de creación de imágenes:
ja: EIBのコンテナイメージは一般に公開されており、イメージ構築ホストで次のコマンドを実行することでSUSE Edgeレジストリからダウンロードできます。
pt_br: A imagem de contêiner do EIB é publicamente disponível e pode ser baixada do registro do SUSE Edge executando o seguinte comando no host de build da imagem:
zh_cn: EIB 容器映像已公开提供，可以通过在映像构建主机上运行以下命令从 SUSE Edge 仓库下载：

source: Creating the image configuration directory
es: Creación del directorio de configuración de imágenes
ja: イメージ設定ディレクトリの作成
pt_br: Criando o diretório de configuração de imagem
zh_cn: 创建映像配置目录

source: As EIB runs within a container, we need to mount a configuration directory from the host, enabling you to specify your desired configuration, and during the build process EIB has access to any required input files and supporting artifacts. This directory must follow a specific structure. Let’s create it, assuming that this directory will exist in your home directory, and called "eib":
es: Dado que EIB se ejecuta dentro de un contenedor, es necesario montar un directorio de configuración desde el host, lo que le permite especificar la configuración deseada. Así, durante el proceso de creación, EIB tiene acceso a cualquier archivo de entrada y artefactos de apoyo necesarios. Este directorio debe tener una estructura específica. Vamos a crearlo suponiendo que este directorio existirá en su directorio de inicio y se llamará "eib":
ja: EIBはコンテナ内で動作するため、ホストから設定ディレク トリをマウントして、必要な設定を指定できるようにする必要があります。ビルドプロセス中に、EIBは必要な入力ファイルやサポートアーティファクトすべてにアクセスできます。このディレクトリは、特定の構造に従う必要があります。このディレクトリがホームディレクトリに存在し、「eib」という名前であると仮定して、ディレクトリを作成してみましょう。
pt_br: Como o EIB é executado dentro de um contêiner, precisamos montar um diretório de configuração do host, o que permite especificar a configuração desejada e, durante o processo de criação, o EIB tem o acesso aos arquivos de entrada necessários e artefatos auxiliares. Esse diretório deve seguir uma estrutura específica. Vamos criá-lo imaginando que ele existe em seu diretório pessoal com o nome "eib":
zh_cn: 由于 EIB 在容器中运行，我们需要从主机挂载一个配置目录，以便能够指定所需的配置，并使 EIB 能够在构建过程中访问任何所需的输入文件和支持制品。此目录必须遵循特定的结构。我们在主目录中创建此目录，并将其命名为“eib”：

source: In the previous step we created a "base-images" directory that will host the SUSE Linux Micro 6.1 input image, let’s ensure that the image is copied over to the configuration directory:
es: En el paso anterior creamos el directorio "base-images" donde se alojará la imagen de entrada de SUSE Linux Micro 6.1. Ahora, nos aseguraremos de que la imagen se copie en el directorio de configuración:
ja: 前の手順でSUSE Linux Micro 6.1入力イメージをホストする「base-images」ディレクトリを作成しました。このイメージが設定ディレクトリにコピーされていることを確認しましょう。
pt_br: Na etapa anterior, criamos um diretório "base-images" que hospedará a imagem de entrada do SUSE Linux Micro 6.1. Vamos garantir que a imagem seja copiada para o diretório de configuração:
zh_cn: 在上一步骤中，我们创建了“base-images”目录，用于托管 SUSE Linux Micro 6.1 输入映像，现在我们确保将该映像复制到配置目录：

source: During the EIB run, the original base image is <emphasis role="strong">not</emphasis> modified; a new and customized version is created with the desired configuration in the root of the EIB config directory.
es: Durante la ejecución de EIB, la imagen base original <emphasis role="strong">no</emphasis> se modifica; se crea una nueva versión personalizada con la configuración deseada en la raíz del directorio de configuración de EIB.
ja: EIBの実行中に元のゴールデンイメージは変更<emphasis role="strong">されません</emphasis>。EIBの設定ディレクトリのルートに、目的の設定でカスタマイズされた新しいバージョンが作成されます。
pt_br: Durante a execução do EIB, a imagem base original <emphasis role="strong">não</emphasis> é modificada. Uma versão nova e personalizada é criada com a configuração desejada na raiz do diretório de configuração do EIB.
zh_cn: 在 EIB 运行过程中，<emphasis role="strong">不会</emphasis>修改原始基础映像；在 EIB 配置目录的根目录中，会使用所需的配置创建新的自定义版本。

source: The configuration directory at this point should look like the following:
es: El directorio de configuración en este momento debería tener el siguiente aspecto:
ja: この時点では、設定ディレクトリは次のようになっているはずです。
pt_br: Neste momento, o diretório de configuração deve ter a seguinte aparência:
zh_cn: 此时，配置目录应如下所示：

source: Creating the image definition file
es: Creación del archivo de definición de imagen
ja: イメージ定義ファイルの作成
pt_br: Criando o arquivo de definição de imagem
zh_cn: 创建映像定义文件

source: The definition file describes the majority of configurable options that the Edge Image Builder supports, a full example of options can be found <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/pkg/image/testdata/full-valid-example.yaml">here</link>, and we would recommend that you take a look at the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">upstream building images guide</link> for more comprehensive examples than the one we’re going to run through below. Let’s start with a very basic definition file for our OS image:
es: El archivo de definición describe la mayoría de las opciones configurables que admite Edge Image Builder. <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/pkg/image/testdata/full-valid-example.yaml">Aquí</link> encontrará un ejemplo completo de las opciones. Le recomendamos que consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">guía original sobre creación de imágenes</link> para ver ejemplos más completos que los que se muestran a continuación. Comencemos con un archivo de definición muy básico para nuestra imagen del sistema operativo:
ja: 定義ファイルには、Edge Image Builderがサポートする設定可能なオプションの大部分が記述されています。オプションの完全な例については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/pkg/image/testdata/full-valid-example.yaml">こちら</link>を参照してください。以下で説明する例よりも広範な例については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">アップストリームのイメージ構築ガイド</link>を参照することをお勧めします。まずは、OSイメージの非常に基本的な定義ファイルから始めましょう。
zh_cn: 定义文件包含了 Edge Image Builder 支持的大部分可配置选项，完整的选项示例可在<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/pkg/image/testdata/full-valid-example.yaml">此处</link>查看，建议您参考<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/docs/building-images.md">上游构建映像指南</link>，获取比下文所述更全面的示例。以下是我们为操作系统映像准备的一个非常基础的定义文件：
