Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Akri is available as a Helm chart within the Edge Helm repository. The recommended way of configuring Akri is by using the given Helm chart to deploy the different components (agent, controller, discovery-handlers), and then use your preferred deployment mechanism to deploy Akri’s Configuration CRDs.
pt_br: O Akri está disponível como gráfico Helm no repositório Helm do Edge. A maneira recomendada de configurar o Akri é usar o gráfico Helm especificado para implantar os diversos componentes (agente, controlador, manipuladores de descoberta) e usar o mecanismo de implantação de sua preferência para implantar as CRDs de configuração do Akri.
zh_cn: Akri 在 Edge Helm 储存库中作为 Helm chart 提供。建议的 Akri 配置方法是使用给定的 Helm chart 部署不同的组件（代理、控制器、发现处理程序），然后使用您偏好的部署机制部署 Akri 的配置 CRD。

source: Configuring Akri
pt_br: Configurando o Akri
zh_cn: 配置 Akri

source: Akri is configured using a <literal>akri.sh/Configuration</literal> object, this object takes in all information about how to discover the devices, as well as what to do when a matching one is discovered.
pt_br: O Akri é configurado usando um objeto <literal>akri.sh/Configuration</literal>, que obtém todas as informações de como descobrir os dispositivos e do que fazer quando um correspondente é descoberto.
zh_cn: 使用 <literal>akri.sh/Configuration</literal> 对象来配置 Akri，该对象包含有关如何发现设备，以及发现了匹配的设备时应执行什么操作的所有信息。

source: Here is an example configuration breakdown with all fields explained:
pt_br: Veja abaixo um exemplo de configuração decomposto com a explicação de todos os campos:
zh_cn: 下面列出了示例配置的明细，其中解释了所有字段：

source: This part describes the configuration of the discovery handler, you have to specify its name (the handlers available as part of Akri’s chart are <literal>udev</literal>, <literal>opcua</literal>, <literal>onvif</literal>). The <literal>discoveryDetails</literal> is handler specific, refer to the handler’s documentation on how to configure it.
pt_br: Esta parte descreve a configuração do manipulador de descoberta. Você deve especificar o nome dele (os manipuladores disponíveis como parte do gráfico do Akri são <literal>udev</literal>, <literal>opcua</literal> e <literal>onvif</literal>). O <literal>discoveryDetails</literal> é específico do manipulador. Consulte a documentação do manipulador para saber como configurá-lo.
zh_cn: 此部分描述发现处理程序的配置，您必须指定处理程序的名称（作为 Akri chart 一部分提供的处理程序包括 <literal>udev</literal>、<literal>opcua</literal>、<literal>onvif</literal>）。<literal>discoveryDetails</literal> 与特定的处理程序相关，有关其配置方法，请参见处理程序的文档。

source: This section defines the workload to be deployed for every discovered device. The example shows a minimal version of a <literal>Pod</literal> configuration in <literal>brokerPodSpec</literal>, all usual fields of a Pod’s spec can be used here. It also shows the Akri specific syntax to request the device in the <literal>resources</literal> section.
pt_br: Esta seção define a carga de trabalho que será implantada para cada dispositivo descoberto. O exemplo mostra uma versão mínima da configuração do <literal>Pod</literal> em <literal>brokerPodSpec</literal>, todos os campos comuns da especificação de um pod podem ser usados aqui. Ele também mostra a sintaxe específica do Akri para solicitar o dispositivo na seção <literal>resources</literal>.
zh_cn: 此部分定义要为每个已发现设备部署的工作负载。该示例显示了 <literal>brokerPodSpec</literal> 中 <literal>Pod</literal> 配置的最低版本，在此处可以使用 Pod 规范的所有常规字段。其中还显示了 <literal>resources</literal> 部分中用于请求设备的 Akri 特定语法。

source: You can alternatively use a Job instead of a Pod, using the <literal>brokerJobSpec</literal> key instead, and providing the spec part of a Job to it.
pt_br: Se preferir, use um job no lugar do pod, com a chave <literal>brokerJobSpec</literal>, e insira a parte da especificação de um job para ele.
zh_cn: 您也可以使用作业来代替 Pod，方法是改用 <literal>brokerJobSpec</literal> 键，并在其中提供作业的规范部分。

source: These two sections show how to configure Akri to deploy a service per broker (<literal>instanceService</literal>), or pointing to all brokers (<literal>configurationService</literal>). These are containing all elements pertaining to a usual Service.
pt_br: Estas duas seções mostram como configurar o Akri para implantar um serviço por agente (<literal>instanceService</literal>) ou apontar para todos os agentes (<literal>configurationService</literal>). Eles contêm todos os elementos que pertencem a um serviço comum.
zh_cn: 这两个部分显示如何配置 Akri 以便为每个中介程序部署一个服务 (<literal>instanceService</literal>)，或指向所有中介程序 (<literal>configurationService</literal>)。这些部分包含与常规服务相关的所有元素。

source: The <literal>brokerProperties</literal> field is a key/value store that will be exposed as additional environment variables to any pod requesting a discovered device.
pt_br: O campo <literal>brokerProperties</literal> é um armazenamento de chave/valor que será exposto como variáveis de ambiente adicionais para um pod que solicita um dispositivo descoberto.
zh_cn: <literal>brokerProperties</literal> 字段是一个键/值存储区，它将作为附加环境变量公开给请求已发现设备的任何 Pod。

source: The capacity is the allowed number of concurrent users of a discovered device.
pt_br: A capacidade é o número permitido de usuários simultâneos de um dispositivo descoberto.
zh_cn: capacity 是已发现设备的并发用户的允许数量。

source: Writing and deploying additional Discovery Handlers
pt_br: Escrevendo e implantando manipuladores de descoberta adicionais
zh_cn: 编写和部署更多发现处理程序

source: In case the protocol used by your device isn’t covered by an existing discovery handler, you can write your own using the <link xl:href="https://docs.akri.sh/development/handler-development">handler development guide</link>.
pt_br: Se o protocolo usado por seu dispositivo não for coberto por um manipulador de descoberta existente, você pode escrever um próprio seguindo o <link xl:href="https://docs.akri.sh/development/handler-development">guia de desenvolvimento de manipulador</link>.
zh_cn: 如果现有的发现处理程序无法涵盖您的设备使用的协议，您可以遵循<link xl:href="https://docs.akri.sh/development/handler-development">处理程序开发指南</link>编写自己的发现处理程序。

source: Akri Rancher Dashboard Extension
pt_br: Extensão Akri do Rancher Dashboard
zh_cn: Akri Rancher 仪表板扩展

source: See <xref linkend="components-rancher-dashboard-extensions"/> for installation guidance.
pt_br: Consulte o <xref linkend="components-rancher-dashboard-extensions"/> para ver a orientação de instalação.
zh_cn: 请参见<xref linkend="components-rancher-dashboard-extensions"/>获取安装指导。

source: Once the extension is installed you can navigate to any Akri-enabled managed cluster using cluster explorer. Under <emphasis role="strong">Akri</emphasis> navigation group you can see <emphasis role="strong">Configurations</emphasis> and <emphasis role="strong">Instances</emphasis> sections.
pt_br: Depois que a extensão for instalada, navegue até um cluster habilitado pelo Akri usando o explorador de clusters. No grupo de navegação <emphasis role="strong">Akri</emphasis>, você verá as seções <emphasis role="strong">Configurations</emphasis> (Configurações) e <emphasis role="strong">Instances</emphasis> (Instâncias).
zh_cn: 安装扩展后，您可以使用群集资源管理器导航到任何已启用 Akri 的受管群集。在 <emphasis role="strong">Akri</emphasis> 导航组下，可以看到 <emphasis role="strong">Configurations</emphasis>（配置）和 <emphasis role="strong">Instances</emphasis>（实例）部分。

source: akri extension configurations
pt_br: configurações extensão akri
zh_cn: Akri 扩展配置

source: The configurations list provides information about <literal>Configuration Discovery Handler</literal> and number of instances. Clicking the name opens a configuration detail page.
pt_br: A lista de configurações apresenta informações sobre o <literal>manipulador de descoberta de configuração</literal> e o número de instâncias. Clique no nome para abrir a página de detalhes da configuração.
zh_cn: 配置列表提供了有关<literal>配置发现处理程序</literal>和实例数量的信息。单击名称会打开配置细节页面。

source: akri extension configuration detail
pt_br: detalhes configuração extensão akri
zh_cn: Akri 扩展配置细节

source: You can also edit or create a new <emphasis role="strong">Configuration</emphasis>. The extension allows you to select discovery handler, set up broker pod or job, customize configurations and instance services, and set the configuration capacity.
pt_br: Você também pode editar ou criar uma nova <emphasis role="strong">configuração</emphasis>. A extensão permite selecionar o manipulador de descoberta, configurar o pod ou job do agente, personalizar configurações e serviços de instâncias e definir a capacidade da configuração.
zh_cn: 您还可以编辑或创建新的<emphasis role="strong">配置</emphasis>。扩展允许您选择发现处理程序、设置中介程序 Pod 或作业、自定义配置和实例服务，以及设置配置容量。

source: akri extension configuration edit
pt_br: edição configuração extensão akri
zh_cn: Akri 扩展配置编辑

source: Discovered devices are listed in the <emphasis role="strong">Instances</emphasis> list.
pt_br: Os dispositivos descobertos são relacionados na lista <emphasis role="strong">Instances</emphasis> (Instâncias).
zh_cn: <emphasis role="strong">Instances</emphasis>（实例）列表中会列出已发现的设备。

source: akri extension instances list
pt_br: lista instâncias extensão akri
zh_cn: Akri 扩展实例列表

source: Clicking the <emphasis role="strong">Instance</emphasis> name opens a detail page allowing to view the workloads and instance service.
pt_br: Clique no nome da <emphasis role="strong">instância</emphasis> para abrir uma página de detalhes com as cargas de trabalho e o serviço da instância.
zh_cn: 单击<emphasis role="strong">实例名称</emphasis>会打开细节页面，在其中可以查看工作负载和实例服务。

source: akri extension instance detail
pt_br: detalhes instância extensão akri
zh_cn: Akri 扩展实例细节

source: <link xl:href="https://k3s.io/">K3s</link> is a highly available, certified Kubernetes distribution designed for production workloads in unattended, resource-constrained, remote locations or inside IoT appliances.
es: <link xl:href="https://k3s.io/">K3s</link> es una distribución de Kubernetes certificada y de alta disponibilidad, diseñada para cargas de trabajo de producción en ubicaciones remotas sin supervisión y con recursos limitados, o dentro de dispositivos IoT.
ja: <link xl:href="https://k3s.io/">K3s</link>は、リソースに制約のあるリモートの無人の場所やIoTアプライアンス内の運用ワークロード向けに設計された、高可用性のKubernetes認定ディストリビューションです。
pt_br: <link xl:href="https://k3s.io/">K3s</link> é uma distribuição Kubernetes certificada e altamente disponível desenvolvida para cargas de trabalho de produção em locais autônomos, remotos e com restrição de recursos ou dentro de aplicações IoT.
zh_cn: <link xl:href="https://k3s.io/">K3s</link> 是经过认证的高可用性 Kubernetes 发行版，专为无人照管、资源受限的远程位置或物联网设备内的生产工作负载而设计。

source: It is packaged as a single and small binary, so installations and updates are fast and easy.
es: Se presenta como un único archivo binario de pequeño tamaño, por lo que su instalación y actualización es rápida y sencilla.
ja: 単一の小さなバイナリとしてパッケージ化されているため、迅速かつ簡単にインストールおよび更新できます。
pt_br: Ele é empacotado como um binário único e pequeno, portanto, as instalações e atualizações são rápidas e fáceis.
zh_cn: 它封装为单个较小二进制文件，因此可以快速轻松地安装和更新。

source: How does SUSE Edge use K3s
es: ¿Cómo se usa K3s en SUSE Edge?
ja: SUSE EdgeでのK3sの用途
pt_br: Como o SUSE Edge usa o K3s
zh_cn: SUSE Edge 如何使用 K3s

source: K3s can be used as the Kubernetes distribution backing the SUSE Edge stack. It is meant to be installed on a SUSE Linux Micro operating system.
es: K3s se puede utilizar como la distribución de Kubernetes que respalda la pila de SUSE Edge. Está diseñado para instalarse en un sistema operativo SUSE Linux Micro.
ja: K3sは、SUSE Edgeスタックを支えるKubernetesディストリビューションとして使用できます。K3sはSUSE Linux Microオペレーティングシステムにインストールすることが意図されています。
pt_br: É possível usar o K3s como distribuição Kubernetes de base para a pilha do SUSE Edge. Ele foi projetado para ser instalado em um sistema operacional SUSE Linux Micro.
zh_cn: K3s 可用作支持 SUSE Edge 堆栈的 Kubernetes 发行版。它适合安装在 SUSE Linux Micro 操作系统上。

source: Using K3s as the SUSE Edge stack Kubernetes distribution is only recommended when etcd as a backend does not fit your constraints. If etcd as a backend is possible, it is better to use RKE2 (<xref linkend="components-rke2"/>).
es: El uso de K3s como distribución de Kubernetes de la pila de SUSE Edge solo se recomienda cuando resulta imposible usar etcd como backend. Si es posible usar etcd como backend, es mejor utilizar RKE2 (<xref linkend="components-rke2"/>).
ja: K3sをSUSE EdgeスタックのKubernetesディストリビューションとして使用することは、etcdをバックエンドとして使用したのでは制約に合わない場合にのみ推奨します。etcdをバックエンドとして使用できる場合は、RKE2 (<xref linkend="components-rke2"/>)を使用することをお勧めします。
pt_br: O uso do K3s como distribuição Kubernetes da pilha do SUSE Edge é recomendado apenas quando o etcd como back end não atende a suas restrições. Se o etcd como back end for possível, será melhor usar o RKE2 (<xref linkend="components-rke2"/>).
zh_cn: 仅当用作后端的 etcd 不能满足您的约束条件时，才建议使用 K3s 作为 SUSE Edge 堆栈 Kubernetes 发行版。如果 etcd 可用作后端，则最好使用 RKE2（<xref linkend="components-rke2"/>）。

source: The recommended way of installing K3s as part of the SUSE Edge stack is by using Edge Image Builder (EIB). See its documentation (<xref linkend="components-eib"/>) for more details on how to configure it to deploy K3s.
es: La forma recomendada de instalar K3s como parte de la pila de SUSE Edge es utilizando Edge Image Builder (EIB). Consulte la documentación (<xref linkend="components-eib"/>) para obtener más detalles sobre cómo configurar EIB para desplegar K3s.
ja: K3sをSUSE Edgeスタックの一部としてインストールする場合に推奨する方法は、Edge Image Builder (EIB)を使用することです。K3sをデプロイするようにEIBを設定する方法の詳細については、EIBのドキュメント(<xref linkend="components-eib"/>)を参照してください。
pt_br: A maneira recomendada de instalar o K3s como parte da pilha do SUSE Edge é usar o Edge Image Builder (EIB). Consulte a documentação dele (<xref linkend="components-eib"/>) para obter mais detalhes de como configurá-lo para implantar o K3s.
zh_cn: 将 K3s 安装为 SUSE Edge 堆栈一部分的建议方法是使用 Edge Image Builder (EIB)。有关如何配置 EIB 来部署 K3s 的详细信息，请参见其文档（<xref linkend="components-eib"/>）。

source: It automatically supports HA setup, as well as Elemental setup.
es: Admite automáticamente tanto la configuración de HA (alta disponibilidad) como la configuración de Elemental.
ja: この方法では、自動的にHAセットアップとElementalセットアップがサポートされます。
pt_br: Ele oferece suporte automático para configuração de alta disponibilidade e do Elemental.
zh_cn: K3s 原生支持 HA 设置以及 Elemental 设置。

source: Fleet for GitOps workflow
es: Fleet para flujo de trabajo de GitOps
ja: GitOpsワークフローでのFleet
pt_br: Fleet para fluxo de trabalho do GitOps
zh_cn: 用于 GitOps 工作流程的 Fleet

source: The SUSE Edge stack uses Fleet as its preferred GitOps tool. For more information around its installation and use, refer to the Fleet section (<xref linkend="components-fleet"/>) in this documentation.
es: La pila de SUSE Edge utiliza Fleet como su herramienta GitOps preferida. Para obtener más información sobre la instalación y el uso, consulte la sección Fleet (<xref linkend="components-fleet"/>) de esta documentación.
ja: SUSE Edgeスタックでは、GitOpsの推奨ツールとしてFleetを使用します 。Fleetのインストールと使用の詳細については、このドキュメントの「Fleet」のセクション(<xref linkend="components-fleet"/>)を参照してください。
pt_br: A pilha do SUSE Edge usa o Fleet como ferramenta GitOps preferencial. Para obter mais informações sobre instalação e uso, consulte a seção do Fleet (<xref linkend="components-fleet"/>) nesta documentação.
zh_cn: SUSE Edge 堆栈使用 Fleet 作为其首选 GitOps 工具。有关 Fleet 安装和用法的详细信息，请参见本文档中的<xref linkend="components-fleet"/>。

source: Storage management
es: Gestión del almacenamiento
ja: ストレージ管理
pt_br: Gerenciamento de armazenamento
zh_cn: 存储管理

source: K3s comes with local-path storage preconfigured, which is suitable for single-node clusters. For clusters spanning over multiple nodes, we recommend using SUSE Storage (<xref linkend="components-suse-storage"/>).
es: K3s incluye almacenamiento de ruta local preconfigurado, lo cual resulta útil para los clústeres de un solo nodo. En el caso de los clústeres de varios nodos, se recomienda utilizar SUSE Storage (<xref linkend="components-suse-storage"/>).
ja: K3sではローカルパスストレージが事前設定されており、これはシングルノードクラスタに適しています。複数のノードにまたがるクラスタの場合は、SUSE Storage (<xref linkend="components-suse-storage"/>)を使用することをお勧めします。
pt_br: O K3s vem com armazenamento de caminho local pré-configurado, que é adequado para clusters de nó único. Para clusters que abrangem vários nós, recomendamos usar o SUSE Storage (<xref linkend="components-suse-storage"/>).
zh_cn: K3s 预配置了本地路径存储服务，这种存储服务适用于单节点群集。对于跨多个节点的群集，我们建议使用 SUSE Storage（<xref linkend="components-suse-storage"/>）。

source: Load balancing and HA
es: Equilibrio de carga y HA
ja: 負荷分散とHA
pt_br: Balanceamento de carga e alta disponibilidade
zh_cn: 负载平衡和 HA

source: If you installed K3s using EIB, this part is already covered by the EIB documentation in the HA section.
es: Si ha instalado K3s utilizando EIB, esta parte ya se trata en la documentación de EIB, en la sección sobre HA.
ja: EIBを使用してK3sをインストールした場合、ここで説明する部分は、EIBのドキュメントの「HA」のセクションで説明済みです。
pt_br: Se você instalou o K3s com o EIB, esta parte já foi coberta pela documentação do EIB na seção de alta disponibilidade.
zh_cn: 如果您是使用 EIB 安装的 K3s，请参见 EIB 文档中的“HA”一章，其中已介绍本节所述的内容。

source: Otherwise, you need to install and configure MetalLB as per our MetalLB documentation (<xref linkend="guides-metallb-k3s"/>).
es: De lo contrario, deberá instalar y configurar MetalLB siguiendo las instrucciones correspondientes de la documentación (<xref linkend="guides-metallb-k3s"/>).
ja: EIBを使用しないでK3sをインストールした場合は、MetalLBのドキュメント(<xref linkend="guides-metallb-k3s"/>)に従ってMetalLBをインストールおよび設定する必要があります。
pt_br: Do contrário, será necessário instalar e configurar o MetalLB de acordo com a nossa documentação do MetalLB (<xref linkend="guides-metallb-k3s"/>).
zh_cn: 否则，您需要按照 MetalLB 文档（<xref linkend="guides-metallb-k3s"/>）安装和配置 MetalLB。

source: See <link xl:href="https://docs.rke2.io/">RKE2 official documentation</link>.
es: Consulte la <link xl:href="https://docs.rke2.io/">documentación oficial de RKE2</link>.
ja: <link xl:href="https://docs.rke2.io/">RKE2の公式ドキュメント</link>を参照してください。
pt_br: Consulte a <link xl:href="https://docs.rke2.io/">documentação oficial do RKE2</link>.
zh_cn: 请参见 <link xl:href="https://docs.rke2.io/">RKE2 官方文档</link>。

source: RKE2 is a fully conformant Kubernetes distribution that focuses on security and compliance by:
es: RKE2 es una distribución de Kubernetes totalmente compatible que se centra en la seguridad y el cumplimiento normativo:
ja: RKE2は、以下によってセキュリティとコンプライアンスに重点を置いた、完全準拠のKubernetesディストリビューションです。
pt_br: O RKE2 é uma distribuição Kubernetes totalmente compatível dedicada à segurança e à conformidade das seguintes maneiras:
zh_cn: RKE2 是完全符合规范且注重安全性与合规性的 Kubernetes 发行版，因为它：

source: Providing defaults and configuration options that allow clusters to pass the CIS Kubernetes Benchmark v1.6 or v1.23 with minimal operator intervention
es: Proporcionando valores predeterminados y opciones de configuración que permiten a los clústeres superar la prueba CIS Kubernetes Benchmark v1.6 o v1.23 con una intervención mínima por parte del operador
ja: クラスタがCIS Kubernetes Benchmark v1.6またはv1.23に合格できるデフォルト値と設定オプションを、オペレータの介入を最小限に抑えながら提供する
pt_br: Oferecendo padrões e opções de configuração para que os clusters sejam aprovados no CIS Kubernetes Benchmark v1.6 ou v1.23 com o mínimo de intervenção do operador
zh_cn: 提供默认设置和配置选项，使群集能够在最低限度的运维干预下通过 CIS Kubernetes 基准 v1.6 或 v1.23

source: Enabling FIPS 140-2 compliance
es: Habilitando la conformidad con FIPS 140-2
ja: FIPS 140-2準拠を可能にする
pt_br: Assegurando a conformidade com o FIPS 140-2
zh_cn: 实现 FIPS 140-2 合规

source: Regularly scanning components for CVEs using <link xl:href="https://trivy.dev">trivy</link> in the RKE2 build pipeline
es: Escaneando regularmente los componentes en busca de CVE mediante <link xl:href="https://trivy.dev">trivy</link> en el proceso de creación de RKE2
ja: <link xl:href="https://trivy.dev">trivy</link>を使用し、コンポーネントを定期的にスキャンしてRKE2ビルドパイプラインにCVEがないかどうかを確認する
pt_br: Verificando regularmente se há CVEs nos componentes por meio do <link xl:href="https://trivy.dev">trivy</link> no pipeline de compilação do RKE2
zh_cn: 在 RKE2 构建管道中使用 <link xl:href="https://trivy.dev">trivy</link> 定期扫描组件中存在的 CVE

source: RKE2 launches control plane components as static pods, managed by kubelet. The embedded container runtime is containerd.
es: RKE2 lanza los componentes del plano de control como pods estáticos, gestionados por kubelet. El entorno de ejecución del contenedor integrado es containerd.
ja: RKE2は、コントロールプレーンコンポーネントを、kubeletによって管理される静的Podとして起動します。組み込みコンテナランタイムはcontainerdです。
pt_br: O RKE2 inicia os componentes do plano de controle como pods estáticos, gerenciados pelo kubelet. O runtime de contêiner incorporado é containerd.
zh_cn: RKE2 将控制平面组件作为 kubelet 管理的静态 Pod 进行启动。嵌入式容器运行时为 containerd。

source: Note: RKE2 is also known as RKE Government in order to convey another use case and sector it currently targets.
es: Nota: RKE2 también se conoce como RKE Government cuando se emplea en otro caso de uso y en el sector al que se dirige.
ja: メモ: RKE2はRKE Governmentとしても知られます。これは、RKE2が現在ターゲットにしている別のユースケースと分野を表すためです。
pt_br: Nota: O RKE2 também é conhecido como RKE Government para expressar outro caso de uso e setor a que ele atende.
zh_cn: 注意：RKE2 也称为 RKE 政府版，这个名称旨在体现它目前面向的另一类使用场景和行业领域。

source: RKE2 vs K3s
es: RKE2 frente a K3s
ja: RKE2とK3s
pt_br: RKE2 ou K3s
zh_cn: RKE2 与 K3s 的比较

source: K3s is a fully compliant and lightweight Kubernetes distribution focused on Edge, IoT, ARM - optimized for ease of use and resource constrained environments.
es: K3s es una distribución de Kubernetes totalmente compatible y ligera, centrada en Edge, IoT y ARM, optimizada para que su uso sea sencillo y para entornos con recursos limitados.
ja: K3sはエッジ、loT、ARMに焦点を当てた、完全準拠の軽量なKubernetes ディストリビューションであり、使いやすさとリソースに制約のある環境向けに最適化されています。
pt_br: O K3s é uma distribuição Kubernetes leve e totalmente compatível, com foco em borda, IoT e ARM, otimizado para facilidade de uso e ambientes com restrição de recursos.
zh_cn: K3s 是完全合规的轻量级 Kubernetes 发行版，主要用于 Edge、IoT 和 ARM，已针对易用性和资源受限的环境进行优化。

source: RKE2 combines the best of both worlds from the 1.x version of RKE (hereafter referred to as RKE1) and K3s.
es: RKE2 combina lo mejor de la versión 1.x de RKE (en adelante, RKE1) y de K3s.
ja: RKE2は、RKEの1.xバージョン(以下「RKE1」)とK3sの両方の長所を兼ね備えています。
pt_br: O RKE2 combina o melhor dos dois mundos: a versão 1.x do RKE (daqui em diante chamada de RKE1) e o K3s.
zh_cn: RKE2 结合了 1.x 版 RKE（后文称为 RKE1）和 K3s 的最大优点。

source: From K3s, it inherits the usability, ease of operation and deployment model.
es: De K3s, hereda la facilidad de uso, la simplicidad de funcionamiento y el modelo de despliegue.
ja: RKE2は、K3sから使いやすさ、操作のしやすさ、およびデプロイメントモデルを継承しています。
pt_br: Do K3s, ele herda a usabilidade, a facilidade de operação e o modelo de implantação.
zh_cn: RKE2 承袭了 K3s 的易用性、易操作性和部署模式。

source: From RKE1, it inherits close alignment with upstream Kubernetes. In places, K3s has diverged from upstream Kubernetes in order to optimize for edge deployments, but RKE1 and RKE2 can stay closely aligned with upstream.
es: De RKE1, hereda una estrecha alineación con la versión original de Kubernetes. En algunos aspectos, K3s se ha desviado de la versión original de Kubernetes con el fin de optimizar los despliegues periféricos; pero RKE1 y RKE2 pueden mantenerse estrechamente alineados con dicha versión original.
ja: RKE1から継承しているのは、アップストリームのKubernetesとの緊密な連携です。K3sはエッジデプロイメントに合わせて最適化されているため、アップストリームのKubernetesとは各所で異なりますが、RKE1とRKE2はアップストリームと緊密な連携を保つことができます。
pt_br: Do RKE1, ele herda o alinhamento próximo com o Kubernetes upstream. Em alguns locais, o K3s diverge do Kubernetes upstream para otimizar as implantações de borda, mas o RKE1 e o RKE2 mantêm um estreito alinhamento com o upstream.
zh_cn: 从 RKE1 继承了与上游 Kubernetes 的紧密一致性。在某些方面，K3s 为了优化边缘部署而与上游 Kubernetes 产生了差异，但 RKE1 和 RKE2 能够保持与上游的紧密一致。

source: How does SUSE Edge use RKE2?
es: ¿Cómo se usa RK2 en SUSE Edge?
ja: SUSE EdgeでのRKE2の用途
pt_br: Como o SUSE Edge usa o RKE2?
zh_cn: SUSE Edge 如何使用 RKE2？
