Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The <literal>VIP</literal> address is a reserved IP address that is not assigned to any node and is used to configure the load balancer. In a dual-stack cluster, both an IPv4 and IPv6 can be specified, but in the following examples priority will be given to the IPv4 address.
es: La dirección <literal>IP virtual</literal> es una dirección IP reservada que no se asigna a ningún nodo y se utiliza para configurar el equilibrador de carga. En un clúster de doble pila, se puede especificar tanto IPv4 como IPv6, pero en los ejemplos siguientes se dará prioridad a la dirección IPv4.
ja: <literal>VIP</literal>アドレスは、どのノードにも割り当てられていない予約済みのIPアドレスであり、ロードバランサを設定するために使用されます。デュアルスタッククラスタでは、IPv4とIPv6の両方を指定できますが、以下の例ではIPv4アドレスが優先されます。
zh_cn: <literal>VIP</literal> 地址是未分配给任何节点的预留 IP 地址，用于配置负载平衡器。在双栈群集中，可同时指定 IPv4 和 IPv6 地址，但在以下示例中，将优先使用 IPv4 地址。

source: Below is the cluster definition, where the cluster network can be configured using the <literal>pods</literal> and the <literal>services</literal> blocks. Also, it contains the references to the control plane and the infrastructure (using the <literal>Metal<superscript>3</superscript></literal> provider) objects to be used.
es: A continuación, se muestra la definición del clúster, donde la red del clúster se puede configurar utilizando los bloques <literal>pods</literal> y <literal>services</literal>. Además, contiene las referencias al plano de control y a los objetos de infraestructura (utilizando el proveedor de <literal>Metal<superscript>3</superscript></literal>) que se van a utilizar.
ja: 以下はクラスタ定義です。ここで、<literal>pods</literal>ブロックと<literal>services</literal>ブロックを使用してクラスタのネットワークを設定できます。また、ここにはコントロールプレーンと、使用するインフラストラクチャ(<literal>Metal<superscript>3</superscript></literal>プロバイダを使用)のオブジェクトへの参照も含まれています。
pt_br: Veja a seguir a definição do cluster, em que a rede do cluster pode ser configurada usando os blocos <literal>pods</literal> e <literal>services</literal>. Ela também contém as referências aos objetos de plano de controle e infraestrutura (usando o provedor <literal>Metal<superscript>3</superscript></literal>) a serem usados.
zh_cn: 下面的内容为群集定义，可在其中使用 <literal>pods</literal> 和 <literal>services</literal> 块来配置群集网络。此外，它还包含对要使用的控制平面和基础架构（使用 <literal>Metal<superscript>3</superscript></literal> 提供程序）对象的引用。

source: Both single-stack and dual-stack deployments are possible, remove the IPv6 CIDRs and IPv6 VIP addresses (in the subsequent sections) for an IPv4 only cluster
es: Se admiten despliegues tanto de pila única como de doble pila. Elimine los CIDR IPv6 y las direcciones IP virtuales IPv6 (en las secciones siguientes) en el caso de un clúster solo IPv4.
ja: シングルスタックとデュアルスタックの両方のデプロイメントが可能です。IPv4のみのクラスタの場合は、IPv6 CIDRおよびIPv6 VIPアドレス(後述するセクション)を削除してください
zh_cn: 单栈和双栈部署均受支持，如果为仅 IPv4 群集，可从后续章节中去除 IPv6 CIDR 和 IPv6 VIP 地址

source: The <literal>Metal3Cluster</literal> object specifies the control-plane endpoint that uses the <literal>VIP</literal> address already reserved (replacing the <literal>${EDGE_VIP_ADDRESS_IPV4}</literal>) to be configured and the <literal>noCloudProvider</literal> because the three bare-metal nodes are used.
es: El objeto <literal>Metal3Cluster</literal> especifica el punto final de plano de control que usa la dirección <literal>IP virtual</literal> ya reservada (en sustitución de <literal>${EDGE_VIP_ADDRESS_IPV4}</literal>) que se va a configurar y <literal>noCloudProvider</literal> porque se utilizan los tres nodos bare metal.
ja: <literal>Metal3Cluster</literal>オブジェクトには、予約済みの<literal>VIP</literal>アドレス( <literal>${EDGE_VIP_ADDRESS_IPV4}</literal>を置き換え)を使用して設定するコントロールプレーンのエンドポイントと、<literal>noCloudProvider</literal> (3つのベアメタルノードを使用しているため)を指定しています。
zh_cn: <literal>Metal3Cluster</literal> 对象指定使用已预留的 <literal>VIP</literal> 地址（请替换 <literal>${EDGE_VIP_ADDRESS_IPV4}</literal>）的待配置控制平面端点，以及 <literal>noCloudProvider</literal>（因为使用了三个裸机节点）。

source: The <literal>RKE2ControlPlane</literal> object specifies the control-plane configuration to be used, and the <literal>Metal3MachineTemplate</literal> object specifies the control-plane image to be used.
es: El objeto <literal>RKE2ControlPlane</literal> especifica la configuración de plano de control que se va a utilizar, y el objeto <literal>Metal3MachineTemplate</literal> especifica la imagen de plano de control que se va a utilizar.
ja: <literal>RKE2ControlPlane</literal>オブジェクトには、使用するコントロールプレーンの設定を指定し、<literal>Metal3MachineTemplate</literal>オブジェクトには、使用するコントロールプレーンのイメージを指定します。
pt_br: O objeto <literal>RKE2ControlPlane</literal> especifica a configuração do plano de controle e o objeto <literal>Metal3MachineTemplate</literal> especifica a imagem do plano de controle que serão usadas.
zh_cn: <literal>RKE2ControlPlane</literal> 对象指定要使用的控制平面配置，<literal>Metal3MachineTemplate</literal> 对象指定要使用的控制平面映像。

source: The number of replicas to be used (in this case, three).
es: El número de réplicas que se utilizarán (en este caso, tres).
ja: 使用するレプリカの数(ここでは3)。
pt_br: O número de réplicas a ser usado (neste caso, três).
zh_cn: 要使用的复本数（在本例中为 3）。

source: The advertisement mode to be used by the Load Balancer (<literal>address</literal> uses the L2 implementation), as well as the address to be used (replacing the <literal>${EDGE_VIP_ADDRESS}</literal> with the <literal>VIP</literal> address).
es: El modo de anuncios que utilizará el equilibrador de carga (en <literal>address</literal> se usa la implementación L2), así como la dirección que se va a usar (sustituyendo <literal>${EDGE_VIP_ADDRESS}</literal> por la dirección <literal>IP virtual</literal>).
ja: ロードバランサで使用するアドバタイズモード(<literal>address</literal>ではL2実装を使用)、および使用するアドレス(<literal>${EDGE_VIP_ADDRESS}</literal>を<literal>VIP</literal>アドレスに置き換え)。
pt_br: O modo de anúncio usado pelo balanceador de carga (<literal>address</literal> usa a implementação L2) e o endereço que será usado (substituindo o <literal>${EDGE_VIP_ADDRESS}</literal> pelo endereço <literal>VIP</literal>).
zh_cn: 负载平衡器要使用的通告模式（<literal>address</literal> 使用 L2 实现），以及要使用的地址（请将 <literal>${EDGE_VIP_ADDRESS}</literal> 替换为 <literal>VIP</literal> 地址）。

source: The <literal>serverConfig</literal> with the <literal>CNI</literal> plug-in to be used (in this case, <literal>Cilium</literal>), and the additional <literal>VIP</literal> address(es) and name(s) to be listed under <literal>tlsSan</literal>.
es: El <literal>serverConfig</literal> con el complemento de <literal>CNI</literal> que se va a usar (en este caso, <literal>Cilium</literal>) y las direcciones <literal>IP virtuales</literal> y nombres que se van a usar en <literal>tlsSan</literal>.
ja: 使用する<literal>CNI</literal>プラグイン(ここでは<literal>Cilium</literal>)と、<literal>tlsSan</literal>の下にリストされる追加の <literal>VIP</literal>アドレスと名前が含まれる<literal>serverConfig</literal>。
zh_cn: <literal>serverConfig</literal> 包含要使用的 <literal>CNI</literal> 插件（本示例中为 <literal>Cilium</literal>），以及要在 <literal>tlsSan</literal> 下列出的额外 <literal>VIP</literal> 地址和名称。

source: The agentConfig block contains the <literal>Ignition</literal> format to be used and the <literal>additionalUserData</literal> to be used to configure the <literal>RKE2</literal> node with information like:
es: El bloque agentConfig contiene el formato de <literal>Ignition</literal> que se va a usar y el bloque <literal>additionalUserData</literal> que se va a usar para configurar el nodo <literal>RKE2</literal> con información como:
ja: agentConfigブロックには、使用する<literal>Ignition</literal>の形式と、<literal>RKE2</literal>ノードに次のような情報を設定するために使用する<literal>additionalUserData</literal>が含まれています。
pt_br: O bloco agentConfig inclui o formato usado do <literal>Ignition</literal> e o <literal>additionalUserData</literal> usado para configurar o nó <literal>RKE2</literal> com informações como:
zh_cn: agentConfig 块包含要使用的 <literal>Ignition</literal> 格式以及用于配置 <literal>RKE2</literal> 节点的 <literal>additionalUserData</literal>，其中的信息如下：

source: The systemd service named <literal>rke2-preinstall.service</literal> to replace automatically the <literal>BAREMETALHOST_UUID</literal> and <literal>node-name</literal> during the provisioning process using the Ironic information.
es: El servicio systemd denominado <literal>rke2-preinstall.service</literal> que sustituye automáticamente a <literal>BAREMETALHOST_UUID</literal> y <literal>node-name</literal> durante el proceso de aprovisionamiento con la información de Ironic.
ja: プロビジョニングプロセス中にIronicの情報を使用して<literal>BAREMETALHOST_UUID</literal>と<literal>node-name</literal>を自動的に置き換える、<literal>rke2-preinstall.service</literal>という名前のsystemdサービス。
pt_br: O serviço systemd chamado <literal>rke2-preinstall.service</literal> para substituir automaticamente o <literal>BAREMETALHOST_UUID</literal> e o <literal>node-name</literal> durante o processo de provisionamento com as informações do Ironic.
zh_cn: 名为 <literal>rke2-preinstall.service</literal> 的 systemd 服务，用于在置备过程中使用 Ironic 信息自动替换 <literal>BAREMETALHOST_UUID</literal> 和 <literal>node-name</literal>。

source: The <literal>storage</literal> block which contains the Helm charts to be used to install the <literal>MetalLB</literal> and the <literal>endpoint-copier-operator</literal>.
es: El bloque <literal>storage</literal> que contiene los charts de Helm que se van a usar para instalar <literal>MetalLB</literal> y <literal>endpoint-copier-operator</literal>.
ja: <literal>MetalLB</literal>と<literal>endpoint-copier-operator</literal>のインストールに使用するHelmチャートが含まれている<literal>storage</literal>ブロック。
pt_br: O bloco <literal>storage</literal> que contém os gráficos Helm que serão usados para instalar o <literal>MetalLB</literal> e o <literal>endpoint-copier-operator</literal>.
zh_cn: <literal>storage</literal> 块，其中包含用于安装 <literal>MetalLB</literal> 和 <literal>endpoint-copier-operator</literal> 的 Helm chart。

source: The <literal>metalLB</literal> custom resource file with the <literal>IPaddressPool</literal> and the <literal>L2Advertisement</literal> to be used (replacing <literal>${EDGE_VIP_ADDRESS_IPV4}</literal> with the <literal>VIP</literal> address).
es: El archivo de recurso personalizado de <literal>metalLB</literal> con el <literal>IPaddressPool</literal> y el <literal>L2Advertisement</literal> que se van a usar (sustituyendo <literal>${EDGE_VIP_ADDRESS_IPV4}</literal> por la dirección <literal>IP virtual</literal>).
ja: 使用する<literal>IPaddressPool</literal>と<literal>L2Advertisement</literal>が含まれている<literal>metalLB</literal>カスタムリソースファイル(<literal>${EDGE_VIP_ADDRESS_IPV4}</literal>を<literal>VIP</literal>アドレスに置き換え)。
zh_cn: <literal>metalLB</literal> 自定义资源文件包含要使用的 <literal>IPaddressPool</literal> 和 <literal>L2Advertisement</literal>（请将 <literal>${EDGE_VIP_ADDRESS_IPV4}</literal> 替换为 <literal>VIP</literal> 地址）。

source: The <literal>endpoint-svc.yaml</literal> file to be used to configure the <literal>kubernetes-vip</literal> service to be used by the <literal>MetalLB</literal> to manage the <literal>VIP</literal> address.
es: El archivo <literal>endpoint-svc.yaml</literal> que se va a usar para configurar el servicio <literal>kubernetes-vip</literal> que utilizará <literal>MetalLB</literal> para gestionar la dirección <literal>IP virtual</literal>.
ja: <literal>MetalLB</literal>が<literal>VIP</literal>アドレスを管理するために使用する<literal>kubernetes-vip</literal>サービスの設定に使用する<literal>endpoint-svc.yaml</literal>ファイル。
pt_br: O arquivo <literal>endpoint-svc.yaml</literal> que será usado para configurar o serviço <literal>kubernetes-vip</literal> usado pelo <literal>MetalLB</literal> para gerenciar o endereço <literal>VIP</literal>.
zh_cn: 用于配置 <literal>kubernetes-vip</literal> 服务的 <literal>end-svc.yaml</literal> 文件，<literal>MetalLB</literal> 使用该服务来管理 <literal>VIP</literal> 地址。

source: The last block of information contains the Kubernetes version to be used. The <literal>${RKE2_VERSION}</literal> is the version of <literal>RKE2</literal> to be used replacing this value (for example, <literal>v1.33.3+rke2r1</literal>).
es: El último bloque de información contiene la versión de Kubernetes que se va a usar. <literal>${RKE2_VERSION}</literal> es la versión de <literal>RKE2</literal> que se va a usar en sustitución de este valor (por ejemplo, <literal>v1.33.3+rke2r1</literal>).
ja: 最後の情報ブロックには、使用するKubernetesバージョンが含まれています。<literal>${RKE2_VERSION}</literal>は使用する<literal>RKE2</literal>のバージョンで、この値は置き換えます(例: <literal>v1.33.3+rke2r1</literal>)。
zh_cn: 最后一部分信息包含要使用的 Kubernetes 版本。<literal>${RKE2_VERSION}</literal> 是要使用的 <literal>RKE2</literal> 版本，需替换此值（例如替换为 <literal>v1.33.3+rke2r1</literal>）。

source: The <literal>image</literal> to be used as a reference to the image generated using <literal>EIB</literal> on the previous section (<xref linkend="eib-edge-image-connected"/>), and <literal>checksum</literal> and <literal>checksumType</literal> to be used to validate the image.
es: La imagen (<literal>image</literal>) que se va a usar como referencia para la imagen generada con <literal>EIB</literal> en la sección anterior (<xref linkend="eib-edge-image-connected"/>), y la suma de comprobación (<literal>checksum</literal>) y el tipo de suma (<literal>checksumType</literal>) que se van a usar para validar la imagen.
ja: 前のセクション(<xref linkend="eib-edge-image-connected"/>)で<literal>EIB</literal>を使用して生成されたイメージへの参照として使用する<literal>image</literal>、およびそのイメージを検証するために使用する<literal>checksum</literal>と<literal>checksumType</literal>。
pt_br: A <literal>image</literal> que será usada como referência à imagem gerada pelo <literal>EIB</literal> na seção anterior (<xref linkend="eib-edge-image-connected"/>), e o <literal>checksum</literal> e o <literal>checksumType</literal> usados para validar a imagem.
zh_cn: <literal>image</literal>，用作对上一节（<xref linkend="eib-edge-image-connected"/>）中使用 <literal>EIB</literal> 生成的映像的引用；<literal>checksum</literal> 和 <literal>checksumType</literal>，用于验证映像。

source: The following yaml files are an example configuration for the worker nodes.
es: Los archivos yaml siguientes son una configuración de ejemplo para los nodos de trabajador.
ja: 以下のyamlファイルは、ワーカーノードの設定例です。
zh_cn: 以下 YAML 文件是工作节点的示例配置。

source: A <literal>MachineDeployment</literal>:
es: Uno de tipo <literal>MachineDeployment</literal>:
ja: <literal>MachineDeployment</literal>:
zh_cn: 一个 <literal>MachineDeployment</literal>：

source: The RKE2ConfigTemplate` object specifies the configuration template to be used for multinode cluster worker nodes.
es: El objeto RKE2ConfigTemplate especifica la plantilla de configuración que se debe usar para nodos de trabajador de un clúster de varios nodos.
ja: RKE2ConfigTemplateオブジェクトには、マルチノードクラスタのワーカーノードに使用する設定テンプレートを指定します。
zh_cn: `RKE2ConfigTemplate` 对象指定要用于多节点群集工作节点的配置模板。

source: The <literal>Metal3MachineTemplate</literal> object contain references to <literal>dataTemplate</literal>, <literal>hostSelector</literal>, and <literal>image</literal> for the worker nodes:
es: El objeto <literal>Metal3MachineTemplate</literal> contiene referencias a <literal>dataTemplate</literal>, <literal>hostSelector</literal> y <literal>image</literal> para los nodos de trabajador:
ja: <literal>Metal3MachineTemplate</literal>オブジェクトには、ワーカーノードの<literal>dataTemplate</literal>、<literal>hostSelector</literal>、<literal>image</literal>への参照が含まれています。
zh_cn: <literal>Metal3MachineTemplate</literal> 对象包含工作节点的 <literal>dataTemplate</literal>、<literal>hostSelector</literal> 和 <literal>image</literal> 相关引用：

source: The <literal>Metal3DataTemplate</literal> object specifies the <literal>metaData</literal> for the downstream cluster for the worker nodes:
es: El objeto <literal>Metal3DataTemplate</literal> especifica los <literal>metaData</literal> para el clúster descendente para los nodos de trabajador:
ja: <literal>Metal3DataTemplate</literal>オブジェクトには、ワーカーノードのダウンストリームクラスタの<literal>metaData</literal>を指定します。
zh_cn: <literal>Metal3DataTemplate</literal> 对象指定下游群集工作节点的 <literal>metaData</literal>：

source: Once the file is created by joining the previous blocks, run the following command in the management cluster to start provisioning the new three bare-metal hosts:
es: Una vez creado el archivo uniendo los bloques anteriores, ejecute el comando siguiente en el clúster de gestión para iniciar el aprovisionamiento de los tres nuevos hosts bare metal:
ja: 前のブロックを結合してファイルが作成されたら、管理クラスタで次のコマンドを実行し、新しい3つのベアメタルホストのプロビジョニングを開始します。
zh_cn: 合并上述各部分创建文件后，在管理群集中运行以下命令，开始置备三个新的裸机主机：

source: Advanced Network Configuration
es: Configuración de red avanzada
ja: 高度なネットワーク設定
pt_br: Configuração avançada de rede
zh_cn: 高级网络配置

source: The directed network provisioning workflow allows for specific network configurations in downstream clusters, such as static IPs, bonding, VLANs, IPv6, etc.
es: El flujo de trabajo de aprovisionamiento de red dirigida permite configuraciones de red específicas en clústeres descendentes, como direcciones IP estáticas, vinculación, VLAN, IPv6, etc.
ja: ダイレクトネットワークプロビジョニングワークフローを使用すると、静的IP、ボンディング、VLAN、IPv6など、ダウンストリームクラスタの特定のネットワーク設定が可能になります。
pt_br: O fluxo de trabalho de provisionamento de rede direcionado permite fazer configurações de rede específicas nos clusters downstream, como IPs estáticos, vínculo, VLANs, IPv6 etc.
zh_cn: 定向网络置备工作流程允许在下游群集中使用静态 IP、绑定、VLAN 等网络配置。

source: The following sections describe the additional steps required to enable provisioning downstream clusters using advanced network configuration.
es: Las secciones siguientes describen los pasos adicionales necesarios para habilitar el aprovisionamiento de clústeres descendentes con el método de configuración de red avanzada.
ja: 次の各セクションでは、高度なネットワーク設定を使用してダウンストリームクラスタをプロビジョニングできるようにするために必要な追加手順について説明します。
pt_br: As seções a seguir descrevem as etapas adicionais necessárias para permitir o provisionamento de clusters downstream usando a configuração de rede avançada.
zh_cn: 以下章节将介绍使用高级网络配置置备下游群集需额外执行的步骤。

source: The image generated using <literal>EIB</literal> has to include the network folder and the script following this section (<xref linkend="add-network-eib"/>).
es: La imagen generada con <literal>EIB</literal> debe incluir la carpeta de red y el guion de esta sección (<xref linkend="add-network-eib"/>).
ja: このセクション(<xref linkend="add-network-eib"/>)に従って、<literal>EIB</literal>を使用して生成したイメージにネットワークフォルダとスクリプトを含める必要があります。
pt_br: A imagem gerada pelo <literal>EIB</literal> deve incluir a pasta de rede e o script, de acordo com as instruções nesta seção (<xref linkend="add-network-eib"/>).
zh_cn: 使用 <literal>EIB</literal> 生成的映像必须包含<xref linkend="add-network-eib"/>一节中所述的 network 文件夹和脚本。

source: <emphasis role="strong">Configuration</emphasis>
es: <emphasis role="strong">Configuración</emphasis>
ja: <emphasis role="strong">設定</emphasis>
pt_br: <emphasis role="strong">Configuração</emphasis>
zh_cn: <emphasis role="strong">配置</emphasis>

source: Before proceeding refer to one of the following sections for guidance on the steps required to enroll and provision the host(s):
es: Antes de continuar, consulte en las secciones siguientes los pasos necesarios para inscribir y aprovisionar los hosts:
ja: 続行する前に、ホストの登録およびプロビジョニングに必要な手順に関するガイダンスについて、次のいずれかのセクションを参照してください。
pt_br: Antes de continuar, consulte uma das seções a seguir para obter orientação sobre as etapas necessárias para registrar e provisionar os hosts:
zh_cn: 在继续操作之前，请参考以下章节，了解登记和置备主机所需执行的步骤：

source: Downstream cluster provisioning with Directed network provisioning (single-node) (<xref linkend="single-node"/>)
es: Aprovisionamiento de clústeres descendentes con aprovisionamiento de red dirigida (nodo único) (<xref linkend="single-node"/>)
ja: ダイレクトネットワークプロビジョニングを使用したダウンストリームクラスタのプロビジョニング(シングルノード) (<xref linkend="single-node"/>)
pt_br: Provisionamento de cluster downstream com provisionamento de rede direcionado (nó único) (<xref linkend="single-node"/>)
zh_cn: 使用定向网络置备来置备下游群集（单节点）（<xref linkend="single-node"/>）

source: Downstream cluster provisioning with Directed network provisioning (multi-node) (<xref linkend="multi-node"/>)
es: Aprovisionamiento de clústeres descendentes con aprovisionamiento de red dirigida (varios nodos) (<xref linkend="multi-node"/>)
ja: ダイレクトネットワークプロビジョニングを使用したダウンストリームクラスタのプロビジョニング(マルチノード) (<xref linkend="multi-node"/>)
pt_br: Provisionamento de cluster downstream com provisionamento de rede direcionado (vários nós) (<xref linkend="multi-node"/>)
zh_cn: 使用定向网络置备来置备下游群集（多节点）（<xref linkend="multi-node"/>）

source: Any advanced network configuration must be applied at enrollment time through the <literal>BareMetalHost</literal> host definition and an associated Secret containing an <literal>nmstate</literal> formatted <literal>networkData</literal> block. The following example file defines a secret containing the required <literal>networkData</literal> that requests a static <literal>IP</literal> and <literal>VLAN</literal> for the downstream cluster host:
es: Cualquier configuración de red avanzada debe aplicarse en el momento de la inscripción mediante la definición de host <literal>BareMetalHost</literal> y un secreto asociado que contenga un bloque <literal>networkData</literal> con formato <literal>nmstate</literal>. El siguiente archivo de ejemplo define un secreto que contiene el bloque <literal>networkData</literal> necesario que solicita una <literal>IP</literal> estática y una <literal>VLAN</literal> para el host del clúster descendente:
ja: 高度なネットワーク設定は、登録時に<literal>BareMetalHost</literal>ホスト定義および<literal>nmstate</literal>形式の<literal>networkData</literal>ブロックを含む関連するシークレットを通じて適用する必要があります。次のサンプルファイルは、ダウンストリームクラスタホストに静的<literal>IP</literal>と<literal>VLAN</literal>を要求する、必須の<literal>networkData</literal>を含むシークレットを定義しています。
pt_br: É necessário aplicar uma configuração de rede avançada no momento do registro por meio de uma definição do host <literal>BareMetalHost</literal> e um segredo associado que contém um bloco <literal>networkData</literal> no formato <literal>nmstate</literal>. O arquivo de exemplo a seguir define um segredo com o <literal>networkData</literal> necessário que solicita um <literal>IP</literal> estático e a <literal>VLAN</literal> para o host do cluster downstream:
zh_cn: 任何高级网络配置都必须在登记时通过 <literal>BareMetalHost</literal> 主机定义以及包含 <literal>nmstate</literal> 格式 <literal>networkData</literal> 块的关联机密来应用。以下示例文件定义了一个包含所需 <literal>networkData</literal> 的机密，该机密会为下游群集主机请求静态 <literal>IP</literal> 和 <literal>VLAN</literal>：

source: As you can see, the example shows the configuration to enable the interface with static IPs, as well as the configuration to enable the VLAN using the base interface, once the following variables are replaced with the actual values, according to your infrastructure:
es: Como puede ver, el ejemplo muestra la configuración para habilitar la interfaz con direcciones IP estáticas, así como la configuración para habilitar la VLAN utilizando la interfaz base, una vez que las siguientes variables se sustituyan por los valores reales de su infraestructura:
ja: ご覧のとおり、この例は、静的IPを使用してインタフェースを有効にするための設定と、ベースインタフェースを使用してVLANを有効にするための設定を示しています。インフラストラクチャに応じて、以下の変数を実際の値に置き換えてください。
pt_br: Como você pode ver, o exemplo mostra a configuração para habilitar a interface com os IPs estáticos e a VLAN usando a interface base, depois que as seguintes variáveis são substituídas pelos valores reais, de acordo com a sua infraestrutura:
zh_cn: 如您所见，该示例展示了启用配备静态 IP 的接口的配置，以及使用基础接口启用 VLAN 的配置，在实际应用时，需根据您的基础架构将以下变量替换为实际值：
