Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Certificates issues when booting the hosts with IPA</emphasis>: Some server vendors verify the SSL connection when attaching virtual-media ISO images to the BMC, which can cause a problem because the generated certificates for the Metal3 deployment are self-signed. It can happen that the host is being booted but it drops to an UEFI shell. See Disabling TLS for virtualmedia ISO attachment (<xref linkend="disabling-tls-for-virtualmedia-iso-attachment"/>) on how to fix it.
es: <emphasis role="strong">Problemas con los certificados al arrancar los hosts con IPA</emphasis>: algunos proveedores de servidores verifican la conexión SSL al conectar imágenes ISO de medios virtuales al BMC, lo que puede causar un problema porque los certificados generados para el despliegue de Metal3 son autofirmados. Puede ocurrir que el host se esté arrancando, pero caiga a una shell UEFI. Consulte la sección sobre cómo inhabilitar TLS para la conexión de ISO de medios virtuales (<xref linkend="disabling-tls-for-virtualmedia-iso-attachment"/>) para averiguar cómo solucionar este problema.
ja: <emphasis role="strong">IPAを使用したホストの起動時に証明書の問題が発生する</emphasis>: 一部のサーバベンダは仮想メディアISOイメージをBMCにアタッチする際にSSL接続を確認します。このため、Metal3デプロイメント用に生成された証明書が自己署名されているために、問題が発生する可能性があります。ホストが起動中であるにもかかわらずUEFIシェルに切り替わってしまう可能性があります。この問題の解決方法については、「仮想メディアISOをアタッチするためのTLSの無効化」(<xref linkend="disabling-tls-for-virtualmedia-iso-attachment"/>)を参照してください。
pt_br: <emphasis role="strong">Problemas no certificado ao inicializar os hosts com IPA</emphasis>: alguns fornecedores de servidor verificam a conexão SSL ao anexar imagens ISO de mídia virtual ao BMC, o que pode causar um problema porque os certificados gerados para a implantação do Metal3 são autoassinados. É possível que o host seja inicializado, mas acabe entrando em um shell UEFI. Consulte Desabilitando TLS para anexo de ISO de mídia virtual (<xref linkend="disabling-tls-for-virtualmedia-iso-attachment"/>) para saber como corrigir isso.
zh_cn: <emphasis role="strong">使用 IPA 引导主机时的证书问题</emphasis>：某些服务器供应商在将虚拟媒体 ISO 映像挂接到 BMC 时会验证 SSL 连接，这可能导致出现问题，因为针对 Metal3 部署生成的证书是自我签名证书。在这种情况下，主机在引导时可能会回退到 UEFI 外壳。请参见<xref linkend="disabling-tls-for-virtualmedia-iso-attachment"/>了解如何解决此问题。

source: <emphasis role="strong">Wrong name or label reference</emphasis>: If the cluster references a node by the wrong name or label, the cluster results as deployed but the BMH remains as “Available”. Double-check the references on the involved objects for the BMHs.
es: <emphasis role="strong">Referencia de nombre o etiqueta incorrecta</emphasis>: si el clúster hace referencia a un nodo con un nombre o etiqueta incorrectos, el clúster se despliega correctamente, pero el BMH permanece con el estado "Available" (Disponible). Compruebe bien las referencias de los objetos involucrados para los BMH.
ja: <emphasis role="strong">間違った名前またはラベル参照</emphasis>: クラスタが間違った名前またはラベルでノードを参照する場合、クラスタはデプロイ済みと表示されますが、BMHは「使用可能」のままとなります。BMHに関連するオブジェクトの参照を再確認します。
pt_br: <emphasis role="strong">Referência a nome ou rótulo incorreto</emphasis>: se o cluster faz referência ao nome ou rótulo incorreto de um nó, ele aparece como implantado, mas o BMH continua como "Disponível". Revise as referências nos objetos envolvidos dos BMHs.
zh_cn: <emphasis role="strong">名称或标签引用错误</emphasis>：如果群集通过错误的名称或标签引用节点，群集可能显示为已部署，但 BMH 仍处于“可用”状态。请仔细检查 BMH 关联对象的引用。

source: <emphasis role="strong">BMC communication issues</emphasis>: Ensure the Metal<superscript>3</superscript> pods running on the management cluster can reach the BMC of the hosts being provisioned (usually the BMC network is very restricted).
es: <emphasis role="strong">Problemas de comunicación de BMC</emphasis>: asegúrese de que los pods de Metal<superscript>3</superscript> que se ejecutan en el clúster de gestión puedan acceder al BMC de los hosts que se están aprovisionando (normalmente, la red de BMC está muy restringida).
ja: <emphasis role="strong">BMC通信の問題</emphasis>: 管理クラスタ上で実行されているMetal<superscript>3</superscript> Podがプロビジョニング中のホストのBMCにアクセスできることを確認します(通常BMCネットワークは非常に制限されています)。
pt_br: <emphasis role="strong">Problemas na comunicação com o BMC</emphasis>: certifique-se de que os pods do Metal<superscript>3</superscript> executados no cluster de gerenciamento possam acessar o BMC dos hosts que estão sendo provisionados (normalmente, a rede do BMC é muito restrita).
zh_cn: <emphasis role="strong">BMC 通信问题</emphasis>：确保管理群集上运行的 Metal<superscript>3</superscript> Pod 能够访问待置备主机的 BMC（通常 BMC 网络的限制极为严格）。

source: <emphasis role="strong">Incorrect bare metal host state</emphasis>: The BMH object goes to different states (inspecting, preparing, provisioned, etc.) during its lifetime <link xl:href="https://book.metal3.io/bmo/state_machine">Lifetime of State machine</link>. If detected an incorrect state, check the <literal>status</literal> field of the BMH object as it contains more information as <literal>kubectl get bmh &lt;name&gt; -o jsonpath=’{.status}’| jq</literal>.
es: <emphasis role="strong">Estado incorrecto del host bare metal</emphasis>: el objeto BMH pasa por diferentes estados (inspección, preparación, aprovisionamiento, etc.) durante su ciclo de vida <link xl:href="https://book.metal3.io/bmo/state_machine">Lifestyle of State machine</link> (Ciclo de vida de la máquina de estados). Si se detecta un estado incorrecto, compruebe el campo <literal>status</literal> del objeto BMH, ya que contiene más información, como <literal>kubectl get bmh &lt;nombre&gt; -o jsonpath=’{.status}’| jq</literal>.
ja: <emphasis role="strong">不正なベアメタルホストの状態</emphasis>: BMHオブジェクトは、 その存続期間中にさまざまな状態(検査中、準備中、プロビジョニング済みなど)に移行します(<link xl:href="https://book.metal3.io/bmo/state_machine">存続期間中のマシンの状態</link>)。不正な状態が検出された場合は、BMHオブジェクトの<literal>status</literal>フィールドを確認してください。このフィールドには<literal>kubectl get bmh &lt;name&gt; -o jsonpath=’{.status}’| jq</literal>のような詳細情報が含まれています。
pt_br: <emphasis role="strong">Estado do host bare metal incorreto</emphasis>: o objeto BMH passa por diferentes estados (inspeção, preparação, provisionamento etc.) durante seu ciclo de vida <link xl:href="https://book.metal3.io/bmo/state_machine">Ciclo de vida da máquina de estado</link> (em inglês). Se for detectado um estado incorreto, verifique o campo <literal>status</literal> do objeto BMH, pois ele contém mais informações, como <literal>kubectl get bmh &lt;nome&gt; -o jsonpath=’{.status}’| jq</literal>.
zh_cn: <emphasis role="strong">裸机主机状态不正确</emphasis>：BMH 对象在其生命周期（<link xl:href="https://book.metal3.io/bmo/state_machine">状态机流转过程</link>）中会经历不同状态（正在检查、正在准备、已置备等）。如果检测到状态不正确，请使用以下命令检查 BMH 对象的 <literal>status</literal> 字段以获取更多信息：<literal>kubectl get bmh &lt;name&gt; -o jsonpath=’{.status}’| jq</literal>。

source: <emphasis role="strong">Host not being deprovisioned</emphasis>: In the event of a host being intended to be deprovisioned fails, the removal can be attempted after adding the “detached” annotation to the BMH object as: <literal>kubectl annotate bmh/&lt;BMH&gt; baremetalhost.metal3.io/detached=””</literal>.
es: <emphasis role="strong">El host no se ha desaprovisionado</emphasis>: en caso de que falle el desaprovisionamiento de un host, se puede intentar eliminarlo después de añadir la anotación "detached" al objeto BMH de la siguiente manera: <literal>kubectl annotate bmh/&lt;BMH&gt; baremetalhost.metal3.io/detached=””</literal>.
ja: <emphasis role="strong">ホストがプロビジョニング解除されない</emphasis>: プロビジョニング解除しようとしていたホストが失敗した場合、BMHオブジェクトに次のように「detached」アノテーションを追加すると削除を試行できます: <literal>kubectl annotate bmh/&lt;BMH&gt; baremetalhost.metal3.io/detached=””</literal>。
pt_br: <emphasis role="strong">O host não é provisionado</emphasis>: em caso de falha no desprovisionamento de um host, é possível tentar removê-lo depois de adicionar a anotação "detached" ao objeto BMH desta forma: <literal>kubectl annotate bmh/&lt;BMH&gt; baremetalhost.metal3.io/detached=””</literal>.
zh_cn: <emphasis role="strong">主机无法取消置备</emphasis>：如果主机取消置备失败，可尝试为 BMH 对象添加“detached”注解后再尝试去除，具体命令为 <literal>kubectl annotate bmh/&lt;BMH&gt; baremetalhost.metal3.io/detached=””</literal>。

source: <emphasis role="strong">Image errors</emphasis>: Verify the image being built with EIB for the downstream cluster is available, has a proper checksum and it is not too large to decompress or too large for disk.
es: <emphasis role="strong">Errores de imagen</emphasis>: compruebe que la imagen que se está creando con EIB para el clúster descendente esté disponible, tenga una suma de comprobación correcta y no sea demasiado grande para descomprimirla ni para el disco.
ja: <emphasis role="strong">イメージエラー</emphasis>: ダウンストリームクラスタに対してEIBを使用して構築されるイメージが使用可能であり、適切なチェックサムがあり、解凍するには大きすぎない、またはディスクに対して大きすぎないことを確認します。
pt_br: <emphasis role="strong">Erros na imagem</emphasis>: verifique se a imagem que está sendo criada com o EIB para o cluster downstream está disponível, tem um checksum apropriado e não é grande demais para descompactar ou para o disco.
zh_cn: <emphasis role="strong">映像错误</emphasis>：验证通过 EIB 为下游群集构建的映像是否可用、是否具有正确的校验和，且其大小不会导致解压失败或超出磁盘容量。

source: <emphasis role="strong">Disk size mismatch</emphasis>: By default, the disk would not expand to fill the whole disk. As explained in the Growfs script (<xref linkend="growfs-script"/>) section, a growfs script needs to be included in the image being built with EIB for the downstream cluster hosts.
es: <emphasis role="strong">Discrepancia en el tamaño del disco</emphasis>: de forma predeterminada, el disco no se expandirá hasta ocupar todo el espacio disponible. Como se explica en la sección del guion Growfs (<xref linkend="growfs-script"/>), es necesario incluir un guion growfs en la imagen que se está creando con EIB para los hosts del clúster descendente.
ja: <emphasis role="strong">ディスクサイズの不一致</emphasis>: デフォルトでは、全ディスクを満たすようにディスクは拡張されません。「Growfsスクリプト」(<xref linkend="growfs-script"/>)セクションで説明しているように、ダウンストリームクラスタホスト用にEIBで構築されるイメージにはgrowfsスクリプトを含める必要があります。
pt_br: <emphasis role="strong">Incompatibilidade de tamanho de disco</emphasis>: por padrão, o disco não expande até se preencher por completo. Conforme explicado na seção do script growfs (<xref linkend="growfs-script"/>), é necessário incluir um script growfs na imagem que está sendo criada com o EIB para os hosts de cluster downstream.
zh_cn: <emphasis role="strong">磁盘大小不匹配</emphasis>：默认情况下，磁盘不会自动扩容至其最大容量。如<xref linkend="growfs-script"/>所述，通过 EIB 为下游群集主机构建映像时，需要包含一个 growfs 脚本。

source: <emphasis role="strong">Cleaning process stuck</emphasis>: The cleaning process is retried several times. If due to a problem with the host cleaning is no longer possible, disable cleaning first by setting the <literal>automatedCleanMode</literal> field to <literal>disabled</literal> on the BMH object.
es: <emphasis role="strong">Proceso de limpieza bloqueado</emphasis>: el proceso de limpieza se reintenta varias veces. Si debido a un problema con el host ya no es posible realizar la limpieza, inhabilite primero la limpieza definiendo en el campo <literal>automatedCleanMode</literal> el valor <literal>disabled</literal> en el objeto BMH.
ja: <emphasis role="strong">クリーニングプロセスの停止</emphasis>: クリーニングプロセスは数回再試行されます。ホストの問題によりクリーニングができなくなった場合は、まず、BMHオブジェクトの<literal>automatedCleanMode</literal>フィールドを<literal>disabled</literal>に設定してクリーニングを無効にします。
pt_br: <emphasis role="strong">Processo de limpeza travado</emphasis>: o processo de limpeza é repetido várias vezes. Se a limpeza não for mais possível devido a um problema com o host, desabilite primeiro a limpeza definindo o campo <literal>automatedCleanMode</literal> como <literal>disabled</literal> no objeto BMH.
zh_cn: <emphasis role="strong">清理过程卡住</emphasis>：清理过程会重试多次。如果由于主机问题导致清理过程无法继续，需要先将 BMH 对象的 <literal>automatedCleanMode</literal> 字段设置为 <literal>disabled</literal>，以禁用清理功能。

source: It is not recommended to manually remove the finalizer when the cleaning process is taking longer than desired or is failing. Doing so, removes the host record from Kubernetes but leave it in Ironic. The currently running action continues in the background, and an attempt to add the host again may fail because of the conflict.
es: No se recomienda eliminar manualmente el finalizador cuando el proceso de limpieza tarda más de lo deseado o falla. Si se hiciera, se eliminaría el registro del host de Kubernetes, pero se dejaría en Ironic. La acción que se está ejecutando actualmente continuaría en segundo plano, y es posible que el intento de volver a añadir el host fallara debido al conflicto.
ja: クリーニングプロセスに必要以上に時間がかかっている、または失敗している場合は、ファイナライザを手動で削除することは推奨されません。手動で削除すると、Kubernetesからホストレコードが削除されますが、Ironicには残ります。現在実行中のアクションはバックグラウンドで続行されるため、ホストを再度追加しようとすると競合により失敗する可能性があります。
pt_br: Não é recomendado remover manualmente o finalizador quando o processo de limpeza está falhando ou levando mais tempo do que o desejado. Se você fizer isso, o registro do host será removido do Kubernetes, mas ficará no Ironic. A ação executada no momento continua em segundo plano, e a tentativa de adicionar o host novamente pode falhar devido ao conflito.
zh_cn: 当清理过程耗时过长或失败时，不建议手动去除终结器。这样做会从 Kubernetes 中去除主机记录，但会在 Ironic 中残留该记录。后台当前运行的操作会继续，再次添加主机时可能会因发生冲突而失败。

source: <emphasis role="strong">Metal3/Rancher Turtles/CAPI pods issues</emphasis>: The deployment flow for all the required components is:
es: <emphasis role="strong">Problemas en los pods de Metal3/Rancher Turtles/CAPI</emphasis>: el flujo de despliegue para todos los componentes necesarios es:
ja: <emphasis role="strong">Metal3/Rancher Turtles/CAPI Podの問題</emphasis>: すべての必要なコンポーネントのデプロイメントフローは次のとおりです。
pt_br: <emphasis role="strong">Problemas nos pods do Metal3/Rancher Turtles/CAPI</emphasis>: o fluxo de implantação de todos os componentes obrigatórios é:
zh_cn: <emphasis role="strong">Metal3/Rancher Turtles/CAPI Pod 问题</emphasis>：所有必需组件的部署流程如下：

source: The Rancher Turtles controller deploys the CAPI operator controller.
es: El controlador de Rancher Turtles despliega el controlador del operador de CAPI.
ja: Rancher TurtlesコントローラはCAPIオペレータコントローラをデプロイします。
pt_br: O controlador Rancher Turtles implanta o controlador do operador CAPI.
zh_cn: Rancher Turtles 控制器部署 CAPI 操作器控制器。

source: The CAPI operator controller then deploys the provider controllers (CAPI core, CAPM3 and RKE2 controlplane/bootstrap).
es: A continuación, el controlador del operador de CAPI despliega los controladores del proveedor (plano de control/arranque del núcleo de CAPI, CAPM3 y RKE2).
ja: 次に、CAPIオペレータコントローラはプロバイダコントローラ(CAPIコア、CAPM3、およびRKE2コントロールプレーン/ブートストラップ)をデプロイします。
pt_br: O controlador do operador CAPI depois implanta os controladores do provedor (núcleo CAPI, CAPM3 e plano de controle/inicialização RKE2).
zh_cn: CAPI 操作器控制器随后部署提供程序控制器（CAPI 核心、CAPM3 和 RKE2 控制平面/引导组件）。

source: Verify all the pods are running correctly and check the logs otherwise.
es: Compruebe que todos los pods funcionen correctamente y, si no fuera así, revise los registros.
ja: すべてのPodが正常に実行されていることを確認し、そうでない場合はログを確認します。
pt_br: Verifique se todos os pods estão sendo executados corretamente e consulte os registos caso não estejam.
zh_cn: 验证所有 Pod 是否正常运行，若非如此，请检查日志。

source: <emphasis role="strong">Metal<superscript>3</superscript> logs</emphasis>:Check logs for the different pods.
es: <emphasis role="strong">Registros de Metal<superscript>3</superscript></emphasis>: consulte los registros de los distintos pods.
ja: <emphasis role="strong">Metal<superscript>3</superscript>ログ</emphasis>: さまざまなPodのログを確認します。
pt_br: <emphasis role="strong">Registros do Metal<superscript>3</superscript></emphasis>: consulte os registros dos diferentes pods.
zh_cn: <emphasis role="strong">Metal<superscript>3</superscript> 日志</emphasis>：检查不同 Pod 的日志。

source: The metal3-ironic pod contains at least 4 different containers (<literal>ironic-httpd</literal>,` ironic-log-watch`, <literal>ironic</literal> &amp; <literal>ironic-ipa-downloader</literal> (init)) on the same pod. Use the <literal>-c</literal> flag when using <literal>kubectl logs</literal> to verify the logs of each of the containers.
es: El pod metal3-ironic contiene al menos 4 contenedores distintos (<literal>ironic-httpd</literal>,` ironic-log-watch`, <literal>ironic</literal> e <literal>ironic-ipa-downloader</literal> (init)) en el mismo pod. Use el indicador <literal>-c</literal> cuando utilice <literal>kubectl logs</literal> para verificar los registros de cada contenedor.
ja: metal3-ironic Podには、少なくとも4つの異なるコンテナ(<literal>ironic-httpd</literal>、「 ironic-log-watch」、 <literal>ironic</literal> 、<literal>ironic-ipa-downloader</literal> (init))が同じPod上に含まれています。<literal>kubectlログ</literal>を使用する場合は<literal>-c</literal>フラグを指定して、各コンテナのログを確認します。
pt_br: O pod metal3-ironic contém pelo menos 4 contêineres diferentes (<literal>ironic-httpd</literal>,` ironic-log-watch`, <literal>ironic</literal> &amp; <literal>ironic-ipa-downloader</literal> (init)) no mesmo pod. Use o sinalizador <literal>-c</literal> ao usar o comando <literal>kubectl logs</literal> para verificar os registros de cada um dos contêineres.
zh_cn: metal3-ironic Pod 至少包含 4 个不同的容器（<literal>ironic-httpd</literal>、`ironic-log-watch`、<literal>ironic</literal> 和 <literal>ironic-ipa-downloader</literal> (init)）。带 <literal>-c</literal> 标志运行 <literal>kubectl logs</literal> 可校验其中每个容器的日志。

source: The <literal>ironic-log-watch</literal> container exposes console logs from the hosts after inspection/provisioning, provided network connectivity enables sending these logs back to the management cluster. This can be useful in cases where there are provisioning errors but you do not have direct access to the BMC console logs.
es: El contenedor <literal>ironic-log-watch</literal> expone los registros del panel de control de los hosts tras la inspección o el aprovisionamiento, siempre que la conectividad de red permita enviar estos registros al clúster de gestión. Esto puede resultar útil en casos en los que se producen errores de aprovisionamiento, pero no se tiene acceso directo a los registros del panel de control de BMC.
ja: <literal>ironic-log-watch</literal>コンテナは、ネットワーク接続により、管理クラスタにコンソールログを返送できる場合は、検査/プロビジョニング後にホストからこのログを公開します。これはプロビジョニングエラーが発生したが、BMCコンソールログに直接アクセスできない場合に役立つ可能性があります。
pt_br: O contêiner <literal>ironic-log-watch</literal> expõe os registros do console dos hosts após a inspeção/provisionamento, desde que a conectividade de rede permita o envio desses registros de volta ao cluster de gerenciamento. Isso pode ser útil quando há erros de provisionamento, mas você não tem acesso direto aos registros do console do BMC.
zh_cn: <literal>ironic-log-watch</literal> 容器会在检查/置备主机后从主机公开控制台日志（前提是网络连接允许将这些日志发送回管理群集）。当发生置备错误，但您无法直接访问 BMC 控制台日志时，此功能非常有用。

source: <emphasis role="strong">Rancher Turtles logs</emphasis>: Check logs for the different pods.
es: <emphasis role="strong">Registros de Rancher Turtles</emphasis>: consulte los registros de los diferentes pods.
ja: <emphasis role="strong">Rancher Turtlesログ</emphasis>: さまざまなPodのログを確認します。
pt_br: <emphasis role="strong">Registros do Rancher Turtles</emphasis>: consulte os registros dos diferentes pods.
zh_cn: <emphasis role="strong">Rancher Turtles 日志</emphasis>：检查不同 Pod 的日志。

source: <emphasis role="strong">BMC logs</emphasis>: Usually BMCs have a UI where most of the interaction can be done. There is usually a “logs” section that can be observed for potential issues (not being able to reach the image, hardware failures, etc.).
es: <emphasis role="strong">Registros de BMC</emphasis>: por lo general, los BMC tienen una interfaz de usuario en la que se puede realizar la mayor parte de la interacción. Suele haber una sección de "registros" en la que se pueden observar posibles problemas (imposibilidad de acceder a la imagen, fallos de hardware, etc.).
ja: <emphasis role="strong">BMCログ</emphasis>: 通常BMCには、ほとんどの操作を実行できるUIがあります。また、通常は潜在的な問題(イメージにアクセスできない、ハードウェアエラーなど)がないか確認できる「ログ」セクションもあります。
pt_br: <emphasis role="strong">Registros do BMC</emphasis>: em geral, os BMCs têm uma IU em que é possível realizar grande parte da interação. Normalmente, há uma seção "registros" na qual observar possíveis problemas (imagem inacessível, falhas de hardware etc.).
zh_cn: <emphasis role="strong">BMC 日志</emphasis>：BMC 通常会提供一个可用于执行大多数交互操作的 UI，其中一般都会有一个“日志”部分，您可在其中查看潜在问题（无法访问映像、硬件故障等）。

source: <emphasis role="strong">Console logs</emphasis>: Connect to the BMC console (via the BMC webui, serial, etc.) and check for errors on the logs being written.
es: <emphasis role="strong">Registros del panel de control</emphasis>: conéctese al panel de control de BMC (a través de la interfaz Web de BMC, en serie, etc.) y compruebe si hay errores en los registros que se están escribiendo.
ja: <emphasis role="strong">コンソールログ</emphasis>: BMCコンソールに接続して(BMC Web UI、シリアルなどを経由)、書き込まれているログにエラーがないか確認します。
pt_br: <emphasis role="strong">Registros do console</emphasis>: conecte-se ao console BMC (pela IU da web do BMC, série etc.) e verifique se há erros nos registros gravados.
zh_cn: <emphasis role="strong">控制台日志</emphasis>：连接到 BMC 控制台（通过 BMC Web UI、串行接口等），检查实时写入的日志中的错误。

source: <emphasis role="strong">Check <literal>BareMetalHost</literal> status</emphasis>:
es: <emphasis role="strong">Compruebe el estado de <literal>BareMetalHost</literal></emphasis>:
ja: <emphasis role="strong"><literal>BareMetalHost</literal>ステータスの確認</emphasis>:
pt_br: <emphasis role="strong">Verifique o status de <literal>BareMetalHost</literal></emphasis>:
zh_cn: <emphasis role="strong">检查 <literal>BareMetalHost</literal> 状态</emphasis>：

source: <literal>kubectl get bmh -A</literal> shows the current state. Look for <literal>provisioning</literal>, <literal>ready</literal>, <literal>error</literal>, <literal>registering</literal>.
es: <literal>kubectl get bmh -A</literal> muestra el estado actual, que puede ser <literal>provisioning</literal>, <literal>ready</literal>, <literal>error</literal> o <literal>registering</literal>.
ja: <literal>kubectl get bmh -A</literal>を実行すると、現在の状態が表示されます。<literal>provisioning</literal>、<literal>ready</literal>、<literal>error</literal>、<literal>registering</literal>を探してください。
pt_br: <literal>kubectl get bmh -A</literal> mostra o estado atual. Procure por <literal>provisioning</literal>, <literal>ready</literal>, <literal>error</literal>, <literal>registering</literal>.
zh_cn: 运行 <literal>kubectl get bmh -A</literal> 可显示当前状态。查找 <literal>provisioning</literal>、<literal>ready</literal>、<literal>error</literal>、<literal>registering</literal>。

source: <literal>kubectl describe bmh -n &lt;namespace&gt; &lt;bmh_name&gt;</literal> provides detailed events and conditions explaining why a BMH might be stuck.
es: <literal>kubectl describe bmh -n &lt;espaciodenombres&gt; &lt;nombre_bmh&gt;</literal> proporciona información detallada sobre los eventos y condiciones que explican por qué un BMH podría estar bloqueado.
ja: <literal>kubectl describe bmh -n &lt;namespace&gt; &lt;bmh_name&gt;</literal>を実行すると、BMHが停止する可能性がある理由を説明する、詳細なイベントと状態が表示されます。
pt_br: <literal>kubectl describe bmh -n &lt;namespace&gt; &lt;nome_do_bmh&gt;</literal> retorna os eventos detalhados e as condições que explicam o motivo da paralisação do BMH.
zh_cn: 运行 <literal>kubectl describe bmh -n &lt;namespace&gt; &lt;bmh_name&gt;</literal> 可提供详细事件和状态，解释 BMH 可能出现卡死状态的原因。

source: <emphasis role="strong">Test RedFish connectivity</emphasis>:
es: <emphasis role="strong">Pruebe la conectividad de Redfish</emphasis>:
ja: <emphasis role="strong">RedFishの接続性のテスト</emphasis>:
pt_br: <emphasis role="strong">Teste a conectividade do RedFish</emphasis>:
zh_cn: <emphasis role="strong">测试 RedFish 连通性</emphasis>：
