Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Files are not properly generated</emphasis>: Ensure the network files matches <link xl:href="https://nmstate.io/examples.html">NMState</link> format.
es: <emphasis role="strong">Los archivos no se han generado correctamente</emphasis>: asegúrese de que los archivos de red cumplan el formato <link xl:href="https://nmstate.io/examples.html">NMState</link>.
ja: <emphasis role="strong">ファイルが適切に生成されない</emphasis>: ネットワークファイルが<link xl:href="https://nmstate.io/examples.html">NMState</link>形式と一致していることを確認します。
pt_br: <emphasis role="strong">Os arquivos não são gerados de maneira apropriada</emphasis>: garanta que os arquivos de rede sigam o formato <link xl:href="https://nmstate.io/examples.html">NMState</link>.
zh_cn: <emphasis role="strong">未正确生成文件</emphasis>：确保网络文件符合 <link xl:href="https://nmstate.io/examples.html">NMState</link> 格式。

source: <emphasis role="strong">Network interfaces are not correctly configured</emphasis>: Ensure the MAC addresses match the interfaces being used on the host.
es: <emphasis role="strong">Las interfaces de red no están configuradas correctamente</emphasis>: asegúrese de que las direcciones MAC coincidan con las interfaces que se utilizan en el host.
ja: <emphasis role="strong">ネットワークインタフェースが正常に設定されない</emphasis>: MACアドレスがホストで使用されているインタフェースと一致していることを確認します。
pt_br: <emphasis role="strong">As interfaces de rede não são configuradas corretamente</emphasis>: garanta que os endereços MAC correspondam às interfaces usadas no host.
zh_cn: <emphasis role="strong">网络接口配置不正确</emphasis>：确保 MAC 地址与主机上使用的接口匹配。

source: <emphasis role="strong">Mismatch between interface names</emphasis>: The <literal>net.ifnames=1</literal> kernel argument enables <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">Predictable Naming Scheme for Network Interfaces</link> so there is no <literal>eth0</literal> anymore but other naming schema such as <literal>enp2s0</literal>.
es: <emphasis role="strong">Los nombres no coinciden entre las interfaces</emphasis>: el argumento del kernel <literal>net.ifnames=1</literal> permite un <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">esquema de nomenclatura predecible para interfaces de red</link>, por lo que ya no existe <literal>eth0</literal>, sino otros esquemas de nomenclatura como <literal>enp2s0</literal>.
ja: <emphasis role="strong">インタフェース名の不一致</emphasis>: <literal>net.ifnames=1</literal>カーネル引数により、 <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">ネットワークインタフェースの予測可能な命名規則</link>が有効になるため、<literal>eth0</literal>はなくなり、<literal>enp2s0</literal>などの他の命名規則が使用されます。
pt_br: <emphasis role="strong">Incompatibilidade entre nomes de interface</emphasis>: o argumento do kernel <literal>net.ifnames=1</literal> habilita o <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">Esquema de nomenclatura previsível para interfaces de rede</link>, portanto, não existe mais o <literal>eth0</literal>, porém, outro esquema de nomenclatura, como o <literal>enp2s0</literal>.
zh_cn: <emphasis role="strong">接口名称不匹配</emphasis>：内核参数 <literal>net.ifnames=1</literal> 会启用<link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">网络接口的可预测命名方案</link>，因此不再使用 <literal>eth0</literal> 命名方案，而是采用 <literal>enp2s0</literal> 等其他命名方案。

source: <emphasis role="strong">Combustion logs</emphasis>: As nmc is being used at combustion time, check combustion logs with <literal>journalctl -u combustion</literal> on the host being provisioned.
es: <emphasis role="strong">Registros de Combustion</emphasis>: dado que nmc se utiliza al mismo tiempo que Combustion, compruebe los registros de Combustion con <literal>journalctl -u combustion</literal> en el host que se está aprovisionando.
ja: <emphasis role="strong">Combustionログ</emphasis>: Combustion時にnmcが使用されるため、プロビジョニング中のホスト上で、<literal>journalctl -u combustion</literal>を使用してCombustionログを確認します。
pt_br: <emphasis role="strong">Registros do Combustion</emphasis>: como o NMC é usado no momento da execução do Combustion, consulte os registros do Combustion com o comando <literal>journalctl -u combustion</literal> no host que está sendo provisionado.
zh_cn: <emphasis role="strong">Combustion 日志</emphasis>：由于 nmc 在 Combustion 阶段使用，可在待置备的主机上使用 <literal>journalctl -u combustion</literal> 检查 Combustion 日志。

source: <emphasis role="strong">NetworkManager logs</emphasis>: On the Metal<superscript>3</superscript> deployment workflow, nmc is part of the IPA execution and it is being executed as a dependency of the NetworkManager service using systemd’s ExecStartPre functionality. Check NetworkManager logs on the IPA host as <literal>journalctl -u NetworkManager</literal> (see the Troubleshooting Directed-network provisioning (<xref linkend="troubleshooting-directed-network-provisioning"/>) section to understand how to access the host when booted with IPA).
es: <emphasis role="strong">Registros de NetworkManager</emphasis>: en el flujo de trabajo de despliegue de Metal<superscript>3</superscript>, nmc forma parte de la ejecución de IPA y se ejecuta como dependencia del servicio NetworkManager usando la funcionalidad ExecStartPre de systemd. Compruebe los registros de NetworkManager en el host de IPA con <literal>journalctl -u NetworkManager</literal> (consulte la sección de resolución de problemas de aprovisionamiento de red dirigida (<xref linkend="troubleshooting-directed-network-provisioning"/>) para comprender cómo acceder al host cuando se inicia con IPA).
ja: <emphasis role="strong">NetworkManagerログ</emphasis>: Metal<superscript>3</superscript>デプロイメントワークフローでは、nmcはIPA実行の一部であり、systemdのExecStartPre機能を使用してNetworkManagerサービスの依存関係として実行されます。IPAホスト上で<literal>journalctl -u NetworkManager</literal>としてNetworkManagerログを確認します(IPAで起動したときにホストにアクセスする方法については、「ダイレクトネットワークプロビジョニングのトラブルシューティング」(<xref linkend="troubleshooting-directed-network-provisioning"/>)セクションを参照してください)。
pt_br: <emphasis role="strong">Registros do NetworkManager</emphasis>: no fluxo de trabalho de implantação do Metal<superscript>3</superscript>, o NMC faz parte da execução do IPA e é executado como uma dependência do serviço NetworkManager, usando a funcionalidade ExecStartPre do systemd. Consulte os registros do NetworkManager no host IPA como <literal>journalctl -u NetworkManager</literal> (consulte a seção de solução de problemas de provisionamento de rede direcionado (<xref linkend="troubleshooting-directed-network-provisioning"/>) para saber como acessar o host quando inicializado com o IPA).
zh_cn: <emphasis role="strong">NetworkManager 日志</emphasis>：在 Metal<superscript>3</superscript> 部署工作流程中，nmc 是 IPA 执行过程的一个环节，它通过 systemd 的 ExecStartPre 功能作为 NetworkManager 服务的依赖项运行。可以在 IPA 主机上使用 <literal>journalctl -u NetworkManager</literal> 检查 NetworkManager 日志（参见<xref linkend="troubleshooting-directed-network-provisioning"/>，了解如何在主机通过 IPA 引导时访问主机）。

source: <emphasis role="strong">Verify the yaml syntax</emphasis>: nmc configuration files are yaml files, check the proper syntax with <literal>yamllint</literal> or similar tools.
es: <emphasis role="strong">Verifique la sintaxis de YAML</emphasis>: los archivos de configuración nmc son archivos YAML. Compruebe que la sintaxis sea correcta con <literal>yamllint</literal> o herramientas similares.
ja: <emphasis role="strong">yaml構文の確認</emphasis>: nmc設定ファイルはyamlファイルです。適切な構文かどうかを<literal>yamllint</literal>または同様のツールで確認します。
pt_br: <emphasis role="strong">Verifique a sintaxe do yaml</emphasis>: os arquivos de configuração do NMC são yaml. Verifique a sintaxe adequada com <literal>yamllint</literal> ou ferramentas similares.
zh_cn: <emphasis role="strong">验证 yaml 语法</emphasis>：nmc 配置文件是 yaml 文件，可使用 <literal>yamllint</literal> 或类似工具检查其语法正确性。

source: <emphasis role="strong">Run nmc manually</emphasis>: As nmc is part of the EIB container, to debug any issues, a local podman command can be used.
es: <emphasis role="strong">Ejecute nmc manualmente</emphasis>: dado que nmc forma parte del contenedor EIB, para depurar cualquier problema se puede utilizar un comando de Podman local.
ja: <emphasis role="strong">nmcを手動で実行する</emphasis>: nmcはEIBコンテナの一部であるため、問題をデバッグするには、ローカルpodmanコマンドを使用できます。
pt_br: <emphasis role="strong">Execute o NMC manualmente</emphasis>: como o NMC faz parte do contêiner EIB, é possível usar o comando podman local para depurar problemas.
zh_cn: <emphasis role="strong">手动运行 nmc</emphasis>：由于 nmc 是 EIB 容器的一部分，可使用本地 Podman 命令来调试问题。

source: Create a temporary folder to store the nmc files.
es: Cree una carpeta temporal para almacenar los archivos de nmc.
ja: nmcファイルを保存するための一時フォルダを作成します。
pt_br: Crie uma pasta temporária para armazenar os arquivos nmc.
zh_cn: 创建一个用于存储 nmc 文件的临时文件夹。

source: Save the nmc files on that location.
es: Guarde los archivos de nmc en esa ubicación.
ja: その場所にnmcファイルを保存します。
pt_br: Salve os arquivos nmc nesse local.
zh_cn: 将 nmc 文件保存到该位置。

source: Run the EIB container with nmc as the entrypoint and the generate command to perform the same tasks nmc would do at combustion time:
es: Ejecute el contenedor de EIB con nmc como punto de entrada y el comando generate para realizar las mismas tareas que nmc haría al mismo tiempo que Combustion:
ja: エントリポイントとしてnmcを使用してEIBコンテナを実行し、generateコマンドを使用して、Combustion時にnmcが実行するのと同じタスクを実行します。
pt_br: Execute o contêiner EIB com o NMC como ponto de entrada e o comando generate para executar as mesmas tarefas que o NMC faz no momento da execução do Combustion:
zh_cn: 以 nmc 为入口点执行 generate 命令来运行 EIB 容器，模拟 nmc 在 combustion 阶段执行的任务：

source: Observe the logs and files being generated on the temporary folder.
es: Observe los registros y archivos que se generan en la carpeta temporal.
ja: 一時フォルダに生成されるログとファイルを確認します。
pt_br: Observe os registros e os arquivos que são gerados na pasta temporária.
zh_cn: 观察临时文件夹中生成的日志和文件。

source: Troubleshooting Phone-Home scenarios
es: Resolución de problemas en escenarios "phone home"
ja: Phone-Homeシナリオのトラブルシューティング
pt_br: Solucionando problemas em cenários "phone home"
zh_cn: 自主回连场景查错

source: Phone-home scenarios involve using Elemental to connect back to the Management cluster and EIB to create an OS image including the elemental-registration bits. Issues can happen when the host is being booted for the first time, during the EIB build process or trying to register to the Management cluster.
es: En los escenarios "phone home" se usa Elemental para volver a conectarse al clúster de gestión y EIB a fin de crear una imagen del sistema operativo que incluya los bits de registro de Elemental. Pueden surgir problemas cuando se arranca el host por primera vez, durante el proceso de creación de EIB o al intentar registrarse en el clúster de gestión.
ja: Phone-Homeシナリオには、Elementalを使用して管理クラスタに接続し直し、EIBを使用してElemental登録情報を含むOSイメージを作成することが含まれます。ホストの初回起動時、EIB構築プロセス中、または管理クラスタに登録しようとするときに問題が発生する可能性があります。
pt_br: Os cenários "phone home" envolvem o uso do Elemental para conectar-se com o cluster de gerenciamento e o EIB criar uma imagem de sistema operacional que inclua os bits do elemental-registration. Pode haver problemas quando o host é inicializado pela primeira vez, durante o processo de criação do EIB ou na tentativa de registro no cluster de gerenciamento.
zh_cn: 自主回连场景涉及使用 Elemental 回连管理群集，以及使用 EIB 创建包含 elemental-registration 组件的操作系统映像。当主机首次引导时、在 EIB 构建过程中或尝试注册到管理群集时，可能会发生问题。

source: <emphasis role="strong">System fails to register</emphasis>: Node not being registered in the UI. Ensure the host is booted properly and, is able to communicate back to Rancher, clock is in sync and the Elemental services are ok.
es: <emphasis role="strong">El sistema no se registra</emphasis>: el nodo no se registra en la interfaz del usuario. Asegúrese de que el host se haya arrancado correctamente y pueda comunicarse con Rancher, que el reloj esté sincronizado y que los servicios de Elemental funcionen correctamente.
ja: <emphasis role="strong">システムを登録できない</emphasis>: UIでノードが登録されていません。ホストが適切に起動していること、Rancherと通信できること、クロックが同期していること、Elementalサービスが正常であることを確認します。
pt_br: <emphasis role="strong">Falha no registro do sistema</emphasis>: o nó não é registrado na IU. Assegure que o host seja inicializado de maneira apropriada e possa se comunicar com o Rancher, o relógio esteja sincronizado e os serviços do Elemental estejam ativos.
zh_cn: <emphasis role="strong">系统注册失败</emphasis>：节点未在 UI 中注册。确保主机正常引导、能够与 Rancher 通信、时钟保持同步，并且 Elemental 服务正常工作。

source: <emphasis role="strong">System fails to be provisioned</emphasis>: Node is registered but it fails to be provisioned. Ensure the host is able to communicate back to Rancher, clock is in sync and the Elemental services are ok.
es: <emphasis role="strong">El sistema no se puede aprovisionar</emphasis>: el nodo está registrado, pero no se puede aprovisionar. Asegúrese de que el host pueda comunicarse con Rancher, que el reloj esté sincronizado y que los servicios de Elemental funcionen correctamente.
ja: <emphasis role="strong">システムをプロビジョニングできない</emphasis>: ノードは登録されているが、プロビジョニングに失敗します。ホストがRancerと通信できること、クロックが同期していること、Elementalサービスに問題がないことを確認します。
pt_br: <emphasis role="strong">Falha no provisionamento do sistema</emphasis>: o nó é registrado, mas não é provisionado. Assegure que o host possa se comunicar com o Rancher, o relógio esteja sincronizado e os serviços do Elemental estejam ativos.
zh_cn: <emphasis role="strong">系统置备失败</emphasis>：节点已注册但置备失败。确保主机能够与 Rancher 通信、时钟保持同步，并且 Elemental 服务正常工作。

source: <emphasis role="strong">System logs</emphasis>: <literal>journalctl</literal>
es: <emphasis role="strong">Registros del sistema</emphasis>: <literal>journalctl</literal>
ja: <emphasis role="strong">システムログ</emphasis>: <literal>journalctl</literal>
pt_br: <emphasis role="strong">Registros do sistema</emphasis>: <literal>journalctl</literal>
zh_cn: <emphasis role="strong">系统日志</emphasis>：<literal>journalctl</literal>

source: <emphasis role="strong">Elemental-system-agent logs</emphasis>: <literal>journalctl -u elemental-system-agent</literal>
es: <emphasis role="strong">Registros de elemental-system-agent</emphasis>: <literal>journalctl -u elemental-system-agent</literal>
ja: <emphasis role="strong">Elemental-system-agentログ</emphasis>: <literal>journalctl -u elemental-system-agent</literal>
pt_br: <emphasis role="strong">Registros do elemental-system-agent</emphasis>: <literal>journalctl -u elemental-system-agent</literal>
zh_cn: <emphasis role="strong">Elemental-system-agent 日志</emphasis>：<literal>journalctl -u elemental-system-agent</literal>

source: <emphasis role="strong">K3s/RKE2 logs</emphasis>: <literal>journalctl -u k3s or journalctl -u rke2-server</literal> (or <literal>rke2-agent</literal>)
es: <emphasis role="strong">Registros de K3s/RKE2</emphasis>: <literal>journalctl -u k3s o journalctl -u rke2-server</literal> (o <literal>rke2-agent</literal>)
ja: <emphasis role="strong">K3s/RKE2ログ</emphasis>: <literal>journalctl -u k3sまたはjournalctl -u rke2-server</literal> (または<literal>rke2-agent</literal>)
pt_br: <emphasis role="strong">Registros do K3s/RKE2</emphasis>: <literal>journalctl -u k3s ou journalctl -u rke2-server</literal> (ou <literal>rke2-agent</literal>)
zh_cn: <emphasis role="strong">K3s/RKE2 日志</emphasis>：<literal>journalctl -u k3s 或 journalctl -u rke2-server</literal>（或 <literal>rke2-agent</literal>）

source: <emphasis role="strong">Review logs</emphasis>: Check Elemental operator pod logs to see if there are any issues. Check the host logs if the node is booted.
es: <emphasis role="strong">Consulte los registros</emphasis>: compruebe los registros del pod del operador de Elemental para ver si hay algún problema. Compruebe los registros del host si el nodo se ha arrancado.
ja: <emphasis role="strong">ログの確認</emphasis>: ElementalオペレータPodのログで、問題がないかどうかを確認します。ノードが起動している場合は、ホストログを確認してください。
pt_br: <emphasis role="strong">Revise os registros</emphasis>: consulte os registros do pod do operador Elemental para ver se há problemas. Verifique os registros do host se o nó for inicializado.
zh_cn: <emphasis role="strong">查看日志</emphasis>：检查 Elemental Operator Pod 日志以确定是否存在任何问题。如果节点已引导，则检查主机日志。

source: <emphasis role="strong">Check MachineRegistration and TPM</emphasis>: By default, TPM is used for <link xl:href="https://elemental.docs.rancher.com/authentication/">authentication</link> but there are alternatives for hosts without TPM.
es: <emphasis role="strong">Compruebe MachineRegistration y TPM</emphasis>: de forma predeterminada, TPM se utiliza para la <link xl:href="https://elemental.docs.rancher.com/authentication/">autenticación</link>, pero existen alternativas para hosts sin TPM.
ja: <emphasis role="strong">MachineRegistrationとTPMの確認</emphasis>: デフォルトで、TPMは<link xl:href="https://elemental.docs.rancher.com/authentication/">認証</link>に使用されますが、TPMのないホストには、代替が存在します。
pt_br: <emphasis role="strong">Verifique o MachineRegistration e o TPM</emphasis>: por padrão, o TPM é usado para <link xl:href="https://elemental.docs.rancher.com/authentication/">autenticação</link>, mas há alternativas para hosts sem o TPM.
zh_cn: <emphasis role="strong">检查 MachineRegistration 和 TPM</emphasis>：默认会使用 TPM 进行<link xl:href="https://elemental.docs.rancher.com/authentication/">身份验证</link>，但对于没有 TPM 的主机，也有替代方案。

source: Troubleshooting Directed-network provisioning
es: Resolución de problemas de aprovisionamiento de red dirigida
ja: ダイレクトネットワークプロビジョニングのトラブルシューティング
pt_br: Solução de problemas de provisionamento de rede direcionado
zh_cn: 定向网络置备查错

source: Directed-network provisioning scenarios involve using Metal<superscript>3</superscript> and CAPI elements to provision the Downstream cluster. It also includes EIB to create an OS image. Issues can happen when the host is being booted for the first time or during the inspection or provisioning processes.
es: En el aprovisionamiento de red dirigida se usan Metal<superscript>3</superscript> y CAPI para aprovisionar el clúster descendente. También se usa EIB para crear una imagen del sistema operativo. Pueden surgir problemas cuando se arranca el host por primera vez o durante los procesos de inspección o aprovisionamiento.
ja: ダイレクトネットワークプロビジョニングシナリオには、Metal<superscript>3</superscript>およびCAPI要素を使用したダウンストリームクラスタのプロビジョニングが含まれます。EIBを使用したOSイメージの作成も含まれます。ホストの初回起動時、または検査プロセスまたはプロビジョニングプロセス中に問題が発生する可能性があります。
pt_br: Os cenários de provisionamento de rede direcionado envolvem o uso de elementos do Metal<superscript>3</superscript> e da CAPI para provisionar o cluster downstream. O EIB também é incluído para criar uma imagem do sistema operacional. Pode haver problemas quando o host é inicializado pela primeira vez ou durante os processos de inspeção ou provisionamento.
zh_cn: 定向网络置备场景涉及使用 Metal<superscript>3</superscript> 和 CAPI 组件置备下游群集，以及使用 EIB 创建操作系统映像。当主机首次引导时，或者在检查或置备过程中，可能会发生问题。

source: <emphasis role="strong">Old firmware</emphasis>: Verify all the different firmware on the physical hosts being used are up to date. This includes the BMC firmware as some times Metal<superscript>3</superscript> <link xl:href="https://book.metal3.io/bmo/supported_hardware#redfish-and-its-variants">requires specific/updated ones</link>.
es: <emphasis role="strong">Firmware antiguo</emphasis>: compruebe que todo el firmware de los hosts físicos que se utilizan esté actualizado. Esto incluye el firmware de BMC, ya que en ocasiones Metal<superscript>3</superscript> <link xl:href="https://book.metal3.io/bmo/supported_hardware#redfish-and-its-variants">requiere un firmware específico/actualizado</link>.
ja: <emphasis role="strong">古いファームウェア</emphasis>: 使用されている物理ホスト上のさまざまなファームウェアがすべて最新であることを確認します。これには、BMCファームウェアが含まれます。Metal<superscript>3</superscript> <link xl:href="https://book.metal3.io/bmo/supported_hardware#redfish-and-its-variants">では特定のファームウェアや更新されたファームウェアが必要になる</link>場合があるためです。
pt_br: <emphasis role="strong">Firmware antigo</emphasis>: garanta que qualquer firmware diferente usado nos hosts físicos esteja atualizado. Isso inclui o firmware BMC, já que às vezes o Metal<superscript>3</superscript> <link xl:href="https://book.metal3.io/bmo/supported_hardware#redfish-and-its-variants">requer um específico/atualizado</link>.
zh_cn: <emphasis role="strong">固件过旧</emphasis>：验证物理主机上使用的所有固件是否为最新版本，包括 BMC 固件（有时 Metal<superscript>3</superscript> <link xl:href="https://book.metal3.io/bmo/supported_hardware#redfish-and-its-variants">需要特定版本/更新的固件</link>）。

source: <emphasis role="strong">Provisioning failed with SSL errors</emphasis>: If the webserver serving the images uses https, Metal<superscript>3</superscript> needs to be configured to inject and trust the certificate on the IPA image. See Kubernetes folder (<xref linkend="mgmt-cluster-kubernetes-folder"/>) on how to include a <literal>ca-additional.crt</literal> file to the Metal<superscript>3</superscript> chart.
es: <emphasis role="strong">El aprovisionamiento falla con errores de SSL</emphasis>: si el servidor Web que proporciona las imágenes utiliza https, Metal<superscript>3</superscript> debe configurarse para inyectar y confiar en el certificado de la imagen IPA. Consulte la carpeta de Kubernetes (<xref linkend="mgmt-cluster-kubernetes-folder"/>) para obtener información sobre cómo incluir un archivo <literal>ca-additional.crt</literal> en el chart de Metal<superscript>3</superscript>.
ja: <emphasis role="strong">プロビジョニングがSSLエラーで失敗した</emphasis>: イメージを提供するWebサーバがhttpsを使用する場合、Metal<superscript>3</superscript>はIPAイメージに証明書を挿入して信頼するように設定する必要があります。<literal>ca-additional.crt</literal>ファイルをMetal<superscript>3</superscript>チャートに含める方法については、Kubernetesフォルダ(<xref linkend="mgmt-cluster-kubernetes-folder"/>)を参照してください。
pt_br: <emphasis role="strong">Falha no provisionamento com erros de SSL</emphasis>: se o servidor web que envia as imagens usa https, o Metal<superscript>3</superscript> precisa ser configurado para injetar e confiar no certificado da imagem do IPA. Consulte a pasta do Kubernetes (<xref linkend="mgmt-cluster-kubernetes-folder"/>) para saber como incluir um arquivo <literal>ca-additional.crt</literal> no gráfico do Metal<superscript>3</superscript>.
zh_cn: <emphasis role="strong">置备因 SSL 错误失败</emphasis>：如果提供映像的 Web 服务器使用 https，需要配置 Metal<superscript>3</superscript> 以在 IPA 映像中注入并信任证书。请参见<xref linkend="mgmt-cluster-kubernetes-folder"/>了解如何将 <literal>ca-additional.crt</literal> 文件包含到 Metal<superscript>3</superscript> chart 中。
