Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: A <literal>GitRepo</literal> is a Fleet (<xref linkend="components-fleet"/>) resource that represents a Git repository from which <literal>Fleet</literal> can create <literal>Bundles</literal>. Each <literal>Bundle</literal> is created based on configuration paths defined inside of the <literal>GitRepo</literal> resource. For more information, see the <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> documentation.
es: Un <literal>GitRepo</literal> es un recurso de Fleet (<xref linkend="components-fleet"/>) que representa un repositorio Git desde el que <literal>Fleet</literal> puede crear <literal>Bundles</literal>. Cada <literal>Bundle</literal> se crea en función de las rutas de configuración definidas dentro del recurso <literal>GitRepo</literal>. Para obtener más información, consulte la documentación de <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link>.
ja: <literal>GitRepo</literal>は、<literal>Fleet</literal>が<literal>バンドル</literal>の作成元として使用できるGitリポジトリを表すFleet (<xref linkend="components-fleet"/>)リソースです。各<literal>バンドル</literal>は、<literal>GitRepo</literal>リソースの内部で定義された設定パスに基づいて作成されます。詳細については、<link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link>のドキュメントを参照してください。
pt_br: O <literal>GitRepo</literal> é um recurso do Fleet (<xref linkend="components-fleet"/>) que representa um repositório Git do qual o <literal>Fleet</literal> pode criar <literal>Bundles</literal>. Cada <literal>Bundle</literal> é criado com base nos caminhos de configuração definidos no recurso <literal>GitRepo</literal>. Para obter mais informações, consulte a documentação do <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link>.
zh_cn: <literal>GitRepo</literal> 是一种 Fleet（<xref linkend="components-fleet"/>）资源，它代表一个 Git 储存库，<literal>Fleet</literal> 可从中创建<literal>捆绑包</literal>。每个<literal>捆绑包</literal>都是基于 <literal>GitRepo</literal> 资源中定义的配置路径创建的。有关详细信息，请参见 <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> 文档。

source: In the context of "Day 2" operations, <literal>GitRepo</literal> resources are normally used to deploy <literal>SUC</literal> or <literal>SUC Plans</literal> in <emphasis role="strong">non air-gapped</emphasis> environments that utilize a <emphasis>Fleet GitOps</emphasis> approach.
es: En el contexto de las operaciones de "día 2", los recursos <literal>GitRepo</literal> se suelen usar para desplegar <literal>SUC</literal> o <literal>planes de SUC</literal> en entornos <emphasis role="strong">no aislados</emphasis> que emplean un enfoque de <emphasis>GitOps de Fleet</emphasis>.
ja: 「Day 2」操作のコンテキストでは、<literal>GitRepo</literal>リソースは通常、<emphasis>Fleet GitOps</emphasis>アプローチを利用する<emphasis role="strong">非エアギャップ</emphasis>環境に<literal>SUC</literal>または<literal>SUC Plan</literal>をデプロイするために使用されます。
pt_br: No contexto das operações de "dia 2", os recursos <literal>GitRepo</literal> costumam ser usados para implantar o <literal>SUC</literal> ou os <literal>planos do SUC</literal> em ambientes <emphasis role="strong">não air-gapped</emphasis> que usam a abordagem <emphasis>GitOps do Fleet</emphasis>.
zh_cn: 在“Day 2”操作情境中，<literal>GitRepo</literal> 资源通常用于在利用 <emphasis>Fleet GitOps</emphasis> 方法的<emphasis role="strong">非隔离</emphasis>环境中部署 <literal>SUC</literal> 或 <literal>SUC 计划</literal>。

source: Alternatively, <literal>GitRepo</literal> resources can also be used to deploy <literal>SUC</literal> or <literal>SUC Plans</literal> on <emphasis role="strong">air-gapped</emphasis> environments, <emphasis role="strong">provided you mirror your repository setup through a local git server</emphasis>.
es: Como alternativa, los recursos <literal>GitRepo</literal> también se pueden utilizar para desplegar <literal>SUC</literal> o <literal>planes de SUC</literal> en entornos <emphasis role="strong">aislados</emphasis>, <emphasis role="strong">siempre que se refleje la configuración del repositorio a través de un servidor Git local</emphasis>.
ja: または、<emphasis role="strong">リポジトリのセットアップをローカルGitサーバ経由でミラーリングする場合</emphasis> 、<literal>GitRepo</literal>リソースを使用して、<literal>SUC</literal>または<literal>SUC Plan</literal>を<emphasis role="strong">エアギャップ</emphasis>環境にデプロイすることもできます。
pt_br: Se preferir, use os recursos <literal>GitRepo</literal> para implantar o <literal>SUC</literal> ou os <literal>planos do SUC</literal> em ambientes <emphasis role="strong">air-gapped</emphasis>, <emphasis role="strong">desde que você espelhe a configuração do seu repositório por um servidor Git local</emphasis>.
zh_cn: 或者，<emphasis role="strong">如果您通过本地 git 服务器镜像储存库设置</emphasis>，则 <literal>GitRepo</literal> 资源也可用于在<emphasis role="strong">隔离</emphasis>环境中部署 <literal>SUC</literal> 或 <literal>SUC 计划</literal>。

source: Bundle
ja: バンドル
zh_cn: 捆绑包

source: <literal>Bundles</literal> hold <emphasis role="strong">raw</emphasis> Kubernetes resources that will be deployed on the targeted cluster. Usually they are created from a <literal>GitRepo</literal> resource, but there are use-cases where they can be deployed manually. For more information refer to the <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> documentation.
es: Los <literal>Bundles</literal> contienen recursos <emphasis role="strong">sin procesar</emphasis> de Kubernetes que se desplegarán en el clúster de destino. Por lo general, se crean a partir de un recurso <literal>GitRepo</literal>, pero hay casos en los que se pueden desplegar manualmente. Para obtener más información, consulte la documentación de <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link>.
ja: <literal>バンドル</literal>は、ターゲットクラスタにデプロイする<emphasis role="strong"> 生</emphasis>のKubernetesリソースを保持します。バンドルは通常、<literal>GitRepo</literal>リソースから作成されますが、手動でデプロイできるユースケースもあります。詳細については、<link xl:href="https://fleet.rancher.io/bundle-add">バンドル</link>のドキュメントを参照してください。
pt_br: Os <literal>Bundles</literal> armazenam recursos <emphasis role="strong">brutos</emphasis> do Kubernetes que serão implantados no cluster de destino. Normalmente, eles são criados de um recurso <literal>GitRepo</literal>, mas há casos de uso em que podem ser implantados manualmente. Para obter mais informações, consulte a documentação do <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link>.
zh_cn: <literal>捆绑包</literal>包含了要在目标群集上部署的<emphasis role="strong">原始</emphasis> Kubernetes 资源。通常它们是基于 <literal>GitRepo</literal> 资源创建的，但在某些使用场景中也可以手动部署。有关详细信息，请参见<link xl:href="https://fleet.rancher.io/bundle-add">捆绑包</link>文档。

source: In the context of "Day 2" operations, <literal>Bundle</literal> resources are normally used to deploy <literal>SUC</literal> or <literal>SUC Plans</literal> in <emphasis role="strong">air-gapped</emphasis> environments that do not use some form of <emphasis>local GitOps</emphasis> procedure (e.g. a <emphasis role="strong">local git server</emphasis>).
es: En el contexto de las operaciones de "día 2", los recursos <literal>Bundle</literal> se suelen usar para desplegar <literal>SUC</literal> o <literal>planes de SUC</literal> en entornos <emphasis role="strong">aislados</emphasis> que no utilizan algún tipo de procedimiento <emphasis>GitOps local</emphasis> (por ejemplo, un <emphasis role="strong">servidor Git local</emphasis>).
ja: 「Day 2」操作のコンテキストでは、<literal>バンドル</literal>リソースは通常、何らかの形態の<emphasis>ローカルGitOps</emphasis>手法を使用しない<emphasis role="strong">エアギャップ</emphasis>環境(<emphasis role="strong">ローカルGitサーバ</emphasis>など )で<literal>SUC</literal>または<literal>SUC Plan</literal>をデプロイするために使用されます。
pt_br: No contexto das operações de "dia 2", os recursos <literal>Bundle</literal> costumam ser usados para implantar o <literal>SUC</literal> ou <literal>planos do SUC</literal> em ambientes <emphasis role="strong">air-gapped</emphasis> que não usam nenhuma forma de procedimento do <emphasis>GitOps local</emphasis> (por exemplo, um <emphasis role="strong">servidor git local</emphasis>).
zh_cn: 在“Day 2”操作情境中，<literal>捆绑包</literal>资源通常用于在不使用某种形式的<emphasis>本地 GitOps</emphasis> 过程（例如<emphasis role="strong">本地 git 服务器</emphasis>）的<emphasis role="strong">隔离</emphasis>环境中部署 <literal>SUC</literal> 或 <literal>SUC 计划</literal>。

source: Alternatively, if your use-case does not allow for a <emphasis>GitOps</emphasis> workflow (e.g. using a Git repository), <literal>Bundle</literal> resources could also be used to deploy <literal>SUC</literal> or <literal>SUC Plans</literal> in <emphasis role="strong">non air-gapped</emphasis> environments.
es: Alternativamente, si su caso de uso no permite un flujo de trabajo <emphasis>GitOps</emphasis> (por ejemplo, porque use un repositorio Git), también se pueden utilizar recursos <literal>Bundle</literal> para desplegar <literal>SUC</literal> o <literal>planes de SUC</literal> en entornos <emphasis role="strong">no aislados</emphasis>.
ja: または、ご自身のユースケースで<emphasis>GitOps</emphasis>ワークフローを使用できない場合は(Gitリポジトリを使用する場合など)、<literal>バンドル</literal>リソースを使用して、<literal>SUC</literal>または<literal>SUC Plan</literal>を<emphasis role="strong">非エアギャップ</emphasis>環境にデプロイすることもできます。
pt_br: Se o seu caso de uso não possibilita um fluxo de trabalho <emphasis>GitOps</emphasis> (por exemplo, usando um repositório Git), a alternativa é usar os recursos <literal>Bundle</literal> para implantar o <literal>SUC</literal> ou os <literal>planos do SUC</literal> em ambientes <emphasis role="strong">não air-gapped</emphasis>.
zh_cn: 或者，如果您的应用场景不允许使用 <emphasis>GitOps</emphasis> 工作流程（例如需使用 Git 储存库），则<literal>捆绑包</literal>资源也可用于在<emphasis role="strong">非隔离</emphasis>环境中部署 <literal>SUC</literal> 或 <literal>SUC 计划</literal>。

source: Day 2 workflow
es: Flujo de trabajo de día 2
ja: Day 2ワークフロー
pt_br: Fluxo de trabalho de dia 2
zh_cn: Day 2 工作流程

source: The following is a "Day 2" workflow that should be followed when upgrading a management cluster to a specific Edge release.
es: A continuación, se describe el flujo de trabajo de "día 2" que se debe seguir al actualizar un clúster de gestión a una versión específica de Edge.
ja: 以下に、管理クラスタを特定のEdgeリリースにアップグレードする際に従う必要がある「Day 2」ワークフローを示します。
pt_br: Veja a seguir um fluxo de trabalho de "dia 2" que deve ser seguido para fazer upgrade de um cluster de gerenciamento para uma versão específica do Edge.
zh_cn: 下面是在将管理群集升级到特定 Edge 版本时应遵循的“Day 2”工作流程。

source: OS upgrade (<xref linkend="management-day2-fleet-os-upgrade"/>)
es: Actualización del sistema operativo (<xref linkend="management-day2-fleet-os-upgrade"/>)
ja: OSアップグレード(<xref linkend="management-day2-fleet-os-upgrade"/>)
pt_br: Upgrade de sistema operacional (<xref linkend="management-day2-fleet-os-upgrade"/>)
zh_cn: 操作系统升级（<xref linkend="management-day2-fleet-os-upgrade"/>）

source: Kubernetes version upgrade (<xref linkend="management-day2-fleet-k8s-upgrade"/>)
es: Actualización de la versión de Kubernetes (<xref linkend="management-day2-fleet-k8s-upgrade"/>)
ja: Kubernetesバージョンアップグレード(<xref linkend="management-day2-fleet-k8s-upgrade"/>)
pt_br: Upgrade de versão do Kubernetes (<xref linkend="management-day2-fleet-k8s-upgrade"/>)
zh_cn: Kubernetes 版本升级（<xref linkend="management-day2-fleet-k8s-upgrade"/>）

source: Helm chart upgrade (<xref linkend="management-day2-fleet-helm-upgrade"/>)
es: Actualización del chart de Helm (<xref linkend="management-day2-fleet-helm-upgrade"/>)
ja: Helmチャートアップグレード(<xref linkend="management-day2-fleet-helm-upgrade"/>)
pt_br: Upgrade de gráfico Helm (<xref linkend="management-day2-fleet-helm-upgrade"/>)
zh_cn: Helm chart 升级（<xref linkend="management-day2-fleet-helm-upgrade"/>）

source: OS upgrade
es: Actualización del sistema operativo
ja: OSアップグレード
pt_br: Upgrade de sistema operacional
zh_cn: 操作系统升级

source: This section describes how to perform an operating system upgrade using <xref linkend="components-fleet"/> and the <xref linkend="components-system-upgrade-controller"/>.
es: En esta sección se describe cómo realizar una actualización del sistema operativo utilizando <xref linkend="components-fleet"/> y <xref linkend="components-system-upgrade-controller"/>.
ja: このセクションでは、<xref linkend="components-fleet"/>と<xref linkend="components-system-upgrade-controller"/>を使用してオペレーティングシステムのアップグレードを行う方法について説明します。
pt_br: Esta seção descreve como fazer upgrade de um sistema operacional usando o <xref linkend="components-fleet"/> e o <xref linkend="components-system-upgrade-controller"/>.
zh_cn: 本节介绍如何使用<xref linkend="components-fleet"/>和<xref linkend="components-system-upgrade-controller"/>执行操作系统升级。

source: <xref linkend="management-day2-fleet-os-upgrade-components"/> - additional components used by the upgrade process.
es: <xref linkend="management-day2-fleet-os-upgrade-components"/>: componentes adicionales usados por el proceso de actualización.
ja: <xref linkend="management-day2-fleet-os-upgrade-components"/> - アップグレードプロセスで使用される追加のコンポーネント。
pt_br: <xref linkend="management-day2-fleet-os-upgrade-components"/>: componentes adicionais usados pelo processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-os-upgrade-components"/> - 升级过程使用的其他组件。

source: <xref linkend="management-day2-fleet-os-upgrade-overview"/> - overview of the upgrade process.
es: <xref linkend="management-day2-fleet-os-upgrade-overview"/>: descripción general del proceso de actualización.
ja: <xref linkend="management-day2-fleet-os-upgrade-overview"/> - アップグレードプロセスの概要。
pt_br: <xref linkend="management-day2-fleet-os-upgrade-overview"/>: visão geral do processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-os-upgrade-overview"/> - 升级过程概述。

source: <xref linkend="management-day2-fleet-os-upgrade-requirements"/> - requirements of the upgrade process.
es: <xref linkend="management-day2-fleet-os-upgrade-requirements"/>: requisitos del proceso de actualización.
ja: <xref linkend="management-day2-fleet-os-upgrade-requirements"/> - アップグレードプロセスの要件。
pt_br: <xref linkend="management-day2-fleet-os-upgrade-requirements"/>: requisitos do processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-os-upgrade-requirements"/> - 升级过程的要求。

source: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment"/> - information on how to deploy <literal>SUC plans</literal>, responsible for triggering the upgrade process.
es: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment"/>: información sobre cómo desplegar <literal>planes de SUC</literal>, responsables de iniciar el proceso de actualización.
ja: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment"/> - <literal>SUC Plan</literal>のデプロイ方法に関する情報。このプランはアップグレードプロセスをトリガする責任を負います。
pt_br: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment"/>: informações de como implantar os <literal>planos do SUC</literal>, responsáveis por acionar o processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment"/> - 关于如何部署负责触发升级过程的 <literal>SUC 计划</literal>的信息。

source: This section covers the custom components that the <literal>OS upgrade</literal> process uses over the default "Day 2" components (<xref linkend="management-day2-fleet-components"/>).
es: Esta sección trata sobre los componentes personalizados que el proceso de <literal>actualización del sistema operativo</literal> usa en lugar de los componentes predeterminados de "día 2" (<xref linkend="management-day2-fleet-components"/>).
ja: このセクションでは、 <literal>OSアップグレード</literal>プロセスがデフォルトの「Day 2」コンポーネント(<xref linkend="management-day2-fleet-components"/>)よりも使用するカスタムコンポーネントについて説明します。
pt_br: Esta seção aborda os componentes personalizados que o processo de <literal>upgrade de sistema operacional</literal> usa com os componentes de "dia 2" padrão (<xref linkend="management-day2-fleet-components"/>).
zh_cn: 本节介绍<literal>操作系统升级</literal>过程中使用的自定义组件，这些组件与默认“Day 2”组件（<xref linkend="management-day2-fleet-components"/>）不同。

source: The OS upgrade on a specific node is handled by a <link xl:href="https://www.freedesktop.org/software/systemd/man/latest/systemd.service.html">systemd.service</link>.
es: La actualización del sistema operativo en un nodo específico se gestiona mediante un servicio <link xl:href="https://www.freedesktop.org/software/systemd/man/latest/systemd.service.html">systemd.service</link>.
ja: 特定のノードでのOSアップグレードは、<link xl:href="https://www.freedesktop.org/software/systemd/man/latest/systemd.service.html">systemd.service</link>によって処理されます。
pt_br: O upgrade de sistema operacional em um nó específico é executado pelo <link xl:href="https://www.freedesktop.org/software/systemd/man/latest/systemd.service.html">systemd.service</link>.
zh_cn: 特定节点上的操作系统升级由 <link xl:href="https://www.freedesktop.org/software/systemd/man/latest/systemd.service.html">systemd.service</link> 处理。

source: A different service is created depending on what type of upgrade the OS requires from one Edge version to another:
es: En función del tipo de actualización que requiera el sistema operativo de una versión de Edge a otra, se creará un servicio diferente:
ja: あるEdgeバージョンから別のEdgeバージョンにOSが必要とするアップグレードのタイプに応じて、異なるサービスが作成されます。
pt_br: É criado um serviço diferente dependendo do tipo de upgrade que o sistema operacional requer de uma versão do Edge para outra:
zh_cn: 根据 Edge 版本升级时操作系统所需的不同升级类型，会创建不同的服务：

source: For Edge versions that require the same OS version (e.g. <literal>6.0</literal>), the <literal>os-pkg-update.service</literal> will be created. It uses <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> to perform a <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">normal package upgrade</link>.
es: Para las versiones de Edge que requieren la misma versión del sistema operativo (por ejemplo, la <literal>6.0</literal>), se creará el servicio <literal>os-pkg-update.service</literal>. Use <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> para realizar una <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">actualización normal del paquete</link>.
ja: 同じOSバージョン(例: <literal>6.0</literal>)を必要とするEdgeバージョンの場合、<literal>os-pkg-update.service</literal>が作成されます。このサービスは<link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link>を使用して、<link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">通常のパッケージアップグレード</link>を実行します。
pt_br: Para versões do Edge que requerem a mesma versão de sistema operacional (por exemplo, <literal>6.0</literal>), o <literal>os-pkg-update.service</literal> é criado. Ele usa o <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> para fazer <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">upgrade de um pacote normal</link>.
zh_cn: 对于需要相同操作系统版本（如 <literal>6.0</literal>）的 Edge 版本，将创建 <literal>os-pkg-update.service</literal>。它使用 <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> 执行<link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">常规软件包升级</link>。

source: For Edge versions that require an OS version migration (e.g <literal>6.0</literal> → <literal>6.1</literal>), the <literal>os-migration.service</literal> will be created. It uses <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> to perform:
es: Para las versiones de Edge que requieran una migración de la versión del sistema operativo (por ejemplo, de la <literal>6.0</literal> a la <literal>6.1</literal>), se creará el servicio <literal>os-migration.service</literal>. Use <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> para realizar:
ja: OSバージョンのマイグレーション(例: <literal>6.0</literal> → <literal>6.1</literal>)が必要なEdgeバージョンの場合、<literal>os-migration.service</literal>が作成されます。このサービスは、<link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link>を使用して以下の処理を実行します。
pt_br: Para versões do Edge que requerem a migração da versão de sistema operacional (por exemplo, <literal>6.0</literal> → <literal>6.1</literal>), o <literal>os-migration.service</literal> é criado. Ele usa o <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> para fazer o seguinte:
zh_cn: 对于需要迁移操作系统版本（例如 <literal>6.0</literal> → <literal>6.1</literal>）的 Edge 版本，将创建 <literal>os-migration.service</literal>。它使用 <link xl:href="https://kubic.opensuse.org/documentation/man-pages/transactional-update.8.html">transactional-update</link> 来执行：

source: A <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">normal package upgrade</link> which ensures that all packages are at up-to-date in order to mitigate any failures in the migration related to old package versions.
es: Una <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">actualización normal del paquete</link> que garantice que todos los paquetes estén actualizados para mitigar cualquier fallo en la migración relacionado con versiones antiguas del paquete.
ja: <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">通常のパッケージのアップグレード</link>。このアップグレードにより、すべてのパッケージを最新にすることで、古いパッケージバージョンに関連するマイグレーション時の障害を軽減します。
pt_br: O <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">upgrade de pacote normal</link>, que garante que todos os pacotes sejam atualizados para mitigar falhas na migração relacionadas a versões antigas dos pacotes.
zh_cn: <link xl:href="https://en.opensuse.org/SDB:Zypper_usage#Updating_packages">常规软件包升级</link>，这可确保所有软件包均为最新版本，以减少因软件包版本过旧而导致的迁移失败情况。

source: An OS migration by utilizing the <literal>zypper migration</literal> command.
es: Una migración del sistema operativo mediante el comando <literal>zypper migration</literal>.
ja: <literal>zypper migration</literal>コマンドを利用したOSマイグレーション。
pt_br: A migração de sistema operacional usando o comando <literal>zypper migration</literal>.
zh_cn: 利用 <literal>zypper migration</literal> 命令进行操作系统迁移。

source: The services mentioned above are shipped on each node through a <literal>SUC plan</literal> which must be located on the management cluster that is in need of an OS upgrade.
es: Los servicios mencionados anteriormente se envían a cada nodo a través de un <literal>plan de SUC</literal>, que debe estar ubicado en el clúster de gestión que necesita una actualización del sistema operativo.
ja: 上記サービスは、OSアップグレードが必要な管理クラスタ上に配置されている必要がある<literal>SUC Plan</literal>を通じて各ノードに配布されます。
pt_br: Os serviços mencionados acima são distribuídos para cada nó por meio de um <literal>plano do SUC</literal>, que deve estar localizado no cluster de gerenciamento que precisa do upgrade de sistema operacional.
zh_cn: 上述服务通过 <literal>SUC 计划</literal>部署到每个节点，该计划必须位于需要升级操作系统的管理群集上。

source: Overview
es: Descripción general
ja: 概要
pt_br: Visão geral
zh_cn: 概述

source: The upgrade of the operating system for management cluster nodes is done by utilizing <literal>Fleet</literal> and the <literal>System Upgrade Controller (SUC)</literal>.
es: La actualización del sistema operativo para los nodos del clúster de gestión se realiza con <literal>Fleet</literal> y <literal>System Upgrade Controller (SUC)</literal>.
ja: 管理クラスタノードのオペレーティングシステムのアップグレードは、<literal>Fleet</literal>と<literal>System Upgrade Controller (SUC)</literal>を利用して実行されます。
pt_br: O upgrade do sistema operacional para nós de cluster de gerenciamento é feito pelo <literal>Fleet</literal> e pelo <literal>System Upgrade Controller (SUC)</literal>.
zh_cn: 通过 <literal>Fleet</literal> 和<literal>系统升级控制器 (SUC)</literal> 来为管理群集节点升级操作系统。
