Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: This section describes the workflow used to automate the provisioning of a single-node downstream cluster using directed network provisioning. This is the simplest way to automate the provisioning of a downstream cluster.
es: En esta sección se describe el flujo de trabajo usado para automatizar el aprovisionamiento de un clúster descendente de un solo nodo con el método de aprovisionamiento de red dirigida. Se trata de la forma más sencilla de automatizar el aprovisionamiento de un clúster descendente.
ja: このセクションでは、ダイレクトネットワークプロビジョニングを使用してシングルノードのダウンストリームクラスタのプロビジョニングを自動化するために用いるワークフローについて説明します。これは、ダウンストリームクラスタのプロビジョニングを自動化する最もシンプルな方法です。
pt_br: Esta seção descreve o fluxo de trabalho usado para automatizar o provisionamento de um cluster downstream de nó único usando o provisionamento de rede direcionado. Essa é a maneira mais fácil de automatizar o provisionamento de um cluster downstream.
zh_cn: 本节介绍用于通过定向网络置备自动置备单节点下游群集的工作流程。这是自动置备下游群集的最简单的方法。

source: <emphasis role="strong">Requirements</emphasis>
es: <emphasis role="strong">Requisitos</emphasis>
ja: <emphasis role="strong">要件</emphasis>
pt_br: <emphasis role="strong">Requisitos</emphasis>
zh_cn: <emphasis role="strong">要求</emphasis>

source: The image generated using <literal>EIB</literal>, as described in the previous section (<xref linkend="eib-edge-image-connected"/>), with the minimal configuration to set up the downstream cluster has to be located in the management cluster exactly on the path you configured on this section (<xref linkend="metal3-media-server"/>).
es: La imagen generada con <literal>EIB</literal>, como se describe en la sección anterior (<xref linkend="eib-edge-image-connected"/>), con la configuración mínima para configurar el clúster descendente, debe ubicarse en el clúster de gestión exactamente en la ruta que ha configurado en esta sección (<xref linkend="metal3-media-server"/>).
ja: 前のセクション(<xref linkend="eib-edge-image-connected"/>)で説明されているように、<literal>EIB</literal>を使用して、ダウンストリームクラスタを設定するための最小限の設定で生成されたイメージが、こちらのセクション(<xref linkend="metal3-media-server"/>)で設定した正確なパス上にある管理クラスタに配置されている。
pt_br: A imagem gerada por meio do <literal>EIB</literal>, conforme descrito na seção anterior (<xref linkend="eib-edge-image-connected"/>), com a configuração mínima para definir o cluster downstream, deve estar localizada no cluster de gerenciamento exatamente no caminho configurado nesta seção (<xref linkend="metal3-media-server"/>).
zh_cn: 如前面的章节（<xref linkend="eib-edge-image-connected"/>）所述使用 <literal>EIB</literal> 生成的、附带用于设置下游群集的最低限度配置的映像，必须位于管理群集上您按照<xref linkend="metal3-media-server"/>一节所述配置的确切路径中。

source: The management server created and available to be used on the following sections. For more information, refer to the Management Cluster section <xref linkend="atip-management-cluster"/>.
es: El servidor de gestión creado y disponible para su uso en las siguientes secciones. Para obtener más información, consulte la sección Clúster de gestión ( <xref linkend="atip-management-cluster"/>).
ja: 管理サーバが作成されていて、次の各セクションで使用できるようになっている。詳細については、管理クラスタに関するセクション<xref linkend="atip-management-cluster"/>を参照してください。
pt_br: O servidor de gerenciamento criado e disponível para uso nas seções a seguir. Para obter mais informações, consulte a seção sobre o cluster de gerenciamento <xref linkend="atip-management-cluster"/>.
zh_cn: 管理服务器已创建并可在后续章节中使用。有关详细信息，请参见管理群集相关的一章<xref linkend="atip-management-cluster"/>。

source: <emphasis role="strong">Workflow</emphasis>
es: <emphasis role="strong">Flujo de trabajo</emphasis>
ja: <emphasis role="strong">ワークフロー</emphasis>
pt_br: <emphasis role="strong">Fluxo de trabalho</emphasis>
zh_cn: <emphasis role="strong">工作流程</emphasis>

source: The following diagram shows the workflow used to automate the provisioning of a single-node downstream cluster using directed network provisioning:
es: El diagrama siguiente muestra el flujo de trabajo usado para automatizar el aprovisionamiento de un clúster descendente de un solo nodo con el método de aprovisionamiento de red dirigida:
ja: 次の図は、ダイレクトネットワークプロビジョニングを使用してシングルノードのダウンストリームクラスタのプロビジョニングを自動化するために用いるワークフローを示しています。
pt_br: O diagrama a seguir mostra o fluxo de trabalho usado para automatizar o provisionamento de um cluster downstream de nó único por meio do provisionamento de rede direcionado:
zh_cn: 下图显示了用于通过定向网络置备自动置备单节点下游群集的工作流程：

source: atip automated singlenode1
es: atip automatizado de un solo nodo 1
ja: atip自動化シングルノード1
pt_br: nóúnico1 automatizado atip
zh_cn: ATIP 单节点群集自动置备 1

source: There are two different steps to automate the provisioning of a single-node downstream cluster using directed network provisioning:
es: Hay dos pasos diferentes para automatizar el aprovisionamiento de un clúster descendente de un solo nodo con el método de aprovisionamiento de red dirigida:
ja: ダイレクトネットワークプロビジョニングを使用してシングルノードのダウンストリームクラスタのプロビジョニングを自動化する手順は2種類です。
pt_br: Há duas etapas diferentes para automatizar o provisionamento de um cluster downstream de nó único por meio do provisionamento de rede direcionado:
zh_cn: 可以执行两个不同的步骤来使用定向网络置备自动置备单节点下游群集：

source: Enroll the bare-metal host to make it available for the provisioning process.
es: Inscribir el host bare metal para que esté disponible para el proceso de aprovisionamiento.
ja: ベアメタルホストを登録して、プロビジョニングプロセスで使用できるようにする。
pt_br: Registre o host bare metal para disponibilizá-lo ao processo de provisionamento.
zh_cn: 登记裸机主机，使其在置备过程中可用。

source: Provision the bare-metal host to install and configure the operating system and the Kubernetes cluster.
es: Proporcionar el host bare metal para instalar y configurar el sistema operativo y el clúster de Kubernetes.
ja: ベアメタルホストをプロビジョニングして、オペレーティングシステムとKubernetesクラスタをインストールして設定する。
pt_br: Provisione o host bare metal para instalar e configurar o sistema operacional e o cluster Kubernetes.
zh_cn: 置备裸机主机，以安装并配置操作系统和 Kubernetes 群集。

source: <emphasis role="strong">Enroll the bare-metal host</emphasis>
es: <emphasis role="strong">Inscripción del host bare metal</emphasis>
ja: <emphasis role="strong">ベアメタルホストの登録</emphasis>
pt_br: <emphasis role="strong">Registrar o host bare metal</emphasis>
zh_cn: <emphasis role="strong">登记裸机主机</emphasis>

source: The first step is to enroll the new bare-metal host in the management cluster to make it available to be provisioned. To do that, the following file (<literal>bmh-example.yaml</literal>) has to be created in the management cluster, to specify the <literal>BMC</literal> credentials to be used and the <literal>BaremetalHost</literal> object to be enrolled:
es: El primer paso es inscribir el nuevo host bare metal en el clúster de gestión para que esté disponible para su aprovisionamiento. Para ello, se debe crear el archivo <literal>bmh-example.yaml</literal> en el clúster de gestión, con el fin de especificar las credenciales de <literal>BMC</literal> que se van a utilizar y el objeto <literal>BaremetalHost</literal> que se va a inscribir:
ja: 最初の手順では、新しいベアメタルホストを管理クラスタに登録してプロビジョニングできるようにします。そのためには、ファイル<literal>bmh-example.yaml</literal>を管理クラスタ内に作成して、使用する<literal>BMC</literal>資格情報と登録する<literal>BaremetalHost</literal>オブジェクトを指定する必要があります。
pt_br: A primeira etapa é registrar o novo host bare metal no cluster de gerenciamento para disponibilizá-lo para provisionamento. Para fazer isso, é necessário criar este arquivo (<literal>bmh-example.yaml</literal>) no cluster de gerenciamento, para especificar as credenciais que serão usadas do <literal>BMC</literal> e o objeto <literal>BaremetalHost</literal> para registro:
zh_cn: 第一步是在管理群集中登记新的裸机主机，使其可供置备。为此，必须在管理群集中创建以下文件 (<literal>bmh-example.yaml</literal>)，以指定要使用的 <literal>BMC</literal> 身份凭证以及要登记的 <literal>BaremetalHost</literal> 对象：

source: where:
es: Donde:
ja: 各項目の内容は次のとおりです。
pt_br: em que:
zh_cn: 其中：

source: <literal>${BMC_USERNAME}</literal> — The user name for the <literal>BMC</literal> of the new bare-metal host.
es: <literal>${BMC_USERNAME}</literal>: es el nombre de usuario del <literal>BMC</literal> del nuevo host bare metal.
ja: <literal>${BMC_USERNAME}</literal> — 新しいベアメタルホストの<literal>BMC</literal>のユーザ名。
pt_br: <literal>${BMC_USERNAME}</literal>: o nome de usuário para o <literal>BMC</literal> do novo host bare metal.
zh_cn: <literal>${BMC_USERNAME}</literal> — 新裸机主机的 <literal>BMC</literal> 用户名。

source: <literal>${BMC_PASSWORD}</literal> — The password for the <literal>BMC</literal> of the new bare-metal host.
es: <literal>${BMC_PASSWORD}</literal>: es la contraseña para el <literal>BMC</literal> del nuevo host bare metal.
ja: <literal>${BMC_PASSWORD}</literal> — 新しいベアメタルホストの<literal>BMC</literal>のパスワード。
pt_br: <literal>${BMC_PASSWORD}</literal>: a senha para o <literal>BMC</literal> do novo host bare metal.
zh_cn: <literal>${BMC_PASSWORD}</literal> — 新裸机主机的 <literal>BMC</literal> 口令。

source: <literal>${BMC_MAC}</literal> — The <literal>MAC</literal> address of the new bare-metal host to be used.
es: <literal>${BMC_MAC}</literal>: es la dirección <literal>MAC</literal> del nuevo host bare metal que se va a utilizar.
ja: <literal>${BMC_MAC}</literal> — 使用する新しいベアメタルホストの<literal>MAC</literal>アドレス。
pt_br: <literal>${BMC_MAC}</literal>: o endereço <literal>MAC</literal> do novo host bare metal que será usado.
zh_cn: <literal>${BMC_MAC}</literal> — 要使用的新裸机主机的 <literal>MAC</literal> 地址。

source: <literal>${BMC_ADDRESS}</literal> — The <literal>URL</literal> for the bare-metal host <literal>BMC</literal> (for example, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). To learn more about the different options available depending on your hardware provider, check the following <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">link</link>.
es: <literal>${BMC_ADDRESS}</literal>: es la <literal>URL</literal> del host bare metal de <literal>BMC</literal> (por ejemplo, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). Para obtener más información sobre las opciones disponibles en función de su proveedor de hardware, consulte el siguiente <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">enlace</link>.
ja: <literal>${BMC_ADDRESS}</literal> — ベアメタルホストの<literal>BMC</literal>の<literal>URL</literal> (例: <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>)。ハードウェアプロバイダに応じて使用できる各種のオプションの詳細については、<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">こちらのリンク</link>を確認してください。
pt_br: <literal>${BMC_ADDRESS}</literal>: o <literal>URL</literal> do host bare metal <literal>BMC</literal> (por exemplo, <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>). Para saber mais sobre as diversas opções disponíveis de acordo com o seu provedor de hardware, acesse este <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">link</link>.
zh_cn: <literal>${BMC_ADDRESS}</literal> — 裸机主机 <literal>BMC</literal> 的 <literal>URL</literal>（例如 <literal>redfish-virtualmedia://192.168.200.75/redfish/v1/Systems/1/</literal>）。要了解有关硬件提供商支持的不同选项的详细信息，请访问<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">此链接</link>。

source: Architecture must be either <literal>x86_64</literal> or <literal>aarch64</literal>, depending on the architecture of the bare-metal host to be enrolled.
es: La arquitectura debe ser <literal>x86_64</literal> o <literal>aarch64</literal>, dependiendo de la arquitectura del host bare metal que se va a inscribir.
ja: アーキテクチャは、登録するベアメタルホストのアーキテクチャに応じて、<literal>x86_64</literal>または<literal>aarch64</literal>のいずれかである必要があります。
zh_cn: 体系结构必须是 <literal>x86_64</literal> 或 <literal>aarch64</literal>，具体取决于要注册的裸机主机的体系结构。

source: If no network configuration for the host has been specified, either at image build time or through the <literal>BareMetalHost</literal> definition, an autoconfiguration mechanism (DHCP, DHCPv6, SLAAC) will be used. For more details or complex configurations, check the <xref linkend="advanced-network-configuration"/>.
es: Si no se ha especificado ninguna configuración de red para el host, ya sea en el momento de la creación de la imagen o en la definición <literal>BareMetalHost</literal>, se utilizará un mecanismo de configuración automática (DHCP, DHCPv6 o SLAAC). Para obtener más detalles o configuraciones complejas, consulte la <xref linkend="advanced-network-configuration"/>.
ja: ホストのネットワーク設定が、イメージのビルド時または<literal>BareMetalHost</literal>定義を通じて指定されていない場合、自動設定メカニズム(DHCP、DHCPv6、SLAAC)が使用されます。詳細または複雑な設定については、<xref linkend="advanced-network-configuration"/>を参照してください。
pt_br: Se não foi especificada uma configuração de rede para o host, seja no momento da criação da imagem, seja pela definição <literal>BareMetalHost</literal>, é usado um mecanismo de configuração automática (DHCP, DHCPv6, SLAAC). Para obter mais detalhes ou ver configurações mais complexas, consulte a <xref linkend="advanced-network-configuration"/>.
zh_cn: 如果未在映像构建时或通过 <literal>BareMetalHost</literal> 定义指定主机的网络配置，系统将使用自动配置机制（DHCP、DHCPv6、SLAAC）。有关详细信息或复杂配置，请参见<xref linkend="advanced-network-configuration"/>。

source: Once the file is created, the following command has to be executed in the management cluster to start enrolling the new bare-metal host in the management cluster:
es: Una vez creado el archivo, se debe ejecutar el siguiente comando en el clúster de gestión para comenzar a inscribir el nuevo host bare metal en el clúster de gestión:
ja: ファイルを作成したら、管理クラスタで次のコマンドを実行し、管理クラスタで新しいベアメタルホストの登録を開始する必要があります。
pt_br: Depois que o arquivo for criado, execute o seguinte comando no cluster de gerenciamento para iniciar o registro do novo host bare metal:
zh_cn: 创建该文件后，必须在管理群集中执行以下命令，才能在管理群集中开始登记新的裸机主机：

source: The new bare-metal host object will be enrolled, changing its state from registering to inspecting and available. The changes can be checked using the following command:
es: El nuevo objeto host bare metal se inscribirá y cambiará su estado de "registering" (en registro) a "inspecting" (en inspección) y "available" (disponible). Los cambios se pueden comprobar con el siguiente comando:
ja: 新しいベアメタルホストオブジェクトが登録され、その状態が「Registering (登録中)」から「Inspecting (検査中)」に変わり、「Available (使用可能)」になります。この変更は次のコマンドを使用して確認できます。
pt_br: O novo objeto host bare metal será registrado, o que altera seu estado de "registrando" para "inspecionando" e "disponível". Para verificar as alterações, use o seguinte comando:
zh_cn: 随后会登记新裸机主机对象，其状态将从正在注册依次变为正在检查和可用。可使用以下命令检查状态变化：

source: The <literal>BaremetalHost</literal> object is in the <literal>registering</literal> state until the <literal>BMC</literal> credentials are validated. Once the credentials are validated, the <literal>BaremetalHost</literal> object changes its state to <literal>inspecting</literal>, and this step could take some time depending on the hardware (up to 20 minutes). During the inspecting phase, the hardware information is retrieved and the Kubernetes object is updated. Check the information using the following command: <literal>kubectl get bmh -o yaml</literal>.
es: El objeto <literal>BaremetalHost</literal> permanece en estado <literal>registering</literal> (en registro) hasta que se validan las credenciales de <literal>BMC</literal>. Una vez validadas las credenciales, el objeto <literal>BaremetalHost</literal> cambia su estado a <literal>inspecting</literal> (en inspección), y este paso puede tardar algún tiempo dependiendo del hardware (hasta 20 minutos). Durante la fase de inspección, se recupera la información del hardware y se actualiza el objeto de Kubernetes. Compruebe la información con el siguiente comando: <literal>kubectl get bmh -o yaml</literal>.
ja: <literal>BaremetalHost</literal>オブジェクトは、<literal>BMC</literal>の資格情報が検証されるまでは「<literal>Registering (登録中)</literal>」の状態です。資格情報の検証が完了すると、<literal>BaremetalHost</literal>オブジェクトの状態が「<literal>Inspecting (検査中)</literal>」に変わります。この手順はハードウェアによっては多少時間がかかる可能性があります(最大で20分)。「Inspecting (検査中)」のフェーズ中に、ハードウェア情報が取得されてKubernetesオブジェクトが更新されます。<literal>kubectl get bmh -o yaml</literal>コマンドを使用して情報を確認してください。
pt_br: O objeto <literal>BaremetalHost</literal> fica no estado <literal>registering</literal> até a validação das credenciais do <literal>BMC</literal>. Depois disso, o estado do objeto <literal>BaremetalHost</literal> muda para <literal>inspecting</literal>, e essa etapa pode levar algum tempo dependendo do hardware (até 20 minutos). Durante a fase de inspeção, as informações do hardware são recuperadas e o objeto Kubernetes é atualizado. Para verificar as informações, use o seguinte comando: <literal>kubectl get bmh -o yaml</literal>.
zh_cn: 在验证 <literal>BMC</literal> 身份凭证之前，<literal>BaremetalHost</literal> 对象将一直处于<literal>正在注册</literal>状态。验证身份凭证后，<literal>BaremetalHost</literal> 对象的状态将更改为<literal>正在检查</literal>，此步骤可能需要一段时间（最长 20 分钟），具体取决于所用的硬件。在检查阶段，将检索硬件信息并更新 Kubernetes 对象。使用以下命令检查信息：<literal>kubectl get bmh -o yaml</literal>。

source: <emphasis role="strong">Provision step</emphasis>
es: <emphasis role="strong">Paso de aprovisionamiento</emphasis>
ja: <emphasis role="strong">プロビジョニング手順</emphasis>
pt_br: <emphasis role="strong">Etapa de provisionamento</emphasis>
zh_cn: <emphasis role="strong">置备步骤</emphasis>

source: Once the bare-metal host is enrolled and available, the next step is to provision the bare-metal host to install and configure the operating system and the Kubernetes cluster. To do that, the following file (<literal>capi-provisioning-example.yaml</literal>) has to be created in the management-cluster with the following information (the <literal>capi-provisioning-example.yaml</literal> can be generated by joining the following blocks).
es: Una vez que el host bare metal está inscrito y disponible, el paso siguiente es aprovisionar el host bare metal para instalar y configurar el sistema operativo y el clúster de Kubernetes. Para ello, se debe crear el archivo <literal>capi-provisioning-example.yaml</literal> en el clúster de gestión con la siguiente información (el archivo <literal>capi-provisioning-example.yaml</literal> se puede generar uniendo los bloques siguientes).
ja: ベアメタルホストが登録されて使用可能になったら、次の手順で、ベアメタルホストをプロビジョニングしてオペレーティングシステムとKubernetesクラスタをインストールして設定します。そのためには、次の情報を使用して管理クラスタでファイル<literal>capi-provisioning-example.yaml</literal>を作成する必要があります(<literal>capi-provisioning-example.yaml</literal>は、以下のブロックを結合して生成できます)。
pt_br: Depois que o host bare metal for registrado e estiver disponível, a próxima etapa será provisioná-lo para instalar e configurar o sistema operacional e o cluster Kubernetes. Para fazer isso, é necessário criar este arquivo (<literal>capi-provisioning-example.yaml</literal>) no cluster de gerenciamento com as seguintes informações (é possível gerar o <literal>capi-provisioning-example.yaml</literal> unindo os blocos abaixo).
zh_cn: 裸机主机已登记并可供使用后，下一步是置备裸机主机，以安装并配置操作系统和 Kubernetes 群集。为此，必须在管理群集中创建以下文件 (<literal>capi-provisioning-example.yaml</literal>) 并在其中包含以下信息（可以通过合并以下块来生成 <literal>capi-provisioning-example.yaml</literal>）。

source: Only values between <literal>$\{…​\}</literal> must be replaced with the real values.
es: Solo los valores entre <literal>$\{…​\}</literal> deben sustituirse por los valores reales.
ja: 実際の値に置き換える必要があるのは、<literal>$\{…​\}</literal>の中の値だけです。
pt_br: Apenas os valores entre <literal>$\{…​\}</literal> devem ser substituídos pelos valores reais.
zh_cn: 只需将 <literal>${...}</literal> 中的值替换为实际值。

source: The following block is the cluster definition, where the networking can be configured using the <literal>pods</literal> and the <literal>services</literal> blocks. Also, it contains the references to the control plane and the infrastructure (using the <literal>Metal<superscript>3</superscript></literal> provider) objects to be used.
es: El siguiente bloque es la definición del clúster, donde se puede configurar la red utilizando los bloques <literal>pods</literal> y <literal>services</literal>. Además, contiene las referencias al plano de control y a los objetos de infraestructura (utilizando el proveedor de <literal>Metal<superscript>3</superscript></literal>) que se van a utilizar.
ja: 次のブロックはクラスタ定義です。ここで、<literal>pods</literal>ブロックと<literal>services</literal>ブロックを使用してネットワーキングを設定できます。また、ここにはコントロールプレーンオブジェクトと、使用するインフラストラクチャ(<literal>Metal<superscript>3</superscript></literal>プロバイダを使用)オブジェクトへの参照も含まれています。
pt_br: O bloco a seguir é a definição do cluster, em que a rede pode ser configurada usando os blocos <literal>pods</literal> e <literal>services</literal>. Ele também contém as referências aos objetos de plano de controle e infraestrutura (usando o provedor <literal>Metal<superscript>3</superscript></literal>) a serem usados.
zh_cn: 下面的块是群集定义，可在其中使用 <literal>pods</literal> 和 <literal>services</literal> 块来配置网络。此外，它还包含对要使用的控制平面和基础架构（使用 <literal>Metal<superscript>3</superscript></literal> 提供程序）对象的引用。

source: Both single-stack and dual-stack deployments are possible, remove the IPv6 CIDRs from the above definition for an IPv4 only cluster.
es: Se admiten despliegues tanto de una pila como de pila doble. Elimine los CIDR IPv6 de la definición de arriba para obtener un clúster solo IPv4.
ja: シングルスタックとデュアルスタック両方のデプロイメントが可能です。IPv4のみのクラスタの場合は、上記の定義からIPv6 CIDRを削除してください。
zh_cn: 单栈和双栈部署均受支持，如果为仅 IPv4 群集，可从上述定义中去除 IPv6 CIDR。

source: Single-stack IPv6 deployments are in tech preview status and not yet officially supported.
es: Los despliegues de una sola pila IPv6 están en estado de tecnología en fase preliminar y aún no se admiten.
ja: シングルスタックのIPv6デプロイメントは技術プレビュー状態であり、公式にはサポートされていません。
zh_cn: 单栈 IPv6 部署目前处于技术预览阶段，暂未提供正式支持。

source: The <literal>Metal3Cluster</literal> object specifies the control-plane endpoint (replacing the <literal>${DOWNSTREAM_CONTROL_PLANE_IPV4}</literal>) to be configured and the <literal>noCloudProvider</literal> because a bare-metal node is used.
es: El objeto <literal>Metal3Cluster</literal> especifica el punto final del plano de control (en sustitución de <literal>${DOWNSTREAM_CONTROL_PLANE_IPV4}</literal>) que se va a configurar y el objeto <literal>noCloudProvider</literal>, ya que se utiliza un nodo bare metal.
ja: <literal>Metal3Cluster</literal>オブジェクトには、設定するコントロールプレーンのエンドポイント(<literal>${DOWNSTREAM_CONTROL_PLANE_IPV4}</literal>を置き換える)と、<literal>noCloudProvider</literal>(ベアメタルノードを使用しているため)を指定します。
zh_cn: <literal>Metal3Cluster</literal> 对象指定要配置的控制平面端点（请替换 <literal>${DOWNSTREAM_CONTROL_PLANE_IPV4}</literal>），以及 <literal>noCloudProvider</literal>（因为使用的是裸机节点）。
