Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Some hardware requires an image with a large sector size, i.e. <emphasis role="strong">4096 bytes</emphasis> rather than the standard 512 bytes. The containerized Kiwi builder supports the ability to generate images with large block size by specifying the "<emphasis role="strong">-b</emphasis>" parameter. For example, to build a "<emphasis role="strong">Default-SelfInstall</emphasis>" image with a large sector size:
es: Hay hardware que requiere una imagen con un tamaño de sectores grandes; por ejemplo, de <emphasis role="strong">4096 bytes</emphasis> en lugar de los 512 bytes estándar. El creador en contenedor de Kiwi permite generar imágenes con bloques grandes especificando el parámetro "<emphasis role="strong">-b</emphasis>". Por ejemplo, para crear una imagen "<emphasis role="strong">Default-SelfInstall</emphasis>" con sectores grandes:
ja: ハードウェアによっては、大きいセクタサイズ、つまり標準の512バイトではなく<emphasis role="strong">4096バイト</emphasis>のイメージが必要になることがあります。コンテナ化されたKiwi Builderでは、「<emphasis role="strong">-b</emphasis>」パラメータを指定することで、大きいブロックサイズのイメージを生成できます。たとえば、大きいセクタサイズを使用して「<emphasis role="strong">Default-SelfInstall</emphasis>」イメージを構築するには、次のコマンドを使用します。
pt_br: Alguns modelos de hardware exigem imagens com tamanho de setor grande, ou seja, <emphasis role="strong">4096 bytes</emphasis> em vez do padrão de 512 bytes. O construtor Kiwi conteinerizado permite gerar imagens com tamanho de bloco grande especificando o parâmetro "<emphasis role="strong">-b</emphasis>". Por exemplo, para criar a imagem "<emphasis role="strong">Default-SelfInstall</emphasis>" com um tamanho de setor grande:
zh_cn: 有些硬件要求映像采用大扇区大小（即 <emphasis role="strong">4096 字节</emphasis>，而非标准的 512 字节）。容器化 Kiwi 构建器支持通过指定“<emphasis role="strong">-b</emphasis>”参数生成大块大小的映像。例如，要构建大扇区大小的“<emphasis role="strong">Default-SelfInstall</emphasis>”映像，请运行：

source: Using a custom Kiwi image definition file
es: Uso de un archivo de definición de imagen de Kiwi personalizado
ja: カスタムのKiwiイメージ定義ファイルの使用
pt_br: Usando um arquivo de definição de imagem personalizado do Kiwi
zh_cn: 创建自定义 Kiwi 映像定义文件

source: For advanced use-cases a custom Kiwi image definition file (<literal>SL-Micro.kiwi</literal>) can be used along with any necessary post-build scripts. This requires overriding the default definitions pre-packaged by the SUSE Edge team.
es: En ciertos casos de uso avanzados, es posible usar un archivo de definición de imagen de Kiwi personalizado (<literal>SL-Micro.kiwi</literal>) junto con los guiones de postcreación necesarios. Para ello, habrá que anular las definiciones predeterminadas preempaquetadas por el equipo de SUSE Edge.
ja: 高度なユースケースでは、カスタムのKiwiイメージ定義ファイル(<literal>SL-Micro.kiwi</literal>)を、必要な構築後スクリプトとともに使用できます。このためには、SUSE Edgeチームによって事前にパッケージ化されているデフォルトの定義を上書きする必要があります。
pt_br: Para casos de uso avançados, é possível usar um arquivo de definição de imagem personalizado do Kiwi (<literal>SL-Micro.kiwi</literal>) junto com os scripts necessários após a criação. Para isso, substitua as definições padrão predefinidas pela equipe do SUSE Edge.
zh_cn: 对于高级使用场景，可以使用自定义 Kiwi 映像定义文件 (<literal>SL-Micro.kiwi</literal>) 以及任何必要的构建后脚本。这需要覆盖 SUSE Edge 团队预先打包的默认定义。

source: Create a new directory and map it into the container image where the helper script is looking (<literal>/micro-sdk/defs</literal>):
es: Cree un directorio nuevo y asígnelo a la imagen de contenedor donde busca el guion de ayuda (<literal>/micro-sdk/defs</literal>):
ja: 新しいディレクトリを作成し、ヘルパースクリプトが参照するコンテナイメージにマップします(<literal>/micro-sdk/defs</literal>)。
pt_br: Crie e mapeie um novo diretório para a imagem do contêiner em que o script auxiliar faz a busca (<literal>/micro-sdk/defs</literal>):
zh_cn: 创建一个新目录，并将其映射到容器映像中辅助脚本将查找定义文件的目录 (<literal>/micro-sdk/defs</literal>)：

source: This is only required for advanced use-cases and may cause supportability issues. Please contact your SUSE representative for further advice and guidance.
es: Esto solo es necesario para casos de uso avanzados y puede causar problemas de compatibilidad. Póngase en contacto con su representante de SUSE para obtener más ayuda.
ja: これは、高度なユースケースにおいて、サポート性に問題が生じる可能性がある場合にのみ必要です。詳細なアドバイスとガイダンスについては、SUSEの担当者にお問い合わせください。
pt_br: Isso é necessário apenas em casos de uso avançados e pode causar problemas de suporte. Contate seu representante SUSE para receber mais conselhos e orientações.
zh_cn: 此操作仅适用于高级使用场景，可能会导致可支持性问题。请联系您的 SUSE 代表以获取进一步建议和指导。

source: To get the default Kiwi image definition files included in the container, the following commands can be used:
es: Para obtener los archivos de definición de imagen de Kiwi por defecto incluidos en el contenedor, se pueden utilizar los siguientes comandos:
ja: コンテナに含まれるデフォルトのKiwiイメージ定義ファイルを取得するには、次のコマンドを使用できます。
pt_br: Para acessar os arquivos de definição de imagem padrão do Kiwi incluídos no contêiner, use os seguintes comandos:
zh_cn: 要获取容器中包含的默认 Kiwi 映像定义文件，可使用以下命令：

source: Using clusterclass to deploy downstream clusters
es: Uso de ClusterClass para desplegar clústeres descendentes
ja: ClusterClassを使用したダウンストリームクラスタのデプロイ
pt_br: Usando clusterclass para implantar clusters downstream
zh_cn: 使用 clusterclass 部署下游群集

source: Introduction
es: Introducción
ja: はじめに
pt_br: Introdução
zh_cn: 简介

source: Provisioning Kubernetes clusters is a complex task that demands deep expertise in configuring cluster components. As configurations grow more intricate, or as the demands of different providers introduce numerous provider-specific resource definitions, cluster creation can feel daunting. Thankfully, Kubernetes Cluster API (CAPI) offers a more elegant, declarative approach that is further enhanced by ClusterClass. This feature introduces a template-driven model, allowing you to define a reusable cluster class that encapsulates complexity and promotes consistency.
es: El aprovisionamiento de clústeres de Kubernetes es una tarea compleja que requiere una gran experiencia a la hora de configurar los componentes del clúster. A medida que las configuraciones se vuelven más complejas, o que las exigencias de los diferentes proveedores introducen numerosas definiciones de recursos específicas para cada uno, la creación de clústeres puede resultar abrumadora. Afortunadamente, la API de clústeres de Kubernetes (Cluster API, CAPI) ofrece un enfoque elegante y claro aún más reforzado gracias a ClusterClass. Esta función introduce un modelo basado en plantillas que permite definir una clase de clúster reutilizable que encapsula la complejidad y promueve la coherencia.
ja: Kubernetesクラスタのプロビジョニングは、クラスタコンポーネントの設定に深い専門知識が求められる複雑な作業です。設定が複雑化したり、さまざまなプロバイダからの要求により多数のプロバイダ固有のリソース定義が導入されたりすると、クラスタの作成が困難に感じられるかもしれません。幸いなことに、Kubernetes Cluster API (CAPI)は、ClusterClassによってさらに強化された、より洗練された宣言型アプローチを提供します。この機能はテンプレート駆動型モデルを導入し、複雑さをカプセル化して一貫性を促進する再利用可能なクラスタクラスを定義できます。
pt_br: O provisionamento de clusters Kubernetes é uma tarefa complexa que demanda profunda experiência na configuração de componentes de cluster. À medida que as configurações se tornam cada vez mais complexas, ou as demandas de diversos provedores geram inúmeras definições de recursos específicas do provedor, a criação de clusters pode ser um processo assustador. Felizmente, a Kubernetes Cluster API (CAPI) oferece uma abordagem declarativa e mais refinada que é aprimorada pelo ClusterClass. Esse recurso apresenta um modelo orientado por gabarito que permite definir uma classe de cluster reutilizável que encapsula a complexidade e promove a consistência.
zh_cn: 置备 Kubernetes 群集是一项复杂的任务，需要具备深入的群集组件配置专业知识。随着配置变得愈发复杂，或者不同提供商的需求引入了大量提供商专用的资源定义，群集创建可能会让人望而生畏。值得庆幸的是，Kubernetes Cluster API (CAPI) 提供了一种更简洁的声明式方法，而 ClusterClass 进一步增强了这种方法。此功能引入了一种基于模板的模型，允许您定义可重用的群集类，该类封装了复杂性并提升了一致性。

source: What is ClusterClass?
es: ¿Qué es ClusterClass?
ja: ClusterClassとは
pt_br: O que é ClusterClass?
zh_cn: 什么是 ClusterClass？

source: The CAPI project introduced the ClusterClass feature as a paradigm shift in Kubernetes cluster lifecycle management through the adoption of a template-based methodology for cluster instantiation. Instead of defining resources independently for every cluster, users define a ClusterClass, which serves as a comprehensive and reusable blueprint. This abstract representation encapsulates the desired state and configuration of a Kubernetes cluster, enabling the rapid and consistent creation of multiple clusters that adhere to the defined specifications. This abstraction reduces the configuration burden, resulting in more manageable deployment manifests. This means that the core components of a workload cluster are defined at the class level allowing users to use these templates as Kubernetes cluster flavors that can be reused one/many times for cluster provisioning. The implementation of ClusterClass yields several key advantages that address the inherent challenges of traditional CAPI management at scale:
es: El proyecto CAPI introdujo la función ClusterClass como un cambio de paradigma en la gestión del ciclo de vida de los clústeres de Kubernetes mediante la adopción de una metodología basada en plantillas para la instanciación de clústeres. En lugar de definir los recursos de forma independiente para cada clúster, los usuarios definen una ClusterClass, que sirve como un modelo completo y reutilizable. Esta representación abstracta encapsula el estado y la configuración deseados de un clúster de Kubernetes, lo que permite la creación rápida y coherente de múltiples clústeres que se ajustan a las especificaciones definidas. Esta abstracción reduce la carga de configuración, lo que da como resultado manifiestos de despliegue más manejables. Esto significa que los componentes centrales de un clúster de carga de trabajo se definen a nivel de clase, lo que permite a los usuarios utilizar estas plantillas como variantes de clústeres de Kubernetes que se pueden reutilizar una o varias veces para el aprovisionamiento de clústeres. La implementación de ClusterClass ofrece varias ventajas clave que abordan los retos inherentes a la gestión tradicional de CAPI a gran escala:
ja: CAPIプロジェクトは、クラスタのインスタンス化にテンプレートベースの手法を採用することで、Kubernetesクラスタのライフサイクル管理におけるパラダイムシフトとしてClusterClass機能を導入しました。ユーザがクラスタごとにリソースを個別に定義する代わりに、ClusterClassを定義することで、ClusterClassは包括的で再利用可能なブループリントとして機能します。この抽象データ型表現は、Kubernetesクラスタの望ましい状態と設定をカプセル化し、定義された仕様に準拠した複数のクラスタを迅速かつ一貫して作成できるようにします。この抽象データ型により、設定の負担が軽減され、より管理しやすいデプロイメントマニフェストが実現されます。つまり、ワークロードクラスタのコアコンポーネントはクラスレベルで定義されるため、ユーザはこれらのテンプレートをKubernetesクラスタのフレーバーとして使用し、クラスタのプロビジョニングに1回または複数回再利用できるようになります。ClusterClassの実装は、従来の大規模なCAPI管理に固有の課題に対処するいくつかの重要な利点をもたらします。
pt_br: O projeto CAPI lançou o recurso ClusterClass como uma mudança de paradigma no gerenciamento do ciclo de vida de clusters Kubernetes por meio da adoção de uma metodologia baseada em gabarito para criação de instâncias de cluster. Em vez de definir recursos separadamente para cada cluster, os usuários definem um ClusterClass, que serve como um diagrama de referência abrangente e reutilizável. Essa representação abstrata encapsula o estado e a configuração desejados de um cluster Kubernetes, o que permite a criação rápida e consistente de vários clusters que seguem as especificações definidas. Essa abstração reduz a sobrecarga de configuração, resultando em manifestos de implantação mais gerenciáveis. Isso significa que os componentes principais de um cluster de carga de trabalho são definidos no nível da classe, permitindo que os usuários recorram a esses gabaritos como variantes de cluster Kubernetes que podem ser reutilizadas uma ou várias vezes para provisionamento de clusters. A implementação do ClusterClass oferece diversas vantagens importantes que abordam os desafios inerentes ao gerenciamento tradicional da CAPI em escala:
zh_cn: CAPI 项目引入了 ClusterClass 功能，通过采用基于模板的群集实例化方法，实现了 Kubernetes 群集生命周期管理的范式转变。用户无需为每个群集独立定义资源，而是定义一个 ClusterClass，将它作为一个全面且可重用的蓝图。这种抽象表示封装了 Kubernetes 群集的期望状态和配置，让您能快速、一致地创建多个符合已定义规范的群集。这种抽象化减轻了配置负担，使部署清单更易于管理。这意味着工作负载群集的核心组件在类级别定义，这样用户便可将这些模板用作 Kubernetes 群集版本，可多次重用以置备群集。ClusterClass 的实现提供了多项关键优势，解决了传统 CAPI 大规模管理所固有的挑战：

source: Substantial Reduction in Complexity and YAML Verbosity
es: Reducción sustancial de la complejidad y la redundancia de YAML
ja: 複雑さとYAMLの冗長性を大幅に削減
pt_br: Redução significativa na complexidade e detalhamento do YAML
zh_cn: 大幅降低复杂性和 YAML 冗余度

source: Optimized Maintenance and Update Processes
es: Procesos de mantenimiento y actualización optimizados
ja: 最適化された保守と更新プロセス
pt_br: Processos otimizados de manutenção e atualização
zh_cn: 优化维护和更新过程

source: Enhanced Consistency and Standardization Across Deployments
es: Mejora en la coherencia y la estandarización entre despliegues
ja: デプロイメント全体における一貫性と標準化の強化
pt_br: Consistência e padronização aprimoradas nas implantações
zh_cn: 增强部署间的一致性和标准化

source: Improved Scalability and Automation Capabilities
es: Mejora en la escalabilidad y las capacidades de automatización
ja: スケーラビリティと自動化機能の向上
pt_br: Escalabilidade e recursos de automação aprimorados
zh_cn: 提高可扩展性和自动化能力

source: Declarative Management and Robust Version Control
es: Gestión declarativa y control de versiones robusto
ja: 宣言型管理と堅牢なバージョン管理
pt_br: Gerenciamento declarativo e controle de versão robusto
zh_cn: 声明式管理和强大的版本控制

source: Example of current CAPI provisioning file
es: Ejemplo de archivo de aprovisionamiento de CAPI actual
ja: 現在のCAPIプロビジョニングファイルの例
pt_br: Exemplo de arquivo de provisionamento da CAPI atual
zh_cn: 当前 CAPI 置备文件示例

source: The deployment of a Kubernetes cluster leveraging the Cluster API (CAPI) and the RKE2 provider requires definition of several custom resources. These resources define the desired state of the cluster and its underlying infrastructure, enabling CAPI to orchestrate the provisioning and management lifecycle. The code snippet below illustrates the resource types that must be configured:
es: El despliegue de un clúster de Kubernetes que aproveche Cluster API (CAPI) y el proveedor RKE2 requiere la definición de varios recursos personalizados. Estos recursos definen el estado deseado del clúster y su infraestructura subyacente, lo que permite a CAPI orquestar el ciclo de vida del aprovisionamiento y gestión. El fragmento de código siguiente ilustra los tipos de recursos que deben configurarse:
ja: Cluster API (CAPI)とRKE2プロバイダを活用するKubernetesクラスタのデプロイメントには、いくつかのカスタムリソースの定義が必要です。これらのリソースは、クラスタとその基盤となるインフラストラクチャの望ましい状態を定義し、CAPIがプロビジョニングと管理のライフサイクルをオーケストレーションできるようにします。以下のコードスニペットは設定する必要のあるリソースタイプを示しています。
pt_br: A implantação de um cluster Kubernetes por meio do provedor Cluster API (CAPI) e RKE2 requer a definição de vários recursos personalizados. Esses recursos definem o estado desejado do cluster e sua infraestrutura subjacente, o que permite à CAPI orquestrar o provisionamento e o ciclo de vida de gerenciamento. O trecho do código a seguir ilustra os tipos de recursos que devem ser configurados:
zh_cn: 利用 Cluster API (CAPI) 和 RKE2 提供程序部署 Kubernetes 群集需要定义多个自定义资源。这些资源定义了群集及其底层基础架构的期望状态，使 CAPI 能够编排置备和管理生命周期。下面的代码段说明了必须配置的资源类型：

source: <emphasis role="strong">Cluster</emphasis>: This resource encapsulates high-level configurations, including the network topology that will govern inter-node communication and service discovery. Furthermore, it establishes essential linkages to the control plane specification and the designated infrastructure provider resource, thereby informing CAPI about the desired cluster architecture and the underlying infrastructure upon which it will be provisioned.
es: <emphasis role="strong">Cluster</emphasis>: este recurso encapsula configuraciones generales, incluida la topología de red que regirá la comunicación entre nodos y la detección de servicios. Además, establece los vínculos esenciales con la especificación del plano de control y el recurso del proveedor de infraestructura designado, informando así a CAPI sobre la arquitectura de clúster deseada y la infraestructura subyacente sobre la que se aprovisionará.
ja: <emphasis role="strong">Cluster</emphasis>: このリソースは、ノード間の通信とサービスディスカバリを制御するネットワークトポロジを含む、高レベルな設定をカプセル化します。さらに、コントロールプレーン仕様と指定されたインフラストラクチャプロバイダリソースとの重要なリンクを確立し、これにより望ましいクラスタアーキテクチャと、そのプロビジョニング対象となる基盤インフラストラクチャについてCAPIに通知します。
pt_br: <emphasis role="strong">Cluster</emphasis>: esse recurso encapsula as configurações de alto nível, incluindo a topologia de rede que controla a comunicação entre os nós e a descoberta de serviços. Ele também estabelece vínculos essenciais com a especificação do plano de controle e o recurso do provedor de infraestrutura designado e, desse modo, informa a CAPI sobre a arquitetura desejada do cluster e a infraestrutura subjacente na qual ele deverá ser provisionado.
zh_cn: <emphasis role="strong">群集</emphasis>：此资源封装了总体配置，包括将管理节点间通信和服务发现的网络拓扑。此外，它还建立了与控制平面规范和指定的基础架构提供程序资源的必要关联，从而告知 CAPI 期望的群集体系结构及将用于置备群集的底层基础架构。

source: <emphasis role="strong">Metal3Cluster</emphasis>: This resource defines infrastructure-level attributes unique to Metal3, for example the external endpoint through which the Kubernetes API server will be accessible.
es: <emphasis role="strong">Metal3Cluster</emphasis>: este recurso define los atributos a nivel de infraestructura exclusivos de Metal3; por ejemplo, el punto final externo a través del cual se podrá acceder al servidor de API de Kubernetes.
ja: <emphasis role="strong">Metal3Cluster</emphasis>: このリソースは、Metal3に固有のインフラストラクチャレベルの属性を定義します。たとえば、Kubernetes APIサーバにアクセスできる外部エンドポイントなど。
pt_br: <emphasis role="strong">Metal3Cluster</emphasis>: esse recurso define os atributos no nível da infraestrutura exclusivos do Metal3, por exemplo, o endpoint externo pelo qual o servidor da API Kubernetes estará acessível.
zh_cn: <emphasis role="strong">Metal3Cluster</emphasis>：此资源定义 Metal3 特有的基础架构级属性，例如 Kubernetes API 服务器可通过其访问的外部端点。

source: <emphasis role="strong">RKE2ControlPlane</emphasis>: The RKE2ControlPlane resource defines the characteristics and behavior of the cluster’s control plane nodes. Within this specification, parameters such as the desired number of control plane replicas (crucial for ensuring high availability and fault tolerance), the specific Kubernetes distribution version (aligned with the chosen RKE2 release), and the strategy for rolling out updates to the control plane components are configured. Additionally, this resource dictates the Container Network Interface (CNI) to be employed within the cluster and facilitates the injection of agent-specific configurations, often leveraging Ignition for seamless and automated provisioning of the RKE2 agents on the control plane nodes.
es: <emphasis role="strong">RKE2ControlPlane</emphasis>: este recurso define las características y el comportamiento de los nodos de plano de control del clúster. Dentro de esta especificación, se configuran parámetros como el número deseado de réplicas del plano de control (fundamental para garantizar una alta disponibilidad y tolerancia a fallos), la versión específica de la distribución de Kubernetes (alineada con la versión elegida de RKE2) y la estrategia para distribuir actualizaciones en los componentes de plano de control. Además, este recurso dicta la interfaz de red de contenedores (CNI) que se empleará dentro del clúster y facilita la inyección de configuraciones específicas del agente, a menudo aprovechando Ignition para el aprovisionamiento automatizado y sin interrupciones de los agentes RKE2 en los nodos de plano de control.
ja: <emphasis role="strong">RKE2ControlPlane</emphasis>: RKE2ControlPlaneリソースは、クラスタのコントロールプレーンノードの特性と動作を定義します。この仕様では、コントロールプレーンレプリカの必要な数(高可用性と耐障害性を確保するために重要)、特定のKubernetesディストリビューションのバージョン(選択したRKE2リリースと一致)、コントロールプレーンコンポーネントへの更新展開戦略などのパラメータが設定されます。さらに、このリソースはクラスタ内で使用されるContainer Network Interface (CNI)を指定し、エージェント固有の設定の注入を容易にします。これには多くの場合、コントロールプレーンノード上のRKE2エージェントのシームレスで自動化されたプロビジョニングのためにIgnitionが活用されます。
pt_br: <emphasis role="strong">RKE2ControlPlane</emphasis>: esse recurso define as características e o comportamento dos nós do plano de controle do cluster. Nessa especificação, os parâmetros, como o número desejado de réplicas do plano de controle (essencial para garantir alta disponibilidade e tolerância a falhas), a versão da distribuição Kubernetes específica (alinhada à versão do RKE2 selecionada) e a estratégia de distribuição das atualizações para os componentes do plano de controle são configurados. Além disso, esse recurso determina a interface de rede de contêiner (CNI, Container Network Interface) que será usada dentro do cluster e facilita a injeção das configurações específicas do agente, em geral aproveitando o Ignition para provisionamento contínuo e automatizado dos agentes do RKE2 nos nós do plano de controle.
zh_cn: <emphasis role="strong">RKE2ControlPlane</emphasis>：此资源定义群集控制平面节点的特性和行为。此规范中配置了期望的控制平面复本数量（对确保高可用性和容错能力至关重要）、特定的 Kubernetes 发行版版本（与所选的 RKE2 版本一致），以及控制平面组件的滚动更新策略等参数。此外，此资源规定了将在群集中采用的容器网络接口 (CNI)，便于注入特定代理的配置，通常利用 Ignition 来无缝自动完成控制平面节点的 RKE2 代理置备。

source: <emphasis role="strong">Metal3MachineTemplate</emphasis>: This resource acts as a blueprint for the creation of the individual compute instances that will form the worker nodes of the Kubernetes cluster defining the image to be used.
es: <emphasis role="strong">Metal3MachineTemplate</emphasis>: este recurso actúa como un modelo para la creación de las instancias de computación individuales que formarán los nodos de trabajador del clúster de Kubernetes, definiendo la imagen que se utilizará.
ja: <emphasis role="strong">Metal3MachineTemplate</emphasis>: このリソースは、使用されるイメージを定義するKubernetesクラスタのワーカーノードを形成する、個々のコンピューティングインスタンス作成のブループリントとして機能します。
pt_br: <emphasis role="strong">Metal3MachineTemplate</emphasis>: esse recurso funciona como um diagrama de referência para criação das instâncias de computação individuais que formam os nós do worker do cluster Kubernetes definindo a imagem que será usada.
zh_cn: <emphasis role="strong">Metal3MachineTemplate</emphasis>：此资源充当将构成 Kubernetes 群集工作节点的各计算实例的创建蓝图，定义了要使用的映像。

source: <emphasis role="strong">Metal3DataTemplate</emphasis>: Complementing the Metal3MachineTemplate, the Metal3DataTemplate resource enables additional metadata to be specified for the newly provisioned machine instances.
es: <emphasis role="strong">Metal3DataTemplate</emphasis>: como complemento de Metal3MachineTemplate, el recurso Metal3DataTemplate permite especificar metadatos adicionales para los equipos recién aprovisionados.
ja: <emphasis role="strong">Metal3DataTemplate</emphasis>: Metal3MachineTemplateを補完するMetal3DataTemplateリソースは、追加のメタデータを新たにプロビジョニングされたマシンインスタンスに指定できるようにします。
pt_br: <emphasis role="strong">Metal3DataTemplate</emphasis>: como complemento ao Metal3MachineTemplate, o recurso Metal3DataTemplate permite especificar metadados adicionais para instâncias de máquina recém-provisionadas.
zh_cn: <emphasis role="strong">Metal3DataTemplate</emphasis>：此资源作为 Metal3MachineTemplate 的补充，可用于为新置备的计算机实例指定其他元数据。

source: Transforming the CAPI provisioning file to ClusterClass
es: Transformación del archivo de aprovisionamiento de CAPI en ClusterClass
ja: CAPIプロビジョニングファイルのClusterClassへの変換
pt_br: Transformando o arquivo de provisionamento da CAPI em ClusterClass
zh_cn: 将 CAPI 置备文件转换为 ClusterClass

source: ClusterClass definition
es: Definición de ClusterClass
ja: ClusterClass定義
pt_br: Definição do ClusterClass
zh_cn: ClusterClass 定义
