Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis role="strong">Fleet</emphasis> is used to deploy and manage <literal>SUC plans</literal> onto the desired cluster.
es: <emphasis role="strong">Fleet</emphasis> se usa para desplegar y gestionar <literal>planes de SUC</literal> en el clúster deseado.
ja: <emphasis role="strong">Fleet</emphasis>は、<literal>SUC Plan</literal>を目的のクラスタにデプロイおよび管理するために使用されます。
pt_br: O <emphasis role="strong">Fleet</emphasis> é usado para implantar e gerenciar os <literal>planos do SUC</literal> no cluster desejado.
zh_cn: <emphasis role="strong">Fleet</emphasis> 用于将 <literal>SUC 计划</literal>部署到目标群集并对其进行管理。

source: <literal>SUC plans</literal> are <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">custom resources</link> that describe the steps that <literal>SUC</literal> needs to follow in order for a specific task to be executed on a set of nodes. For an example of how an <literal>SUC plan</literal> looks like, refer to the <link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">upstream repository</link>.
es: Los <literal>planes de SUC</literal> son <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> que describen los pasos que debe seguir <literal>SUC</literal> para ejecutar una tarea específica en un conjunto de nodos. Para ver un ejemplo de cómo es un <literal>plan de SUC</literal>, consulte el <link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">repositorio original</link>.
ja: <literal>SUC Plan</literal>は、特定のタスクをノードセットで実行するために<literal>SUC</literal>が従う必要がある手順を記述した<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">カスタムリソース</link>です。<literal>SUC Plan</literal>の例については、<link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">アップストリームリポジトリ</link>を参照してください。
pt_br: Os <literal>planos do SUC</literal> são <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> que descrevem as etapas que o <literal>SUC</literal> precisa seguir para execução de uma tarefa específica em um conjunto de nós. Para ver um exemplo de como é um <literal>plano do SUC</literal>, consulte o <link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">repositório upstream</link>.
zh_cn: <literal>SUC 计划</literal>是一种<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">自定义资源</link>，描述了 <literal>SUC</literal> 为在一组节点上执行特定任务而需要遵循的步骤。有关 <literal>SUC 计划</literal>的示例，请参见<link xl:href="https://github.com/rancher/system-upgrade-controller?tab=readme-ov-file#example-plans">上游储存库</link>。

source: The <literal>OS SUC plans</literal> are shipped to each cluster by deploying a <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> or <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> resource to a specific Fleet <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">workspace</link>. Fleet retrieves the deployed <literal>GitRepo/Bundle</literal> and deploys its contents (the <literal>OS SUC plans</literal>) to the desired cluster(s).
es: Los <literal>planes de SUC de sistema operativo</literal> se envían a cada clúster desplegando un recurso <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> o <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> a un <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">espacio de trabajo</link> de Fleet específico. Fleet recupera el <literal>GitRepo/Bundle</literal> desplegado y despliega su contenido (los <literal>planes de SUC de sistema operativo</literal>) en los clústeres deseados.
ja: <literal>OS SUC Plan</literal>は、<link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link>または<link xl:href="https://fleet.rancher.io/bundle-add">バンドル</link>リソースを特定のFleet<link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">ワークスペース</link>にデプロイすることで、各クラスタに配布されます。Fleetはデプロイされた<literal>GitRepo/Bundle</literal>を取得し、その内容 (<literal>OS SUC plan</literal>)を目的のクラスタにデプロイします。
pt_br: Os <literal>planos do SUC de sistema operacional</literal> são enviados a cada cluster por meio da implantação de um recurso <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> ou <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> em um <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">espaço de trabalho</link> do Fleet específico. O Fleet recupera o <literal>GitRepo/Bundle</literal> implantado e implanta seu conteúdo (os <literal>planos do SUC de sistema operacional</literal>) no(s) cluster(s) desejado(s).
zh_cn: 通过向特定 Fleet <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">工作区</link>部署 <link xl:href="https://fleet.rancher.io/gitrepo-add">GitRepo</link> 或<link xl:href="https://fleet.rancher.io/bundle-add">捆绑包</link>资源将<literal>操作系统 SUC 计划</literal>分发到各个群集。Fleet 会获取已部署的 <literal>GitRepo/捆绑包</literal>，并将其内容（<literal>操作系统 SUC 计划</literal>）部署到目标群集。

source: <literal>GitRepo/Bundle</literal> resources are always deployed on the <literal>management cluster</literal>. Whether to use a <literal>GitRepo</literal> or <literal>Bundle</literal> resource depends on your use-case, check <xref linkend="management-day2-fleet-determine-use-case"/> for more information.
es: Los recursos <literal>GitRepo/Bundle</literal> siempre se despliegan en el <literal>clúster de gestión</literal>. Que se use un recurso <literal>GitRepo</literal> o <literal>Bundle</literal> depende del caso de uso. Consulte la <xref linkend="management-day2-fleet-determine-use-case"/> para obtener más información.
ja: <literal>GitRepo/バンドル</literal>リソースは常に、<literal>管理クラスタ</literal>上にデプロイされます。<literal>GitRepo</literal>リソースを使用するか<literal>バンドル</literal>リソースを使用するかは、ユースケースによって異なります。詳細については、<xref linkend="management-day2-fleet-determine-use-case"/>をご確認ください。
pt_br: Os recursos <literal>GitRepo/Bundle</literal> sempre são implantados no <literal>cluster de gerenciamento</literal>. O uso do recurso <literal>GitRepo</literal> ou <literal>Bundle</literal> depende do seu caso de uso. Consulte a <xref linkend="management-day2-fleet-determine-use-case"/> para obter mais informações.
zh_cn: <literal>GitRepo/捆绑包</literal>资源始终部署在<literal>管理群集</literal>上。使用 <literal>GitRepo</literal> 还是<literal>捆绑包</literal>资源取决于具体应用场景，有关详细信息，请参见<xref linkend="management-day2-fleet-determine-use-case"/>。

source: <literal>OS SUC plans</literal> describe the following workflow:
es: Los <literal>planes de SUC de sistema operativo</literal> describen el siguiente flujo de trabajo:
ja: <literal>OS SUC Plan</literal>は、次のワークフローを記述します。
pt_br: Os <literal>planos do SUC de sistema operacional</literal> descrevem o seguinte fluxo de trabalho:
zh_cn: <literal>操作系统 SUC 计划</literal>描述了以下工作流程：

source: Always <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link> the nodes before OS upgrades.
es: Use siempre el comando <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link> en los nodos antes de las actualizaciones del sistema operativo.
ja: 常に、OSをアップグレードする前に、ノードを<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link>します。
pt_br: Sempre use o comando <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">cordon</link> nos nós antes dos upgrades de sistema operacional.
zh_cn: 执行操作系统升级前，务必要<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_cordon/">封锁</link>节点。

source: Always upgrade <literal>control-plane</literal> nodes before <literal>worker</literal> nodes.
es: Actualice siempre los nodos <literal>control-plane</literal> antes que los nodos <literal>worker</literal>.
ja: 常に、 <literal>ワーカー</literal>ノードの前に<literal>コントロールプレーン</literal>ノードをアップグレードします。
pt_br: Sempre faça upgrade dos nós do <literal>plano de controle</literal> antes dos nós do <literal>worker</literal>.
zh_cn: 务必先升级<literal>控制平面</literal>节点，再升级<literal>工作</literal>节点。

source: Always upgrade the cluster on a <emphasis role="strong">one</emphasis> node at a time basis.
es: Actualice siempre el clúster en un <emphasis role="strong">único</emphasis> nodo cada vez.
ja: 常に、一度に <emphasis role="strong">1</emphasis>ノードずつクラスタをアップグレードします。
pt_br: Sempre faça upgrade do cluster <emphasis role="strong">um</emphasis> nó de cada vez.
zh_cn: 升级群集时，务必<emphasis role="strong">逐个</emphasis>节点依序升级。

source: Once the <literal>OS SUC plans</literal> are deployed, the workflow looks like this:
es: Una vez desplegados los <literal>planes de SUC de sistema operativo</literal>, el flujo de trabajo es el siguiente:
ja: <literal>OS SUC Plan</literal>がデプロイされると、ワークフローは次のようになります。
pt_br: Depois que os <literal>planos do SUC de sistema operacional</literal> forem implantados, o fluxo de trabalho terá esta aparência:
zh_cn: 部署<literal>操作系统 SUC 计划</literal>后，工作流程如下：

source: SUC reconciles the deployed <literal>OS SUC plans</literal> and creates a <literal>Kubernetes Job</literal> on <emphasis role="strong">each node</emphasis>.
es: SUC reconcilia los <literal>planes de SUC de sistema operativo</literal> desplegados y crea un <literal>trabajo de Kubernetes</literal> en <emphasis role="strong">cada nodo</emphasis>.
ja: SUCは、デプロイされた<literal>OS SUC Plan</literal>を照合し、<literal>Kubernetes Job</literal>を<emphasis role="strong">各ノード</emphasis>に作成します。
pt_br: O SUC reconcilia os <literal>planos do SUC de sistema operacional</literal> implantados e cria um <literal>Kubernetes Job</literal> em <emphasis role="strong">cada nó</emphasis>.
zh_cn: SUC 协调已部署的<literal>操作系统 SUC 计划</literal>，并在<emphasis role="strong">每个节点</emphasis>上创建一个 <literal>Kubernetes 作业</literal>。

source: The <literal>Kubernetes Job</literal> creates a systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>) for either package upgrade, or OS migration.
es: El <literal>trabajo de Kubernetes</literal> crea un servicio systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>) para la actualización de paquetes o para la migración del sistema operativo.
ja: <literal>Kubernetes Job</literal>は、パッケージのアップグレードまたはOSマイグレーションのためにsystemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>)を作成します。
pt_br: O <literal>Kubernetes Job</literal> cria um systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>) para upgrade de pacote ou migração de sistema operacional.
zh_cn: <literal>Kubernetes 作业</literal>创建一个 systemd.service（<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>），用于执行软件包升级或操作系统迁移。

source: The created <literal>systemd.service</literal> triggers the OS upgrade process on the specific node.
es: El servicio <literal>systemd.service</literal> creado activa el proceso de actualización del sistema operativo en el nodo específico.
ja: 作成された <literal>systemd.service</literal>は、特定のノードでOSアップグレードプロセスをトリガします。
pt_br: O <literal>systemd.service</literal> criado aciona o processo de upgrade de sistema operacional no nó específico.
zh_cn: 所创建的 <literal>systemd.service</literal> 触发特定节点上的操作系统升级过程。

source: Once the OS upgrade process finishes, the corresponding node will be <literal>rebooted</literal> to apply the updates on the system.
es: Cuando finaliza el proceso de actualización del sistema operativo, el nodo correspondiente se <literal>rearranca</literal> para aplicar las actualizaciones en el sistema.
ja: OSアップグレードプロセスが終了すると、対応するノードが <literal>再起動</literal>され、システムに更新が適用されます。
pt_br: Após o término do processo de upgrade do sistema operacional, o nó correspondente será <literal>reinicializado</literal> para aplicar as atualizações ao sistema.
zh_cn: 操作系统升级过程完成后，相应节点将<literal>重引导</literal>以应用系统更新。

source: Below you can find a diagram of the above description:
es: A continuación, encontrará un diagrama de la descripción anterior:
ja: 上記の説明を以下に図示します。
pt_br: Veja a seguir um diagrama da descrição acima:
zh_cn: 下面是上述流程的示意图：

source: fleet day2 management os upgrade
es: actualización de sistema operativo de gestión de día 2 con fleet
ja: fleet day2管理osアップグレード
pt_br: upgrade so gerenciamento dia2 fleet
zh_cn: Fleet Day2 管理操作系统升级

source: Requirements
es: Requisitos
ja: 要件
pt_br: Requisitos
zh_cn: 要求

source: <emphasis>General:</emphasis>
es: <emphasis>Generales:</emphasis>
ja: <emphasis>全般:</emphasis>
pt_br: <emphasis>Geral:</emphasis>
zh_cn: <emphasis>一般：</emphasis>

source: <emphasis role="strong">SCC registered machine</emphasis> - All management cluster nodes should be registered to <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal> which is needed so that the respective <literal>systemd.service</literal> can successfully connect to the desired RPM repository.
es: <emphasis role="strong">Equipo registrado en el Centro de servicios al cliente de SUSE</emphasis>. Todos los nodos del clúster de gestión deben estar registrados en <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal>. Esto es necesario para que el servicio <literal>systemd.service</literal> respectivo pueda conectarse correctamente al repositorio de RPM deseado.
ja: <emphasis role="strong">SCC登録マシン</emphasis> - すべての管理クラスタノードを<literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal>に登録する必要があります。これは、各<literal>systemd.service</literal>が目的のRPMリポジトリに正常に接続できるようにするために必要です。
pt_br: <emphasis role="strong">Máquina registrada no SCC</emphasis>: todos os nós do cluster de gerenciamento devem ser registrados no <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal> para que o respectivo <literal>systemd.service</literal> possa se conectar com sucesso ao repositório RPM desejado.
zh_cn: <emphasis role="strong">已在 SCC 中注册的计算机</emphasis> - 所有管理群集节点都应已注册到 <literal><link xl:href="https://scc.suse.com/">https://scc.suse.com/</link></literal>。只有这样，<literal>systemd.service</literal> 才能成功连接到所需的 RPM 储存库。

source: For Edge releases that require an OS version migration (e.g. <literal>6.0</literal> → <literal>6.1</literal>), make sure that your SCC key supports the migration to the new version.
es: Para las versiones de Edge que requieren una migración de la versión del sistema operativo (por ejemplo, de la <literal>6.0</literal> a la <literal>6.1</literal>), asegúrese de que su clave del Centro de servicios al cliente de SUSE admita la migración a la nueva versión.
ja: OSバージョンのマイグレーション (例: <literal>6.0</literal> → <literal>6.1</literal>)が必要なEdgeリリースの場合、SCCキーが新しいバージョンへのマイグレーションをサポートしていることを確認してください。
pt_br: Para lançamentos do Edge que exigem a migração da versão do sistema operacional (por exemplo, <literal>6.0</literal> → <literal>6.1</literal>), verifique se a chave do SCC oferece suporte à migração para a nova versão.
zh_cn: 对于需要进行操作系统版本迁移的 Edge 版本（例如 <literal>6.0</literal> → <literal>6.1</literal>），请确保您的 SCC 密钥支持迁移到新版本。

source: <emphasis role="strong">Make sure that SUC Plan tolerations match node tolerations</emphasis> - If your Kubernetes cluster nodes have custom <emphasis role="strong">taints</emphasis>, make sure to add <link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">tolerations</link> for those taints in the <emphasis role="strong">SUC Plans</emphasis>. By default, <emphasis role="strong">SUC Plans</emphasis> have tolerations only for <emphasis role="strong">control-plane</emphasis> nodes. Default tolerations include:
es: <emphasis role="strong">Asegúrese de que las tolerancias del plan de SUC coincidan con las tolerancias de los nodos</emphasis>. Si los nodos de su clúster de Kubernetes tienen <emphasis role="strong">intolerancias (taints)</emphasis> personalizadas, asegúrese de añadir <link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">tolerancias (tolerations)</link> para ellas en los <emphasis role="strong">planes de SUC</emphasis>. De forma predeterminada, los <emphasis role="strong">planes de SUC</emphasis> solo tienen tolerancias para los nodos de <emphasis role="strong">plano de control</emphasis>. Las tolerancias predeterminadas son:
ja: <emphasis role="strong">SUC PlanのTolerationがノードのTolerationと一致すること</emphasis> - Kubernetesクラスタノードにカスタムの<emphasis role="strong">Taint</emphasis>が設定されている場合は、<emphasis role="strong">SUC Plan</emphasis>にそのTaintに対する<link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">Toleration</link>を追加してください。デフォルトでは、<emphasis role="strong">SUC Plan</emphasis>には、<emphasis role="strong">コントロールプレーン</emphasis>ノードのTolerationのみが含まれます。デフォルトのTolerationは次のとおりです。
pt_br: <emphasis role="strong">Garantir que as tolerâncias do plano do SUC correspondam às do nó</emphasis>: se os nós do cluster Kubernetes têm <emphasis role="strong">taints</emphasis> personalizados, adicione <link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">tolerâncias</link> a esses taints nos <emphasis role="strong">planos do SUC</emphasis>. Por padrão, os <emphasis role="strong">planos do SUC</emphasis> têm tolerâncias apenas para nós do <emphasis role="strong">plano de controle</emphasis>. As tolerâncias padrão incluem:
zh_cn: <emphasis role="strong">确保 SUC 计划容忍度与节点容忍度相匹配</emphasis> - 如果您的 Kubernetes 群集节点具有自定义<emphasis role="strong">污点</emphasis>，请确保在 <emphasis role="strong">SUC 计划</emphasis>中为这些污点添加<link xl:href="https://kubernetes.io/docs/concepts/scheduling-eviction/taint-and-toleration/">容忍度</link>。默认情况下，<emphasis role="strong">SUC 计划</emphasis>仅包含<emphasis role="strong">控制平面</emphasis>节点的容忍度。默认容忍度包括：

source: Any additional tolerations must be added under the <literal>.spec.tolerations</literal> section of each Plan. <emphasis role="strong">SUC Plans</emphasis> related to the OS upgrade can be found in the <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> repository under <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>. <emphasis role="strong">Make sure you use the Plans from a valid repository <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag.</emphasis>
es: Cualquier tolerancia adicional debe añadirse en la sección <literal>.spec.tolerations</literal> de cada plan. Los <emphasis role="strong">planes de SUC</emphasis> relacionados con la actualización del sistema operativo se pueden encontrar en el repositorio <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> en <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>. <emphasis role="strong">Asegúrese de usar planes que tengan una etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de repositorio válida.</emphasis>
ja: 追加のTolerationは、各Planの<literal>.spec.tolerations</literal>セクションに追加する必要があります。OSアップグレードに関連する<emphasis role="strong">SUC Plan</emphasis>は、<literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>の下の<link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>リポジトリにあります。<emphasis role="strong">有効なリポジトリ<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグからのPlanを使用してください。</emphasis>
pt_br: As tolerâncias adicionais devem ser incluídas na seção <literal>.spec.tolerations</literal> de cada plano. Os <emphasis role="strong">planos do SUC</emphasis> relacionados a upgrade de sistema operacional estão disponíveis no repositório <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> em <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>. <emphasis role="strong">Use os planos de uma tag de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> válida do repositório.</emphasis>
zh_cn: 其他任何容忍度必须添加到每个计划的 <literal>.spec.tolerations</literal> 部分。与操作系统升级相关的 <emphasis role="strong">SUC 计划</emphasis>可以在 <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> 储存库中的 <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal> 下找到。<emphasis role="strong">请确保使用有效储存库<link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记中的计划。</emphasis>

source: An example of defining custom tolerations for the <emphasis role="strong">control-plane</emphasis> SUC Plan would look like this:
es: Esto es un ejemplo de definición de tolerancias personalizadas para el plan de SUC de <emphasis role="strong">plano de control</emphasis>:
ja: <emphasis role="strong">control-plane</emphasis> SUC Planに対してカスタムのTolerationを定義する例は次のようになります。
pt_br: Um exemplo de definição de tolerâncias personalizadas para o plano do SUC de <emphasis role="strong">plano de controle</emphasis> tem esta aparência:
zh_cn: 为<emphasis role="strong">控制平面</emphasis> SUC 计划定义自定义容忍度的示例如下：

source: <emphasis>Air-gapped:</emphasis>
es: <emphasis>En entornos aislados:</emphasis>
ja: <emphasis>エアギャップ:</emphasis>
zh_cn: <emphasis>隔离：</emphasis>

source: <emphasis role="strong">Mirror SUSE RPM repositories</emphasis> - OS RPM repositories should be locally mirrored so that the <literal>systemd.service</literal> can have access to them. This can be achieved by using either <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/book-rmt.html">RMT</link> or <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUMA</link>.
es: <emphasis role="strong">Duplique los repositorios RPM de SUSE</emphasis>. Los repositorios RPM del sistema operativo deben duplicarse y guardarse de forma local para que el servicio <literal>systemd.service</literal> pueda acceder a ellos. Para ello, utilice <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/book-rmt.html">RMT</link> o <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUMA</link>.
ja: <emphasis role="strong">SUSE RPMリポジトリのミラーリング</emphasis> - OS RPMリポジトリをローカルにミラーリングし、<literal>systemd.service</literal>がそのリポジトリにアクセスできるようにする必要があります。このためには、<link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/book-rmt.html">RMT</link>または<link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUMA</link>のいずれかを使用します。
pt_br: <emphasis role="strong">Espelhar repositórios RPM do SUSE</emphasis>: os repositórios RPM de sistema operacional devem ser espelhados localmente para que o <literal>systemd.service</literal> tenha acesso a eles. Para isso, use <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/book-rmt.html">RMT</link> ou <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUMA</link>.
zh_cn: <emphasis role="strong">镜像 SUSE RPM 储存库</emphasis> - 操作系统 RPM 储存库应镜像到本地，以便 <literal>systemd.service</literal> 可以访问它们。您可以使用 <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/book-rmt.html">RMT</link> 或 <link xl:href="https://documentation.suse.com/suma/5.0/en/suse-manager/index.html">SUMA</link> 来完成该操作。

source: OS upgrade - SUC plan deployment
es: Actualización del sistema operativo - Despliegue del plan de SUC
ja: OSアップグレード - SUC Planのデプロイメント
pt_br: Upgrade de sistema operacional: implantação do plano do SUC
zh_cn: 操作系统升级 - SUC 计划部署
