Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: For environments previously upgraded using this procedure, users should ensure that <emphasis role="strong">one</emphasis> of the following steps is completed:
es: En entornos que se hayan actualizado previamente mediante este procedimiento, los usuarios deben asegurarse de que se haya completado <emphasis role="strong">uno</emphasis> de los pasos siguientes:
ja: この手順を使用して以前にアップグレードした環境の場合、ユーザは次の手順の<emphasis role="strong">いずれか</emphasis>を完了していることを確認する必要があります。
pt_br: Em ambientes que já passaram por upgrade usando esse procedimento, os usuários devem garantir que <emphasis role="strong">uma</emphasis> das seguintes etapas seja concluída:
zh_cn: 对于之前使用此过程升级的环境，用户应确保完成以下步骤之<emphasis role="strong">一</emphasis>：

source: <literal>Remove any previously deployed SUC Plans related to older Edge release versions from the management cluster</literal> - can be done by removing the desired cluster from the existing <literal>GitRepo/Bundle</literal> <link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">target configuration</link>, or removing the <literal>GitRepo/Bundle</literal> resource altogether.
es: <literal>Elimine cualquier plan de SUC desplegado anteriormente relacionado con versiones anteriores de Edge del clúster de gestión</literal>. Puede hacerlo eliminando el clúster deseado de la <link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">configuración de destino</link> del <literal>GitRepo/Bundle</literal> o eliminando por completo el recurso <literal>GitRepo/Bundle</literal>.
ja: <literal>管理クラスタから古いEdgeリリースバージョンに関連する以前にデプロイしたSUC Planを削除する</literal> - これは、既存の<literal>GitRepo/バンドル</literal><link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">ターゲット設定</link>から目的のクラスタを削除するか、<literal>GitRepo/バンドル</literal>リソースを完全に削除することで、実行できます。
pt_br: <literal>Remover os planos do SUC que já foram implantados relacionados a versões de lançamento mais antigas do Edge do cluster de gerenciamento</literal>: para fazer isso, remova o cluster desejado da <link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">configuração de destino</link> do <literal>GitRepo/Bundle</literal>, ou remova o recurso <literal>GitRepo/Bundle</literal> completamente.
zh_cn: <literal>从管理群集中去除任何先前部署且与旧版 Edge 相关的 SUC 计划</literal> - 方法是从现有的 <literal>GitRepo/捆绑包</literal><link xl:href="https://fleet.rancher.io/gitrepo-targets#target-matching">目标配置</link>中去除相应群集，或完全去除 <literal>GitRepo/捆绑包</literal>资源。

source: <literal>Reuse the existing GitRepo/Bundle resource</literal> - can be done by pointing the resource’s revision to a new tag that holds the correct fleets for the desired <literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link>.
es: <literal>Reutilice el recurso GitRepo/Bundle existente</literal>. Puede hacerlo haciendo que la revisión del recurso apunte a una nueva etiqueta que contenga los recursos de Fleet correctos para la <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> deseada de <literal>suse-edge/fleet-examples</literal>.
ja: <literal>既存のGitRepo/バンドルリソースを再利用する</literal> - 目的の<literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>の正しいフリートを保持する新しいタグにリソースのリビジョンをポイントすることで実行できます。
pt_br: <literal>Reutilizar o recurso GitRepo/Bundle existente</literal>: para fazer isso, aponte a revisão do recurso para uma nova tag que inclua as instâncias do Fleet corretas para a <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> desejada de <literal>suse-edge/fleet-examples</literal>.
zh_cn: <literal>重用现有的 GitRepo/捆绑包资源</literal> - 方法是将资源的修订版指向一个新标签，该标签包含目标 <literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>的正确 Fleet。

source: This is done in order to avoid clashes between <literal>SUC Plans</literal> for older Edge release versions.
es: Esto se hace con el fin de evitar conflictos entre los <literal>planes de SUC</literal> para versiones anteriores de Edge.
ja: これは古いEdgeリリースバージョンの<literal>SUC Plan</literal>間のクラッシュを回避するために実行されます。
pt_br: Isso é feito para evitar conflitos entre os <literal>planos do SUC</literal> de versões de lançamento mais antigas do Edge.
zh_cn: 这样做是为了避免旧版 Edge 的 <literal>SUC 计划</literal>之间发生冲突。

source: If users attempt to upgrade, while there are existing <literal>SUC Plans</literal> on the management cluster, they will see the following fleet error:
es: Si los usuarios intentan actualizar mientras hay <literal>planes de SUC</literal> en el clúster de gestión, verán el siguiente error de Fleet:
ja: ユーザがアップグレードを試す場合、管理クラスタに既存の<literal>SUC Plan</literal>がある場合は、次のフリートエラーが表示されます。
pt_br: Se os usuários tentarem fazer upgrade e já houver <literal>planos do SUC</literal> no cluster de gerenciamento, eles verão o seguinte erro no Fleet:
zh_cn: 如果用户尝试升级，而管理群集上存在现有的 <literal>SUC 计划</literal>，他们将看到以下 Fleet 错误：

source: As mentioned in <xref linkend="management-day2-fleet-os-upgrade-overview"/>, OS upgrades are done by shipping <literal>SUC plans</literal> to the desired cluster through one of the following ways:
es: Como se menciona en la <xref linkend="management-day2-fleet-os-upgrade-overview"/>, las actualizaciones del sistema operativo se realizan incluyendo <literal>planes de SUC</literal> en el clúster deseado de las siguientes formas:
ja: <xref linkend="management-day2-fleet-os-upgrade-overview"/>で説明したように、OSアップグレードは、次のいずれかの方法を使用して<literal>SUC Plan</literal>を目的のクラスタに配布することで実行されます。
pt_br: Conforme mencionado na <xref linkend="management-day2-fleet-os-upgrade-overview"/>, os upgrades de sistema operacional são feitos enviando os <literal>planos do SUC</literal> ao cluster desejado de uma destas maneiras:
zh_cn: 如<xref linkend="management-day2-fleet-os-upgrade-overview"/>中所述，可以通过以下任意一种方式将 <literal>SUC 计划</literal>分发到目标群集来完成操作系统升级：

source: Fleet <literal>GitRepo</literal> resource - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>.
es: Recurso <literal>GitRepo</literal> de Fleet: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>.
ja: Fleet <literal>GitRepo</literal>リソース - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>。
pt_br: Recurso <literal>GitRepo</literal> do Fleet: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>.
zh_cn: Fleet <literal>GitRepo</literal> 资源 - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo"/>。

source: Fleet <literal>Bundle</literal> resource - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle"/>.
es: Recurso <literal>Bundle</literal> de Fleet: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle"/>.
ja: Fleet<literal>バンドル</literal>リソース - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle"/>。
pt_br: Recurso <literal>Bundle</literal> do Fleet: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle"/>.
zh_cn: Fleet <literal>捆绑包</literal>资源 - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle"/>。

source: To determine which resource you should use, refer to <xref linkend="management-day2-fleet-determine-use-case"/>.
es: Para determinar qué recurso se debe usar, consulte la <xref linkend="management-day2-fleet-determine-use-case"/>.
ja: どのリソースを使用すべきかを判断するには、<xref linkend="management-day2-fleet-determine-use-case"/>を参照してください。
pt_br: Para determinar o recurso que você deve usar, consulte a <xref linkend="management-day2-fleet-determine-use-case"/>.
zh_cn: 要确定使用哪个资源，请参见<xref linkend="management-day2-fleet-determine-use-case"/>。

source: For use-cases where you wish to deploy the <literal>OS SUC plans</literal> from a third-party GitOps tool, refer to <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-third-party"/>
es: Si desea desplegar los <literal>planes de SUC de sistema operativo</literal> desde una herramienta GitOps de terceros, consulte la <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-third-party"/>.
ja: <literal>OS SUC Plan</literal>をサードパーティのGitOpsツールからデプロイするユースケースの場合は、<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-third-party"/>を参照してください。
pt_br: Para casos de uso de implantação dos <literal>planos do SUC de sistema operacional</literal> de uma ferramenta GitOps de terceiros, consulte a <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-third-party"/>.
zh_cn: 对于希望通过第三方 GitOps 工具部署<literal>操作系统 SUC 计划</literal>的使用场景，请参见<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-third-party"/>。

source: SUC plan deployment - GitRepo resource
es: Despliegue del plan de SUC - Recurso GitRepo
ja: SUC Planのデプロイメント - GitRepoリソース
pt_br: Implantação do plano do SUC: recurso GitRepo
zh_cn: SUC 计划部署 - GitRepo 资源

source: A <emphasis role="strong">GitRepo</emphasis> resource, that ships the needed <literal>OS SUC plans</literal>, can be deployed in one of the following ways:
es: Es posible desplegar un recurso <emphasis role="strong">GitRepo</emphasis>, que incluye los <literal>planes de SUC de sistema operativo</literal>, de estas formas:
ja: 必要な<literal>OS SUC Plan</literal>を配布する、<emphasis role="strong">GitRepo</emphasis>リソースは、次の方法のいずれかでデプロイできます。
pt_br: Um recurso <emphasis role="strong">GitRepo</emphasis>, que distribui os <literal>planos do SUC de sistema operacional</literal> necessários, pode ser implantado de uma das seguintes maneiras:
zh_cn: 提供所需<literal>操作系统 SUC 计划</literal>的 <emphasis role="strong">GitRepo</emphasis> 资源可通过以下方式之一进行部署：

source: Through the <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/>を通じて(<literal>Rancher</literal>が利用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal>: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>)。
pt_br: Pela implantação manual do recurso (<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>) em seu <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-gitrepo-manual"/>）到<literal>管理群集</literal>。

source: Once deployed, to monitor the OS upgrade process of the nodes of your targeted cluster, refer to <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
es: Una vez desplegado, para supervisar el proceso de actualización del sistema operativo de los nodos de su clúster de destino, consulte la <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
ja: デプロイ後に、ターゲットクラスタのノードのOSアップグレードプロセスを監視するには、<xref linkend="components-system-upgrade-controller-monitor-plans"/>を参照してください。
pt_br: Após a implantação, para monitorar o processo de upgrade do sistema operacional dos nós do cluster de destino, consulte a <xref linkend="components-system-upgrade-controller-monitor-plans"/>.
zh_cn: 部署后，要监控目标群集节点的操作系统升级过程，请参见<xref linkend="components-system-upgrade-controller-monitor-plans"/>。

source: GitRepo creation - Rancher UI
es: Creación de GitRepo - Interfaz de usuario de Rancher
ja: GitRepoの作成 - Rancher UI
pt_br: Criação do GitRepo: IU do Rancher
zh_cn: GitRepo 创建 - Rancher UI

source: To create a <literal>GitRepo</literal> resource through the Rancher UI, follow their official <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">documentation</link>.
es: Para crear un recurso <literal>GitRepo</literal> con la interfaz de usuario de Rancher, siga la <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">documentación oficial</link>.
ja: Rancher UIを通じて<literal>GitRepo</literal>リソースを作成するには、公式の<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">ドキュメント</link>に従ってください。
zh_cn: 要通过 Rancher UI 创建 <literal>GitRepo</literal> 资源，请遵循其官方<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">文档</link>。

source: The Edge team maintains a ready to use <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/os-upgrade">fleet</link>. Depending on your environment this fleet could be used directly or as a template.
es: El equipo de Edge mantiene una <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/os-upgrade">flota (fleet)</link> lista para usar. Dependiendo de su entorno, se puede utilizar directamente o como plantilla.
ja: Edgeチームは、すぐに使用できる<link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/os-upgrade">フリート</link>を維持しています。環境によっては、このフリートを直接使用することも、テンプレートとして使用することもできます。
zh_cn: Edge 团队维护着一个即用型 <link xl:href="https://github.com/suse-edge/fleet-examples/tree/release-3.4.0/fleets/day2/system-upgrade-controller-plans/os-upgrade">Fleet</link>。根据您的环境的不同，该 Fleet 可以直接使用或用作模板。

source: Always use this fleet from a valid Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag.
es: Use siempre esta flota desde una etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de Edge válida.
ja: 常に、このフリートは有効なEdge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグから使用してください。
pt_br: Use sempre essa instância do Fleet de uma tag de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> válida do Edge.
zh_cn: 请务必通过有效的 Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记使用此 Fleet。

source: For use-cases where no custom changes need to be included to the <literal>SUC plans</literal> that the fleet ships, users can directly refer the <literal>os-upgrade</literal> fleet from the <literal>suse-edge/fleet-examples</literal> repository.
es: Para los casos prácticos en los que no es necesario incluir cambios personalizados en los <literal>planes de SUC</literal> que incluye la flota, los usuarios pueden usar directamente la flota <literal>os-upgrade</literal> desde el repositorio <literal>suse-edge/fleet-examples</literal>.
ja: フリートが配布する<literal>SUC Plan</literal>にカスタム変更を含める必要がないユースケースでは、ユーザは<literal>suse-edge/fleet-examples</literal>リポジトリから <literal>os-upgrade</literal>フリートを直接参照できます。
pt_br: Para casos de uso em que não há necessidade de incluir alterações personalizadas nos <literal>planos do SUC</literal> que a instância do Fleet envia, os usuários podem fazer referência à instância do Fleet de <literal>os-upgrade</literal> do repositório <literal>suse-edge/fleet-examples</literal>.
zh_cn: 对于不需要在 Fleet 附带的 <literal>SUC 计划</literal>中包含自定义更改的使用场景，用户可以直接引用 <literal>suse-edge/fleet-examples</literal> 储存库中的 <literal>os-upgrade</literal> Fleet。

source: In cases where custom changes are needed (e.g. to add custom tolerations), users should refer the <literal>os-upgrade</literal> fleet from a separate repository, allowing them to add the changes to the SUC plans as required.
es: Si fuera necesario realizar cambios personalizados (por ejemplo, para añadir tolerancias personalizadas), los usuarios deben usar la flota <literal>os-upgrade</literal> desde un repositorio independiente, lo que les permitirá añadir los cambios a los planes de SUC según sea necesario.
ja: カスタム変更(カスタム許容値の追加など)が必要な場合、ユーザは別のリポジトリから<literal>os-upgrade</literal>フリートを参照して、必要に応じてSUC Planに変更を追加できるようにする必要があります。
pt_br: Nos casos em que as alterações personalizadas são necessárias (por exemplo, para adicionar tolerâncias personalizadas), os usuários devem fazer referência à instância do Fleet de <literal>os-upgrade</literal> de um repositório separado, para que possam adicioná-las aos planos do SUC conforme necessário.
zh_cn: 如果需要自定义更改（例如添加自定义容忍度），用户应从单独的储存库中引用 <literal>os-upgrade</literal> Fleet，以便能够根据需要将更改添加到 SUC 计划中。

source: An example of how a <literal>GitRepo</literal> can be configured to use the fleet from the <literal>suse-edge/fleet-examples</literal> repository, can be viewed <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/gitrepos/day2/os-upgrade-gitrepo.yaml">here</link>.
es: Hay un ejemplo de cómo se puede configurar un recurso <literal>GitRepo</literal> para utilizar la flota del repositorio <literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/gitrepos/day2/os-upgrade-gitrepo.yaml">aquí</link>.
ja: <literal>GitRepo</literal>を<literal>suse-edge/fleet-examples</literal>リポジトリのフリートを使用するように設定する方法の例については、<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/gitrepos/day2/os-upgrade-gitrepo.yaml">こちら</link>を参照してください。
zh_cn: 有关如何配置 <literal>GitRepo</literal> 以使用 <literal>suse-edge/fleet-examples</literal> 储存库中的 Fleet 的示例，请参见<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/gitrepos/day2/os-upgrade-gitrepo.yaml">此处</link>。

source: GitRepo creation - manual
es: Creación de GitRepo - Manual
ja: GitRepoの作成 - 手動
pt_br: Criação do GitRepo: manual
zh_cn: GitRepo 创建 - 手动

source: Pull the <emphasis role="strong">GitRepo</emphasis> resource:
es: Extraiga el recurso <emphasis role="strong">GitRepo</emphasis>:
ja: <emphasis role="strong">GitRepo</emphasis>リソースをプルします。
pt_br: Obtenha o recurso <emphasis role="strong">GitRepo</emphasis>:
zh_cn: 提取 <emphasis role="strong">GitRepo</emphasis> 资源：

source: Edit the <emphasis role="strong">GitRepo</emphasis> configuration:
es: Edite la configuración de <emphasis role="strong">GitRepo</emphasis>:
ja: <emphasis role="strong">GitRepo</emphasis>設定を編集します。
pt_br: Edite a configuração do <emphasis role="strong">GitRepo</emphasis>:
zh_cn: 编辑 <emphasis role="strong">GitRepo</emphasis> 配置：

source: Remove the <literal>spec.targets</literal> section - only needed for downstream clusters.
es: Elimine la sección <literal>spec.targets</literal>: solo se necesita para clústeres descendentes.
ja: <literal>spec.targets</literal>セクションを削除します。ダウンストリームクラスタにのみ必要です。
pt_br: Remova a seção <literal>spec.targets</literal> (necessário apenas para clusters downstream).
zh_cn: 去除 <literal>spec.targets</literal> 部分 - 该部分仅用于下游群集。

source: Point the namespace of the <literal>GitRepo</literal> to the <literal>fleet-local</literal> namespace - done in order to deploy the resource on the management cluster.
es: Dirija el espacio de nombres de <literal>GitRepo</literal> al espacio de nombres <literal>fleet-local</literal>. Esto se hace para desplegar el recurso en el clúster de gestión.
ja: <literal>GitRepo</literal>のネームスペースを<literal>fleet-local</literal>ネームスペースにポイントします。これは、リソースを管理クラスタにデプロイするために実行します。
pt_br: Aponte o namespace do <literal>GitRepo</literal> para o namespace <literal>fleet-local</literal>, feito para implantar o recurso no cluster de gerenciamento.
zh_cn: 将 <literal>GitRepo</literal> 的名称空间指向 <literal>fleet-local</literal> 名称空间 - 这样做是为了在管理群集上部署该资源。

source: Apply the <emphasis role="strong">GitRepo</emphasis> resource your <literal>management cluster</literal>:
es: Aplique el recurso <emphasis role="strong">GitRepo</emphasis> a su <literal>clúster de gestión</literal>:
ja: <emphasis role="strong">GitRepo</emphasis>リソースを<literal>管理クラスタ</literal>に適用します。
pt_br: Aplique o recurso <emphasis role="strong">GitRepo</emphasis> ao <literal>cluster de gerenciamento</literal>:
zh_cn: 将 <emphasis role="strong">GitRepo</emphasis> 资源应用于<literal>管理群集</literal>：

source: View the created <emphasis role="strong">GitRepo</emphasis> resource under the <literal>fleet-local</literal> namespace:
es: Compruebe que el recurso <emphasis role="strong">GitRepo</emphasis> creado se encuentra en el espacio de nombres <literal>fleet-local</literal>:
ja: <literal>fleet-local</literal>ネームスペースの下に、作成した <emphasis role="strong">GitRepo</emphasis>リソースを表示します。
pt_br: Visualize o recurso <emphasis role="strong">GitRepo</emphasis> criado no namespace <literal>fleet-local</literal>:
zh_cn: 查看 <literal>fleet-local</literal> 名称空间下创建的 <emphasis role="strong">GitRepo</emphasis> 资源：

source: SUC plan deployment - Bundle resource
es: Despliegue del plan de SUC - Recurso Bundle
ja: SUC Planのデプロイメント - バンドルリソース
pt_br: Implantação do plano do SUC – recurso Bundle
zh_cn: SUC 计划部署 - 捆绑包资源

source: A <emphasis role="strong">Bundle</emphasis> resource, that ships the needed <literal>OS SUC Plans</literal>, can be deployed in one of the following ways:
es: Es posible desplegar un recurso <emphasis role="strong">Bundle</emphasis>, que incluye los <literal>planes de SUC de sistema operativo</literal> válidos, de estas formas:
ja: 必要な<literal>OS SUC Plan</literal>を配布する<emphasis role="strong">バンドル</emphasis>リソースは、次の方法のいずれかでデプロイできます。
pt_br: O recurso <emphasis role="strong">Bundle</emphasis>, que envia os <literal>planos do SUC de sistema operacional</literal> necessários, pode ser implantado de uma das seguintes maneiras:
zh_cn: 提供所需<literal>操作系统 SUC 计划</literal>的<emphasis role="strong">捆绑包</emphasis>资源可以通过以下方式之一进行部署：

source: Through the <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/> (when <literal>Rancher</literal> is available).
es: Mediante la <literal>interfaz de usuario de Rancher</literal>: <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/> (si <literal>Rancher</literal> está disponible).
ja: <literal>Rancher UI</literal> - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/>を通じて(<literal>Rancher</literal>が利用可能な場合)。
pt_br: Pela <literal>IU do Rancher</literal> : <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/> (quando o <literal>Rancher</literal> está disponível).
zh_cn: 通过 <literal>Rancher UI</literal> 部署 - <xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-rancher"/>（如果 <literal>Rancher</literal> 可用）。

source: By manually deploying (<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>) the resource to your <literal>management cluster</literal>.
es: Desplegando manualmente (<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>) el recurso en el <literal>clúster de gestión</literal>.
ja: リソースを<literal>管理クラスタ</literal>に手動でデプロイする(<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>)。
pt_br: Por meio da implantação manual do recurso (<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>) no <literal>cluster de gerenciamento</literal>.
zh_cn: 手动将相应资源部署（<xref linkend="management-day2-fleet-os-upgrade-plan-deployment-bundle-manual"/>）到<literal>管理群集</literal>。
