Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: It is recommended to use the default network configuration via files describing the desired network states under the <literal>/network</literal> directory. Only opt for custom scripting when that behaviour is not applicable to your use case.
es: Se recomienda utilizar la configuración de red predeterminada mediante archivos que describen los estados de red deseados en el directorio <literal>/network</literal>. Utilice guiones personalizados únicamente cuando ese comportamiento no sea aplicable a su caso de uso.
ja: <literal>/network</literal>ディレクトリにある、望ましいネットワーク状態を記述したファイルを介して、デフォルトのネットワーク設定を使用することをお勧めします。カスタムスクリプトを選択するのは、デフォルト設定の動作がユースケースに当てはまらない場合のみにしてください。
pt_br: A recomendação é usar a configuração de rede padrão por meio dos arquivos que descrevem o estado da rede desejado no diretório <literal>/network</literal>. Crie scripts personalizados apenas quando esse comportamento não é cabível no seu caso de uso.
zh_cn: 建议通过 <literal>/network</literal> 目录下描述期望的网络状态的文件来使用默认网络配置。请仅在该行为不适用于您的使用场景时，才选择自定义脚本。

source: In this example, we will create a custom script which applies static configuration for the <literal>eth0</literal> interface on all provisioned nodes, as well as removing and disabling the automatically created wired connections by NetworkManager. This is beneficial in situations where you want to make sure that every node in your cluster has an identical networking configuration, and as such you do not need to be concerned with the MAC address of each node prior to image creation.
es: En este ejemplo, crearemos un guion personalizado que aplica una configuración estática para la interfaz <literal>eth0</literal> en todos los nodos aprovisionados, además de eliminar e inhabilitar las conexiones con cable que haya creado automáticamente NetworkManager. Esto resulta útil en situaciones en las que se desea garantizar que todos los nodos del clúster tengan una configuración de red idéntica, por lo que no es necesario preocuparse por la dirección MAC de cada nodo antes de crear la imagen.
ja: この例では、プロビジョニングされたすべてのノードで<literal>eth0</literal>インタフェースに静的設定を適用し、NetworkManagerによって自動的に作成された有線接続を削除して無効にするカスタムスクリプトを作成します。これは、クラスタ内のすべてのノードに同一のネットワーキング設定を確実に適用したい場合に便利です。その結果、イメージの作成前に各ノードのMACアドレスを気にする必要がなくなります。
pt_br: Neste exemplo, vamos criar um script personalizado que aplica a configuração estática da interface <literal>eth0</literal> a todos os nós provisionados, além de remover e desabilitar as conexões com fio criadas automaticamente pelo NetworkManager. Isso é vantajoso nos casos em que você quer garantir que cada nó no cluster tenha uma configuração de rede idêntica e, sendo assim, você não precisa se preocupar com o endereço MAC de cada nó antes da criação da imagem.
zh_cn: 在此示例中，我们将创建一个自定义脚本来对所有已置备节点上的 <literal>eth0</literal> 接口应用静态配置，同时去除并禁用 NetworkManager 自动创建的有线连接。如果您想要确保群集中每个节点都采用相同的网络配置，则这种做法非常有利，这样，您就不需要在创建映像之前考虑每个节点的 MAC 地址。

source: Let’s start by storing the connection file in the <literal>/custom/files</literal> directory:
es: Para empezar, se almacena el archivo de conexión en el directorio <literal>/custom/files</literal>:
ja: まず、<literal>/custom/files</literal>ディレクトリに接続ファイルを保存しましょう。
pt_br: Para começar, vamos armazenar o arquivo de conexão no diretório <literal>/custom/files</literal>:
zh_cn: 首先，我们将连接文件存储在 <literal>/custom/files</literal> 目录中：

source: Now that the static configuration is created, we will also create our custom network script:
es: Ahora que ya hemos creado la configuración estática, también crearemos nuestro guion de red personalizado:
ja: 静的設定が作成されたので、カスタムネットワークスクリプトも作成します。
pt_br: Com a configuração estática criada, vamos também criar nosso script de rede personalizado:
zh_cn: 创建静态配置后，我们再创建自定义网络脚本：

source: The nmc binary will still be included by default, so it can also be used in the <literal>configure-network.sh</literal> script if necessary.
es: El binario de nmc seguirá estando incluido por defecto, por lo que también se puede utilizar en el guion <literal>configure-network.sh</literal> si es necesario.
ja: nmcのバイナリはこれまで同様にデフォルトで含まれるため、必要に応じて<literal>configure-network.sh</literal>スクリプトで使用することもできます。
pt_br: Por padrão, o binário nmc ainda será incluído, para ser usado no script <literal>configure-network.sh</literal> se necessário.
zh_cn: 默认情况下仍会包含 nmc 二进制文件，因此如果需要，也可以在 <literal>configure-network.sh</literal> 脚本中使用它。

source: The custom script must always be provided under <literal>/network/configure-network.sh</literal> in the configuration directory. If present, all other files will be ignored. It is NOT possible to configure a network by working with both static configurations in YAML format and a custom script simultaneously.
es: El guion personalizado siempre debe proporcionarse en <literal>/network/configure-network.sh</literal> en el directorio de configuración. Si está presente, se ignorarán todos los demás archivos. NO es posible configurar una red utilizando simultáneamente configuraciones estáticas en formato YAML y un guion personalizado.
ja: カスタムスクリプトは常に設定ディレクトリの<literal>/network/configure-network.sh</literal>で提供する必要があります。このファイルが存在する場合、他のファイルはすべて無視されます。YAML形式の静的設定とカスタムスクリプトの両方を同時に使用してネットワークを設定することはできません。
pt_br: O script personalizado deve sempre ser inserido em <literal>/network/configure-network.sh</literal> no diretório de configuração. Se estiver presente, todos os outros arquivos serão ignorados. NÃO é possível configurar uma rede trabalhando com as configurações estáticas no formato YAML e um script personalizado ao mesmo tempo.
zh_cn: 必须始终在配置目录中的 <literal>/network/configure-network.sh</literal> 下提供自定义脚本。系统将忽略存在的所有其他文件。因为无法同时使用 YAML 格式的静态配置和自定义脚本来配置网络。

source: Verify that an Ethernet interface is statically configured using our connection file and is active:
es: Verifique que se ha configurado de forma estática una interfaz Ethernet utilizando nuestro archivo de conexión y que esta interfaz esté activa:
ja: 接続ファイルを使用してEthernetインタフェースが静的に設定されていて、アクティブであることを確認します。
pt_br: Verifique se uma interface Ethernet foi configurada estaticamente usando nosso arquivo de conexão e se ela está ativa:
zh_cn: 校验是否使用连接文件静态配置了以太网接口，并且该接口处于活动状态：

source: Elemental is a software stack enabling centralized and full cloud-native OS management with Kubernetes. The Elemental stack consists of a number of components that either reside on Rancher itself, or on the edge nodes. The core components are:
es: Elemental es una pila de software que permite la gestión centralizada y completa del sistema operativo nativo en la nube con Kubernetes. La pila Elemental consta de varios componentes que residen en Rancher o en los nodos periféricos. Los componentes principales son:
ja: Elementalは、Kubernetesを使用した完全にクラウドネイティブな集中型のOS管理を可能にするソフトウェアスタックです。Elementalスタックは、Rancher自体またはエッジノード上に存在する多数のコンポーネントで構成されます。中核となるコンポーネントは次のとおりです。
pt_br: Elemental é uma pilha de software que possibilita o gerenciamento de sistema operacional nativo de nuvem e totalmente centralizado com o Kubernetes. A pilha Elemental consiste em vários componentes que residem no próprio Rancher ou em nós de borda. Os componentes principais são:
zh_cn: Elemental 是一个软件堆栈，可用于通过 Kubernetes 实现集中式云原生操作系统全面管理。Elemental 堆栈由驻留在 Rancher 本身或边缘节点上的许多组件构成。核心组件包括：

source: <emphasis role="strong">elemental-operator</emphasis> - The core operator that resides on Rancher and handles registration requests from clients.
es: <emphasis role="strong">elemental-operator</emphasis>: el operador central que reside en Rancher y gestiona las solicitudes de registro de los clientes.
ja: <emphasis role="strong">elemental-operator</emphasis> - Rancher上に存在し、クライアントからの登録リクエストを処理するコアオペレータ。
pt_br: <emphasis role="strong">elemental-operator</emphasis> : o operador principal que reside no Rancher e processa as solicitações de registro dos clientes.
zh_cn: <emphasis role="strong">elemental-operator</emphasis> - 驻留在 Rancher 上的核心操作器，用于处理来自客户端的注册请求。

source: <emphasis role="strong">elemental-register</emphasis> - The client that runs on the edge nodes allowing registration via the <literal>elemental-operator</literal>.
es: <emphasis role="strong">elemental-register</emphasis>: el cliente que se ejecuta en los nodos periféricos y permite el registro a través de <literal>elemental-operator</literal>.
ja: <emphasis role="strong">elemental-register</emphasis> - エッジノード上で動作し、<literal>elemental-operator</literal>を介して登録できるようにするクライアント。
pt_br: <emphasis role="strong">elemental-register</emphasis>: o cliente executado em nós de borda que possibilita o registro por meio do <literal>elemental-operator</literal>.
zh_cn: <emphasis role="strong">elemental-register</emphasis> - 在边缘节点上运行的客户端，支持通过 <literal>elemental-operator</literal> 进行注册。

source: <emphasis role="strong">elemental-system-agent</emphasis> - An agent that resides on the edge nodes; its configuration is fed from <literal>elemental-register</literal> and it receives a <literal>plan</literal> for configuring the <literal>rancher-system-agent</literal>
es: <emphasis role="strong">elemental-system-agent</emphasis>: un agente que reside en los nodos periféricos. Toma su configuración de <literal>elemental-register</literal> y recibe un <literal>plan</literal> para configurar el agente <literal>rancher-system-agent</literal>.
ja: <emphasis role="strong">elemental-system-agent</emphasis> - エッジノードに存在するエージェント。その設定は<literal>elemental-register</literal>から提供され、<literal>rancher-system-agent</literal>を設定するための<literal>plan</literal>を受け取ります。
pt_br: <emphasis role="strong">elemental-system-agent</emphasis>: um agente que reside em nós de borda. Sua configuração é alimentada pelo <literal>elemental-register</literal> e recebe um <literal>plan</literal> para configurar o <literal>rancher-system-agent</literal>.
zh_cn: <emphasis role="strong">elemental-system-agent</emphasis> - 驻留在边缘节点上的代理；其配置由 <literal>elemental-register</literal> 馈送，接收用于配置 <literal>rancher-system-agent</literal> 的<literal>计划</literal>。

source: <emphasis role="strong">rancher-system-agent</emphasis> - Once the edge node has fully registered, this takes over from <literal>elemental-system-agent</literal> and waits for further <literal>plans</literal> from Rancher Manager (e.g. for Kubernetes installation).
es: <emphasis role="strong">rancher-system-agent</emphasis>: cuando el nodo periférico se ha registrado por completo, toma el control de <literal>elemental-system-agent</literal> y espera nuevos <literal>planes</literal> de Rancher Manager (por ejemplo, para la instalación de Kubernetes).
ja: <emphasis role="strong">rancher-system-agent</emphasis> - エッジノードが完全に登録された後に、<literal>elemental-system-agent</literal>から処理を引き継ぎ、Rancher Managerからの他の<literal>plans</literal>を待機します(Kubernetesのインストールなど)。
pt_br: <emphasis role="strong">rancher-system-agent</emphasis>: após o registro completo do nó de borda, esse componente assume o comando depois do <literal>elemental-system-agent</literal> e aguarda outros <literal>plans</literal> do Rancher Manager (por exemplo, instalação do Kubernetes).
zh_cn: <emphasis role="strong">rancher-system-agent</emphasis> - 完全注册边缘节点后，此组件将接管 <literal>elemental-system-agent</literal>，并等待 Rancher Manager 接下来的<literal>计划</literal>（例如 Kubernetes 安装）。

source: See <link xl:href="https://elemental.docs.rancher.com/">Elemental upstream documentation</link> for full information about Elemental and its relationship to Rancher.
es: Consulte la <link xl:href="https://elemental.docs.rancher.com/">documentación original de Elemental</link> para obtener información completa sobre Elemental y su relación con Rancher.
ja: Elemental、およびElementalとRancherとの関係の詳細については、<link xl:href="https://elemental.docs.rancher.com/">Elementalのアップストリームドキュメント</link>を参照してください。
pt_br: Consulte a <link xl:href="https://elemental.docs.rancher.com/">documentação upstream do Elemental</link> para obter todas as informações sobre o Elemental e seu relacionamento com o Rancher.
zh_cn: 有关 Elemental 及其与 Rancher 的关系的完整信息，请参见 <link xl:href="https://elemental.docs.rancher.com/">Elemental 上游文档</link>。

source: How does SUSE Edge use Elemental?
es: ¿Cómo se usa Elemental en SUSE Edge?
ja: SUSE EdgeでのElementalの用途
pt_br: Como o SUSE Edge usa o Elemental?
zh_cn: SUSE Edge 如何使用 Elemental？

source: We use portions of Elemental for managing remote devices where Metal<superscript>3</superscript> is not an option (for example, there is no BMC, or the device is behind a NAT gateway). This tooling allows for an operator to bootstrap their devices in a lab before knowing when or where they will be shipped to. Namely, we leverage the <literal>elemental-register</literal> and <literal>elemental-system-agent</literal> components to enable the onboarding of SUSE Linux Micro hosts to Rancher for "phone home" network provisioning use-cases. When using Edge Image Builder (EIB) to create deployment images, the automatic registration through Rancher via Elemental can be achieved by specifying the registration configuration in the configuration directory for EIB.
es: Partes de Elemental se usan para gestionar dispositivos remotos en caso de que no sea posible hacerlo con Metal<superscript>3</superscript> (por ejemplo, si no hay BMC o si el dispositivo está tras una puerta de enlace NAT). Esto permite a los operadores arrancar sus dispositivos en un laboratorio antes de saber cuándo o dónde se enviarán. En concreto, se aprovechan los componentes <literal>elemental-register</literal> y <literal>elemental-system-agent</literal> para permitir la incorporación de hosts de SUSE Linux Micro en Rancher para casos de uso de aprovisionamiento de red "phone home". Si se usa Edge Image Builder (EIB) para crear imágenes de despliegue, es posible realizar el registro automático a través de Rancher vía Elemental especificando la configuración de registro en el directorio de configuración de EIB.
ja: SUSEでは、Metal<superscript>3</superscript>を選択できないリモートデバイス(たとえば、BMCがない、デバイスがNATゲートウェイの背後にあるなど)の管理にElementalの一部を使用しています。このツールにより、オペレータは、デバイスがいつどこに配置されるかがわかる前に、ラボでデバイスをブートストラップできます。すなわち、<literal>elemental-register</literal>と<literal>elemental-system-agent</literal>コンポーネントを利用して、「Phone Home」ネットワークプロビジョニングのユースケースでSUSE Linux MicroホストをRancherにオンボードできます。Edge Image Builder (EIB)を使用してデプロイメントイメージを作成する場合、EIBの設定ディレクトリで登録設定を指定することで、Rancherを使用してElemental経由で自動登録を行うことができます。
pt_br: Usamos partes do Elemental para gerenciar dispositivos remotos quando o Metal<superscript>3</superscript> não é viável (por exemplo, não existe BMC ou o dispositivo está protegido por um gateway NAT). Essa ferramenta permite que o operador inicialize os dispositivos em laboratório antes de saber quando ou para onde serão enviados. Especificamente, usamos os componentes <literal>elemental-register</literal> e <literal>elemental-system-agent</literal> para permitir a integração de hosts do SUSE Linux Micro no Rancher para casos de uso de provisionamento de rede "phone home". Quando o Edge Image Builder (EIB) é usado para criar imagens de implantação, o registro automático pelo Rancher via Elemental pode ser feito especificando a configuração de registro no diretório de configuração do EIB.
zh_cn: 我们将使用 Elemental 的部分功能来管理无法使用 Metal<superscript>3</superscript> 的远程设备（例如，没有 BMC 的设备，或者 NAT 网关后的设备）。在知道设备何时运送或运送到何处之前，操作员可以使用此工具在实验室中引导其设备。也就是说，我们利用 <literal>elemental-register</literal> 和 <literal>elemental-system-agent</literal> 组件将 SUSE Linux Micro 主机接入 Rancher，以支持“自主回连”网络置备使用场景。使用 Edge Image Builder (EIB) 创建部署映像时，可以通过在 EIB 的配置目录中指定注册配置，来使用 Elemental 通过 Rancher 完成自动注册。

source: In SUSE Edge 3.4 we do <emphasis role="strong">not</emphasis> leverage the operating system management aspects of Elemental, and therefore it’s not possible to manage your operating system patching via Rancher. Instead of using the Elemental tools to build deployment images, SUSE Edge uses the Edge Image Builder tooling, which consumes the registration configuration.
es: En SUSE Edge 3.4 <emphasis role="strong">no</emphasis> se aprovechan las funciones de gestión del sistema operativo de Elemental, por lo que no es posible gestionar los parches del sistema operativo a través de Rancher. En lugar de utilizar las herramientas de Elemental para crear imágenes de despliegue, SUSE Edge usa Edge Image Builder, que hace uso de la configuración de registro.
ja: SUSE Edge 3.4では、Elementalのオペレーティングシステム管理の側面を利用して<emphasis role="strong">いない</emphasis>ため、Rancher経由でオペレーティングシステムのパッチを管理することはできません。SUSE Edgeでは、Elementalツールを使用してデプロイメントイメージを構築する代わりに、登録設定を使用するEdge Image Builderツールを使用します。
zh_cn: 在 SUSE Edge 3.4 中，我们<emphasis role="strong">不会</emphasis>利用 Elemental 的操作系统管理功能，因此无法通过 Rancher 管理操作系统修补。SUSE Edge 不会使用 Elemental 工具来构建部署映像，而是使用 Edge Image Builder 工具，后者利用注册配置。

source: The SUSE Edge recommended way of building deployments image that can leverage Elemental for registration to Rancher in the "phone home network provisioning" deployment footprint is to follow the instructions detailed in the remote host onboarding with Elemental (<xref linkend="quickstart-elemental"/>) quickstart.
es: La forma recomendada por SUSE Edge para crear imágenes de despliegue que puedan aprovechar Elemental para el registro en Rancher en el método de aprovisionamiento de red "phone home" es seguir las instrucciones descritas en la guía de inicio rápido de incorporación de hosts remotos con Elemental (<xref linkend="quickstart-elemental"/>).
ja: 「Phone Homeネットワークプロビジョニング」のデプロイメントフットプリントでElementalを利用してRancherに登録可能なデプロイメントイメージを構築する場合、SUSE Edgeでは、Elementalを使用したリモートホストのオンボーディング(<xref linkend="quickstart-elemental"/>)のクイックスタートで詳しく説明されている手順に従う方法をお勧めします。
pt_br: A maneira recomendada do SUSE Edge para criar imagens de implantação que possam usar o Elemental para registro no Rancher na área de implantação de "provisionamento de rede 'phone home'" é seguir as instruções detalhadas no início rápido sobre integração de host remoto com o Elemental (<xref linkend="quickstart-elemental"/>).
zh_cn: SUSE Edge 建议的、可以在“自主回连网络置备”部署空间中利用 Elemental 注册到 Rancher 的部署映像构建方法是，遵循有关使用 Elemental 进行远程主机初始配置（<xref linkend="quickstart-elemental"/>）快速入门中详述的说明。

source: Labels
es: Etiquetas
ja: ラベル
pt_br: Rótulos
zh_cn: 标签

source: Elemental tracks its inventory with the <literal>MachineInventory</literal> CRD and provides a way to select inventory, e.g. for selecting machines to deploy Kubernetes clusters to, based on labels. This provides a way for users to predefine most (if not all) of their infrastructure needs prior to hardware even being purchased. Also, since nodes can add/remove labels on their respective inventory object (by re-running <literal>elemental-register</literal> with the additional flag <literal>--label "FOO=BAR"</literal>), we can write scripts that will discover and let Rancher know where a node is booted.
es: Elemental realiza un seguimiento de su inventario con la CRD <literal>MachineInventory</literal> y ofrece una forma de seleccionar el inventario (por ejemplo, para seleccionar equipos en los que desplegar clústeres de Kubernetes) basada en etiquetas. Esto permite a los usuarios predefinir la mayor parte (si no la totalidad) de sus necesidades de infraestructura antes incluso de adquirir el hardware. Además, dado que los nodos pueden añadir o eliminar etiquetas en sus objetos de inventario respectivos (volviendo a ejecutar <literal>elemental-register</literal> con el indicador adicional <literal>--label "FOO=BAR"</literal>), es posible escribir guiones que detecten y comuniquen a Rancher dónde se ha iniciado un nodo.
ja: Elementalは、<literal>MachineInventory</literal> CRDを使用してインベントリを追跡し、インベントリを選択する方法を提供します。たとえば、Kubernetesクラスタのデプロイ先のマシンをラベルに基づいて選択できます。これにより、ユーザはハードウェアを購入する前に、インフラストラクチャのニーズの(すべてではないにしても)ほとんどを事前に定義しておくことができます。また、ノードはその各インベントリオブジェクトのラベルを追加/削除できるので(<literal>elemental-register</literal>を、追加のフラグ<literal>--label "FOO=BAR "</literal>を指定して再実行する)、ノードがブートされた場所を検出してRancherに知らせるスクリプトを作成できます。
pt_br: O Elemental monitora o inventário com a CRD <literal>MachineInventory</literal> e permite selecionar um inventário, por exemplo, para selecionar máquinas nas quais implantar clusters Kubernetes com base em rótulos. Dessa forma, os usuários podem predefinir grande parte (se não tudo) de suas necessidades de infraestrutura antes mesmo da compra do hardware. Além disso, como os nós podem adicionar/remover rótulos de seu respectivo objeto de inventário (executando novamente o <literal>elemental-register</literal> com o sinalizador adicional <literal>--label "FOO=BAR"</literal>), podemos escrever scripts para descobrir e permitir que o Rancher saiba onde um nó é inicializado.
zh_cn: Elemental 使用 <literal>MachineInventory</literal> CRD 跟踪其清单，并提供选择清单的方法，例如，根据标签选择要将 Kubernetes 群集部署到的计算机。这样，用户就可以在购买硬件之前，预定义其大部分（甚至所有）基础架构需求。另外，由于节点可以在其相应清单对象上添加/去除标签（结合附加标志 <literal>--label "FOO=BAR"</literal> 重新运行 <literal>elemental-register</literal>），我们可以编写脚本来发现节点的引导位置并告诉 Rancher。

source: The Elemental UI does not currently know how to build installation media or update non-"Elemental Teal" operating systems. This should be addressed in future releases.
es: La interfaz de usuario de Elemental no puede actualmente crear medios de instalación ni actualizar sistemas operativos que no sean "Elemental Teal". Esto debería solucionarse en futuras versiones.
ja: 現在のところ、Elemental UIは、インストールメディアの構築方法を認識したり、「Elemental Teal」以外のオペレーティングシステムを更新したりすることはできません。これは将来のリリースで対応予定です。
pt_br: Atualmente, a IU do Elemental não sabe como criar uma mídia de instalação ou atualizar sistemas operacionais não "Elemental Teal". Isso deve ser resolvido em versões futuras.
zh_cn: Elemental UI 目前不知道如何构建安装媒体或更新非“Elemental Teal”操作系统。此问题在将来的版本中应会得到解决。

source: Akri is a CNCF-Sandbox project that aims to discover leaf devices to present those as Kubernetes native resource. It also allows scheduling a pod or a job for each discovered device. Devices can be node-local or networked, and can use a wide variety of protocols.
pt_br: Akri é um projeto Sandbox da CNCF que visa a descobrir dispositivos folha para apresentá-los como recursos nativos do Kubernetes. Ele também permite programar um pod ou job para cada dispositivo descoberto. Os dispositivos podem ser de nó local ou de rede e usar uma ampla variedade de protocolos.
zh_cn: Akri 是一个 CNCF 沙箱项目，旨在发现叶设备并将其呈现为 Kubernetes 原生资源。它还允许为每个发现的设备调度一个 Pod 或作业。设备可以在节点本地，也可以联网，并可以使用多种协议。

source: Akri’s upstream documentation is available at: <link xl:href="https://docs.akri.sh">https://docs.akri.sh</link>
pt_br: A documentação upstream do Akri está disponível em: <link xl:href="https://docs.akri.sh">https://docs.akri.sh</link>
zh_cn: 有关 Akri 的上游文档，请访问 <link xl:href="https://docs.akri.sh">https://docs.akri.sh</link>

source: How does SUSE Edge use Akri?
pt_br: Como o SUSE Edge usa o Akri?
zh_cn: SUSE Edge 如何使用 Akri？

source: Akri is currently tech-preview in the SUSE Edge stack.
pt_br: Atualmente, o Akri está em prévia de tecnologia na pilha do SUSE Edge.
zh_cn: Akri 目前在 SUSE Edge 堆栈中以技术预览的形式提供。

source: Akri is available as part of the Edge Stack whenever there is a need to discover and schedule workload against leaf devices.
pt_br: O Akri está disponível como parte da pilha do Edge sempre que é preciso descobrir e programar uma carga de trabalho com base nos dispositivos folha.
zh_cn: 每当需要发现叶设备以及针对叶设备调度工作负载时，都可以使用 Edge 堆栈中包含的 Akri。

source: Installing Akri
pt_br: Instalando o Akri
zh_cn: 安装 Akri
