Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: nmstate is a widely adopted library (with an accompanying CLI tool) which offers a declarative API for network configurations via a predefined schema.
es: nmstate es una biblioteca de amplia adopción (que incluye una herramienta de interfaz de línea de comandos) que ofrece una API declarativa para configuraciones de red a través de un esquema predefinido.
ja: nmstateは広く採用されているライブラリ(CLIツールが付属)であり、定義済みスキーマを使用したネットワーク設定用の宣言型APIを提供します。
pt_br: O nmstate é uma biblioteca muito usada (com uma ferramenta CLI auxiliar) que oferece uma API declarativa para configurações de rede usando um esquema predefinido.
zh_cn: nmstate 是广泛采用的库（附带 CLI 工具），它提供一个声明性 API，可用于通过预定义的纲要进行网络配置。

source: Details about nmstate can be found in the <link xl:href="https://nmstate.io/">upstream documentation</link>.
es: Encontrará información sobre nmstate en la <link xl:href="https://nmstate.io/">documentación original</link>.
ja: nmstateの詳細については、<link xl:href="https://nmstate.io/">アップストリームドキュメント</link>を参照してください。
pt_br: Os detalhes sobre o nmstate estão disponíveis na <link xl:href="https://nmstate.io/">documentação upstream</link>.
zh_cn: 有关 nmstate 的详细信息，请参见<link xl:href="https://nmstate.io/">上游文档</link>。

source: Enter: NetworkManager Configurator (nmc)
es: NetworkManager Configurator (nmc)
ja: NetworkManager Configurator (nmc)の概要
pt_br: Inserir: NetworkManager Configurator (nmc)
zh_cn: NetworkManager Configurator (nmc) 概述

source: The network customization options available in SUSE Edge are achieved via a CLI tool called NetworkManager Configurator or <emphasis>nmc</emphasis> for short. It is leveraging the functionality provided by the nmstate library and, as such, it is fully capable of configuring static IP addresses, DNS servers, VLANs, bonding, bridges, etc. This tool allows us to generate network configurations from predefined desired states and to apply those across many different nodes in an automated fashion.
es: Para acceder a las opciones de personalización de redes disponibles en SUSE Edge se usa una herramienta de interfaz de línea de comandos llamada NetworkManager Configurator, o <emphasis>nmc</emphasis> para abreviar. Aprovecha la funcionalidad que ofrece la biblioteca nmstate y es capaz de configurar por si sola direcciones IP estáticas, servidores DNS, VLAN, vinculaciones, puentes, etc. Esta herramienta permite generar configuraciones de redes a partir de estados predefinidos deseados y aplicarlas de forma automatizada en muchos nodos diferentes.
ja: SUSE Edgeで利用可能なネットワークのカスタマイズオプションは、NetworkManager Configurator (短縮名は<emphasis>nmc</emphasis>)と呼ばれるCLIツールを使用して実行します。このツールはnmstateライブラリによって提供される機能を利用しているため、静的IPアドレス、DNSサーバ、VLAN、ボンディング、ブリッジなどを完全に設定できます。このツールを使用して、事前定義された望ましい状態からネットワーク設定を生成し、その設定を多数のノードに自動的に適用できます。
pt_br: As opções de personalização de rede no SUSE Edge são obtidas por uma ferramenta CLI chamada NetworkManager Configurator, ou <emphasis>nmc</emphasis> na forma abreviada, que aproveita a funcionalidade da biblioteca nmstate e, desse modo, é totalmente capaz de configurar endereços IP estáticos, servidores DNS, VLANs, vínculos, pontes etc. Essa ferramenta permite gerar configurações de rede com base em estados desejados predefinidos e aplicá-las a vários nós de maneira automatizada.
zh_cn: SUSE Edge 中提供的网络自定义选项通过一个称为 NetworkManager Configurator（简称为 <emphasis>nmc</emphasis>）的 CLI 工具实现。此工具利用 nmstate 库提供的功能，因此完全能够配置静态 IP 地址、DNS 服务器、VLAN、绑定、网桥等。我们可以使用此工具根据预定义的期望状态生成网络配置，并自动将这些配置应用于许多不同的节点。

source: Details about the NetworkManager Configurator (nmc) can be found in the <link xl:href="https://github.com/suse-edge/nm-configurator">upstream repository</link>.
es: Encontrará información sobre NetworkManager Configurator (nmc) en el <link xl:href="https://github.com/suse-edge/nm-configurator">repositorio original</link>.
ja: NetworkManager Configurator (nmc)の詳細については、<link xl:href="https://github.com/suse-edge/nm-configurator">アップストリームリポジトリ</link>を参照してください。
pt_br: Os detalhes sobre o NetworkManager Configurator (nmc) estão disponíveis no <link xl:href="https://github.com/suse-edge/nm-configurator">repositório upstream</link>.
zh_cn: 有关 NetworkManager Configurator (nmc) 的详细信息，请参见<link xl:href="https://github.com/suse-edge/nm-configurator">上游储存库</link>。

source: How does SUSE Edge use NetworkManager Configurator?
es: ¿Cómo se usa NetworkManager Configurator en SUSE Edge?
ja: SUSE EdgeでのNetworkManager Configuratorの用途
pt_br: Como o SUSE Edge usa o NetworkManager Configurator?
zh_cn: SUSE Edge 如何使用 NetworkManager Configurator？

source: SUSE Edge utilizes <emphasis>nmc</emphasis> for the network customizations in the various different provisioning models:
es: SUSE Edge usa <emphasis>nmc</emphasis> para personalizar las redes en los distintos modelos de aprovisionamiento:
ja: SUSE Edgeは、<emphasis>nmc</emphasis>を利用して次のようなさまざまなプロビジョニングモデルでネットワークをカスタマイズします。
pt_br: O SUSE Edge utiliza o <emphasis>nmc</emphasis> para as personalizações de rede em diversos modelos de provisionamento:
zh_cn: SUSE Edge 利用 <emphasis>nmc</emphasis> 在各种不同的置备模型中进行网络自定义：

source: Custom network configurations in the Directed Network Provisioning scenarios (<xref linkend="quickstart-metal3"/>)
es: Configuraciones de red personalizadas en casos de aprovisionamiento de red dirigida (<xref linkend="quickstart-metal3"/>)
ja: ダイレクトネットワークプロビジョニングシナリオにおけるカスタムネットワーク設定(<xref linkend="quickstart-metal3"/>)
pt_br: Configurações de rede personalizadas em cenários de provisionamento de rede direcionado (<xref linkend="quickstart-metal3"/>)
zh_cn: 定向网络置备场景中的自定义网络配置（<xref linkend="quickstart-metal3"/>）

source: Declarative static configurations in the Image Based Provisioning scenarios (<xref linkend="quickstart-eib"/>)
es: Configuraciones estáticas declarativas en casos de aprovisionamiento basado en imágenes (<xref linkend="quickstart-eib"/>)
ja: イメージベースのプロビジョニングシナリオにおける宣言的な静的設定(<xref linkend="quickstart-eib"/>)
pt_br: Configurações estáticas declarativas em cenários de provisionamento com base em imagem (<xref linkend="quickstart-eib"/>)
zh_cn: 基于映像的置备场景中的声明性静态配置（<xref linkend="quickstart-eib"/>）

source: Configuring with Edge Image Builder
es: Configuración con Edge Image Builder
ja: Edge Image Builderを使用した設定
pt_br: Configurando com o Edge Image Builder
zh_cn: 使用 Edge Image Builder 进行配置

source: Edge Image Builder (EIB) is a tool which enables configuring multiple hosts with a single OS image. In this section we’ll show how you can use a declarative approach to describe the desired network states, how those are converted to the respective NetworkManager connections, and are then applied during the provisioning process.
es: Edge Image Builder (EIB) es una herramienta que permite configurar varios hosts con una sola imagen del sistema operativo. En esta sección, se muestra cómo se puede utilizar un enfoque declarativo para describir los estados de red deseados, cómo se convierten en las respectivas conexiones de NetworkManager y cómo se aplican durante el proceso de aprovisionamiento.
ja: Edge Image Builder (EIB)は、1つのOSイメージで複数のホストを設定できるツールです。このセクションでは、宣言型アプローチを使用して、どのように目的のネットワーク状態を記述するかと、それらがどのように各NetworkManager接続に変換され、プロビジョニングプロセス中に適用されるかを示します。
pt_br: O Edge Image Builder (EIB) é uma ferramenta que permite configurar vários hosts com uma única imagem de sistema operacional. Nesta seção, vamos mostrar como usar uma abordagem declarativa para descrever os estados da rede desejados, como eles são convertidos nas respectivas conexões do NetworkManager e, em seguida, aplicados durante o processo de provisionamento.
zh_cn: Edge Image Builder (EIB) 是可用于通过单个操作系统映像配置多个主机的工具。本节将介绍如何使用声明式方法来描述期望的网络状态，如何将这些状态转换为相应的 NetworkManager 连接，然后在置备过程中应用这些连接。

source: If you’re following this guide, it’s assumed that you’ve got the following already available:
es: Si está siguiendo esta guía, se entiende que ya dispone de lo siguiente:
ja: このガイドに従って操作を進める場合、以下がすでに用意されていることを想定しています。
pt_br: Se você está seguindo este guia, já deve ter os seguintes itens disponíveis:
zh_cn: 如果您要学习本指南，事先需要做好以下准备：

source: An AMD64/Intel 64 physical host (or virtual machine) running SLES 15 SP6 or openSUSE Leap 15.6
es: Un host físico (o máquina virtual) AMD64/Intel 64 que ejecute SLES 15 SP6 u openSUSE Leap 15.6
ja: SLES 15 SP6またはopenSUSE Leap 15.6を実行しているAMD64/Intel 64物理ホスト(または仮想マシン)
pt_br: Host físico (ou máquina virtual) AMD64/Intel 64 com SLES 15 SP6 ou openSUSE Leap 15.6
zh_cn: 一台运行 SLES 15 SP6 或 openSUSE Leap 15.6 的 AMD64/Intel 64 物理主机（或虚拟机）

source: An available container runtime (e.g. Podman)
es: Un entorno de ejecución de contenedores disponible (por ejemplo, Podman)
ja: 利用可能なコンテナランタイム(Podmanなど)
pt_br: Runtime de contêiner disponível (por exemplo, Podman)
zh_cn: 一个可用的容器运行时（例如 Podman）

source: A copy of the SUSE Linux Micro 6.1 RAW image found <link xl:href="https://www.suse.com/download/sle-micro/">here</link>
es: Una copia de la imagen RAW de SUSE Linux Micro 6.1 que se encuentra <link xl:href="https://www.suse.com/download/sle-micro/">aquí</link>
ja: SUSE Linux Micro 6.1 RAWイメージのコピー(<link xl:href="https://www.suse.com/download/sle-micro/">こちら</link>にあります)
pt_br: Cópia da imagem RAW do SUSE Linux Micro 6.1 disponível <link xl:href="https://www.suse.com/download/sle-micro/">aqui</link>
zh_cn: SUSE Linux Micro 6.1 原始映像，可在<link xl:href="https://www.suse.com/download/sle-micro/">此处</link>获取

source: Getting the Edge Image Builder container image
es: Obtención de la imagen del contenedor de Edge Image Builder
ja: Edge Image Builderのコンテナイメージの取得
pt_br: Obtendo a imagem de contêiner do Edge Image Builder
zh_cn: 获取 Edge Image Builder 容器映像

source: The EIB container image is publicly available and can be downloaded from the SUSE Edge registry by running:
es: La imagen del contenedor de EIB está disponible públicamente y se puede descargar desde el registro de SUSE Edge ejecutando:
ja: EIBのコンテナイメージは一般に公開されており、次のコマンドを実行してSUSE Edgeレジストリからダウンロードできます。
pt_br: A imagem de contêiner do EIB está disponível publicamente e pode ser baixada do registro SUSE Edge executando o seguinte comando:
zh_cn: EIB 容器映像已公开提供，可以通过运行以下命令从 SUSE Edge 仓库下载：

source: Let’s start with creating the configuration directory:
es: Para empezar, se crea el directorio de configuración:
ja: まず設定ディレクトリを作成しましょう。
pt_br: Vamos começar pela criação do diretório de configuração:
zh_cn: 我们来开始创建配置目录：

source: We will now ensure that the downloaded base image copy is moved over to the configuration directory:
es: Ahora, hay que asegurarse de que la copia de la imagen base descargada se traslade al directorio de configuración:
ja: ダウンロードしたゴールデンイメージのコピーを確実に設定ディレクトリに移動します。
pt_br: Agora vamos mover a cópia da imagem base baixada para o diretório de configuração:
zh_cn: 确保下载的基础映像已移动到配置目录：

source: EIB is never going to modify the base image input. It will create a new image with its modifications.
es: EIB nunca modificará la imagen base introducida. Creará una nueva imagen con sus modificaciones.
ja: EIBは、ゴールデンイメージの入力を変更することはありません。変更を加えた新しいイメージを作成します。
pt_br: O EIB nunca modifica a entrada da imagem base, ele cria uma nova com as respectivas modificações.
zh_cn: EIB 永远不会修改基础映像输入。它会创建一个包含所需修改内容的新映像。

source: The definition file describes the majority of configurable options that the Edge Image Builder supports.
es: El archivo de definición describe la mayoría de las opciones configurables que admite Edge Image Builder.
ja: 定義ファイルには、Edge Image Builderがサポートする設定オプションの大部分を記述します。
pt_br: O arquivo de definição descreve a maioria das opções configuráveis que o Edge Image Builder suporta.
zh_cn: 定义文件描述了 Edge Image Builder 支持的大多数可配置选项。

source: Let’s start with a very basic definition file for our OS image:
es: Comencemos con un archivo de definición muy básico para nuestra imagen del sistema operativo:
ja: OSイメージの非常に基本的な定義ファイルから開始しましょう。
pt_br: Vamos começar com um arquivo de definição bem básico para nossa imagem de sistema operacional:
zh_cn: 首先，我们为操作系统映像创建一个非常简单的定义文件：

source: The <literal>image</literal> section is required, and it specifies the input image, its architecture and type, as well as what the output image will be called. The <literal>operatingSystem</literal> section is optional, and contains configuration to enable login on the provisioned systems with the <literal>root/eib</literal> username/password.
es: La sección <literal>image</literal> es obligatoria y especifica la imagen de entrada, su arquitectura y su tipo, así como el nombre que se le dará a la imagen de salida. La sección <literal>operatingSystem</literal> es opcional y contiene la configuración para habilitar el inicio de sesión en los sistemas aprovisionados con el nombre de usuario/contraseña <literal>root/eib</literal>.
ja: <literal>image</literal>セクションは必須で、入力イメージ、そのアーキテクチャとタイプ、および出力イメージの名前を指定します。<literal>operatingSystem</literal>セクションはオプションであり、プロビジョニングされたシステムに<literal>root/eib</literal>のユーザ名/パスワードでログインできるようにするための設定を含めます。
pt_br: A seção <literal>image</literal> é obrigatória e especifica a imagem de entrada, sua arquitetura e tipo, além do nome da imagem de saída. A seção <literal>operatingSystem</literal> é opcional e contém a configuração para permitir o login nos sistemas provisionados com nome de usuário/senha <literal>root/eib</literal>.
zh_cn: 必须包含 <literal>image</literal> 部分，它指定输入映像、输入映像的体系结构和类型，以及输出映像的名称。<literal>operatingSystem</literal> 是可选部分，其中包含的配置允许用户通过 <literal>root/eib</literal> 用户名/口令登录到置备的系统。

source: Feel free to use your own encrypted password by running <literal>openssl passwd -6 &lt;password&gt;</literal>.
es: Puede usar libremente su propia contraseña cifrada ejecutando <literal>openssl passwd -6 &lt;contraseña&gt;</literal>.
ja: <literal>openssl passwd -6 &lt;password&gt;</literal>を実行して、独自の暗号化パスワードを自由に使用してください。
pt_br: Você pode usar sua própria senha criptografada executando <literal>openssl passwd -6 &lt;senha&gt;</literal>.
zh_cn: 您可以运行 <literal>openssl passwd -6 &lt;password&gt;</literal> 来使用自己的已加密口令。

source: Defining the network configurations
es: Definición de las configuraciones de redes
ja: ネットワーク設定の定義
pt_br: Definindo as configurações de rede
zh_cn: 定义网络配置

source: The desired network configurations are not part of the image definition file that we just created. We’ll now populate those under the special <literal>network/</literal> directory. Let’s create it:
es: Las configuraciones de redes deseadas no forman parte del archivo de definición de imagen que se acaba de crear. Se introducen ahora en el directorio <literal>network/</literal> especial. Vamos a crearlo:
ja: 先ほど作成したイメージ定義ファイルには、望ましいネットワーク設定が含まれていません。そこで、<literal>network/</literal>という特別なディレクトリの下にその設定を入力します。では、作成してみましょう。
pt_br: As configurações de rede desejadas não fazem parte do arquivo de definição da imagem que acabamos de criar. Vamos agora preenchê-las no diretório especial <literal>network/</literal>. Para criá-lo:
zh_cn: 期望的网络配置不是我们刚刚创建的映像定义文件的一部分。现在我们在特殊的 <literal>network/</literal> 目录下填充这些配置。我们来创建该目录：

source: As previously mentioned, the NetworkManager Configurator (<emphasis>nmc</emphasis>) tool expects an input in the form of predefined schema. You can find how to set up a wide variety of different networking options in the <link xl:href="https://nmstate.io/examples.html">upstream NMState examples documentation</link>.
es: Como se mencionó anteriormente, la herramienta NetworkManager Configurator (<emphasis>nmc</emphasis>) espera una entrada en forma de esquema predefinido. Encontrará cómo configurar una amplia variedad de opciones de red diferentes en la <link xl:href="https://nmstate.io/examples.html">documentación de ejemplos de NMState original</link>.
ja: 前述のように、NetworkManager Configurator (<emphasis>nmc</emphasis>)ツールでは、事前定義されたスキーマの形式での入力が必要です。さまざまなネットワーキングオプションの設定方法については、<link xl:href="https://nmstate.io/examples.html">アップストリームのNMStateの例のドキュメント</link>を参照してください。
pt_br: Como já foi mencionado, a ferramenta NetworkManager Configurator (<emphasis>nmc</emphasis>) espera uma entrada no formato de esquema predefinido. Você encontra como configurar uma ampla variedade de opções de rede na <link xl:href="https://nmstate.io/examples.html">documentação de exemplos upstream do NMState</link>.
zh_cn: 如前所述，NetworkManager Configurator (<emphasis>nmc</emphasis>) 工具要求提供预定义纲要形式的输入。您可以参见<link xl:href="https://nmstate.io/examples.html">上游 NMState 示例文档</link>，了解如何设置各种不同的网络选项。

source: This guide will explain how to configure the networking on three different nodes:
es: En esta guía se explica cómo configurar la red en tres nodos diferentes:
ja: このガイドでは、次の3つの異なるノードでネットワーキングを設定する方法について説明します。
pt_br: Esse guia explica como configurar a rede em três nós diferentes:
zh_cn: 本指南将介绍如何在三个不同的节点上配置网络：

source: A node which uses two Ethernet interfaces
es: Un nodo que usa dos interfaces Ethernet
ja: 2つのEthernetインタフェースを使用するノード
pt_br: Um nó que usa duas interfaces Ethernet
zh_cn: 使用两个以太网接口的节点

source: A node which uses network bonding
es: Un nodo que usa vinculación de interfaces de red
ja: ネットワークボンディングを使用するノード
pt_br: Um nó que usa vínculo de rede
zh_cn: 使用网络绑定的节点

source: A node which uses a network bridge
es: Un nodo que usa un puente de redes
ja: ネットワークブリッジを使用するノード
pt_br: Um nó que usa ponte de rede
zh_cn: 使用网桥的节点

source: Using completely different network setups is not recommended in production builds, especially if configuring Kubernetes clusters. Networking configurations should generally be homogeneous amongst nodes or at least amongst roles within a given cluster. This guide is including various different options only to serve as an example reference.
es: No se recomienda utilizar configuraciones de redes completamente diferentes en entornos de producción, especialmente si se configuran clústeres de Kubernetes. Las configuraciones de redes deben ser, por lo general, homogéneas entre los nodos o, al menos, entre las funciones dentro de un clúster determinado. Esta guía incluye varias opciones diferentes solo a modo de referencia.
ja: 特にKubernetesクラスタを設定する場合、まったく異なるネットワークセットアップを運用ビルドで使用することは推奨されません。ネットワーキング設定は通常、特定のクラスタ内のノード間、または少なくともロール間で同種にすることをお勧めします。このガイドにはさまざまな異なるオプションが含まれていますが、これは参考例として提供することのみを目的としています。
pt_br: O uso de configurações de rede completamente diferentes não é recomendado em builds de produção, especialmente na configuração de clusters Kubernetes. Em geral, as configurações de rede devem ser homogêneas entre os nós ou, pelo menos, entre as funções em um determinado cluster. Este guia inclui diversas opções apenas para servir como referência de exemplo.
zh_cn: 不建议在生产构建中使用完全不同的网络设置，尤其是在配置 Kubernetes 群集时。网络配置通常应在节点之间或至少在给定群集内的角色之间保持同质。本指南包含的各种不同选项仅供参考。

source: The following assumes a default <literal>libvirt</literal> network with an IP address range <literal>192.168.122.1/24</literal>. Adjust accordingly if this differs in your environment.
es: En el ejemplo siguiente se entiende que se usa una red <literal>libvirt</literal> predeterminada con un rango de direcciones IP <literal>192.168.122.1/24</literal>. Ajústelo según las necesidades concretas de su entorno.
ja: 以下では、IPアドレス範囲<literal>192.168.122.1/24</literal>を使用するデフォルトの<literal>libvirt</literal>ネットワークを想定しています。ご自身の環境でこの範囲が異なる場合は、適宜調整してください。
pt_br: No exemplo abaixo, foi considerada a rede padrão <literal>libvirt</literal> com um intervalo de endereços IP <literal>192.168.122.1/24</literal>. Ajuste-a de acordo se for diferente em seu ambiente.
zh_cn: 以下示例采用 IP 地址范围为 <literal>192.168.122.1/24</literal> 的默认 <literal>libvirt</literal> 网络。如果您的环境与此不同，请相应地进行调整。

source: Let’s create the desired states for the first node which we will call <literal>node1.suse.com</literal>:
es: Vamos a crear los estados deseados para el primer nodo, al que llamaremos <literal>node1.suse.com</literal>:
ja: <literal>node1.suse.com</literal>という名前の最初のノードに対して、望ましい状態を作成しましょう。
pt_br: Vamos criar os estados desejados para o primeiro nó, que será chamado de <literal>node1.suse.com</literal>:
zh_cn: 我们来为第一个节点（名为 <literal>node1.suse.com</literal>）创建期望的状态：

source: In this example we define a desired state of two Ethernet interfaces (eth0 and eth3), their requested IP addresses, routing, and DNS resolution.
es: En este ejemplo, definimos el estado deseado de dos interfaces Ethernet (eth0 y eth3), sus direcciones IP solicitadas, el enrutamiento y la resolución DNS.
ja: この例では、2つのEthernetインタフェース(eth0とeth3)、要求されたIPアドレス、ルーティング、およびDNS解決の望ましい状態を定義しています。
pt_br: Nesse exemplo, definimos um estado desejado de duas interfaces Ethernet (eth0 e eth3), os endereços IP solicitados, o roteamento e a resolução DNS.
zh_cn: 在此示例中，我们将定义两个以太网接口（eth0 和 eth3）的期望状态、其请求 IP 地址、路由和 DNS 解析。

source: You must ensure that the MAC addresses of all Ethernet interfaces are listed. Those are used during the provisioning process as the identifiers of the nodes and serve to determine which configurations should be applied. This is how we are able to configure multiple nodes using a single ISO or RAW image.
es: Debe asegurarse de que las direcciones MAC de todas las interfaces Ethernet estén incluidas en la lista. Estas direcciones se utilizan durante el proceso de aprovisionamiento como identificadores de los nodos y sirven para determinar qué configuraciones deben aplicarse. De esta manera, podemos configurar varios nodos utilizando una sola imagen ISO o RAW.
ja: 必ず、すべてのEthernetインタフェースのMACアドレスを記述してください。これらのMACアドレスは、プロビジョニングプロセス中にノードの識別子として使用され、どの設定を適用すべきかを判断するのに役立ちます。このようにして、1つのISOまたはRAWイメージを使用して複数のノードを設定できます。
pt_br: Garanta que os endereços MAC de todas as interfaces Ethernet sejam listados. Eles são usados durante o processo de provisionamento como identificadores dos nós e servem para determinar quais configurações devem ser aplicadas. É dessa forma que podemos configurar vários nós usando uma única imagem ISO ou RAW.
zh_cn: 必须确保列出了所有以太网接口的 MAC 地址。这些地址在置备过程中用作节点的标识符，用于确定要应用哪些配置。这就是我们使用单个 ISO 或 RAW 映像配置多个节点的方式。

source: Next up is the second node which we will call <literal>node2.suse.com</literal> and which will use network bonding:
es: El siguiente es el segundo nodo, al que llamaremos <literal>node2.suse.com</literal> y que utilizará vinculación de interfaces de red:
ja: 次は、<literal>node2.suse.com</literal>という名前の2つ目のノードです。このノードではネットワークボンディングを使用します。
pt_br: O próximo é o segundo nó que será chamado de <literal>node2.suse.com</literal> e usará vínculo de rede:
zh_cn: 接下来对第二个节点（名为 <literal>node2.suse.com</literal>）进行操作，该节点使用网络绑定：

source: In this example we define a desired state of two Ethernet interfaces (eth0 and eth1) which are not enabling IP addressing, as well as a bond with a round-robin policy and its respective address which is going to be used to forward the network traffic.
es: En este ejemplo definimos un estado deseado de dos interfaces Ethernet (eth0 y eth1) que no permiten el direccionamiento IP, así como una vinculación con una directiva round-robin y su dirección respectiva que se utilizará para reenviar el tráfico de red.
ja: この例では、IPアドレス指定を有効にしていない2つのEthernetインタフェース(eth0とeth1)の望ましい状態と、ラウンドロビンポリシーによるボンディング、およびネットワークトラフィックを転送するために使用する各アドレスを定義します。
pt_br: Nesse exemplo, definimos um estado desejado de duas interfaces Ethernet (eth0 e eth1) que não habilitam endereçamento IP, além de um vínculo com política round robin e o respectivo endereço que será usado para encaminhar o tráfego de rede.
zh_cn: 在此示例中，我们将定义两个未启用 IP 寻址的以太网接口（eth0 和 eth1）的期望状态，以及采用轮替策略的绑定及其用于转发网络流量的相应地址。

source: Lastly, we’ll create the third and final desired state file which will be utilizing a network bridge and which we’ll call <literal>node3.suse.com</literal>:
es: Por último, crearemos el tercer y último archivo de estado deseado, que usará un puente de red y al que llamaremos <literal>node3.suse.com</literal>:
ja: 最後に、3つ目となる、望ましい状態の最後のファイルを作成します。これはネットワークブリッジを利用し、<literal>node3.suse.com</literal>という名前です。
pt_br: Por fim, vamos criar o terceiro e último arquivo de estado desejado, que usará uma ponte de rede e será chamado de <literal>node3.suse.com</literal>:
zh_cn: 最后，我们将创建第三个（也是最后一个）期望状态文件，该文件利用网桥，我们将其命名为 <literal>node3.suse.com</literal>：
