Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: SUSE Edge is using <xref linkend="components-eib"/> in order to customize base SUSE Linux Micro OS images. Follow <xref linkend="suse-security-install"/> for an air-gapped installation of SUSE Security on top of Kubernetes clusters provisioned by EIB.
es: SUSE Edge utiliza <xref linkend="components-eib"/> para personalizar las imágenes del sistema operativo SUSE Linux Micro base. Siga las instrucciones de la <xref linkend="suse-security-install"/> para realizar una instalación en entornos aislados de SUSE Security sobre clústeres de Kubernetes aprovisionados por EIB.
ja: SUSE Edgeは、SUSE Linux Micro OSのゴールデンイメージをカスタマイズするために<xref linkend="components-eib"/>を使用しています。EIBでプロビジョニングしたKubernetesクラスタ上にSUSE Securityをエアギャップインストールするには、<xref linkend="suse-security-install"/>に従ってください。
pt_br: O SUSE Edge usa o <xref linkend="components-eib"/> para personalizar as imagens base do sistema operacional SUSE Linux Micro. Siga a <xref linkend="suse-security-install"/> para uma instalação air-gapped do SUSE Security em clusters Kubernetes provisionados pelo EIB.
zh_cn: SUSE Edge 使用<xref linkend="components-eib"/>来自定义基础 SUSE Linux Micro 操作系统映像。请按照<xref linkend="suse-security-install"/>中所述，在 EIB 置备的 Kubernetes 群集上进行 SUSE Security 隔离式安装。

source: See <link xl:href="https://metallb.universe.tf/">MetalLB official documentation</link>.
es: Consulte la <link xl:href="https://metallb.universe.tf/">documentación oficial de MetalLB</link>.
ja: <link xl:href="https://metallb.universe.tf/">MetalLBの公式ドキュメント</link>を参照してください。
pt_br: Consulte a <link xl:href="https://metallb.universe.tf/">documentação oficial do MetalLB</link>.
zh_cn: 请参见 <link xl:href="https://metallb.universe.tf/">MetalLB 官方文档</link>。

source: MetalLB is a load-balancer implementation for bare-metal Kubernetes clusters, using standard routing protocols.
es: MetalLB es una implementación de equilibrador de carga para clústeres de Kubernetes en bare metal que utiliza protocolos de enrutamiento estándar.
ja: MetalLBは、標準のルーティングプロトコルを使用する、ベアメタルKubernetesクラスタ用のロードバランサの実装です。
pt_br: O MetalLB é uma implementação de balanceador de carga para clusters Kubernetes bare metal, usando protocolos de roteamento padrão.
zh_cn: MetalLB 是使用标准路由协议的裸机 Kubernetes 群集的负载平衡器实现。

source: In bare-metal environments, setting up network load balancers is notably more complex than in cloud environments. Unlike the straightforward API calls in cloud setups, bare-metal requires either dedicated network appliances or a combination of load balancers and Virtual IP (VIP) configurations to manage High Availability (HA) or address the potential Single Point of Failure (SPOF) inherent in a single node load balancer. These configurations are not easily automated, posing challenges in Kubernetes deployments where components dynamically scale up and down.
es: En entornos bare metal, configurar equilibradores de carga de red es notablemente más complejo que en entornos en la nube. A diferencia de las sencillas llamadas a la API de las configuraciones en la nube, en bare metal se requieren dispositivos de red dedicados o una combinación de equilibradores de carga y configuraciones de IP virtual (VIP) para gestionar la alta disponibilidad (HA) o abordar el posible punto único de fallo (SPOF) inherente a que haya un equilibrador de carga de un solo nodo. Estas configuraciones no se automatizan fácilmente, lo que plantea retos en los despliegues de Kubernetes, donde los componentes se escalan dinámicamente.
ja: ベアメタル環境では、ネットワークロードバランサの設定がクラウドセットアップよりも著しく複雑になります。クラウド設定でのわかりやすいAPIコールとは異なり、ベアメタルでは、高可用性(HA)を管理したり、シングルノードのロードバランサに特有の潜在的な単一障害点(SPOF)に対処したりするために、専用のネットワークアプライアンス、またはロードバランサと仮想IP (VIP)設定の組み合わせが必要になります。このような設定は自動化しにくく、コンポーネントが動的にスケールアップ/ダウンするKubernetesのデプロイメントでは課題となります。
pt_br: Em ambientes bare metal, a configuração de balanceadores de carga de rede é visivelmente mais complexa do que em ambientes de nuvem. Ao contrário das chamadas de API simples nas configurações de nuvem, o bare metal requer aplicações de rede dedicadas ou uma combinação de balanceadores de carga e configurações de IP virtual (VIP, Virtual IP) para gerenciar a alta disponibilidade (HA, High Availability) ou resolver o ponto único de falha (SPOF, Single Point of Failure) inerentes em um balanceador de carga de nó único. Essas configurações não são automatizadas com facilidade, criando desafios para as implantações do Kubernetes em que a escala dos componentes aumenta e reduz de forma dinâmica.
zh_cn: 在裸机环境中，设置网络负载平衡器比在云环境中要复杂得多。与云设置中的直接 API 调用不同，裸机需要通过专用网络设备或者负载平衡器和虚拟 IP (VIP) 配置的组合，来管理高可用性 (HA) 或解决单节点负载平衡器固有的潜在单一故障点 (SPOF)。这些配置不容易实现自动化，在组件会动态扩缩的 Kubernetes 部署中带来了挑战。

source: MetalLB addresses these challenges by harnessing the Kubernetes model to create LoadBalancer type services as if they were operating in a cloud environment, even on bare-metal setups.
es: MetalLB aborda estos retos aprovechando el modelo de Kubernetes para crear servicios de tipo LoadBalancer como si estuvieran operando en un entorno de nube, incluso en configuraciones bare metal.
ja: MetalLBでは、こうした課題に対処するために、Kubernetesモデルを利用してLoadBalancerタイプのサービスを作成し、ベアメタルセットアップであってもクラウド環境であるかのように動作させます。
pt_br: O MetalLB resolve esses desafios usando o modelo do Kubernetes para criar serviços do tipo LoadBalancer como se operassem em um ambiente de nuvem, mesmo nas configurações bare metal.
zh_cn: MetalLB 可以解决这些挑战，因为它利用 Kubernetes 模型创建 LoadBalancer 类型的服务，就如同这些服务是在云环境中运行一样，即使在裸机设置中，也能做到这一点。

source: There are two different approaches, via <link xl:href="https://metallb.universe.tf/concepts/layer2/">L2 mode</link> (using ARP <emphasis>tricks</emphasis>) or via <link xl:href="https://metallb.universe.tf/concepts/bgp/">BGP</link>. Mainly L2 does not need any special network gear but BGP is in general better. It depends on the use cases.
es: Hay dos enfoques distintos, mediante el <link xl:href="https://metallb.universe.tf/concepts/layer2/">modo L2</link> (que usa <emphasis>tricks</emphasis> ARP) o mediante <link xl:href="https://metallb.universe.tf/concepts/bgp/">BGP</link>. A rasgos generales, el modo L2 no necesita ningún equipo de red especial, pero BGP suele ser mejor. El uso de un enfoque u otro dependerá de los casos de uso.
ja: 2つの異なるアプローチがあります。<link xl:href="https://metallb.universe.tf/concepts/layer2/">L2モード</link>(ARP<emphasis>トリック</emphasis>を使用する)アプローチか、<link xl:href="https://metallb.universe.tf/concepts/bgp/">BGP</link>を使用するアプローチです。主にL2では特別なネットワーク機器は必要ありませんが、一般的にはBGPのほうが優れています。これはユースケースによって異なります。
pt_br: Há duas abordagens diferentes, pelo <link xl:href="https://metallb.universe.tf/concepts/layer2/">modo L2</link> (usando <emphasis>truques</emphasis> de ARP) ou pelo <link xl:href="https://metallb.universe.tf/concepts/bgp/">BGP</link>. Basicamente, o L2 não precisa de equipamento de rede especial, mas o BGP costuma ser melhor. Isso depende do caso de uso.
zh_cn: 为此可以采用两种不同的方法：通过 <link xl:href="https://metallb.universe.tf/concepts/layer2/">L2 模式</link>（使用 ARP <emphasis>技巧</emphasis>）或通过 <link xl:href="https://metallb.universe.tf/concepts/bgp/">BGP</link>。大体而言，L2 不需要任何特殊网络设备，但 BGP 通常效果更好。使用哪种方法取决于使用场景。

source: How does SUSE Edge use MetalLB?
es: ¿Cómo se usa MetalLB en SUSE Edge?
ja: SUSE EdgeでのMetalLBの用途
pt_br: Como o SUSE Edge usa o MetalLB?
zh_cn: SUSE Edge 如何使用 MetalLB？

source: SUSE Edge uses MetalLB in three key ways:
es: SUSE Edge usa MetalLB principalmente de tres formas:
ja: SUSE Edgeは、MetalLBを主に次の3つの方法で使用します。
zh_cn: SUSE Edge 主要通过三种方式使用 MetalLB：

source: As a Load Balancer Solution: MetalLB serves as the Load Balancer solution for bare-metal machines.
es: Como solución de equilibrador de carga: MetalLB sirve como solución de equilibrio de carga para equipos bare metal.
ja: ロードバランサソリューションとして: MetalLBは、ベアメタルマシン用のロードバランサソリューションとして機能します。
pt_br: Como solução de balanceador de carga: o MetalLB atua como solução de balanceador de carga para máquinas bare metal.
zh_cn: 作为负载平衡器解决方案：MetalLB 充当裸机的负载平衡器解决方案。

source: For an HA K3s/RKE2 Setup: MetalLB allows for load balancing the Kubernetes API using a Virtual IP address.
es: En configuraciones K3s/RKE2 de HA: MetalLB permite equilibrar la carga de la API de Kubernetes utilizando una dirección IP virtual.
ja: HA K3s/RKE2セットアップの場合: MetalLBでは、仮想IPアドレスを使用してKubernetes APIを負荷分散できます。
pt_br: Em uma configuração do K3s/RKE2 de alta disponibilidade: o MetalLB permite o balanceamento de carga da API do Kubernetes usando um endereço IP virtual.
zh_cn: 对于 HA K3s/RKE2 设置：MetalLB 允许使用虚拟 IP 地址对 Kubernetes API 进行负载平衡。

source: As an L3 BGP solution where MetalLB advertises routes to the service IPs to nearby routers.
es: Como solución BGP L3 donde MetalLB anuncia rutas a las IP de servicio a routers cercanos.
ja: MetalLBがサービスIPへのルートを近隣ルータにアドバタイズするL3 BGPソリューションとして。
zh_cn: 作为 L3 BGP 解决方案，MetalLB 会向附近的路由器通告指向服务 IP 的路由。

source: In order to be able to expose the API, the Endpoint Copier Operator (<xref linkend="components-eco"/>) is used to keep in sync the K8s API endpoints from the <literal>kubernetes</literal> service to a <literal>kubernetes-vip</literal> LoadBalancer service.
es: Para poder exponer la API, se utiliza el operador Endpoint Copier Operator (<xref linkend="components-eco"/>) para mantener sincronizados los puntos finales de la API de K8s desde el servicio <literal>kubernetes</literal> con un servicio LoadBalancer <literal>kubernetes-vip</literal>.
ja: APIを公開できるようにするため、Endpoint Copier Operator (<xref linkend="components-eco"/>)を使用して、 <literal>kubernetes</literal>サービスから<literal>kubernetes-vip</literal> LoadBalancerサービスへのK8s APIエンドポイントの同期を維持します。
pt_br: Para expor a API, o Endpoint Copier Operator (<xref linkend="components-eco"/>) é usado para sincronização dos endpoints da API K8s do serviço <literal>kubernetes</literal> com um serviço LoadBalancer <literal>kubernetes-vip</literal>.
zh_cn: 为了能够公开 API，会使用 Endpoint Copier Operator（<xref linkend="components-eco"/>）将 K8s API 端点从 <literal>kubernetes</literal> 服务同步到 <literal>kubernetes-vip</literal> LoadBalancer 服务。

source: Installation of MetalLB in L2 mode is described in <xref linkend="guides-metallb-k3s"/> and for L3 mode in <xref linkend="guides-metallb-k3s-l3"/>.
es: La instalación de MetalLB en el modo L2 se describe en el <xref linkend="guides-metallb-k3s"/> y en el modo L3, en <xref linkend="guides-metallb-k3s-l3"/>.
ja: L2モードでのMetalLBのインストールについては、<xref linkend="guides-metallb-k3s"/>で説明されており、L3モードの場合は<xref linkend="guides-metallb-k3s-l3"/>で説明されています。
zh_cn: 有关 L2 模式下 MetalLB 的安装说明，请参见<xref linkend="guides-metallb-k3s"/>；有关 L3 模式下的安装说明，请参见<xref linkend="guides-metallb-k3s-l3"/>。

source: A guide on installing MetalLB in front of the <literal>kube-api-server</literal> to achieve high-availability topology can be found in <xref linkend="guides-metallb-kubernetes"/>.
es: Hay disponible una guía sobre cómo instalar MetalLB delante del <literal>kube-api-server</literal> para lograr una topología de alta disponibilidad en el <xref linkend="guides-metallb-kubernetes"/>.
ja: <literal>kube-api-server</literal>の前面にインストールして高可用性トポロジを実現する方法のガイドについては、<xref linkend="guides-metallb-kubernetes"/>を参照してください。
pt_br: Um guia para instalação do MetalLB na frente do <literal>kube-api-server</literal> para obter uma topologia de alta disponibilidade está disponível no <xref linkend="guides-metallb-kubernetes"/>.
zh_cn: 有关在 <literal>kube-api-server</literal> 前端安装 MetalLB 以实现高可用性拓扑的指南，可参见<xref linkend="guides-metallb-kubernetes"/>。

source: K3s comes with its Load Balancer solution called <literal>Klipper</literal>. To use MetalLB, <literal>Klipper</literal> must be disabled. This can be done by starting the K3s server with the <literal>--disable servicelb</literal> option, as described in the <link xl:href="https://docs.k3s.io/networking">K3s documentation</link>.
es: K3s incluye su propia solución de equilibrio de carga llamada <literal>Klipper</literal>. Para utilizar MetalLB, es necesario inhabilitar <literal>Klipper</literal>. Para hacerlo, inicie el servidor K3s con la opción <literal>--disable servicelb</literal>, tal y como se describe en la <link xl:href="https://docs.k3s.io/networking">documentación de K3s</link>.
ja: K3sには、<literal>Klipper</literal>というロードバランサソリューションが付属しています。MetalLBを使用するには、<literal>Klipper</literal>を無効にする必要があります。このためには、<link xl:href="https://docs.k3s.io/networking">K3sのドキュメント</link>で説明されているように、<literal>--disable servicelb</literal>オプションを指定してK3sサーバを起動します。
pt_br: O K3s vem com a própria solução de balanceador de carga chamada <literal>Klipper</literal>. Para usar o MetalLB, é necessário desabilitar o <literal>Klipper</literal>. Para fazer isso, inicie o servidor K3s com a opção <literal>--disable servicelb</literal>, conforme descrito na <link xl:href="https://docs.k3s.io/networking">documentação do K3s</link>.
zh_cn: K3s 附带负载平衡器解决方案 <literal>Klipper</literal>。要使用 MetalLB，必须禁用 <literal>Klipper</literal>。为此，可以按照 <link xl:href="https://docs.k3s.io/networking">K3s 文档</link>中所述，使用 <literal>--disable servicelb</literal> 选项启动 K3s 服务器。

source: <link xl:href="https://github.com/suse-edge/endpoint-copier-operator">Endpoint Copier Operator</link> is a Kubernetes operator whose purpose is to create a copy of a Kubernetes Service and Endpoint and to keep them synced.
es: <link xl:href="https://github.com/suse-edge/endpoint-copier-operator">Endpoint Copier Operator</link> es un operador de Kubernetes cuyo objetivo es crear una copia de un servicio y un punto final de Kubernetes y mantenerlos sincronizados.
ja: <link xl:href="https://github.com/suse-edge/endpoint-copier-operator">Endpoint Copier Operator</link>は、Kubernetesサービスとエンドポイントのコピーを作成し、同期を維持することを目的としたKubernetesオペレータです。
pt_br: <link xl:href="https://github.com/suse-edge/endpoint-copier-operator">Endpoint Copier Operator</link> é um operador do Kubernetes que tem como finalidade criar uma cópia de um serviço e endpoint do Kubernetes e mantê-los sincronizados.
zh_cn: <link xl:href="https://github.com/suse-edge/endpoint-copier-operator">Endpoint Copier Operator</link> 是一个 Kubernetes 操作器，其用途是创建 Kubernetes 服务和端点的副本，并将它们保持同步。

source: How does SUSE Edge use Endpoint Copier Operator?
es: ¿Cómo se usa Endpoint Copier Operator en SUSE Edge?
ja: SUSE EdgeでのEndpoint Copier Operatorの用途
pt_br: Como o SUSE Edge usa o Endpoint Copier Operator?
zh_cn: SUSE Edge 如何使用 Endpoint Copier Operator？

source: At SUSE Edge, the Endpoint Copier Operator plays a crucial role in achieving High Availability (HA) setup for K3s/RKE2 clusters. This is accomplished by creating a <literal>kubernetes-vip</literal> service of type <literal>LoadBalancer</literal>, ensuring its Endpoint remains in constant synchronization with the kubernetes Endpoint. MetalLB (<xref linkend="components-metallb"/>) is leveraged to manage the <literal>kubernetes-vip</literal> service, as the exposed IP address is used from other nodes to join the cluster.
es: En SUSE Edge, Endpoint Copier Operator desempeña un papel crucial para conseguir una configuración de alta disponibilidad (HA) para clústeres K3s/RKE2. Esto se logra creando un servicio <literal>kubernetes-vip</literal> de tipo <literal>LoadBalancer</literal>, lo que garantiza que su punto final se sincronice constantemente con el punto final de Kubernetes. MetalLB (<xref linkend="components-metallb"/>) se utiliza para gestionar el servicio <literal>kubernetes-vip</literal>, ya que la dirección IP expuesta se utiliza desde otros nodos para unirse al clúster.
ja: SUSE Edgeでは、Endpoint Copier OperatorがK3s/RKE2クラスタの高可用性(HA)セットアップを実現するために重要な役割を果たします。これは、<literal>LoadBalancer</literal>タイプの<literal>kubernetes-vip</literal>サービスを作成することで達成され、そのエンドポイントがkubernetesエンドポイントと常に同期を維持するようにします。公開されているIPアドレスはクラスタに参加するために他のノードから使用されるため、MetalLB (<xref linkend="components-metallb"/>)は <literal>kubernetes-vip</literal>サービスを管理するために活用されます。
pt_br: No SUSE Edge, o Endpoint Copier Operator desempenha um papel crucial na configuração de alta disponibilidade (HA, High Availability) para clusters K3s/RKE2. Para que isso seja possível, crie um serviço <literal>kubernetes-vip</literal> do tipo <literal>LoadBalancer</literal>, garantindo que seu endpoint esteja sempre sincronizado com o endpoint do kubernetes. O MetalLB (<xref linkend="components-metallb"/>) é usado para gerenciar o serviço <literal>kubernetes-vip</literal>, já que o endereço IP exposto é usado em outros nós para ingressar no cluster.
zh_cn: 在 SUSE Edge 中，Endpoint Copier Operator 在实现 K3s/RKE2 群集的高可用性 (HA) 设置方面发挥着关键作用。此目标通过创建一个类型为 <literal>LoadBalancer</literal> 的 <literal>kubernetes-vip</literal> 服务并确保其端点与 kubernetes 端点始终保持同步来实现。系统会使用 MetalLB（<xref linkend="components-metallb"/>）来管理 <literal>kubernetes-vip</literal> 服务，因为其他节点会使用其公开 IP 地址加入群集。

source: Best Practices
es: Prácticas recomendadas
ja: ベストプラクティス
pt_br: Melhores práticas
zh_cn: 最佳实践

source: Comprehensive documentation for using the Endpoint Copier Operator can be found <link xl:href="https://github.com/suse-edge/endpoint-copier-operator/blob/main/README.md">here</link>.
es: La documentación completa para utilizar Endpoint Copier Operator se encuentra <link xl:href="https://github.com/suse-edge/endpoint-copier-operator/blob/main/README.md">aquí</link>.
ja: Endpoint Copier Operatorの使用に関する包括的なドキュメントについては、<link xl:href="https://github.com/suse-edge/endpoint-copier-operator/blob/main/README.md">こちら</link>をご覧ください。
pt_br: Você encontra a documentação completa sobre como usar o Endpoint Copier Operator <link xl:href="https://github.com/suse-edge/endpoint-copier-operator/blob/main/README.md">aqui</link>.
zh_cn: 有关使用 Endpoint Copier Operator 的完整文档，请参见<link xl:href="https://github.com/suse-edge/endpoint-copier-operator/blob/main/README.md">此处</link>。

source: Additionally, refer to our guide (<xref linkend="guides-metallb-k3s"/>) on achieving a K3s/RKE2 HA setup using the Endpoint Copier Operator and MetalLB.
es: También puede consultar nuestra guía (<xref linkend="guides-metallb-k3s"/>) sobre cómo lograr una configuración HA de K3s/RKE2 utilizando Endpoint Copier Operator y MetalLB.
ja: また、Endpoint Copier OperatorとMetalLBを使用してK3s/RKE2HA セットアップを実行するする方法については、SUSEのガイド(<xref linkend="guides-metallb-k3s"/>)を参照してください。
pt_br: Consulte também nosso guia (<xref linkend="guides-metallb-k3s"/>) para obter uma configuração de alta disponibilidade do K3s/RKE2 por meio do Endpoint Copier Operator e do MetalLB.
zh_cn: 此外，可参考我们的指南（<xref linkend="guides-metallb-k3s"/>），了解如何使用 Endpoint Copier Operator 和 MetalLB 实现 K3s/RKE2 高可用性设置。

source: Presently, the Endpoint Copier Operator is limited to working with only one Service/Endpoint. Enhancements to support multiple Services/Endpoints are planned for the future.
es: Actualmente, Endpoint Copier Operator solo puede trabajar con un servicio/punto final. Se prevé realizar mejoras en el futuro para admitir múltiples servicios/puntos finales.
ja: 現在、Endpoint Copier Operatorは1つのサービス/エンドポイントにのみ対応しています。今後、複数のサービス/エンドポイントをサポートする機能拡張が予定されています。
pt_br: No momento, o funcionamento do Endpoint Copier Operator está limitado apenas a um serviço/endpoint. Há planos para estender o suporte a vários serviços/endpoints no futuro.
zh_cn: 目前，Endpoint Copier Operator 仅能用于单个服务/端点。未来计划增强其功能，以支持多个服务/端点。

source: This section describes how you can use Edge Virtualization to run virtual machines on your edge nodes. Edge Virtualization is designed for lightweight virtualization use-cases, where it is expected that a common workflow for the deployment and management of both virtualized and containerized applications will be utilized.
es: En esta sección se describe cómo se puede utilizar Edge Virtualization para ejecutar máquinas virtuales en los nodos periféricos. Edge Virtualization se hadiseñado para casos de uso de virtualización ligeros, en los que se espera que se utilice un flujo de trabajo común para el despliegue y la gestión tanto de aplicaciones virtualizadas como en contenedores.
ja: このセクションでは、Edge Virtualizationを使用してエッジノードで仮想マシンを実行する方法について説明します。Edge Virtualizationは、軽量な仮想化ユースケース向けに設計されており、仮想化およびコンテナ化されたアプリケーションのデプロイメントと管理に共通のワークフローが利用されることが想定されています。
pt_br: Esta seção descreve como usar o Edge Virtualization para executar máquinas virtuais em nós de borda. O Edge Virtualization foi projetado para casos de uso de virtualização leve, em que se espera o uso de um fluxo de trabalho comum para implantação e gerenciamento de aplicativos tanto virtualizados quanto conteinerizados.
zh_cn: 本节介绍如何使用 Edge Virtualization 在边缘节点上运行虚拟机。Edge Virtualization 为轻量级虚拟化使用场景而设计，这些使用场景预期会使用一个通用工作流程来部署和管理虚拟化和容器化的应用程序。

source: SUSE Edge Virtualization supports two methods of running virtual machines:
es: SUSE Edge Virtualization admite dos métodos para ejecutar máquinas virtuales:
ja: SUSE Edge Virtualizationでは、仮想マシンの実行方法として次の2つをサポートしています。
pt_br: O SUSE Edge Virtualization oferece suporte a dois métodos de execução de máquinas virtuais:
zh_cn: SUSE Edge Virtualization 支持两种虚拟机运行方法：

source: Deploying the virtual machines manually via libvirt+qemu-kvm at the host level (where Kubernetes is not involved)
es: Despliegue manual de las máquinas virtuales mediante libvirt+qemu-kvm a nivel del host (sin intervención de Kubernetes)
ja: ホストレベルでlibvirt+qemu-kvmを介して仮想マシンを手動でデプロイする(Kubernetesは関与しない)
pt_br: Implantação manual de máquinas virtuais pelo libvirt+qemu-kvm no nível do host (não há envolvimento do Kubernetes)
zh_cn: 在主机级别通过 libvirt+qemu-kvm 手动部署虚拟机（不涉及 Kubernetes）

source: Deploying the KubeVirt operator for Kubernetes-based management of virtual machines
es: Despliegue del operador KubeVirt para la gestión basada en Kubernetes de máquinas virtuales
ja: KubeVirtオペレータをデプロイし、Kubernetesベースで仮想マシンを管理する
pt_br: Implantação do operador KubeVirt para gerenciamento de máquinas virtuais com base no Kubernetes
zh_cn: 部署 KubeVirt 操作器来实现基于 Kubernetes 的虚拟机管理

source: Both options are valid, but only the second one is covered below. If you want to use the standard out-of-the box virtualization mechanisms provided by SUSE Linux Micro, a comprehensive guide can be found <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/chap-virtualization-introduction.html">here</link>, and whilst it was primarily written for SUSE Linux Enterprise Server, the concepts are almost identical.
es: Ambas opciones son válidas, pero solo la segunda se trata a continuación. Si desea utilizar los mecanismos de virtualización estándares listos para usar que proporciona SUSE Linux Micro, encontrará una guía completa en <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/chap-virtualization-introduction.html">este documento</link>. Aunque está escrita principalmente para SUSE Linux Enterprise Server, los conceptos son prácticamente idénticos.
ja: どちらのオプションも有効ですが、以下では2番目のオプションのみを説明しています。SUSE Linux Microで提供されている、すぐに使用できる標準の仮想化メカニズムを使用する場合は、<link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/chap-virtualization-introduction.html">こちら</link>で包括的なガイドを参照してください。このガイドは主にSUSE Linux Enterprise Server用に記載されていますが、概念はほぼ同じです。
pt_br: As duas opções são válidas, mas apenas a segunda está descrita abaixo. Para usar os mecanismos de virtualização padrão e prontos para uso incluídos no SUSE Linux Micro, há um guia completo <link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/chap-virtualization-introduction.html">aqui</link> e, apesar de ter sido escrito inicialmente para o SUSE Linux Enterprise Server, os conceitos são quase idênticos.
zh_cn: 这两种方法都有效，但下面仅介绍第二种方法。如果您要使用 SUSE Linux Micro 提供的现成可用的标准虚拟化机制，可在<link xl:href="https://documentation.suse.com/sles/15-SP6/html/SLES-all/chap-virtualization-introduction.html">此处</link>找到详细的指南，尽管该指南主要是针对 SUSE Linux Enterprise Server 编写的，但概念几乎相同。
