Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The values inside the config map <literal>sriov-custom-auto-config</literal> are the only values to be replaced with real values.
es: Los valores del mapa de configuración <literal>sriov-custom-auto-config</literal> son los únicos que deben sustituirse por valores reales.
ja: 実際の値に置き換える値は、設定マップ<literal>sriov-custom-auto-config</literal>内の値のみです。
pt_br: Os valores no mapa de configuração <literal>sriov-custom-auto-config</literal> são os únicos que precisam ser substituídos pelos valores reais.
zh_cn: 只有 <literal>sriov-custom-auto-config</literal> 配置映射中的值可以替换为实际值。

source: <literal>${RESOURCE_NAME1}</literal> — The resource name to be used for the first <literal>PF</literal> interface (for example, <literal>sriov-resource-du1</literal>). It is added to the prefix <literal>rancher.io</literal> to be used as a label to be used by the workloads (for example, <literal>rancher.io/sriov-resource-du1</literal>).
es: <literal>${RESOURCE_NAME1}</literal>: el nombre del recurso que se va a usar para la primera interfaz de función física <literal>PF</literal> (por ejemplo, <literal>sriov-resource-du1</literal>). Se añade al prefijo <literal>rancher.io</literal> para usarse como etiqueta que utilizarán las cargas de trabajo (por ejemplo, <literal>rancher.io/sriov-resource-du1</literal>).
ja: <literal>${RESOURCE_NAME1}</literal> — 最初の<literal>PF</literal>インタフェースに使用するリソース名(例: <literal>sriov-resource-du1</literal>)。このリソース名はプレフィックス<literal>rancher.io</literal>に追加されてラベルとして使用され、ワークロードで使用されます(例: <literal>rancher.io/sriov-resource-du1</literal>)。
pt_br: <literal>${RESOURCE_NAME1}</literal>: o nome do recurso usado para a primeira interface <literal>PF</literal> (por exemplo, <literal>sriov-resource-du1</literal>). Ele é adicionado ao prefixo <literal>rancher.io</literal> usado como o rótulo que as cargas de trabalho usarão (por exemplo, <literal>rancher.io/sriov-resource-du1</literal>).
zh_cn: <literal>${RESOURCE_NAME1}</literal> — 用于第一个 <literal>PF</literal> 接口的资源名称（例如 <literal>sriov-resource-du1</literal>）。它将添加到前缀 <literal>rancher.io</literal> 的后面，供工作负载用作标签（例如 <literal>rancher.io/sriov-resource-du1</literal>）。

source: <literal>${SRIOV-NIC-NAME1}</literal> — The name of the first <literal>PF</literal> interface to be used (for example, <literal>eth0</literal>).
es: <literal>${SRIOV-NIC-NAME1}</literal>: el nombre de la primera interfaz de función física <literal>PF</literal> que se usará (por ejemplo, <literal>eth0</literal>).
ja: <literal>${SRIOV-NIC-NAME1}</literal> — 使用する最初の<literal>PF</literal>インタフェースの名前(例: <literal>eth0</literal>)。
pt_br: <literal>${SRIOV-NIC-NAME1}</literal>: o nome da primeira interface <literal>PF</literal> que será usada (por exemplo, <literal>eth0</literal>).
zh_cn: <literal>${SRIOV-NIC-NAME1}</literal> — 要使用的第一个 <literal>PF</literal> 接口的名称（例如 <literal>eth0</literal>）。

source: <literal>${PF_NAME1}</literal> — The name of the first physical function <literal>PF</literal> to be used. Generate more complex filters using this (for example, <literal>eth0#2-5</literal>).
es: <literal>${PF_NAME1}</literal>: el nombre de la primera función física <literal>PF</literal> que se usará. Con esto, puede generar filtros más complejos (por ejemplo, <literal>eth0#2-5</literal>).
ja: <literal>${PF_NAME1}</literal> — 使用する最初の物理機能<literal>PF</literal>の名前。これを使用して、より複雑なフィルタを生成します(例: <literal>eth0#2-5</literal>)。
pt_br: <literal>${PF_NAME1}</literal>: o nome da primeira função física <literal>PF</literal> que será usada. Gere filtros mais complexos usando este comando (por exemplo, <literal>eth0#2-5</literal>).
zh_cn: <literal>${PF_NAME1}</literal> — 要使用的第一个物理功能 <literal>PF</literal> 的名称。可以使用此名称生成更复杂的过滤器（例如 <literal>eth0#2-5</literal>）。

source: <literal>${DRIVER_NAME1}</literal> — The driver name to be used for the first <literal>VF</literal> interface (for example, <literal>vfio-pci</literal>).
es: <literal>${DRIVER_NAME1}</literal>: el nombre del controlador que se usará para la primera interfaz de función virtual <literal>VF</literal> (por ejemplo, <literal>vfio-pci</literal>).
ja: <literal>${DRIVER_NAME1}</literal> — 最初の<literal>VF</literal>インタフェースに使用するドライバ名(例: <literal>vfio-pci</literal>)。
pt_br: <literal>${DRIVER_NAME1}</literal>: o nome do driver que será usado para a primeira interface <literal>VF</literal> (por exemplo, <literal>vfio-pci</literal>).
zh_cn: <literal>${DRIVER_NAME1}</literal> — 用于第一个 <literal>VF</literal> 接口的驱动程序名称（例如 <literal>vfio-pci</literal>）。

source: <literal>${NUM_VFS1}</literal> — The number of <literal>VFs</literal> to be created for the first <literal>PF</literal> interface (for example, <literal>8</literal>).
es: <literal>${NUM_VFS1}</literal>: el número de <literal>funciones virtuales</literal> que se crearán para la primera interfaz de función física <literal>PF</literal> (por ejemplo, <literal>8</literal>).
ja: <literal>${NUM_VFS1}</literal> — 最初の<literal>PF</literal>インタフェース用に作成する<literal>VF</literal>の数(例: <literal>8</literal>)。
pt_br: <literal>${NUM_VFS1}</literal>: o número de <literal>VFs</literal> que será criado para a primeira interface <literal>PF</literal> (por exemplo, <literal>8</literal>).
zh_cn: <literal>${NUM_VFS1}</literal> — 要为第一个 <literal>PF</literal> 接口创建的 <literal>VF</literal> 数量（例如 <literal>8</literal>）。

source: The <literal>/var/sriov-auto-filler.sh</literal> to be used as a translator between the high-level config map <literal>sriov-custom-auto-config</literal> and the <literal>sriovnetworknodepolicy</literal> which contains the low-level hardware information. This script has been created to abstract the user from the complexity to know in advance the hardware information. No changes are required in this file, but it should be present if we need to enable <literal>sr-iov</literal> and create <literal>VFs</literal>.
es: El archivo <literal>/var/sriov-auto-filler.sh</literal> que se usará como traductor entre el mapa de configuración general <literal>sriov-custom-auto-config</literal> y el archivo <literal>sriovnetworknodepolicy</literal>, que contiene la información de hardware de bajo nivel. Este guion se ha creado para evitar al usuario la complejidad que supone que tenga que conocer de antemano la información de hardware. No es necesario realizar cambios en este archivo, pero debe estar presente si necesitamos habilitar <literal>sr-iov</literal> y crear <literal>funciones virtuales</literal>.
ja: <literal>/var/sriov-auto-filler.sh</literal>は、高レベルの設定マップ<literal>sriov-custom-auto-config</literal>と、低レベルのハードウェア情報を含む<literal>sriovnetworknodepolicy</literal>との間で情報を変換するために使用されます。このスクリプトは、ユーザがハードウェア情報を事前に把握する手間をなくすために作成されています。このファイルを変更する必要はありませんが、<literal>sr-iov</literal>を有効にして<literal>VF</literal>を作成する必要がある場合は、このファイルが存在する必要があります。
pt_br: O <literal>/var/sriov-auto-filler.sh</literal> usado como conversor entre o mapa de configuração de alto nível <literal>sriov-custom-auto-config</literal> e o <literal>sriovnetworknodepolicy</literal>, que contém as informações de hardware de baixo nível. Esse script foi criado para eliminar a complexidade do usuário em ter que saber com antecedência as informações do hardware. Não há necessidade de alterações no arquivo, mas ele deverá estar presente se precisarmos habilitar <literal>sr-iov</literal> e criar <literal>VFs</literal>.
zh_cn: 提供 <literal>/var/sriov-auto-filler.sh</literal>，用作高层级配置映射 <literal>sriov-custom-auto-config</literal> 与包含底层硬件信息的 <literal>sriovnetworknodepolicy</literal> 之间的转换器。创建此脚本的目的是简化用户操作，让其无需提前了解复杂的硬件信息。不需要在此文件中进行更改，但如果我们需要启用 <literal>sr-iov</literal> 并创建 <literal>VF</literal>，则应该提供此脚本。

source: The kernel arguments to be used to enable the following features:
es: Los argumentos del kernel que se usarán para habilitar las siguientes funciones:
ja: 次の機能を有効にするために使用するカーネル引数:
pt_br: Os argumentos do kernel que serão usados para habilitar os seguintes recursos:
zh_cn: 用于启用以下功能的内核参数：

source: Parameter
es: Parámetro
ja: パラメータ
pt_br: Parâmetro
zh_cn: 参数

source: Value
es: Valor
ja: 値
pt_br: Valor
zh_cn: 值

source: Isolate the cores 1-30 and 33-62.
es: Aísla los núcleos 1-30 y 33-62.
ja: コア1-30および33-62を分離します。
pt_br: Isolar os núcleos 1-30 e 33-62.
zh_cn: 隔离核心 1-30 和 33-62。

source: Allows the kernel to skew the timer interrupts across the isolated CPUs.
es: Permite al kernel distribuir las interrupciones del temporizador entre las CPU aisladas.
ja: 分離されたCPU間でカーネルがタイマー割り込みをずらすことができるようにします。
pt_br: Permite que o kernel distribua as interrupções do temporizador entre as CPUs isoladas.
zh_cn: 允许内核在隔离的 CPU 之间错开定时器中断。

source: Allows the kernel to run the timer tick on a single CPU when the system is idle.
es: Permite al kernel ejecutar la marca del temporizador en una sola CPU cuando el sistema está inactivo.
ja: システムがアイドル状態のときにカーネルが1つのCPUでタイマーティックを実行できるようにします。
pt_br: Permite que o kernel execute o tick do temporizador em uma única CPU quando o sistema está ocioso.
zh_cn: 允许内核在系统空闲时在单个 CPU 上运行定时器节拍周期。

source: kernel boot parameter is the current main interface to configure full dynticks along with CPU Isolation.
es: El parámetro de arranque del kernel es la interfaz principal actual para configurar dynticks completos junto con el aislamiento de la CPU.
ja: カーネルブートパラメータは、完全なdynticksとCPU分離の設定を行うための現在の主要インタフェースです。
pt_br: O parâmetro de inicialização do kernel é a interface principal atual para configurar dynticks completos junto com o isolamento de CPU.
zh_cn: 内核引导参数是当前用于配置完整 dynticks 及 CPU 隔离的主接口。

source: Allows the kernel to run the RCU callbacks on a single CPU when the system is idle.
es: Permite al kernel ejecutar las retrollamadas de RCU en una sola CPU cuando el sistema está inactivo.
ja: システムがアイドル状態のときにカーネルが1つのCPUでRCUコールバックを実行できるようにします。
pt_br: Permite que o kernel execute os retornos de chamada RCU em uma única CPU quando o sistema está ocioso.
zh_cn: 允许内核在系统空闲时在单个 CPU 上运行 RCU 回调。

source: Allows the kernel to run the interrupts on a single CPU when the system is idle.
es: Permite al kernel ejecutar las interrupciones en una sola CPU cuando el sistema está inactivo.
ja: システムがアイドル状態のときにカーネルが1つのCPUで割り込みを実行できるようにします。
pt_br: Permite que o kernel execute as interrupções em uma única CPU quando o sistema está ocioso.
zh_cn: 允许内核在系统空闲时在单个 CPU 上运行中断。

source: Minimizes the latency of exiting the idle state.
es: Minimiza la latencia al salir del estado inactivo.
ja: アイドル状態から抜け出すまでのレイテンシを最小化します。
pt_br: Minimiza a latência de sair do estado ocioso.
zh_cn: 最大限度地减少因退出空闲状态造成的延迟。

source: Allows to use vfio for the dpdk interfaces.
es: Permite usar vfio para las interfaces dpdk.
ja: vfioをdpdkインタフェースに使用できるようにします。
pt_br: Permite usar vfio para as interfaces dpdk.
zh_cn: 允许为 dpdk 接口使用 vfio。

source: Enables the use of vfio for VFs.
es: Habilita el uso de vfio para funciones virtuales.
ja: vfioをVFに使用できるようにします。
pt_br: Permite usar vfio para VFs.
zh_cn: 允许为 VF 使用 vfio。

source: Allows to set the size of huge pages to 1 G.
es: Permite establecer el tamaño de las páginas enormes en 1 GB.
ja: Huge Pageのサイズを1Gに設定できるようにします。
pt_br: Permite definir o tamanho das páginas enormes como 1 G.
zh_cn: 允许将大页的大小设置为 1 G。

source: Number of huge pages defined before.
es: El número de páginas enormes definidas anteriormente.
ja: 前に定義したHuge Pageの数。
pt_br: O número de páginas enormes definido antes.
zh_cn: 先前定义的大页数量。

source: Default value to enable huge pages.
es: Valor predeterminado para habilitar las páginas enormes.
ja: Huge Pageを有効にする場合のデフォルト値。
pt_br: O valor padrão para habilitar o HugePages.
zh_cn: 用于启用大页的默认值。

source: Disables the watchdog.
es: Inhabilita el watchdog.
ja: ウォッチドッグを無効にします。
pt_br: Desabilita o watchdog.
zh_cn: 禁用看门狗。

source: Disables the NMI watchdog.
es: Inhabilita el watchdog de NMI.
ja: NMIウォッチドッグを無効にします。
pt_br: Desabilita o watchdog de NMI.
zh_cn: 禁用 NMI 看门狗。

source: The following systemd services are used to enable the following:
es: Los siguientes servicios systemd se utilizan para habilitar lo siguiente:
ja: 次のsystemdサービスは、以下のサービスを有効にするために使用します。
pt_br: Os serviços systemd abaixo são usados para habilitar o seguinte:
zh_cn: 以下 systemd 服务用于启用下述功能：

source: <literal>rke2-preinstall.service</literal> to replace automatically the <literal>BAREMETALHOST_UUID</literal> and <literal>node-name</literal> during the provisioning process using the Ironic information.
es: <literal>rke2-preinstall.service</literal> para sustituir automáticamente <literal>BAREMETALHOST_UUID</literal> y <literal>node-name</literal> durante el proceso de aprovisionamiento utilizando la información de Ironic.
ja: <literal>rke2-preinstall.service</literal> - プロビジョニングプロセス中にIronicの情報を利用して<literal>BAREMETALHOST_UUID</literal>と<literal>node-name</literal>を自動的に置き換えます。
pt_br: <literal>rke2-preinstall.service</literal> para substituir automaticamente o <literal>BAREMETALHOST_UUID</literal> e o <literal>node-name</literal> durante o processo de provisionamento com as informações do Ironic.
zh_cn: <literal>rke2-preinstall.service</literal>，用于在置备过程中使用 Ironic 信息自动替换 <literal>BAREMETALHOST_UUID</literal> 和 <literal>node-name</literal>。

source: <literal>cpu-partitioning.service</literal> to enable the isolation cores of the <literal>CPU</literal> (for example, <literal>1-30,33-62</literal>).
es: <literal>cpu-partitioning.service</literal> para habilitar los núcleos de aislamiento de la <literal>CPU</literal> (por ejemplo, <literal>1-30,33-62</literal>).
ja: <literal>cpu-partitioning.service</literal> - <literal>CPU</literal>の分離コアを有効にします(例: <literal>1-30,33-62</literal>)。
pt_br: <literal>cpu-partitioning.service</literal> para habilitar os núcleos de isolamento da <literal>CPU</literal> (por exemplo, <literal>1-30,33-62</literal>).
zh_cn: <literal>cpu-partitioning.service</literal>，用于启用 <literal>CPU</literal> 核心隔离（例如 <literal>1-30,33-62</literal>）。

source: <literal>performance-settings.service</literal> to enable the CPU performance tuning.
es: <literal>performance-settings.service</literal> para habilitar la optimización del rendimiento de la CPU.
ja: <literal>performance-settings.service</literal> - CPUのパフォーマンス調整を有効にします。
pt_br: <literal>performance-settings.service</literal> para habilitar o ajuste de desempenho da CPU.
zh_cn: <literal>performance-settings.service</literal>，用于调优 CPU 性能。

source: <literal>sriov-custom-auto-vfs.service</literal> to install the <literal>sriov</literal> Helm chart, wait until custom resources are created and run the <literal>/var/sriov-auto-filler.sh</literal> to replace the values in the config map <literal>sriov-custom-auto-config</literal> and create the <literal>sriovnetworknodepolicy</literal> to be used by the workloads.
es: <literal>sriov-custom-auto-vfs.service</literal> para instalar el chart de Helm <literal>sriov</literal>. Espere hasta que se creen los recursos personalizados y ejecute <literal>/var/sriov-auto-filler.sh</literal> para reemplazar los valores en el mapa de configuración <literal>sriov-custom-auto-config</literal> y crear el <literal>sriovnetworknodepolicy</literal> que utilizarán las cargas de trabajo.
ja: <literal>sriov-custom-auto-vfs.service</literal> - <literal>sriov</literal> Helmチャートをインストールし、カスタムリソースが作成されるまで待機し、<literal>/var/sriov-auto-filler.sh</literal>を実行して設定マップ<literal>sriov-custom-auto-config</literal>の値を置き換えてワークロードが使用する<literal>sriovnetworknodepolicy</literal>を作成します。
pt_br: <literal>sriov-custom-auto-vfs.service</literal> para instalar o gráfico Helm <literal>sriov</literal>. Aguarde a criação dos recursos personalizados e execute o <literal>/var/sriov-auto-filler.sh</literal> para substituir os valores no mapa de configuração <literal>sriov-custom-auto-config</literal> e criar o <literal>sriovnetworknodepolicy</literal> que as cargas de trabalho usarão.
zh_cn: <literal>sriov-custom-auto-vfs.service</literal>，用于执行以下操作：安装 <literal>sriov</literal> Helm chart，等待自定义资源创建完成，运行 <literal>/var/sriov-auto-filler.sh</literal> 以替换配置映射 <literal>sriov-custom-auto-config</literal> 中的值，并创建工作负载要使用的 <literal>sriovnetworknodepolicy</literal>。

source: The <literal>${RKE2_VERSION}</literal> is the version of <literal>RKE2</literal> to be used replacing this value (for example, <literal>v1.33.3+rke2r1</literal>).
es: <literal>${RKE2_VERSION}</literal> es la versión de <literal>RKE2</literal> que se usará en sustitución de este valor (por ejemplo, <literal>v1.33.3+rke2r1</literal>).
ja: <literal>${RKE2_VERSION}</literal>は使用する<literal>RKE2</literal>のバージョンであり、この値は置き換えます(例: <literal>v1.33.3+rke2r1</literal>)。
zh_cn: <literal>${RKE2_VERSION}</literal> 是要使用的 <literal>RKE2</literal> 版本，需替换此值（例如替换为 <literal>v1.33.3+rke2r1</literal>）。

source: With all these changes mentioned, the <literal>RKE2ControlPlane</literal> block in the <literal>capi-provisioning-example.yaml</literal> will look like the following:
es: Con todos estos cambios mencionados, el bloque <literal>RKE2ControlPlane</literal> del archivo <literal>capi-provisioning-example.yaml</literal> tendrá el siguiente aspecto:
ja: これらの変更をすべて行うと、<literal>capi-provisioning-example.yaml</literal>の<literal>RKE2ControlPlane</literal>ブロックは次のようになります。
pt_br: Com todas essas alterações mencionadas, o bloco <literal>RKE2ControlPlane</literal> no <literal>capi-provisioning-example.yaml</literal> terá a seguinte aparência:
zh_cn: 做出上述所有更改后，<literal>capi-provisioning-example.yaml</literal> 中的 <literal>RKE2ControlPlane</literal> 块如下所示：

source: Once the file is created by joining the previous blocks, the following command must be executed in the management cluster to start provisioning the new downstream cluster using the Telco features:
es: Una vez creado el archivo uniendo los bloques anteriores, se debe ejecutar el siguiente comando en el clúster de gestión para iniciar el aprovisionamiento del nuevo clúster descendente utilizando las funciones de telecomunicaciones:
ja: 前の各ブロックを結合してファイルを作成したら、管理クラスタで次のコマンドを実行し、通信機能を使用する新しいダウンストリームクラスタのプロビジョニングを開始する必要があります。
pt_br: Após a criação do arquivo unindo os blocos anteriores, execute o seguinte comando no cluster de gerenciamento para iniciar o provisionamento do novo cluster downstream usando os recursos de telecomunicações:
zh_cn: 通过合并上述块创建该文件后，必须在管理群集中执行以下命令才能开始使用电信功能置备新的下游群集：

source: Private registry
es: Registro privado
ja: プライベートレジストリ
pt_br: Registro particular
zh_cn: 专用仓库

source: It is possible to configure a private registry as a mirror for images used by workloads.
es: Es posible configurar un registro privado como duplicado de las imágenes usadas por las cargas de trabajo.
ja: ワークロードで使用するイメージのミラーとしてプライベートレジストリを設定できます。
pt_br: É possível configurar um registro particular como espelho para as imagens que as cargas de trabalho usam.
zh_cn: 可以配置专用仓库作为工作负载所使用映像的镜像。

source: To do this we create the secret containing the information about the private registry to be used by the downstream cluster.
es: Para ello, creamos el secreto que contiene la información sobre el registro privado que usará el clúster descendente.
ja: そのために、ダウンストリームクラスタで使用するプライベートレジストリに関する情報を含むシークレットを作成します。
pt_br: Para isso, criamos o segredo com as informações sobre o registro particular que será usado pelo cluster downstream.
zh_cn: 为此，我们可以创建机器，并在其中包含有关下游群集要使用的专用仓库的信息。

source: The <literal>tls.crt</literal>, <literal>tls.key</literal> and <literal>ca.crt</literal> are the certificates to be used to authenticate the private registry. The <literal>username</literal> and <literal>password</literal> are the credentials to be used to authenticate the private registry.
es: Los archivos <literal>tls.crt</literal>, <literal>tls.key</literal> y <literal>ca.crt</literal> son los certificados que se usarán para autenticar el registro privado. <literal>username</literal> y <literal>password</literal> son las credenciales que se usarán para autenticar el registro privado.
ja: <literal>tls.crt</literal>、<literal>tls.key</literal>、および<literal>ca.crt</literal>は、プライベートレジストリを認証するために使用する証明書です。<literal>username</literal>および<literal>password</literal>は、プライベートレジストリを認証するために使用する資格情報です。
pt_br: O <literal>tls.crt</literal>, <literal>tls.key</literal> e <literal>ca.crt</literal> são os certificados usados para autenticar o registro particular. O <literal>username</literal> e a <literal>password</literal> são as credenciais usadas para autenticar o registro particular.
zh_cn: <literal>tls.crt</literal>、<literal>tls.key</literal> 和 <literal>ca.crt</literal> 是用于对专用仓库进行身份验证的证书。<literal>username</literal> 和 <literal>password</literal> 是用于对专用仓库进行身份验证的身份凭证。

source: The <literal>tls.crt</literal>, <literal>tls.key</literal>, <literal>ca.crt</literal> , <literal>username</literal> and <literal>password</literal> have to be encoded in base64 format before to be used in the secret.
es: Los campos <literal>tls.crt</literal>, <literal>tls.key</literal>, <literal>ca.crt</literal>, <literal>username</literal> y <literal>password</literal> deben cifrarse en formato base64 antes de utilizarse en el secreto.
ja: <literal>tls.crt</literal>、<literal>tls.key</literal>、<literal>ca.crt</literal>、<literal>username</literal>、および<literal>password</literal>は、シークレットで使用する前にbase64形式でエンコードする必要があります。
pt_br: O <literal>tls.crt</literal>, <literal>tls.key</literal>, <literal>ca.crt</literal> , <literal>username</literal> e <literal>password</literal> devem ser codificados no formato base64 antes de serem usados no segredo.
zh_cn: 在机密中使用 <literal>tls.crt</literal>、<literal>tls.key</literal>、<literal>ca.crt</literal>、<literal>username</literal> 和 <literal>password</literal> 之前，必须对它们进行 base64 编码。

source: Where the <literal>registry.example.com</literal> is the example name of the private registry to be used by the downstream cluster, and it should be replaced with the real values.
es: Donde <literal>registry.example.com</literal> es el nombre de ejemplo del registro privado que usará el clúster descendente, y debe sustituirse por los valores reales.
ja: ここで、<literal>registry.example.com</literal>は、ダウンストリームクラスタで使用するプライベートレジストリの名前の例です。これは実際の値に置き換える必要があります。
pt_br: Em que <literal>registry.example.com</literal> é o nome de exemplo do registro particular usado pelo cluster downstream e deve ser substituído pelos valores reais.
zh_cn: 其中，<literal>registry.example.com</literal> 是下游群集使用的专用仓库的示例名称，应将其替换为实际值。

source: Downstream cluster provisioning in air-gapped scenarios
es: Aprovisionamiento de clústeres descendentes en entornos aislados
ja: エアギャップシナリオでのダウンストリームクラスタのプロビジョニング
pt_br: Provisionamento de cluster downstream em cenários air-gapped
zh_cn: 在隔离场景中置备下游群集

source: The directed network provisioning workflow allows to automate the provisioning of downstream clusters in air-gapped scenarios.
es: El flujo de trabajo de aprovisionamiento de red dirigida permite automatizar el aprovisionamiento de clústeres descendentes en entornos aislados.
ja: ダイレクトネットワークプロビジョニングワークフローでは、エアギャップシナリオでのダウンストリームクラスタのプロビジョニングを自動化できます。
pt_br: O fluxo de trabalho de provisionamento de rede direcionado permite automatizar o provisionamento de clusters downstream nos cenários air-gapped.
zh_cn: 定向网络置备工作流程允许在隔离场景中自动置备下游群集。

source: Requirements for air-gapped scenarios
es: Requisitos para entornos aislados
ja: エアギャップシナリオの要件
pt_br: Requisitos para cenários air-gapped
zh_cn: 隔离场景的要求
