Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Now we should be able to re-establish a connection:
es: Ahora deberíamos poder restablecer la conexión:
ja: これで、接続を再確立できるはずです。
pt_br: Agora devemos conseguir reestabelecer a conexão:
zh_cn: 现在我们应该可以重新建立连接：

source: Finally, let us remove the virtual machine:
es: Por último, eliminemos la máquina virtual:
ja: 最後に、仮想マシンを削除しましょう。
pt_br: Por fim, vamos remover a máquina virtual:
zh_cn: 最后，我们将该虚拟机去除：

source: Simple ingress networking
es: Conexión de redes sencilla con Ingress
ja: シンプルなIngressネットワーキング
pt_br: Rede de entrada simples
zh_cn: 简单入口网络

source: In this section, we show how you can expose virtual machines as standard Kubernetes services and make them available via the Kubernetes ingress service, for example, <link xl:href="https://docs.rke2.io/networking/networking_services#nginx-ingress-controller">NGINX with RKE2</link> or <link xl:href="https://docs.k3s.io/networking/networking-services#traefik-ingress-controller">Traefik with K3s</link>. This document assumes that these components are already configured appropriately and that you have an appropriate DNS pointer, for example, via a wild card, to point at your Kubernetes server nodes or your ingress virtual IP for proper ingress resolution.
es: En esta sección, se explica cómo exponer máquinas virtuales como servicios estándar de Kubernetes y cómo hacerlas disponibles mediante el servicio Ingress de Kubernetes; por ejemplo, <link xl:href="https://docs.rke2.io/networking/networking_services#nginx-ingress-controller">NGINX con RKE2</link> o <link xl:href="https://docs.k3s.io/networking/networking-services#traefik-ingress-controller">Traefik con K3s</link>. En este documento se entiende que estos componentes ya están configurados adecuadamente y que dispone de un puntero DNS adecuado (por ejemplo, un comodín) que dirija a los nodos de su servidor de Kubernetes o a su IP virtual de Ingress para que Ingress se resuelva adecuadamente.
ja: このセクションでは、仮想マシンを標準のKubernetesサービスとして公開し、<link xl:href="https://docs.rke2.io/networking/networking_services#nginx-ingress-controller">NGINXとRKE2</link>、<link xl:href="https://docs.k3s.io/networking/networking-services#traefik-ingress-controller">TraefikとK3s</link>などのKubernetes Ingressサービスを介して利用可能にする方法を示します。このドキュメントでは、これらのコンポーネントがすでに適切に設定されていること、およびKubernetesサーバノードまたはIngress仮想IPを指す適切なDNSポインタが設定されていて(ワイルドカードを使用するなど)、Ingressを適切に解決できることを前提としています。
pt_br: Nesta seção, mostramos como é possível expor máquinas virtuais como serviços padrão do Kubernetes e disponibilizá-los pelo serviço de entrada do Kubernetes, por exemplo, <link xl:href="https://docs.rke2.io/networking/networking_services#nginx-ingress-controller">NGINX com RKE2</link> ou <link xl:href="https://docs.k3s.io/networking/networking-services#traefik-ingress-controller">Traefik com K3s</link>. Este documento pressupõe que esses componentes já foram devidamente configurados e que você tem o ponteiro de DNS, por exemplo, usando um curinga, para apontar para os nós do servidor Kubernetes ou IP virtual de entrada para uma resolução de entrada correta.
zh_cn: 本节介绍如何将虚拟机公开为标准 Kubernetes 服务，并通过 Kubernetes 入口服务（例如 <link xl:href="https://docs.rke2.io/networking/networking_services#nginx-ingress-controller">RKE2 中的 NGINX</link> 或 <link xl:href="https://docs.k3s.io/networking/networking-services#traefik-ingress-controller">K3s 中的 Traefik</link>）来提供这些虚拟机。本文档假设已正确配置这些组件，并且有一个适当的 DNS 指针指向 Kubernetes 服务器节点或入口虚拟 IP（例如通过通配符来指向），以正确解析入口。

source: In SUSE Edge 3.1+, if you are using K3s in a multi-server node configuration, you might have needed to configure a MetalLB-based VIP for Ingress; this is not required for RKE2.
es: En SUSE Edge 3.1 y versiones posteriores, si utiliza K3s en una configuración de nodos con varios servidores, es posible que haya tenido que configurar una IP virtual basada en MetalLB para Ingress. Esto no es necesario para RKE2.
ja: SUSE Edge 3.1以降では、マルチサーバノード設定でK3sを使用している場合、Ingress用にMetalLBベースのVIPを設定する必要がある場合があります。RKE2では、これは不要です。
pt_br: A partir do SUSE Edge 3.1, se você usa o K3s em uma configuração de nó de vários servidores, talvez tenha que configurar um VIP com base no MetalLB para entrada. Isso não é necessário no RKE2.
zh_cn: 在 SUSE Edge 3.1+ 中，如果您在多服务器节点配置中使用 K3s，则可能需要为入口配置基于 MetalLB 的 VIP；对于 RKE2 则不需要这样做。

source: In the example environment, another openSUSE Tumbleweed virtual machine is deployed, cloud-init is used to install NGINX as a simple Web server at boot time, and a simple message is configured to be returned to verify that it works as expected when a call is made. To see how this is done, simply <literal>base64 -d</literal> the cloud-init section in the output below.
es: En el entorno de ejemplo, se despliega otra máquina virtual Tumbleweed de openSUSE, se usa cloud-init para instalar NGINX como servidor Web sencillo en el momento del arranque y se configura un mensaje sencillo, que se envía para verificar que funciona según lo esperado cuando se realiza una llamada. Para ver cómo se hace, use el comando <literal>base64 -d</literal> en la sección cloud-init del siguiente ejemplo.
ja: この例の環境では、別のopenSUSE Tumbleweed仮想マシンをデプロイし、cloud-initを使用して、ブート時にNGINXをシンプルなWebサーバとしてインストールしています。また、呼び出しの実行時に期待どおりに動作することを確認するためにシンプルなメッセージを返すように設定しています。この処理を確認するには、以下の出力のcloud-initのセクションに対して<literal>base64 -d</literal>を実行するだけです。
pt_br: No ambiente de exemplo, outra máquina virtual openSUSE Tumbleweed foi implantada, o cloud-init foi usado para instalar o NGINX como servidor web simples no momento da inicialização e uma mensagem simples foi configurada para ser exibida para verificar se ela funciona conforme o esperado quando uma chamada é feita. Para ver como isso é feito, basta executar <literal>base64 -d</literal> na seção cloud-init na saída a seguir.
zh_cn: 在示例环境中，部署了另一个 openSUSE Tumbleweed 虚拟机，cloud-init 用于在引导时将 NGINX 安装为简单 Web 服务器，并且配置了一条简单的返回消息，用于在调用时验证其是否按预期工作。要了解如何执行此操作，只需对以下输出中的 cloud-init 部分运行 <literal>base64 -d</literal> 即可。

source: Let us create this virtual machine now:
es: Vamos a crear esta máquina virtual:
ja: では、この仮想マシンを作成してみましょう。
pt_br: Agora vamos criar a máquina virtual:
zh_cn: 现在我们来创建此虚拟机：

source: When this virtual machine has successfully started, we can use the <literal>virtctl</literal> command to expose the <literal>VirtualMachineInstance</literal> with an external port of <literal>8080</literal> and a target port of <literal>80</literal> (where NGINX listens by default). We use the <literal>virtctl</literal> command here as it understands the mapping between the virtual machine object and the pod. This creates a new service for us:
es: Cuando esta máquina virtual se haya iniciado correctamente, se podrá usar el comando <literal>virtctl</literal> para exponer la instancia <literal>VirtualMachineInstance</literal> con el puerto externo <literal>8080</literal> y el puerto de destino <literal>80</literal> (en el que NGINX escucha por defecto). Aquí, utilizamos el comando <literal>virtctl</literal>, ya que entiende la asignación entre el objeto de máquina virtual y el pod. Esto crea un nuevo servicio:
ja: この仮想マシンが正常に起動したら、<literal>virtctl</literal>コマンドを使用して、外部ポート<literal>8080</literal>とターゲットポート<literal>80</literal> (NGINXがデフォルトでリスンするポート)で<literal>VirtualMachineInstance</literal>を公開できます。<literal>virtctl</literal>コマンドは、仮想マシンオブジェクトとPodのマッピングを理解しているため、ここではこのコマンドを使用します。これにより、新しいサービスが作成されます。
pt_br: Quando a máquina virtual é iniciada com sucesso, podemos usar o comando <literal>virtctl</literal> para expor <literal>VirtualMachineInstance</literal> com a porta externa <literal>8080</literal> e a porta de destino <literal>80</literal> (na qual o NGINX escuta por padrão). Usamos o comando <literal>virtctl</literal> aqui porque ele reconhece o mapeamento entre o objeto e o pod da máquina virtual. Isso cria um novo serviço:
zh_cn: 此虚拟机成功启动后，我们可以使用 <literal>virtctl</literal> 命令公开 <literal>VirtualMachineInstance</literal>，其外部端口为 <literal>8080</literal>，目标端口为 <literal>80</literal>（NGINX 默认侦听此端口）。此处我们之所以使用 <literal>virtctl</literal> 命令，是因为它能够识别虚拟机对象与 Pod 之间的映射。这为我们创建了新服务：

source: We will then have an appropriate service automatically created:
es: A continuación, se crea automáticamente el servicio adecuado:
ja: これで、適切なサービスが自動的に作成されます。
pt_br: Desse modo, o serviço apropriado será criado automaticamente:
zh_cn: 然后会自动创建一个适当的服务：

source: Next, if you then use <literal>kubectl create ingress</literal>, we can create an ingress object that points to this service. Adapt the URL (known as the "host" in the <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_create/kubectl_create_ingress/">ingress</link> object) here to match your DNS configuration and ensure that you point it to port <literal>8080</literal>:
es: Ahora, si utiliza <literal>kubectl create ingress</literal>, puede crear un objeto Ingress que apunte a este servicio. Adapte la URL (conocida como "host" en el objeto <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_create/kubectl_create_ingress/">ingress</link>) aquí para que coincida con su configuración de DNS y asegúrese de que apunta al puerto <literal>8080</literal>:
ja: 次に、<literal>kubectl create ingress</literal>を使用すると、このサービスを指すIngressオブジェクトを作成できます。ここでURL (<link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_create/kubectl_create_ingress/">Ingress</link>オブジェクトの「ホスト」として知られている)をDNS設定に合わせて調整し、ポート<literal>8080</literal>を指すようにします。
pt_br: Se depois você usar <literal>kubectl create ingress</literal>, poderemos criar a seguir um objeto de entrada que aponte para esse serviço. Adapte o URL aqui (conhecido como "host" no objeto <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_create/kubectl_create_ingress/">ingress</link>) de acordo com sua configuração do DNS e garanta que ele aponte para a porta <literal>8080</literal>:
zh_cn: 接下来，如果您使用 <literal>kubectl create ingress</literal>，则可以创建一个指向此服务的 ingress 对象。此处请根据您的 DNS 配置修改 URL（在 <link xl:href="https://kubernetes.io/docs/reference/kubectl/generated/kubectl_create/kubectl_create_ingress/">ingress</link> 对象中称为“host”），并确保将其指向端口 <literal>8080</literal>：

source: With DNS being configured correctly, you should be able to curl the URL immediately:
es: Con el servidor DNS configurado correctamente, debería poder ejecutar el comando curl en la URL de inmediato:
ja: DNSが正しく設定されたら、URLに対してすぐにcurlを実行できます。
pt_br: Com a configuração correta do DNS, você pode executar curl no URL imediatamente:
zh_cn: 正确配置 DNS 后，可以立即对 URL 运行 curl 命令：

source: Let us clean up by removing this virtual machine and its service and ingress resources:
es: Para limpiar, eliminaremos esta máquina virtual y sus recursos de servicio y de Ingress:
ja: この仮想マシンとそのサービス、およびIngressリソースを削除して、クリーンアップしましょう。
pt_br: Vamos fazer a limpeza removendo a máquina virtual e os respectivos recursos de entrada e serviço:
zh_cn: 我们来通过去除此虚拟机及其服务和入口资源进行清理：

source: Using the Rancher UI extension
es: Uso de la extensión de interfaz de usuario de Rancher
ja: Rancher UI拡張機能の使用
pt_br: Usando a extensão de IU do Rancher
zh_cn: 使用 Rancher UI 扩展

source: SUSE Edge Virtualization provides a UI extension for Rancher Manager, enabling basic virtual machine management using the Rancher dashboard UI.
es: SUSE Edge Virtualization proporciona una extensión de interfaz de usuario para Rancher Manager, lo que permite la gestión básica de máquinas virtuales mediante la interfaz de usuario del panel de control de Rancher.
ja: SUSE Edge VirtualizationはRancher Manager用のUI拡張機能を提供しており、Rancher Dashboard UIを使用して基本的な仮想マシン管理を行うことができます。
pt_br: O SUSE Edge Virtualization oferece uma extensão de IU para o Rancher Manager, que permite o gerenciamento básico de máquinas virtuais usando a interface de usuário do Rancher Dashboard.
zh_cn: SUSE Edge Virtualization 为 Rancher Manager 提供了 UI 扩展，让您可以使用 Rancher 仪表板 UI 进行基本的虚拟机管理。

source: See Rancher Dashboard Extensions (<xref linkend="components-rancher-dashboard-extensions"/>) for installation guidance.
es: Consulte la sección sobre extensiones de panel de control de Rancher (<xref linkend="components-rancher-dashboard-extensions"/>) para obtener instrucciones de instalación.
ja: インストールのガイダンスについては、Rancher Dashboard拡張機能(<xref linkend="components-rancher-dashboard-extensions"/>)を参照してください。
pt_br: Consulte as extensões do Rancher Dashboard (<xref linkend="components-rancher-dashboard-extensions"/>) para obter orientação de instalação.
zh_cn: 请参见<xref linkend="components-rancher-dashboard-extensions"/>获取安装指导。

source: Using KubeVirt Rancher Dashboard Extension
es: Uso de la extensión de panel de control KubeVirt de Rancher
ja: KubeVirt Rancher Dashboard拡張機能の使用
pt_br: Usando a extensão KubeVirt do Rancher Dashboard
zh_cn: 使用 KubeVirt Rancher 仪表板扩展

source: The extension introduces a new <emphasis role="strong">KubeVirt</emphasis> section to the Cluster Explorer. This section is added to any managed cluster which has KubeVirt installed.
es: La extensión introduce una nueva sección <emphasis role="strong">KubeVirt</emphasis> en Cluster Explorer. Esta sección se añade a cualquier clúster gestionado que tenga instalado KubeVirt.
ja: この拡張機能により、Cluster Explorerに新たに<emphasis role="strong">［KubeVirt］</emphasis>セクションが導入されます。このセクションは、KubeVirtがインストールされている管理対象クラスタに追加されます。
pt_br: A extensão introduz uma nova seção <emphasis role="strong">KubeVirt</emphasis> no explorador de clusters, que é adicionada a qualquer cluster gerenciado que tenha o KubeVirt instalado.
zh_cn: 该扩展在群集资源管理器中引入了新的 <emphasis role="strong">KubeVirt</emphasis> 部分。此部分已添加到装有 KubeVirt 的任何受管群集。

source: The extension allows you to directly interact with KubeVirt Virtual Machine resources to manage Virtual Machines lifecycle.
es: La extensión permite interactuar directamente con los recursos de la máquina virtual de KubeVirt para gestionar el ciclo de vida de las máquinas virtuales.
ja: この拡張機能を使用すると、KubeVirt仮想マシンリソースを直接操作し、仮想マシンのライフサイクルを管理できます。
pt_br: A extensão permite interagir diretamente com os recursos de máquina virtual do KubeVirt para gerenciar o ciclo de vida das máquinas virtuais.
zh_cn: 使用该扩展，您可以直接与 KubeVirt 虚拟机资源进行交互，以管理虚拟机生命周期。

source: Creating a virtual machine
es: Creación de una máquina virtual
ja: 仮想マシンの作成
pt_br: Criando uma máquina virtual
zh_cn: 创建虚拟机

source: Navigate to <emphasis role="strong">Cluster Explorer</emphasis> clicking KubeVirt-enabled managed cluster in the left navigation.
es: En el panel de navegación izquierdo, diríjase a <emphasis role="strong">Cluster Explorer</emphasis> (Explorador de clústeres) haciendo clic en el clúster gestionado habilitado para KubeVirt.
ja: 左側のナビゲーションでKubeVirtが有効な管理対象クラスタをクリックして、<emphasis role="strong">［Cluster Explorer］</emphasis>に移動します。
pt_br: Navegue até o <emphasis role="strong">explorador de clustersr</emphasis> clicando no cluster gerenciado habilitado para KubeVirt na navegação esquerda.
zh_cn: 单击左侧导航栏中已启用 KubeVirt 的受管群集，导航到 <emphasis role="strong">Cluster Explorer</emphasis>（群集资源管理器）。

source: Navigate to <emphasis role="strong">KubeVirt &gt; Virtual Machines</emphasis> page and click <literal>Create from YAML</literal> in the upper right of the screen.
es: Diríjase a la página <emphasis role="strong">KubeVirt &gt; Virtual Machines</emphasis> (KubeVirt > Máquinas virtuales) y haga clic en <literal>Create from YAML</literal> (Crear desde YAML) en la parte superior derecha de la pantalla.
ja: <emphasis role="strong">［KubeVirt］ </emphasis> &gt; ［Virtual Machines (仮想マシン)］ページで、画面の右上にある［ <literal>Create from YAML (YAMLから作成)</literal>］をクリックします。
pt_br: Navegue até a página <emphasis role="strong">KubeVirt &gt; Virtual Machines</emphasis> (Máquinas virtuais) e clique em <literal>Create from YAML</literal> (Criar do YAML) na parte superior direita da tela.
zh_cn: 导航到 <emphasis role="strong">KubeVirt &gt; Virtual Machines（虚拟机）</emphasis>页面，然后单击屏幕右上角的 <literal>Create from YAML</literal>（基于 YAML 创建）。

source: Fill in or paste a virtual machine definition and press <literal>Create</literal>. Use virtual machine definition from Deploying Virtual Machines section as an inspiration.
es: Rellene o pegue una definición de máquina virtual y pulse <literal>Create</literal> (Crear). Use la definición de máquina virtual de la sección Despliegue de máquinas virtuales como referencia.
ja: 仮想マシンの定義を入力するか貼り付けて、［<literal>Create (作成)</literal>］を押します。「仮想マシンのデプロイ 」セクションの仮想マシンの定義を参考にしてください。
pt_br: Preencha ou cole uma definição da máquina virtual e clique em <literal>Create</literal> (Criar). Use a definição da máquina virtual da seção Implantando máquinas virtuais como modelo.
zh_cn: 填写或粘贴虚拟机定义，然后单击 <literal>Create</literal>（创建）。使用“部署虚拟机”一节中创建的虚拟机定义作为灵感来源。

source: <imageobject> <imagedata fileref="virtual-machines-page.png" width=""/> </imageobject>
es: <imageobject> <imagedata fileref="virtual-machines-page.png" width="100%"/> </imageobject>
ja: <imageobject> <imagedata fileref="virtual-machines-page.png" width="100%"/> </imageobject>
zh_cn: <imageobject> <imagedata fileref="virtual-machines-page.png" width="100%"/> </imageobject>

source: virtual machines page
es: página de máquinas virtuales
ja: ［Virtual Machines (仮想マシン)］ページ
pt_br: página máquinas virtuais
zh_cn: 虚拟机页面

source: Virtual Machine Actions
es: Acciones de la máquina virtual
ja: 仮想マシンのアクション
pt_br: Ações da máquina virtual
zh_cn: 虚拟机操作

source: You can use the action menu accessed from the <emphasis role="strong">⋮</emphasis> drop-down list to the right of each virtual machine to perform start, stop, pause or soft reboot actions. Alternatively you can also use group actions at the top of the list by selecting virtual machines to perform the action on.
es: Puede utilizar el menú de acciones al que se accede desde la lista desplegable <emphasis role="strong">⋮</emphasis> situada a la derecha de cada máquina virtual para iniciar, detener, pausar o hacer un reinicio suave. También puede usar las acciones de grupo de la parte superior de la lista seleccionando las máquinas virtuales en las que desea realizar la acción.
ja: 各仮想マシンの右側にある <emphasis role="strong">⋮</emphasis> ドロップダウンリストからアクセスできるアクションメニューを使用して、起動、停止、一時停止、またはソフト再起動のアクションを実行できます。または、アクションを実行する仮想マシンを選択して、リストの一番上にあるグループアクションを使用することもできます。
pt_br: É possível usar o menu de ações acessado pela lista suspensa <emphasis role="strong">⋮</emphasis> à direita de cada máquina virtual para executar as ações iniciar, parar, pausar ou fazer reboot suave. Se preferir, use as ações em grupo na parte superior da lista selecionando as máquinas virtuais nas quais executar a ação.
zh_cn: 使用操作菜单（可通过每个虚拟机右侧的 <emphasis role="strong">⋮</emphasis> 下拉列表访问）来执行启动、停止、暂停或软重引导操作。或者，您也可以选中多个虚拟机并使用列表顶部的组操作来对它们执行操作。

source: Performing the actions may have an effect on Virtual Machine Run Strategy. <link xl:href="https://kubevirt.io/user-guide/compute/run_strategies/#virtctl">See the table in KubeVirt documentation</link> for more details.
es: Estas acciones pueden afectar a la estrategia de ejecución de la máquina virtual. Consulte la <link xl:href="https://kubevirt.io/user-guide/compute/run_strategies/#virtctl">tabla en la documentación de KubeVirt</link> para obtener más detalles.
ja: アクションを実行すると、仮想マシン実行戦略に影響する場合があります。詳細については<link xl:href="https://kubevirt.io/user-guide/compute/run_strategies/#virtctl">KubeVirtドキュメントの表</link>を参照 してください。
pt_br: A execução das ações pode afetar a estratégia de execução da máquina virtual. <link xl:href="https://kubevirt.io/user-guide/compute/run_strategies/#virtctl">Consulte a tabela na documentação do KubeVirt</link> para obter mais detalhes.
zh_cn: 执行这些操作可能会对虚拟机运行策略产生影响。有关详细信息，<link xl:href="https://kubevirt.io/user-guide/compute/run_strategies/#virtctl">请参见 KubeVirt 文档中的表格</link>。

source: Accessing virtual machine console
es: Acceso al panel de control de la máquina virtual
ja: 仮想マシンコンソールへのアクセス
pt_br: Acessando o console da máquina virtual
zh_cn: 访问虚拟机控制台

source: The "Virtual machines" list provides a <literal>Console</literal> drop-down list that allows to connect to the machine using <emphasis role="strong">VNC or Serial Console</emphasis>. This action is only available to running machines.
es: La lista "Virtual Machines" (Máquinas virtuales) proporciona una lista desplegable <literal>Console</literal> (Panel de control) que permite conectarse a la máquina mediante <emphasis role="strong">VNC o un panel de control serie</emphasis>. Esta acción solo está disponible para máquinas en ejecución.
ja: ［Virtual Machines (仮想マシン)］リストには［<literal>Console</literal> (コンソール)］ドロップダウンリストがあり、ここから<emphasis role="strong">VNCまたはシリアルコンソール</emphasis>を使用してマシンに接続できます。このアクションは、実行中のマシンでのみ使用できます。
pt_br: A lista de "máquinas virtuais" oferece a lista suspensa <literal>Console</literal>, que permite conectar-se à máquina usando <emphasis role="strong">VNC ou console serial</emphasis>. Essa ação está disponível apenas em máquinas que estão em execução.
zh_cn: “Virtual machines”（虚拟机）列表提供了<literal>控制台</literal>下拉列表，用于通过 <emphasis role="strong">VNC 或串行控制台</emphasis>连接到虚拟机。此操作仅适用于正在运行的虚拟机。

source: In some cases, it takes a short while before the console is accessible on a freshly started virtual machine.
es: En algunos casos, para poder acceder al panel de control en una máquina virtual recién iniciada se debe esperar un poco.
ja: 新しく起動した仮想マシンでは、コンソールにアクセスできるようになるまでにしばらく時間がかかることがあります。
pt_br: Em alguns casos, leva um curto tempo para que o console fique disponível em uma máquina virtual que acabou de ser iniciada.
zh_cn: 在某些情况下，需要等待一段时间才能在全新启动的虚拟机上访问控制台。

source: <imageobject> <imagedata fileref="vnc-console-ui.png" width=""/> </imageobject>
es: <imageobject> <imagedata fileref="vnc-console-ui.png" width="100%"/> </imageobject>
ja: <imageobject> <imagedata fileref="vnc-console-ui.png" width="100%"/> </imageobject>
zh_cn: <imageobject> <imagedata fileref="vnc-console-ui.png" width="100%"/> </imageobject>

source: vnc console ui
es: interfaz del panel de control de vnc
ja: VNCコンソールUI
pt_br: iu console vnc
zh_cn: VNC 控制台 UI

source: SUSE Edge is using <xref linkend="components-eib"/> in order to customize base SUSE Linux Micro OS images. Follow <xref linkend="kubevirt-install"/> for an air-gapped installation of both KubeVirt and CDI on top of Kubernetes clusters provisioned by EIB.
es: SUSE Edge usa <xref linkend="components-eib"/> para personalizar las imágenes del sistema operativo SUSE Linux Micro base. Siga las instrucciones de la <xref linkend="kubevirt-install"/> para realizar una instalación en un entorno aislado tanto de KubeVirt como de CDI sobre clústeres de Kubernetes aprovisionados por EIB.
ja: SUSE Edgeは、SUSE Linux Micro OSのゴールデンイメージをカスタマイズするために<xref linkend="components-eib"/>を使用しています。EIBでプロビジョニングしたKubernetesクラスタ上にKubeVirtとCDIの両方をエアギャップインストールするには、 <xref linkend="kubevirt-install"/>に従ってください。
pt_br: O SUSE Edge usa o <xref linkend="components-eib"/> para personalizar as imagens base do sistema operacional SUSE Linux Micro. Siga a <xref linkend="kubevirt-install"/> para saber sobre a instalação air-gapped tanto do KubeVirt quanto da CDI em clusters Kubernetes provisionados pelo EIB.
zh_cn: SUSE Edge 使用<xref linkend="components-eib"/>来自定义基础 SUSE Linux Micro 操作系统映像。请按照<xref linkend="kubevirt-install"/>中所述，在 EIB 置备的 Kubernetes 群集上进行 KubeVirt 和 CDI 隔离式安装。

source: System Upgrade Controller
zh_cn: 系统升级控制器

source: See the <link xl:href="https://github.com/rancher/system-upgrade-controller">System Upgrade Controller documentation</link>.
es: Consulte la <link xl:href="https://github.com/rancher/system-upgrade-controller">documentación de System Upgrade Controller</link>.
ja: <link xl:href="https://github.com/rancher/system-upgrade-controller">System Upgrade Controllerのドキュメント</link>を参照してください。
pt_br: Consulte a <link xl:href="https://github.com/rancher/system-upgrade-controller">documentação do System Upgrade Controller</link>.
zh_cn: 请参见<link xl:href="https://github.com/rancher/system-upgrade-controller">系统升级控制器文档</link>。
