Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: When using RKE2 or K3s we need to expose services (Rancher in this context) from the management cluster as they are not exposed by default. In RKE2 there is an NGINX Ingress controller, whilst k3s is using Traefik. The current workflow suggests using MetalLB for announcing a service (via L2 or BGP Advertisement) and the respective Ingress Controller to create an Ingress via <literal>HelmChartConfig</literal> since creating a new Ingress object would override the existing setup.
es: Cuando se utiliza RKE2 o K3s, es necesario exponer los servicios (Rancher en este contexto) desde el clúster de gestión, ya que no están expuestos de forma predeterminada. En RKE2, hay un controlador Ingress NGINX, y en k3s utiliza Traefik. El flujo de trabajo actual sugiere utilizar MetalLB para anunciar un servicio (con el modo L2 o con BGP) y el controlador de Ingress correspondiente para crear un objeto Ingress a través de <literal>HelmChartConfig</literal>, ya que la creación de un nuevo objeto Ingress anularía la configuración existente.
ja: RKE2またはK3sを使用する場合、サービス(このコンテキストではRancher)がデフォルトでは公開されていないため、管理クラスタから公開する必要があります。RKE2ではNGINX Ingressコントローラが使用されており、k3sではTraefikが使用されています。現在のワークフローでは、サービスの通知(L2またはBGPアドバタイズメント経由)にはMetalLBを使用し、それぞれのIngressコントローラを使用して<literal>HelmChartConfig</literal>経由でIngressを作成することが推奨されています。これは、新しいIngressオブジェクトを作成すると既存のセットアップが上書きされるためです。
pt_br: Ao usar o RKE2 ou K3s, precisamos expor os serviços (neste contexto, do Rancher) do cluster de gerenciamento já que eles não são expostos por padrão. No RKE2, há um controlador de entrada NGINX, enquanto o k3s usa o Traefik. O fluxo de trabalho atual sugere o uso do MetalLB para anunciar um serviço (anúncio por L2 ou BGP) e do respectivo controlador de entrada para criar uma entrada usando <literal>HelmChartConfig</literal>, já que a criação de um novo objeto de entrada substitui a configuração existente.
zh_cn: 使用 RKE2 或 K3s 时，我们需要通过管理群集公开服务（此处指 Rancher），因为它们默认不会公开。RKE2 中通过 NGINX 入口控制器来实现此目的，K3s 使用的则是 Traefik。当前的工作流程建议使用 MetalLB 来公布服务（通过 L2 或 BGP 通告），并使用相应的入口控制器通过 <literal>HelmChartConfig</literal> 创建入口，因为创建新的入口对象时会覆盖现有的设置。

source: Install Rancher Prime (via Helm) and configure the necessary values
es: Instale Rancher Prime (mediante Helm) y configure los valores necesarios.
ja: Rancher Prime (Helm経由)をインストールし、必要な値を設定します。
pt_br: Instalar o Rancher Prime (pelo Helm) e configurar os valores necessários
zh_cn: 安装 Rancher Prime（通过 Helm）并配置必要的值

source: Follow the <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancher installation</link> documentation for more details.
es: Consulte la documentación sobre la <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">instalación de Rancher</link> para obtener más detalles.
ja: 詳細については、<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancherのインストール</link>のドキュメントに従ってください。
zh_cn: 有关详细信息，请参见 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/getting-started/installation-and-upgrade/install-upgrade-on-a-kubernetes-cluster">Rancher 安装</link>文档。

source: Create a LoadBalancer service to expose Rancher
es: Cree un servicio LoadBalancer para exponer Rancher.
ja: Rancherを公開するためのLoadBalancerサービスを作成します。
pt_br: Criar um serviço LoadBalancer para expor o Rancher
zh_cn: 创建 LoadBalancer 服务以公开 Rancher

source: Create an IP Address Pool for the service using the IP address we set up earlier in the Helm values
es: Cree un pool de direcciones IP para el servicio utilizando la dirección IP que hemos configurado anteriormente en los valores de Helm.
ja: Helm値で以前に設定したIPアドレスを使用して、サービスのIPアドレスプールを作成します。
pt_br: Criar um pool de endereços IP para o serviço usando o endereço IP que já configuramos nos valores do Helm
zh_cn: 使用我们之前在 Helm 值中设置的 IP 地址为该服务创建 IP 地址池

source: Create an L2 Advertisement for the IP address pool
es: Crear un anuncio L2 para el pool de direcciones IP.
ja: IPアドレスプール用のL2アドバタイズメントを作成します。
pt_br: Criar um anúncio por L2 para o pool de endereços IP
zh_cn: 为该 IP 地址池创建 L2 通告

source: Ensure Elemental is properly installed
es: Asegúrese de que Elemental se ha instalado correctamente.
ja: Elementalが適切にインストールされていることを確認します。
pt_br: Garantir que o Elemental seja devidamente instalado
zh_cn: 确保 Elemental 已正确安装

source: Install the Elemental Operator and Elemental UI on the management nodes
es: Instale el operador de Elemental y la interfaz del usuario de Elemental en los nodos de gestión.
ja: 管理ノードにElemental OperatorとElemental UIをインストールします。
pt_br: Instale o operador Elemental e a respectiva IU nos nós de gerenciamento.
zh_cn: 在管理节点上安装 Elemental Operator 和 Elemental UI

source: Add the Elemental configuration on the downstream node together with a registration code, as that will prompt Edge Image Builder to include the remote registration option for the machine.
es: Añada la configuración de Elemental en el nodo descendente junto con un código de registro, ya que eso hará que Edge Image Builder incluya la opción de registro remoto para el equipo.
ja: ダウンストリームノードにElementalの設定を登録コードとともに追加します。これによりEdge Image Builderにマシンのリモート登録オプションを含めるように要求されます。
pt_br: Adicione a configuração do Elemental ao nó downstream junto com um código de registro, pois isso solicitará que o Edge Image Builder inclua a opção de registro remoto na máquina.
zh_cn: 在下游节点上添加 Elemental 配置以及注册代码，这样 Edge Image Builder 将会为计算机提供远程注册选项。

source: Check <xref linkend="install-elemental"/> and <xref linkend="configure-elemental"/> for additional information and examples.
es: Consulte la <xref linkend="install-elemental"/> y la <xref linkend="configure-elemental"/> para obtener información adicional y ejemplos.
ja: 追加情報と例については、<xref linkend="install-elemental"/>と<xref linkend="configure-elemental"/>を確認してください。
pt_br: Consulte a <xref linkend="install-elemental"/> e a <xref linkend="configure-elemental"/> para obter informações e exemplos adicionais.
zh_cn: 有关更多信息和示例，请参见<xref linkend="install-elemental"/>和<xref linkend="configure-elemental"/>。

source: Hardware Specific
es: Específicos del hardware
ja: ハードウェア固有
pt_br: Específico do hardware
zh_cn: 硬件特定配置

source: Trusted Platform Module
zh_cn: 可信平台模块

source: It is necessary to properly handle the <link xl:href="https://elemental.docs.rancher.com/tpm/">Trusted Platform Module</link> (TPM) configuration. Failing to do so will result in errors similar to the following:
es: Es necesario gestionar correctamente la configuración del módulo de plataforma segura <link xl:href="https://elemental.docs.rancher.com/tpm/">Trusted Platform Module</link> (TPM). Si no se hace, se producirán errores como este:
ja: <link xl:href="https://elemental.docs.rancher.com/tpm/">Trusted Platform Module</link> (TPM)設定を適切に行う必要があります。適切に設定しないと、次のようなエラーが発生します。
pt_br: É necessário gerenciar de maneira apropriada a configuração do <link xl:href="https://elemental.docs.rancher.com/tpm/">Trusted Platform Module</link> (TPM). Se isso não for feito, haverá erros semelhantes a estes:
zh_cn: 必须妥善处理<link xl:href="https://elemental.docs.rancher.com/tpm/">可信平台模块</link> (TPM) 配置，否则将导致如下所示的错误：

source: This can be mitigated by one of the following approaches:
es: Esto se puede mitigar con uno de estos enfoques:
ja: このエラーは、以下のアプローチのいずれかで軽減できます。
pt_br: Para mitigá-los, siga uma das abordagens abaixo:
zh_cn: 可通过以下方法之一缓解此问题：

source: Enable TPM in the Virtual Machine settings
es: Habilite TPM en la configuración de la máquina virtual
ja: 仮想マシン設定でTPMを有効にする
pt_br: Habilitar o TPM nas configurações da máquina virtual
zh_cn: 在虚拟机设置中启用 TPM

source: <emphasis>Example with UTM on MacOS</emphasis>
es: <emphasis>Ejemplo con UTM en MacOS</emphasis>
ja: <emphasis>MacOSでのUTMの例</emphasis>
pt_br: <emphasis>Exemplo com UTM no MacOS</emphasis>
zh_cn: <emphasis>MacOS 上的 UTM 示例</emphasis>

source: Emulate TPM by using negative value for the TPM seed in the <literal>MachineRegistration</literal> resource
es: Emule TPM utilizando un valor negativo para la semilla de TPM en el recurso <literal>MachineRegistration</literal>.
ja: <literal>MachineRegistration</literal>リソースでTPMシードに負の値を使用してTPMをエミュレートする
pt_br: Emular o TPM usando um valor negativo para a semente do TPM no recurso <literal>MachineRegistration</literal>
zh_cn: 通过在 <literal>MachineRegistration</literal> 资源中为 TPM 种子使用负值来模拟 TPM

source: Disable TPM in the <literal>MachineRegistration</literal> resource
es: Inhabilite TPM en el recurso <literal>MachineRegistration</literal>.
ja: <literal>MachineRegistration</literal>リソースでTPMを無効にする
pt_br: Desabilitar o TPM no recurso <literal>MachineRegistration</literal>
zh_cn: 在 <literal>MachineRegistration</literal> 资源中禁用 TPM

source: Third-Party Integration
es: Integración de productos de otros fabricantes
ja: サードパーティの統合
pt_br: Integração de terceiros
zh_cn: 第三方集成

source: How to integrate third-party tools
es: Integración de herramientas de terceros
ja: サードパーティツールの統合方法
pt_br: Como integrar ferramentas de terceiros
zh_cn: 如何集成第三方工具

source: <link xl:href="https://nats.io/">NATS</link> is a connective technology built for the ever-increasingly hyper-connected world. It is a single technology that enables applications to securely communicate across any combination of cloud vendors, on-premises, edge, Web and mobile devices. NATS consists of a family of open-source products that are tightly integrated but can be deployed easily and independently. NATS is being used globally by thousands of companies, spanning use cases including microservices, edge computing, mobile and IoT, and can be used to augment or replace traditional messaging.
es: <link xl:href="https://nats.io/">NATS</link> es una tecnología de conectividad diseñada para un mundo cada vez más hiperconectado. Se trata de una tecnología única que permite a las aplicaciones comunicarse de forma segura a través de cualquier combinación de proveedores de la nube, instalaciones locales, dispositivos periféricos, Web y móviles. NATS consta de una familia de productos de código abierto estrechamente integrados, pero que pueden desplegarse de forma independiente y sencilla. NATS se utiliza en miles de empresas de todo el mundo y abarca casos de uso que incluyen microservicios, edge computing, dispositivos móviles e IoT. También se puede utilizar para ampliar o sustituir la mensajería tradicional.
ja: <link xl:href="https://nats.io/">NATS</link>は、ますますハイパーコネクテッド化が進む世界のために構築された接続テクノロジです。NATSは、クラウドベンダ、オンプレミス、エッジ、Web、モバイルデバイスがどのように組み合わさっていてもアプリケーションが安全に通信することを可能にする単一のテクノロジです。NATSはオープンソース製品ファミリで構成されており、各製品は緊密に統合されている一方で、簡単に個別にデプロイできます。NATSは世界中で数千社もの企業で使用されており、マイクロサービス、エッジコンピューティング、モバイル、IoTなどのユースケースに幅広く対応しているため、NATSを使用して従来のメッセージングの強化や置き換えを図ることができます。
pt_br: <link xl:href="https://nats.io/">NATS</link> é uma tecnologia conectiva projetada para o mundo cada vez mais hiperconectado. Trata-se de uma tecnologia única que permite que os aplicativos se comuniquem de forma segura com qualquer combinação de fornecedores de nuvem, ambientes locais e dispositivos de borda, web e móveis. O NATS consiste em uma família de produtos de código-fonte aberto estreitamente integrados, mas que podem ser implantados com facilidade e de modo independente. O NATS é usado mundialmente por milhares de empresas, atendendo a casos de uso como microsserviços, computação de borda, dispositivos móveis e IoT, e pode ser usado para expandir ou substituir o serviço de mensagens tradicional.
zh_cn: <link xl:href="https://nats.io/">NATS</link> 是为日益发展的超级互联世界而开发的连接技术。仅凭这一项技术，应用程序就能在云供应商、本地、边缘、Web 和移动设备的任意组合之间安全地通信。NATS 由一系列开源产品组成，这些产品紧密集成，但可以轻松独立部署。NATS 已由全球数千家公司使用，涵盖微服务、边缘计算、移动通信和 IoT 等使用场景，并可用于增强或取代传统的消息传递方式。

source: Architecture
es: Arquitectura
ja: アーキテクチャ
pt_br: Arquitetura
zh_cn: 体系结构

source: NATS is an infrastructure that allows data exchange between applications in the form of messages.
es: NATS es una infraestructura que permite el intercambio de datos entre aplicaciones en forma de mensajes.
ja: NATSは、メッセージの形式でアプリケーション間のデータ交換を可能にするインフラストラクチャです。
pt_br: O NATS é uma infraestrutura que permite a troca de dados entre aplicativos na forma de mensagens.
zh_cn: NATS 是能够在应用程序之间以消息形式实现数据交换的基础架构。

source: NATS client applications
es: Aplicaciones cliente de NATS
ja: NATSクライアントアプリケーション
pt_br: Aplicativos clientes do NATS
zh_cn: NATS 客户端应用程序

source: NATS client libraries can be used to allow the applications to publish, subscribe, request and reply between different instances. These applications are generally referred to as <literal>client applications</literal>.
es: Las bibliotecas cliente NATS permiten que las aplicaciones publiquen, se suscriban, soliciten y respondan entre diferentes instancias. Estas aplicaciones se denominan generalmente <literal>aplicaciones cliente</literal>.
ja: NATSクライアントライブラリを使用すると、アプリケーションが異なるインスタンス間でパブリッシュ、サブスクライブ、要求、および応答できるようになります。このようなアプリケーションを一般的に<literal>クライアントアプリケーション</literal>と呼びます。
pt_br: É possível usar as bibliotecas de clientes do NATS para permitir que os aplicativos publiquem, assinem, solicitem e respondam entre instâncias diferentes. Esses aplicativos costumam ser chamados de <literal>aplicativos clientes</literal>.
zh_cn: 应用程序可以使用 NATS 客户端库在不同的实例之间发布和订阅消息，以及发出请求和做出答复。这些应用程序通常称作<literal>客户端应用程序</literal>。

source: NATS service infrastructure
es: Infraestructura de servicios NATS
ja: NATSサービスインフラストラクチャ
pt_br: Infraestrutura de serviço do NATS
zh_cn: NATS 服务基础架构

source: The NATS services are provided by one or more NATS server processes that are configured to interconnect with each other and provide a NATS service infrastructure. The NATS service infrastructure can scale from a single NATS server process running on an end device to a public global super-cluster of many clusters spanning all major cloud providers and all regions of the world.
es: Los servicios NATS son proporcionados por uno o varios procesos de servidor NATS configurados para interconectarse entre sí y ofrecer una infraestructura. Esta infraestructura puede escalarse desde un único proceso de servidor NATS que se ejecuta en un dispositivo final hasta un superclúster global público compuesto por muchos clústeres que abarca todos los principales proveedores de nube y todas las regiones del mundo.
ja: NATSサービスは、相互接続されてNATSサービスインフラストラクチャを提供するように設定された1つ以上のNATSサーバプロセスによって提供されます。NATSサービスインフラストラクチャは、1つのエンドデバイスで動作する単一のNATSサーバプロセスから、すべての主要クラウドプロバイダと世界のあらゆる地域にまたがる多数のクラスタからなるパブリックなグローバルスーパークラスタまで拡張可能です。
pt_br: Os serviços do NATS são fornecidos por um ou mais processos do servidor NATS, que são configurados para interconexão uns com os outros e oferecem a infraestrutura de serviço do NATS, que pode ajustar a escala de um único processo do servidor NATS executado em um dispositivo de endpoint para um supercluster público global com muitos clusters, envolvendo todos os principais provedores de nuvem de todas as regiões do mundo.
zh_cn: NATS 服务由一个或多个 NATS 服务器进程提供，这些进程配置为彼此互连，提供了 NATS 服务基础架构。NATS 服务基础架构可以从一个终端设备上运行的单个 NATS 服务器进程，扩展为由许多群集组成的全球公用超级群集，这些群集跨越所有主要云提供商服务和全球所有区域。

source: Simple messaging design
es: Diseño de mensajería sencillo
ja: シンプルなメッセージングデザイン
pt_br: Design de mensagens simples
zh_cn: 简单的消息传递设计

source: NATS makes it easy for applications to communicate by sending and receiving messages. These messages are addressed and identified by subject strings and do not depend on network location. Data is encoded and framed as a message and sent by a publisher. The message is received, decoded and processed by one or more subscribers.
es: Con NATS, las aplicaciones pueden comunicarse fácilmente enviando y recibiendo mensajes. Estos mensajes se dirigen e identifican mediante cadenas de asunto y no dependen de la ubicación de la red. Los datos se cifran y se estructuran como mensajes, y son enviados por un editor. El mensaje es recibido, descifrado y procesado por uno o varios suscriptores.
ja: NATSを使用すると、アプリケーションはメッセージを送受信して簡単に通信できます。これらのメッセージはサブジェクト文字列によってアドレス指定および識別され、ネットワークの場所には依存しません。データはエンコードされてメッセージとしてフレーム化され、パブリッシャによって送信されます。メッセージは1人以上のサブスクライバによって受信、デコード、処理されます。
pt_br: O NATS facilita a comunicação dos aplicativos ao enviar e receber mensagens. Essas mensagens são endereçadas e identificadas por strings de assunto e não dependem do local da rede. Os dados são codificados e estruturados como uma mensagem e enviados por um publicador. A mensagem é recebida, decodificada e processada por um ou mais subscritores.
zh_cn: NATS 使应用程序能够通过发送和接收消息来轻松进行通信。这些消息按照主题字符串进行寻址和标识，并且不依赖于网络位置。数据经过编码，并构造为由发布者发送的消息。该消息由一个或多个订阅者接收、解码和处理。

source: NATS has a built-in distributed persistence system called JetStream. JetStream was created to solve the problems identified with streaming in technology today — complexity, fragility and a lack of scalability. JetStream also solves the problem with the coupling of the publisher and the subscriber (the subscribers need to be up and running to receive the message when it is published). More information about NATS JetStream can be found <link xl:href="https://docs.nats.io/nats-concepts/jetstream">here</link>.
es: NATS cuenta con un sistema de persistencia distribuida integrado llamado JetStream. JetStream se creó para resolver los problemas de transmisión identificados de la tecnología actual: complejidad, fragilidad y falta de escalabilidad. JetStream también resuelve el problema del acoplamiento entre el editor y el suscriptor (los suscriptores deben estar activos y en funcionamiento para recibir el mensaje cuando se publica). Para obtener más información sobre NATS JetStream, consulte <link xl:href="https://docs.nats.io/nats-concepts/jetstream">este documento</link>.
ja: NATSにはJetStreamと呼ばれる分散型の永続化システムが組み込まれています。JetStreamは、今日のテクノロジにおけるストリーミングで明らかになった問題、すなわち複雑性、脆弱性、スケーラビリティの欠如を解決するために作成されました。また、JetStreamは、パブリッシャとサブスクライバのカップリングに関する問題(パブリッシュされたメッセージを受信するにはサブスクライバが稼働している必要がある)も解決します。NATS JetStreamの詳細については、<link xl:href="https://docs.nats.io/nats-concepts/jetstream">こちら</link>を参照してください。
pt_br: O NATS tem um sistema de persistência distribuída incorporado chamado JetStream. O JetStream foi criado para solucionar os problemas de transmissão identificados nas tecnologias atuais: complexidade, fragilidade e falta de escalabilidade. O JetStream também soluciona o problema de acoplamento entre publicador e subscritor (os subscritores precisam estar em funcionamento para receber a mensagem quando ela for publicada). Há mais informações sobre o NATS JetStream <link xl:href="https://docs.nats.io/nats-concepts/jetstream">aqui</link>.
zh_cn: NATS 内置了一套称为 JetStream 的分布式持久化系统，旨在解决当今流媒体技术存在的诸多问题 — 复杂性高、稳定性差以及可伸缩性不足。JetStream 还能解决发布者和订阅者之间的耦合问题（即订阅者必须处于正常运行状态，才能接收发布的消息）。有关 NATS JetStream 的详细信息，请参见<link xl:href="https://docs.nats.io/nats-concepts/jetstream">此处</link>。

source: Installing NATS on top of K3s
es: Instalación de NATS sobre K3s
ja: K3s上へのNATSのインストール
pt_br: Instalando o NATS no K3s
zh_cn: 在 K3s 上安装 NATS

source: NATS is built for multiple architectures so it can easily be installed on K3s. (<xref linkend="components-k3s"/>)
es: NATS está diseñado para múltiples arquitecturas, por lo que se puede instalar fácilmente en K3s (<xref linkend="components-k3s"/>).
ja: NATSは複数のアーキテクチャ向けに構築されているため、K3s (<xref linkend="components-k3s"/>)上に簡単にインストールできます。
pt_br: O NATS foi projetado para várias arquiteturas para ser facilmente instalado no K3s (<xref linkend="components-k3s"/>).
zh_cn: NATS 是为多种体系结构构建的，因此可以在 K3s 上轻松安装。（<xref linkend="components-k3s"/>）

source: Let us create a values file to overwrite the default values of NATS.
es: Vamos a crear un archivo de valores para sobrescribir los valores predeterminados de NATS.
ja: NATSのデフォルト値を上書きするvaluesファイルを作成しましょう。
pt_br: Vamos criar um arquivo de valores para substituir os valores padrão do NATS.
zh_cn: 我们创建一个值文件来重写 NATS 的默认值。

source: Now let us install NATS via Helm:
es: Ahora, se instala NATS mediante Helm:
ja: では、Helmを介してNATSをインストールしてみましょう。
pt_br: Agora vamos instalar o NATS pelo Helm:
zh_cn: 现在我们需要通过 Helm 安装 NATS：

source: With the <literal>values.yaml</literal> file above, the following components will be in the <literal>nats</literal> namespace:
es: Con el archivo <literal>values.yaml</literal> anterior, los componentes siguientes estarán en el espacio de nombres <literal>nats</literal>:
ja: 上記の<literal>values.yaml</literal>ファイルでは、次のコンポーネントが<literal>nats</literal>ネームスペースに配置されます。
pt_br: Com o arquivo <literal>values.yaml</literal> acima, os seguintes componentes estarão no namespace <literal>nats</literal>:
zh_cn: 在上面创建的 <literal>values.yaml</literal> 文件中，需将以下组件放在 <literal>nats</literal> 名称空间中：

source: HA version of NATS Statefulset containing three containers: NATS server + Config reloader and Metrics sidecars.
es: Una versión de alta disponibilidad de NATS Statefulset que incluye tres contenedores: el servidor de NATS, el recargador de configuración y sidecars de métricas.
ja: NATS StatefulsetのHAバージョン。3つのコンテナ(NATSサーバ + ConfigリローダとMetricsサイドカー)が含まれます。
pt_br: Versão de alta disponibilidade do NATS Statefulset com três contêineres: servidor NATS, recarregador de configurações e sidecars de métricas.
zh_cn: HA 版本的 NATS 有状态副本集，其中包含三个容器：NATS 服务器、配置重载器和指标分支。

source: NATS box container, which comes with a set of <literal>NATS</literal> utilities that can be used to verify the setup.
es: Un contenedor de caja de NATS, que incluye un conjunto de utilidades <literal>NATS</literal> que se pueden utilizar para verificar la configuración.
ja: NATS boxコンテナ。セットアップの確認に使用できる一連の<literal>NATS</literal>ユーティリティが付属します。
pt_br: Contêiner NATS box, que vem com um conjunto de utilitários do <literal>NATS</literal> que são usados para verificar a configuração.
zh_cn: NATS 箱容器，其中附带一组可用于校验设置的 <literal>NATS</literal> 实用程序。

source: JetStream also leverages its Key-Value back-end that comes with <literal>PVCs</literal> bounded to the pods.
es: JetStream también aprovecha su interfaz final de clave-valor incluida con <literal>PVC</literal> vinculados a los pods.
ja: JetStreamは、Podにバインドされた<literal>PVC</literal>が付属するKey-Valueバックエンドも利用します。
pt_br: O JetStream também aproveita o back end de chave-valor incluído nos <literal>PVCs</literal> vinculados aos pods.
zh_cn: JetStream 还会利用其键值后端，该后端附带与 Pod 绑定的 <literal>PVC</literal>。

source: Testing the setup
es: Prueba de la configuración
ja: セットアップのテスト
pt_br: Testando a configuração
zh_cn: 测试设置

source: Create a subscription for the test subject:
es: Cree una suscripción de prueba:
ja: テストサブジェクトのサブスクリプションを作成します。
pt_br: Crie uma assinatura para a entidade de teste:
zh_cn: 为测试主题创建订阅：

source: Send a message to the test subject:
es: Envíe un mensaje de prueba:
ja: テストサブジェクトにメッセージを送信します。
pt_br: Envie uma mensagem para a entidade de teste:
zh_cn: 向测试主题发送消息：

source: Cleaning up
es: Limpieza
ja: クリーンアップ
pt_br: Limpando
zh_cn: 清理

source: NATS as a back-end for K3s
es: NATS como interfaz final para K3s
ja: K3sのバックエンドとしてのNATS
pt_br: NATS como back end para K3s
zh_cn: NATS 用作 K3s 的后端
