Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: For information about how Fleet works, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/architecture">Fleet Architecture</link>.
es: Para obtener información sobre cómo funciona Fleet, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/architecture">Fleet Architecture</link> (Arquitectura de Fleet).
ja: Fleetの仕組みについては、<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/architecture">Fleetアーキテクチャ</link>を参照してください。
zh_cn: 有关 Fleet 工作原理的信息，请参见 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/architecture">Fleet Architecture</link>。

source: Installing Fleet with Helm
es: Instalación de Fleet con Helm
ja: Helmを使用したFleetのインストール
pt_br: Instalando o Fleet com o Helm
zh_cn: 使用 Helm 安装 Fleet

source: Fleet comes built-in to Rancher, but it can be also <link xl:href="https://fleet.rancher.io/installation">installed</link> as a standalone application on any Kubernetes cluster using Helm.
es: Fleet viene integrado en Rancher, pero también se puede <link xl:href="https://fleet.rancher.io/installation">instalar</link> como una aplicación independiente en cualquier clúster de Kubernetes utilizando Helm.
ja: FleetはRancherにビルトインされていますが、Helmを使用して、スタンドアロンアプリケーションとして任意のKubernetesクラスタに<link xl:href="https://fleet.rancher.io/installation">インストール</link>することもできます。
pt_br: O Fleet está incorporado ao Rancher, mas também é possível <link xl:href="https://fleet.rancher.io/installation">instalá-lo</link> como aplicativo independente em qualquer cluster Kubernetes que usa o Helm.
zh_cn: Fleet 已内置于 Rancher 中，但您也可以使用 Helm 将 Fleet <link xl:href="https://fleet.rancher.io/installation">安装</link>为任何 Kubernetes 群集上的独立应用程序。

source: Using Fleet with Rancher
es: Uso de Fleet con Rancher
ja: RancherでのFleetの使用
pt_br: Usando o Fleet com o Rancher
zh_cn: 使用 Rancher 中的 Fleet

source: Rancher uses Fleet to deploy applications across managed clusters. Continuous delivery with Fleet introduces GitOps at scale, designed to manage applications running on large numbers of clusters.
es: Rancher usa Fleet para desplegar aplicaciones en clústeres gestionados. La entrega continua con Fleet introduce GitOps a gran escala, un sistema diseñado para gestionar aplicaciones que se ejecutan en un gran número de clústeres.
ja: Rancherは、Fleetを使用してアプリケーションを管理対象クラスタ全体にデプロイします。Fleetを使用した継続的デリバリにより、大量のクラスタで実行されるアプリケーションを管理するために設計された、大規模なGitOpsが導入されます。
pt_br: O Rancher usa o Fleet para implantar aplicativos em clusters gerenciados. A entrega contínua com o Fleet introduz o GitOps em escala, o que foi projetado para gerenciar aplicativos executados em uma grande quantidade de clusters.
zh_cn: Rancher 使用 Fleet 在受管群集中部署应用程序。Fleet 的持续交付功能引入了大规模 GitOps，旨在管理在大量群集上运行的应用程序。

source: Fleet shines as an integrated part of Rancher. Clusters managed with Rancher automatically get the Fleet agent deployed as part of the installation/import process and the cluster is immediately available to be managed by Fleet.
es: Fleet funciona de forma óptima como parte integrante de Rancher. En los clústeres gestionados con Rancher se despliega automáticamente el agente de Fleet como parte del proceso de instalación/importación, y el clúster queda inmediatamente disponible para ser gestionado por Fleet.
ja: FleetはRancherと統合してその一部として機能します。Rancherで管理されるクラスタには、インストール/インポートプロセスの一部としてFleetエージェントが自動的にデプロイされるため、クラスタはすぐにFleetで管理できるようになります。
pt_br: O Fleet se destaca como parte integrante do Rancher. O agente Fleet é automaticamente implantado em clusters gerenciados com o Rancher, como parte do processo de instalação/importação, e o cluster fica imediatamente disponível para gerenciamento pelo Fleet.
zh_cn: Fleet 作为 Rancher 的集成部分优势显著：使用 Rancher 管理的群集会在安装/导入过程中自动由 Fleet 代理部署，并且之后群集立即便能由 Fleet 管理。

source: Accessing Fleet in the Rancher UI
es: Acceso a Fleet en la interfaz de usuario de Rancher
ja: Rancher UIでのFleetへのアクセス
pt_br: Acessando o Fleet na IU do Rancher
zh_cn: 在 Rancher UI 中访问 Fleet

source: Fleet comes preinstalled in Rancher and is managed by the <emphasis role="strong">Continuous Delivery</emphasis> option in the Rancher UI.
es: Fleet viene preinstalado en Rancher y se gestiona con la opción <emphasis role="strong">Continuous Delivery</emphasis> (Entrega continua) en la interfaz de usuario de Rancher.
ja: FleetはRancherにプリインストールされており、Rancher UIの<emphasis role="strong">［Continuous Delivery (継続的デリバリ)］</emphasis>オプションで管理されます。
pt_br: O Fleet vem pré-instalado no Rancher e é gerenciado pela opção <emphasis role="strong">Continuous Delivery</emphasis> (Entrega contínua) na IU do Rancher.
zh_cn: Rancher 中预安装了 Fleet，可通过 Rancher UI 中的 <emphasis role="strong">Continuous Delivery</emphasis>（持续交付）选项进行管理。

source: fleet dashboard
es: panel de control de fleet
ja: Fleetダッシュボード
pt_br: dashboard fleet
zh_cn: Fleet 仪表板

source: Continuous Delivery section consists of following items:
es: La sección Continuous Delivery (Entrega continua) incluye estos elementos:
ja: ［Continuous Delivery (継続的デリバリ)］セクションは次の項目で構成されます。
pt_br: A seção Continuous Delivery (Entrega contínua) consiste nos seguintes itens:
zh_cn: “Continuous Delivery”（持续交付）部分包括以下项目：

source: Dashboard
es: Dashboard (Panel de control)
ja: Dashboard (ダッシュボード)
zh_cn: Dashboard（仪表板）

source: An overview page of all GitOps repositories across all workspaces. Only the workspaces with repositories are displayed.
es: Se trata de una vista general de todos los repositorios GitOps en todos los espacios de trabajo. Solo se muestran los espacios de trabajo con repositorios.
ja: すべてのワークスペースにわたるすべてのGitOpsリポジトリの概要ページ。リポジトリのあるワークスペースのみが表示されます。
pt_br: Uma página de visão geral de todos os repositórios do GitOps em todos os espaços de trabalho. São mostrados apenas os espaços de trabalho com repositórios.
zh_cn: 所有工作空间中所有 GitOps 储存库的概览页面。仅显示包含储存库的工作空间。

source: Git repos
es: Git repos (Repositorios Git)
ja: Git repos (Gitリポジトリ)
pt_br: Repositórios Git
zh_cn: Git repos（Git 储存库）

source: A list of GitOps repositories in the selected workspace. Select the active workspace using the dropdown list at the top of the page.
es: Muestra una lista de repositorios GitOps del espacio de trabajo seleccionado. Seleccione el espacio de trabajo activo en la lista desplegable de la parte superior de la página.
ja: 選択したワークスペース内のGitOpsリポジトリのリスト。ページ上部のドロップダウンリストを使用してアクティブなワークスペースを選択します。
pt_br: Uma lista de repositórios do GitOps no espaço de trabalho selecionado. Escolha o espaço de trabalho ativo na lista suspensa na parte superior da página.
zh_cn: 所选工作空间中的 GitOps 储存库列表。使用页面顶部的下拉列表选择活动工作空间。

source: Clusters
es: Clusters (Clústeres)
ja: Clusters (クラスタ)
zh_cn: Clusters（群集）

source: A list of managed clusters. By default, all Rancher-managed clusters are added to the <literal>fleet-default</literal> workspace. <literal>fleet-local</literal> workspace includes the local (management) cluster. From here, it is possible to <literal>Pause</literal> or <literal>Force update</literal> the clusters or move the cluster into another workspace. Editing the cluster allows to update labels and annotations used for grouping the clusters.
es: Muestra una lista de clústeres gestionados. De forma predeterminada, todos los clústeres gestionados por Rancher se añaden al espacio de trabajo <literal>fleet-default</literal>. El espacio de trabajo <literal>fleet-local</literal> incluye el clúster local (de gestión). Desde aquí, es posible usar las acciones <literal>Pause</literal> (Pausar) o <literal>Force update</literal> (Forzar la actualización) en los clústeres o mover el clúster a otro espacio de trabajo. Editar el clúster permite actualizar las etiquetas y anotaciones utilizadas para agrupar los clústeres.
ja: 管理対象クラスタのリスト。デフォルトでは、Rancherで管理されているすべてのクラスタが<literal>fleet-default</literal>ワークスペースに追加されます。<literal>fleet-local</literal>ワークスペースにはローカル(管理)クラスタが含まれます。ここから、クラスタを<literal>Pause (一時停止)</literal>または<literal>Force Update (強制的に更新)</literal>したり、クラスタを別のワークスペースに移動したりすることができます。クラスタを編集すると、クラスタのグループ化に使用するラベルや注釈を更新できます。
pt_br: Uma lista de clusters gerenciados. Por padrão, todos os clusters gerenciados pelo Rancher são adicionados ao espaço de trabalho <literal>fleet-default</literal>. O espaço de trabalho <literal>fleet-local</literal> inclui o cluster (de gerenciamento) local. Nele, é possível <literal>Pause</literal> (Pausar) ou <literal>Force update</literal> (Forçar a atualização) dos clusters ou mover o cluster para outro espaço de trabalho. A edição do cluster permite atualizar rótulos e anotações usados para agrupamento de clusters.
zh_cn: 受管群集列表。默认情况下，Rancher 管理的所有群集都会添加到 <literal>fleet-default</literal> 工作空间。<literal>fleet-local</literal> 工作空间包含本地（管理）群集。在此处可以<literal>暂停</literal>或<literal>强制更新</literal>群集，或者将群集移动到另一个工作空间。可以通过编辑群集来更新用于群集分组的标签和注解。

source: Cluster groups
es: Cluster groups (Grupos de clústeres)
ja: Cluster groups (クラスタグループ)
pt_br: Grupos de clusters
zh_cn: Cluster groups（群集组）

source: This section allows custom grouping of the clusters within the workspace using selectors.
es: Esta sección permite agrupar de forma personalizada los clústeres dentro del espacio de trabajo mediante selectores.
ja: このセクションでは、セレクタを使用してワークスペース内のクラスタのカスタムグループを作成できます。
pt_br: A seção "Cluster Groups" (Grupos de clusters) permite o agrupamento personalizado de clusters no espaço de trabalho usando os seletores.
zh_cn: 在此部分，可以使用选择器对工作空间内的群集进行自定义分组。

source: Advanced
es: Advanced (Avanzado)
ja: Advanced (詳細)
pt_br: Avançado
zh_cn: Advanced（高级）

source: The "Advanced" section allows to manage workspaces and other related Fleet resources.
es: Esta sección permite gestionar los espacios de trabajo y otros recursos relacionados con Fleet.
ja: ［Advanced (詳細)］セクションでは、ワークスペースやその他の関連するFleetリソースを管理できます。
pt_br: A seção "Advanced" (Avançado) permite gerenciar espaços de trabalho e outros recursos do Fleet relacionados.
zh_cn: 在“Advanced”（高级）部分可以管理工作空间和其他相关 Fleet 资源。

source: Example of installing KubeVirt with Rancher and Fleet using Rancher dashboard
es: Ejemplo de instalación de KubeVirt con Rancher y Fleet usando el panel de control de Rancher
ja: Rancher Dashboardを使用してRancherおよびFleetとともにKubeVirtをインストールする例
pt_br: Exemplo de instalação do KubeVirt com o Rancher e o Fleet usando o Rancher Dashboard
zh_cn: 使用 Rancher 仪表板通过 Rancher 和 Fleet 安装 KubeVirt 的示例

source: Create a Git repository containing the <literal>fleet.yaml</literal> file:
es: Cree un repositorio Git que contenga el archivo <literal>fleet.yaml</literal>:
ja: <literal>fleet.yaml</literal>ファイルを含むGitリポジトリを作成します。
pt_br: Crie um repositório Git com o arquivo <literal>fleet.yaml</literal>:
zh_cn: 创建包含 <literal>fleet.yaml</literal> 文件的 Git 储存库：

source: In the Rancher dashboard, navigate to <emphasis role="strong">☰ &gt; Continuous Delivery &gt; Git Repos</emphasis> and click <literal>Add Repository</literal>.
es: En el panel de control de Rancher, diríjase a <emphasis role="strong">☰ &gt; Continuous Delivery &gt; Git Repos</emphasis> (☰ > Entrega continua > Repositorios Git) y haga clic en <literal>Add Repository</literal> (Añadir repositorio).
ja: Rancher Dashboardで、<emphasis role="strong">［☰］&gt; ［Continuous Delivery (継続的デリバリ)］ &gt; ［Git Repos (Gitリポジトリ)］</emphasis>に移動して、［<literal>Add Repository (リポジトリの追加)</literal>］をクリックします。
pt_br: No Rancher Dashboard, navegue até <emphasis role="strong">☰ &gt; Continuous Delivery &gt; Git Repos</emphasis> (Entrega contínua > Repositórios Git) e clique em <literal>Add Repository</literal> (Adicionar repositório).
zh_cn: 在 Rancher 仪表板中，导航到 <emphasis role="strong">☰ &gt; Continuous Delivery（持续交付）&gt; Git repos（Git 储存库）</emphasis>，然后单击 <literal>Add Repository</literal>（添加储存库）。

source: The Repository creation wizard guides through creation of the Git repo. Provide <emphasis role="strong">Name</emphasis>, <emphasis role="strong">Repository URL</emphasis> (referencing the Git repository created in the previous step) and select the appropriate branch or revision. In the case of a more complex repository, specify <emphasis role="strong">Paths</emphasis> to use multiple directories in a single repository.
es: El asistente para la creación de repositorios le guía a través del proceso de creación del repositorio Git. Proporcione el nombre (<emphasis role="strong">Name</emphasis>) y la URL del repositorio (<emphasis role="strong">Repository URL</emphasis>) que haga referencia al repositorio Git creado en el paso anterior, y seleccione la rama o revisión adecuada. En el caso de un repositorio más complejo, especifique las rutas (<emphasis role="strong">Paths</emphasis>) para utilizar varios directorios en un solo repositorio.
ja: リポジトリの作成ウィザードの指示に従ってGitリポジトリを作成します。<emphasis role="strong">［Name (名前)］</emphasis>、<emphasis role="strong">［Repository URL (リポジトリのURL)］</emphasis>(前の手順で作成したGitリポジトリを参照)を指定し、適切なブランチまたはリビジョンを選択します。より複雑なリポジトリの場合は、<emphasis role="strong">［Paths (パス)］</emphasis>を指定して、1つのリポジトリで複数のディレクトリを使用します。
pt_br: O assistente de criação de repositório orienta na criação do repositório Git. Insira o <emphasis role="strong">Name</emphasis> (Nome), <emphasis role="strong">Repository URL</emphasis> (URL do repositório), mencionando o repositório Git criado na etapa anterior, e selecione a ramificação ou revisão apropriada. No caso de um repositório mais complexo, especifique os <emphasis role="strong">Paths</emphasis> (Caminhos) para usar vários diretórios em um único repositório.
zh_cn: 储存库创建向导将指导您完成 Git 储存库创建步骤。提供<emphasis role="strong">名称</emphasis>、<emphasis role="strong">储存库 URL</emphasis>（引用上一步骤中创建的 Git 储存库），并选择适当的分支或修订版。对于较复杂的储存库，请指定<emphasis role="strong">路径</emphasis>以便在单个储存库中使用多个目录。

source: fleet create repo1
es: creación de repositorio 1 con fleet
ja: Fleetリポジトリの作成1
pt_br: criar repo1 fleet
zh_cn: Fleet - 创建储存库 1

source: Click <literal>Next</literal>.
es: Haga clic en <literal>Next</literal> (Siguiente).
ja: ［<literal>Next (次へ)</literal>］をクリックします。
pt_br: Clique em <literal>Next</literal> (Avançar).
zh_cn: 单击 <literal>Next</literal>（下一步）。

source: In the next step, you can define where the workloads will get deployed. Cluster selection offers several basic options: you can select no clusters, all clusters, or directly choose a specific managed cluster or cluster group (if defined). The "Advanced" option allows to directly edit the selectors via YAML.
es: En el paso siguiente, puede definir dónde se desplegarán las cargas de trabajo. Existen varias opciones básicas para seleccionar clústeres: puede no seleccionar ningún clúster, seleccionarlos todos o elegir directamente un clúster gestionado específico o un grupo de clústeres (si se ha definido). La opción Advanced (Avanzado) permite editar directamente los selectores a través del archivo YAML.
ja: 次の手順では、ワークロードをデプロイする場所を定義できます。クラスタの選択では複数の基本オプションがあります。クラスタをまったく選択しないことも、すべてのクラスタを選択することも、特定の管理対象クラスタやクラスタグループ(定義されている場合)を直接選択することもできます。［Advanced (詳細)］オプションを使用すると、YAML経由でセレクタを直接編集できます。
pt_br: Na próxima etapa, você poderá definir o local de implantação das cargas de trabalho. A seleção de cluster inclui várias opções básicas: nenhum cluster, todos os clusters ou escolher diretamente um cluster gerenciado ou grupo de clusters específico (se definido). A opção "Advanced" (Avançado) permite editar os seletores direto pelo YAML.
zh_cn: 在下一步骤中，可以定义工作负载的部署位置。在群集选择方面，可以使用多个基本选项：可以不选择任何群集、选择所有群集，或者直接选择特定的受管群集或群集组（如果已定义）。“Advanced”（高级）选项允许通过 YAML 直接编辑选择器。

source: fleet create repo2
es: creación de repositorio 2 con fleet
ja: Fleetリポジトリの作成2
pt_br: criar repo2 fleet
zh_cn: Fleet - 创建储存库 2

source: Click <literal>Create</literal>. The repository gets created. From now on, the workloads are installed and kept in sync on the clusters matching the repository definition.
es: Haga clic en <literal>Create</literal> (Crear). Se crea el repositorio. A partir de ahora, las cargas de trabajo se instalan y se mantienen sincronizadas en los clústeres que coinciden con la definición del repositorio.
ja: ［<literal>Create (作成)</literal>］をクリックします。リポジトリが作成されます。今後、ワークロードはリポジトリ定義に一致するクラスタにインストールされ、同期が維持されます。
pt_br: Clique em <literal>Create</literal> (Criar). O repositório é criado. A partir de agora, as cargas de trabalho são instaladas e sincronizadas nos clusters correspondentes à definição do repositório.
zh_cn: 单击 <literal>Create</literal>（创建）。系统即会创建储存库。从现在起，工作负载将在与储存库定义匹配的群集上安装并保持同步。

source: Debugging and troubleshooting
es: Depuración y solución de problemas
ja: デバッグとトラブルシューティング
pt_br: Depurando e solucionando problemas
zh_cn: 调试和查错

source: The "Advanced" navigation section provides overviews of lower-level Fleet resources. <link xl:href="https://fleet.rancher.io/ref-bundle-stages">A bundle</link> is an internal resource used for the orchestration of resources from Git. When a Git repo is scanned, it produces one or more bundles.
es: La sección "Advanced" (Avanzado) ofrece una visión general de los recursos de Fleet de nivel inferior. Un <link xl:href="https://fleet.rancher.io/ref-bundle-stages">bundle</link> es un recurso interno que se utiliza para la coordinación de recursos de Git. Cuando se analiza un repositorio Git, se generan uno o varios Bundles.
ja: ナビゲーションの［Advanced (詳細)］セクションでは、下位レベルのFleetリソースの概要が表示されます。<link xl:href="https://fleet.rancher.io/ref-bundle-stages">バンドル</link>は、Gitからのリソースのオーケストレーションに使用される内部リソースです。Gitリポジトリがスキャンされると、バンドルが1つ以上生成されます。
pt_br: A seção de navegação "Advanced" (Avançado) apresenta visões gerais dos recursos do Fleet de nível mais baixo. <link xl:href="https://fleet.rancher.io/ref-bundle-stages">Bundle</link> é um recurso interno usado para orquestração dos recursos do Git. Quando um repositório Git é verificado, ele gera um ou mais bundles.
zh_cn: “Advanced”（高级）导航部分提供了低层级 Fleet 资源的概览。<link xl:href="https://fleet.rancher.io/ref-bundle-stages">捆绑包</link>是一个内部资源，用于编排 Git 中的资源。扫描 Git 储存库时，会生成一个或多个捆绑包。

source: To find bundles relevant to a specific repository, go to the Git repo detail page and click the <literal>Bundles</literal> tab.
es: Para encontrar Bundles relevantes para un repositorio específico, vaya a la página de detalles del repositorio Git y haga clic en la pestaña <literal>Bundles</literal>.
ja: 特定のリポジトリに関連するバンドルを見つけるには、［Git Repos (Gitリポジトリ)］の［Detail (詳細)］ページに移動し、［<literal>Bundles (バンドル)</literal>］タブをクリックします。
pt_br: Para localizar os bundles relevantes a um repositório específico, vá até a página de detalhes do repositório Git e clique na guia <literal>Bundles</literal>.
zh_cn: 要查找与特定储存库相关的捆绑包，请转到 Git 储存库细节页面，并单击 <literal>Bundles</literal>（捆绑包）选项卡。

source: fleet repo bundles
es: Bundles en repositorios fleet
ja: Fleetリポジトリバンドル
pt_br: bundles repositório fleet
zh_cn: Fleet 储存库捆绑包

source: For each cluster, the bundle is applied to a BundleDeployment resource that is created. To view BundleDeployment details, click the <literal>Graph</literal> button in the upper right of the Git repo detail page. A graph of <emphasis role="strong">Repo &gt; Bundles &gt; BundleDeployments</emphasis> is loaded. Click the BundleDeployment in the graph to see its details and click the <literal>Id</literal> to view the BundleDeployment YAML.
es: El bundle se aplica a un recurso BundleDeployment que se crea para cada clúster. Para ver los detalles de BundleDeployment, haga clic en el botón <literal>Graph</literal> (Gráfico) situado en la parte superior derecha de la página de detalles del repositorio Git. Se carga un gráfico de <emphasis role="strong">Repo > Bundles > BundleDeployments</emphasis> (Repositorio > Bundles > BundleDeployments). Haga clic en BundleDeployment en el gráfico para ver sus detalles y haga clic en <literal>Id</literal> para ver el YAML de BundleDeployment.
ja: クラスタごとに、作成されたBundleDeploymentリソースにバンドルが適用されます。BundleDeploymentの詳細を表示するには、［Git Repos (Gitリポジトリ)］の［Detail (詳細)］ページの右上にある ［<literal>Graph (グラフ)</literal>］ボタンをクリックします。<emphasis role="strong">［Repo (リポジトリ) ］&gt;［Bundles (バンドル)］&gt;［BundleDeployments］</emphasis>のグラフがロードされます。グラフ内のBundleDeploymentをクリックすると詳細が表示され、［<literal>Id (ID)</literal>］をクリックするとBundleDeployment YAMLが表示されます。
pt_br: Para cada cluster, o bundle é aplicado a um recurso BundleDeployment que foi criado. Para ver os detalhes do BundleDeployment, clique no botão <literal>Graph</literal> (Gráfico) na parte superior direita da página de detalhes do repositório Git. É carregado um gráfico de <emphasis role="strong">Repo &gt; Bundles &gt; BundleDeployments</emphasis> (Repositório > Bundles > BundleDeployments). Clique no BundleDeployment no gráfico para ver seus detalhes e clique no <literal>Id</literal> para conferir o YAML do BundleDeployment.
zh_cn: 对于每个群集，捆绑包将应用于创建的 BundleDeployment 资源。要查看 BundleDeployment 细节，请单击 Git 储存库细节页面右上角的 <literal>Graph</literal>（图表）按钮。系统随即会加载 <emphasis role="strong">Repo（储存库）&gt; Bundles（捆绑包）&gt; BundleDeployment</emphasis> 图表。在图表中单击相应 BundleDeployment 可查看其细节，单击 <literal>ID</literal> 可查看 BundleDeployment YAML。

source: fleet repo graph
es: gráfico de repositorios de fleet
ja: Fleetリポジトリのグラフ
pt_br: gráfico repositório fleet
zh_cn: Fleet 储存库图表

source: For additional information on Fleet troubleshooting tips, refer <link xl:href="https://fleet.rancher.io/troubleshooting">here</link>.
es: Para consejos sobre la resolución de problemas de Fleet, consulte <link xl:href="https://fleet.rancher.io/troubleshooting">este documento</link>.
ja: Fleetのトラブルシューティングのヒントに関する追加情報については、<link xl:href="https://fleet.rancher.io/troubleshooting">こちら</link>を参照してください。
pt_br: Para obter informações adicionais com dicas de solução de problemas no Fleet, acesse <link xl:href="https://fleet.rancher.io/troubleshooting">aqui</link>.
zh_cn: 有关 Fleet 查错提示的更多信息，请参见<link xl:href="https://fleet.rancher.io/troubleshooting">此处</link>。

source: Fleet examples
es: Ejemplos de Fleet
ja: Fleetの例
pt_br: Exemplos do Fleet
zh_cn: Fleet 示例

source: The Edge team maintains a <link xl:href="https://github.com/suse-edge/fleet-examples">repository</link> with examples of installing Edge projects with Fleet.
es: El equipo de Edge mantiene un <link xl:href="https://github.com/suse-edge/fleet-examples">repositorio</link> con ejemplos de instalación de proyectos de Edge con Fleet.
ja: Edgeチームは、Fleetを使用してEdgeプロジェクトをインストールする例を含む<link xl:href="https://github.com/suse-edge/fleet-examples">リポジトリ</link>を維持しています。
pt_br: A equipe do Edge mantém um <link xl:href="https://github.com/suse-edge/fleet-examples">repositório</link> com exemplos de instalação de projetos do Edge com o Fleet.
zh_cn: Edge 团队维护的一个<link xl:href="https://github.com/suse-edge/fleet-examples">储存库</link>包含了有关使用 Fleet 安装 Edge 项目的示例。

source: The Fleet project includes a <link xl:href="https://github.com/rancher/fleet-examples">fleet-examples</link> repository that covers all use cases for <link xl:href="https://fleet.rancher.io/gitrepo-content">Git repository structure</link>.
es: El proyecto de Fleet incluye un repositorio <link xl:href="https://github.com/rancher/fleet-examples">fleet-examples</link> que cubre todos los posibles casos de uso para la <link xl:href="https://fleet.rancher.io/gitrepo-content">estructura de repositorios de Git</link>.
ja: Fleetプロジェクトには、<link xl:href="https://fleet.rancher.io/gitrepo-content">Gitリポジトリ構造</link>のすべてのユースケースをカバーする<link xl:href="https://github.com/rancher/fleet-examples">fleet-examples</link>リポジトリが含まれています。
pt_br: O projeto do Fleet inclui o repositório <link xl:href="https://github.com/rancher/fleet-examples">fleet-examples</link> que abrange todos os casos de uso da <link xl:href="https://fleet.rancher.io/gitrepo-content">estrutura de repositório Git</link>.
zh_cn: Fleet 项目包含 <link xl:href="https://github.com/rancher/fleet-examples">fleet-examples</link> 储存库，其中涵盖了 <link xl:href="https://fleet.rancher.io/gitrepo-content">Git 储存库结构</link>的所有使用场景。
