Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: For more information on product support lifecycle updates for SUSE Edge, see <link xl:href="https://www.suse.com/lifecycle/#suse-edge-33">Product Support Lifecycle</link>.
es: Para obtener más información sobre las actualizaciones del ciclo de vida de asistencia de productos para SUSE Edge, consulte <link xl:href="https://www.suse.com/lifecycle/#suse-edge-33">Ciclo de vida de la asistencia técnica del producto</link>.
ja: SUSE Edgeの製品サポートライフサイクルの更新に関する詳細については、<link xl:href="https://www.suse.com/lifecycle/#suse-edge-33">製品サポートライフサイクル</link>を参照してください。
zh_cn: 有关 SUSE Edge 产品支持生命周期更新的详细信息，请参见 <link xl:href="https://www.suse.com/lifecycle/#suse-edge-33">Product Support Lifecycle</link>。

source: SUSE Telco Cloud (formerly known as SUSE Edge for Telco) is a derivative of SUSE Edge, with additional optimizations and components that enable the platform to address the requirements found in telecommunications use-cases. Unless explicitly stated, all the release notes are applicable for both SUSE Edge 3.4, and SUSE Telco Cloud 3.4.
es: SUSE Telco Cloud (anteriormente conocido como SUSE Edge for Telco) es un producto derivado de SUSE Edge, con optimizaciones y componentes adicionales que permiten a la plataforma adaptarse al uso práctico en el sector de las telecomunicaciones. A menos que se indique explícitamente lo contrario, todas las notas de la versión son aplicables tanto a SUSE Edge 3.4 como a SUSE Telco Cloud 3.4.
ja: SUSE Telco Cloud (旧称SUSE Edge for Telco)はSUSE Edgeの派生製品にあたり、このプラットフォームを通信事業者の要件に対処可能にするための最適化とコンポーネントが追加されています。明記されていない限り、すべてのリリースノートはSUSE Edge 3.4とSUSE Telco Cloud 3.4の両方に適用されます。
zh_cn: SUSE Telco Cloud（前身为 SUSE Edge for Telco）是 SUSE Edge 的衍生产品，它经过进一步优化并包含更多组件，使平台能够满足电信行业场景的需求。除非另有明确说明，所有发行说明均适用于 SUSE Edge 3.4 和 SUSE Telco Cloud 3.4。

source: About
es: Acerca de
ja: 概要
pt_br: Sobre
zh_cn: 简介

source: These Release Notes are, unless explicitly specified and explained, identical across all architectures, and the most recent version, along with the release notes of all other SUSE products are always available online at <link xl:href="https://www.suse.com/releasenotes">https://www.suse.com/releasenotes</link>.
es: Estas notas de la versión son, salvo que se especifique y explique explícitamente lo contrario, idénticas en todas las arquitecturas, y la versión más reciente, junto con las notas de la versión de todos los demás productos SUSE, están siempre disponibles en línea en <link xl:href="https://www.suse.com/releasenotes">https://www.suse.com/releasenotes</link>.
ja: これらのリリースノートは、明示的に指定および説明されていない限り、すべてのアーキテクチャで同一です。また、最新バージョンは、その他すべてのSUSE製品のリリースノートとともに、常に<link xl:href="https://www.suse.com/releasenotes">https://www.suse.com/releasenotes</link>でオンラインで参照できます。
pt_br: As Notas de lançamento, a menos que claramente especificado e explicado, são idênticas em todas as arquiteturas; e a versão mais recente, junto com as Notas de lançamento de todos os outros produtos SUSE, está sempre disponível online em <link xl:href="https://www.suse.com/releasenotes">https://www.suse.com/releasenotes</link>.
zh_cn: 除非明确指定和说明，否则下面的发行说明在所有体系结构中都是相同的，并且最新版本以及所有其他 SUSE 产品的发行说明始终在 <link xl:href="https://www.suse.com/releasenotes">https://www.suse.com/releasenotes</link> 上在线提供。

source: Entries are only listed once, but they can be referenced in several places if they are important and belong to more than one section. Release notes usually only list changes that happened between two subsequent releases. Certain important entries from the release notes of previous product versions may be repeated. To make these entries easier to identify, they contain a note to that effect.
es: Las entradas solo se muestran una vez, pero pueden aparecer referenciadas en varios lugares si son importantes y pertenecen a más de una sección. Las notas de la versión suelen mostrar solo los cambios que se han producido entre dos versiones consecutivas. Es posible que se repitan algunas entradas importantes de las notas de la versión de versiones anteriores del producto. Para facilitar la identificación de estas entradas, se incluye una nota al respecto.
ja: エントリが記載されるのは1回だけですが、そのエントリが重要で複数のセクションに属している場合は複数の場所で参照できます。リリースノートには通常、連続する2つのリリース間の変更のみが記載されます。特定の重要なエントリは、以前の製品バージョンのリリースノートから繰り返し記載される場合があります。このようなエントリを特定しやすくするために、該当するエントリにはその旨を示すメモが含まれています。
pt_br: As entradas são listadas apenas uma vez, mas é possível fazer referência a elas em vários locais, se forem importantes e pertencerem a mais de uma seção. Normalmente, as Notas de lançamento listam somente as alterações feitas entre dois lançamentos subsequentes. Determinadas entradas importantes das Notas de lançamento de versões anteriores dos produtos podem se repetir. Para facilitar a identificação dessas entradas, elas incluem uma observação a esse respeito.
zh_cn: 说明项只会列出一次，但是，非常重要并且属于多个章节的说明项可能会在多处提到。发行说明通常只会列出两个后续版本之间发生的更改。本发行说明可能重复了旧产品版本的发行说明中的某些重要说明项。为了方便识别这些说明项，发行说明中会通过一条备注来指出这一点。

source: However, repeated entries are provided as a courtesy only. Therefore, if you are skipping one or more releases, check the release notes of the skipped releases also. If you are only reading the release notes of the current release, you could miss important changes that may affect system behavior. SUSE Edge versions are defined as x.y.z, where 'x' denotes the major version, 'y' denotes the minor, and 'z' denotes the patch version, also known as the "z-stream". SUSE Edge product lifecycles are defined based around a given minor release, e.g. "3.4", but ship with subsequent patch updates through its lifecycle, e.g. "3.4.1".
es: Sin embargo, las entradas repetidas se proporcionan únicamente como cortesía. Por lo tanto, si se salta una o más versiones, compruebe también las notas de las versiones omitidas. Si solo lee las notas de la versión actual, podría perderse cambios importantes que pueden afectar al comportamiento del sistema. Las versiones de SUSE Edge se definen como x.y.z, donde "x" denota la versión principal; "y", la secundaria y "z", la versión del parche, también conocida como "z-stream". Los ciclos de vida de los productos SUSE Edge se definen en función de una versión secundaria determinada, por ejemplo, "3.4", pero se envían con actualizaciones de parches posteriores a lo largo de su ciclo de vida, por ejemplo, "3.4.1".
ja: ただし、繰り返し記載されているエントリは厚意としてのみ提供されています。したがって、リリースを1つ以上スキップする場合は、スキップしたリリースのリリースノートも確認してください。現行リリースのリリースノートしか確認しないと、システムの動作に影響する可能性がある重要な変更を見逃す可能性があります。SUSE Edgeのバージョンはx.y.zで定義され、「x」はメジャーバージョン、「y」はマイナーバージョン、「z」は「z ストリーム」とも呼ばれるパッチバージョンを表します。SUSE Edgeの製品ライフサイクルは、「3.4」のようなマイナーリリースを中心に定義されますが、「3.4.1」のように、ライフサイクルを通じて後続のパッチアップデートが適用されます。
zh_cn: 但需注意，重复列出的内容仅出于方便查阅目的提供。因此，如果您跳过了一个或多个版本，还需查看被跳过版本的发行说明。如果您仅阅读当前版本的发行说明，可能会遗漏影响系统运行的重要变更。SUSE Edge 版本格式为 x.y.z，其中“x”表示主要版本，“y”表示次要版本，“z”表示补丁版本（也称为“z-stream”）。SUSE Edge 产品生命周期基于特定的次要版本（如“3.4”）定义，但在生命周期内会通过后续补丁更新（如“3.4.1”）持续优化。

source: SUSE Edge z-stream releases are tightly integrated and thoroughly tested as a versioned stack. Upgrade of any individual components to a different versions to those listed above is likely to result in system downtime. While it’s possible to run Edge clusters in untested configurations, it is not recommended, and it may take longer to provide resolution through the support channels.
es: Las versiones z-stream de SUSE Edge están estrechamente integradas y se han probado exhaustivamente como una pila de versión. La actualización de cualquier componente individual a una versión diferente a las indicadas anteriormente probablemente provocará una interrupción del sistema. Aunque es posible ejecutar clústeres de Edge en configuraciones no probadas, no es recomendable y es posible que la resolución a través de los canales de asistencia técnica lleve más tiempo.
ja: SUSE Edge zストリームリリースは、バージョン管理されたスタックとして緊密に統合されていて、綿密にテストされています。個々のコンポーネントを上記のバージョンとは異なるバージョンにアップグレードすると、システムのダウンタイムが発生する可能性が高くなります。テストされていない設定でEdgeクラスタを実行することは可能ですが、推奨されません。また、サポートチャンネルを通じて解決策を提供するのに時間がかかる場合があります。
pt_br: As versões z-stream do SUSE Edge são estreitamente integradas e foram testadas na íntegra como uma pilha com controle de versão. O upgrade de qualquer componente individual para versões diferentes das que estão listadas acima pode resultar em tempo de inatividade do sistema. É possível executar clusters Edge em configurações não testadas, mas não é recomendado e pode levar mais tempo para conseguir uma resolução por meio dos canais de suporte.
zh_cn: 各个 SUSE Edge z-stream 版本紧密集成，并已作为版本受控的堆栈进行全面测试。将任何一个组件升级到其他版本（而不是上面列出的版本）都可能会导致系统停机。虽然可以在未经测试的配置中运行 Edge 群集，但我们不建议这样做，而且这样可能需要花费更长的时间来通过支持渠道获得问题的解决方法。

source: Release 3.4.0
es: Versión 3.4.0
ja: リリース3.4.0
zh_cn: 3.4.0 版本

source: Availability Date: 24th September 2025
es: Fecha de disponibilidad: 24 de septiembre de 2025
ja: 公開日: 2025年9月24日
zh_cn: 发布日期：2025 年 9 月 24 日

source: Full Support End Date: 20th March 2026
es: Fecha de final de asistencia completa: 20 de marzo de 2026
ja: 完全サポート終了日: 2026年3月20日
zh_cn: 全面支持结束日期：2026 年 3 月 20 日

source: Maintenance Support End Date: 20th September 2027
es: Fecha de final de asistencia de mantenimiento: 20 de septiembre de 2027
ja: 保守サポート終了日: 2027年9月20日
zh_cn: 维护支持结束日期：2027 年 9 月 20 日

source: EOL: 21st September 2027
es: Fin de vida útil: 21 de septiembre de 2027
ja: EOL: 2027年9月21日
zh_cn: 生命周期终止日期：2027 年 9 月 21 日

source: Summary: SUSE Edge 3.4.0 is the first release in the SUSE Edge 3.4 release stream.
es: Resumen: SUSE Edge 3.4.0 es la primera versión de SUSE Edge 3.4.
ja: 概要: SUSE Edge 3.4.0はSUSE Edge 3.4リリースストリームの最初のリリースです。
zh_cn: 概述：SUSE Edge 3.4.0 是 SUSE Edge 3.4 系列版本中的第一个版本。

source: New Features
es: Funciones nuevas
ja: 新機能
pt_br: Novos recursos
zh_cn: 新功能

source: Updated to Kubernetes 1.33 and Rancher Prime 2.12
es: Se ha actualizado a Kubernetes 1.33 y Rancher Prime 2.12
ja: Kubernetes 1.33およびRancher Prime 2.12に更新
zh_cn: 已更新到 Kubernetes 1.33 和 Rancher Prime 2.12

source: Updated Rancher Turtles, Cluster API and Metal3/Ironic versions
es: Se han actualizado las versiones de Rancher Turtles, Cluster API y Metal3/Ironic
ja: Rancher Turtles、Cluster API、Metal3/Ironicのバージョンを更新
pt_br: Versões atualizadas do Rancher Turtles, da Cluster API e do Metal3/Ironic
zh_cn: 更新了 Rancher Turtles、Cluster API 和 Metal3/Ironic 版本

source: Updated to SUSE Storage (Longhorn) 1.9.1 <link xl:href="https://longhorn.io/docs/1.9.1/">Release Notes</link>
es: Se ha actualizado a SUSE Storage (Longhorn) 1.9.1 <link xl:href="https://longhorn.io/docs/1.9.1/">Notas de la versión</link>
ja: SUSE Storage (Longhorn) 1.9.1に更新(<link xl:href="https://longhorn.io/docs/1.9.1/">リリースノート</link>)
zh_cn: 已更新到 SUSE Storage (Longhorn) 1.9.1，详见<link xl:href="https://longhorn.io/docs/1.9.1/">发行说明</link>

source: More flexible deployment of AArch64 downstream clusters is now possible via the directed network provisioning flow. See <xref linkend="atip-automated-provisioning"/> for more details.
es: Ahora es posible un despliegue más flexible de clústeres descendentes AArch64 a través del flujo de aprovisionamiento de red dirigido. Consulte el <xref linkend="atip-automated-provisioning"/> para obtener más detalles.
ja: AArch64ダウンストリームクラスタのより柔軟なデプロイメントが、ダイレクトネットワークプロビジョニングフローを通じて可能になりました。詳細については、<xref linkend="atip-automated-provisioning"/>を参照してください。
zh_cn: 现在可通过定向网络置备流程更灵活地部署 AArch64 下游群集，详情请参见<xref linkend="atip-automated-provisioning"/>

source: Deployment of dual-stack clusters is now fully supported (single-stack ipv6 remains in <xref linkend="tech-previews"/>)
es: Ahora se admite por completo el despliegue de clústeres de pila dual. El despliegue IPv6 de pila única sigue siendo una tecnología en fase preliminar (<xref linkend="tech-previews"/>)
ja: デュアルスタッククラスタのデプロイメントが完全にサポートされるようになりました(シングルスタックIPv6は<xref linkend="tech-previews"/>のままです)。
zh_cn: 现已全面支持双栈群集部署（单栈 IPv6 仍处于<xref linkend="tech-previews"/>阶段）

source: BGP mode for MetalLB is now available as a tech preview see <xref linkend="tech-previews"/> and <xref linkend="guides-metallb-k3s-l3"/> for more details.
es: El modo de BGP para MetalLB está ahora disponible como tecnología en fase preliminar. Consulte la <xref linkend="tech-previews"/> y el <xref linkend="guides-metallb-k3s-l3"/> para obtener más información.
ja: MetalLBのBGPモードが技術プレビューとして利用可能になりました。詳細については、<xref linkend="tech-previews"/>および<xref linkend="guides-metallb-k3s-l3"/>を参照してください。
zh_cn: MetalLB 的 BGP 模式现已作为技术预览功能提供，详情请参见<xref linkend="tech-previews"/>和<xref linkend="guides-metallb-k3s-l3"/>

source: Edge Image Builder has been updated to 1.3.0, see <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/RELEASE_NOTES.md">Upstream Release Notes</link>
es: Edge Image Builder se ha actualizado a la versión 1.3.0, consulte las <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/RELEASE_NOTES.md">Notas de la versión originales</link>
ja: Edge Image Builderが1.3.0に更新されました。<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/RELEASE_NOTES.md">アップストリームリリースノート</link>を参照してください。
zh_cn: Edge Image Builder 已更新到 1.3.0，详见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.3/RELEASE_NOTES.md">上游发行说明</link>

source: Bug &amp; Security Fixes
es: Soluciones de seguridad y errores
ja: バグおよびセキュリティの修正
pt_br: Correções de bugs e de segurança
zh_cn: Bug 和安全修复

source: Rancher Prime 2.12 contains several bugfixes <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">Upstream Rancher Release Notes</link>
es: Rancher Prime 2.12 contiene varias correcciones de errores: <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">Notas de la versión de Rancher</link>
ja: Rancher Prime 2.12にはいくつかのバグ修正が含まれています(<link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">アップストリームRancherリリースノート</link>)
zh_cn: Rancher Prime 2.12 包含多项 bug 修复，详见<link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">上游 Rancher 发行说明</link>

source: Rancher Prime 2.12 contains a fix for issues related to AppVersion when determining extension upgrade availability, which impacted operation with Edge charts <link xl:href="https://github.com/rancher/dashboard/issues/14204">Upstream Issue</link>
es: Rancher Prime 2.12 contiene una corrección para problemas relacionados con AppVersion al determinar la disponibilidad de la actualización de la extensión, lo que afectaba al funcionamiento con charts de Edge: <link xl:href="https://github.com/rancher/dashboard/issues/14204">Problema original</link>
ja: Rancher Prime 2.12には、拡張機能のアップグレードの利用可能性を判断する際のAppVersionに関連する問題の修正が含まれています。この問題はEdgeチャートでの動作に影響を与えていました(<link xl:href="https://github.com/rancher/dashboard/issues/14204">アップストリームの問題</link>)
zh_cn: Rancher Prime 2.12 修复了与 AppVersion 相关的问题，该问题曾影响扩展升级可用性判断，进而影响与 Edge chart 的兼容，详见<link xl:href="https://github.com/rancher/dashboard/issues/14204">上游问题</link>

source: SUSE Storage (Longhorn) 1.9.1 contains several bugfixes <link xl:href="https://github.com/longhorn/longhorn/releases/tag/v1.9.1">Upstream Longhorn Bug Fixes</link>
es: SUSE Storage (Longhorn) 1.9.1 contiene varias correcciones de errores: <link xl:href="https://github.com/longhorn/longhorn/releases/tag/v1.9.1">Corrección de errores de Longhorn</link>
ja: SUSE Storage (Longhorn) 1.9.1には複数のバグ修正が含まれています(<link xl:href="https://github.com/longhorn/longhorn/releases/tag/v1.9.1">アップストリームのLonghornバグ修正</link>)
zh_cn: SUSE Storage (Longhorn) 1.9.1 包含多项 bug 修复，详见<link xl:href="https://github.com/longhorn/longhorn/releases/tag/v1.9.1">上游 Longhorn bug 修复</link>

source: The updated Metal<superscript>3</superscript> chart fixes an issue where the wrong MAC may be collected for bonded interfaces during inspection <link xl:href="https://bugs.launchpad.net/ironic-python-agent/+bug/2103450">Upstream IPA issue</link>
es: El chart actualizado de Metal<superscript>3</superscript> soluciona un problema por el que se podía recopilar una dirección MAC errónea para interfaces vinculadas durante la inspección: <link xl:href="https://bugs.launchpad.net/ironic-python-agent/+bug/2103450">Problema de IPA</link>
ja: 更新されたMetal<superscript>3</superscript>チャートは、検査中にボンディングされたインタフェースに対して間違ったMACが収集される可能性のある問題を修正しました(<link xl:href="https://bugs.launchpad.net/ironic-python-agent/+bug/2103450">アップストリームのIPAの問題</link>)
zh_cn: 更新的 Metal<superscript>3</superscript> chart 修复了检查期间可能为绑定接口收集错误 MAC 地址的问题，详见<link xl:href="https://bugs.launchpad.net/ironic-python-agent/+bug/2103450">上游 IPA 问题</link>

source: The updated Metal<superscript>3</superscript> chart fixes an issue where the deployment may not be correctly restarted on ConfigMap updates <link xl:href="https://github.com/suse-edge/charts/issues/219">Upstream Issue</link>
es: El chart actualizado de Metal<superscript>3</superscript> soluciona un problema por el que no se podía reiniciar correctamente el despliegue si se actualizaba ConfigMap: <link xl:href="https://github.com/suse-edge/charts/issues/219">Problema original</link>
ja: 更新されたMetal<superscript>3</superscript>チャートは、ConfigMapの更新時にデプロイメントが正しく再起動されない可能性のある問題を修正しました(<link xl:href="https://github.com/suse-edge/charts/issues/219">アップストリームの問題</link>)
zh_cn: 更新的 Metal<superscript>3</superscript> chart 修复了 ConfigMap 更新时部署可能无法正确重启的问题，详见<link xl:href="https://github.com/suse-edge/charts/issues/219">上游问题</link>

source: The Rancher Turtles update includes a fix which resolves an issue where MachineTemplate ownerReferences were not applied by the RKE2 CAPI provider <link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/500">Upstream Issue</link>
es: La actualización de Rancher Turtles incluye una solución a un problema por el que el proveedor de CAPI de RKE2 no aplicaba las ownerReferences de MachineTemplate: <link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/500">Problema original</link>
ja: Rancher Turtlesの更新には、MachineTemplate ownerReferencesがRKE2 CAPIプロバイダによって適用されなかった問題を解決する修正が含まれています(<link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/500">アップストリームの問題</link>)
zh_cn: Rancher Turtles 更新包含一项修复，解决了 RKE2 CAPI 提供程序未应用 MachineTemplate ownerReferences 的问题，详见<link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/500">上游问题</link>

source: Known Issues
es: Problemas conocidos
ja: 既知の問題
pt_br: Problemas conhecidos
zh_cn: 已知问题

source: If deploying new clusters, please follow <xref linkend="guides-kiwi-builder-images"/> to build fresh images first as this is now the first step required to create clusters for both AMD64/Intel 64 and AArch64 architectures as well as management and downstream clusters.
es: Si va a desplegar nuevos clústeres, siga las instrucciones del <xref linkend="guides-kiwi-builder-images"/> para crear primero imágenes nuevas, ya que ahora este es el primer paso necesario para crear clústeres tanto para las arquitecturas AMD64/Intel 64 y AArch64 como para los clústeres de gestión y los clústeres descendentes.
ja: 新しいクラスタをデプロイする場合は、<xref linkend="guides-kiwi-builder-images"/>に従って、まず新規イメージを構築してください。これはAMD64/Intel 64とAArch64アーキテクチャ両方のクラスタ、および管理クラスタとダウンストリームクラスタを作成するために必要な最初の手順です。
pt_br: Se você está implantando novos clusters, siga o <xref linkend="guides-kiwi-builder-images"/> para primeiro criar as novas imagens, já que esta é a primeira etapa necessária para criar clusters para ambas as arquiteturas AMD64/Intel 64 e AArch64, além dos clusters de gerenciamento e downstream.
zh_cn: 如果要部署新群集，请先按照<xref linkend="guides-kiwi-builder-images"/>所述构建全新映像。现在，无论是要创建 AMD64/Intel 64 还是 AArch64 体系结构的群集（包括管理群集和下游群集），都必须先执行此步骤。

source: When deploying via Edge Image Builder, <literal>HelmChartConfigs</literal> manifests may fail if they are put in the <literal>kubernetes/manifests</literal> configuration directory. Instead it is reccomended to place any <literal>HelmChartConfigs</literal> in <literal>/var/lib/rancher/{rke2/k3s}/server/manifests/</literal> using the EIB os-files interface, see <xref linkend="mgmt-cluster-directory-structure"/> for example. Failure to do this may cause nodes to stay in <literal>NotReady</literal> state on initial startup, as discussed in <link xl:href="https://github.com/rancher/rke2/issues/8357">#8357 RKE2 issue</link>
es: Cuando se realiza el despliegue con Edge Image Builder, los manifiestos <literal>HelmChartConfigs</literal> pueden fallar si se colocan en el directorio de configuración <literal>kubernetes/manifests</literal>. Se recomienda colocar cualquier <literal>HelmChartConfigs</literal> en <literal>/var/lib/rancher/{rke2/k3s}/server/manifests/</literal> mediante la interfaz os-files de EIB. Consulte <xref linkend="mgmt-cluster-directory-structure"/> para ver un ejemplo. Si no lo hace así, durante el arranque inicial, los nodos podrían quedarse en estado <literal>NotReady</literal>, como se explica en: <link xl:href="https://github.com/rancher/rke2/issues/8357">Problema n.º 8357 de RKE2</link>
ja: Edge Image Builder経由でデプロイする場合、<literal>HelmChartConfigs</literal>マニフェストを<literal>kubernetes/manifests</literal>設定ディレクトリに配置すると失敗する可能性があります。代わりに、EIB os-filesインタフェースを使用して、<literal>HelmChartConfigs</literal>を<literal>/var/lib/rancher/{rke2/k3s}/server/manifests/</literal>に配置することをお勧めします。例については、<xref linkend="mgmt-cluster-directory-structure"/>を参照してください。これを実行しないと、<link xl:href="https://github.com/rancher/rke2/issues/8357">#8357 RKE2の問題</link>で説明されているように、ノードが初期起動時に<literal>NotReady</literal>状態のままになる可能性があります。
zh_cn: 通过 Edge Image Builder 部署时，如果将 <literal>HelmChartConfigs</literal> 清单放入 <literal>kubernetes/manifests</literal> 配置目录，可能会导致部署失败。建议改为通过 EIB os-files 接口将所有 <literal>HelmChartConfigs</literal> 放置在 <literal>/var/lib/rancher/{rke2/k3s}/server/manifests/</literal> 目录中，示例请参见<xref linkend="mgmt-cluster-directory-structure"/>。若不如此操作，可能导致节点首次启动时处于 <literal>NotReady</literal> 状态，详见 <link xl:href="https://github.com/rancher/rke2/issues/8357">RKE2 问题 #8357</link>
