Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: While the current version of Elemental has a way to build its own installation media, in SUSE Edge 3.3.1 we do this with Kiwi and Edge Image Builder instead, so the resulting system is built with <link xl:href="https://www.suse.com/products/micro/">SUSE Linux Micro</link> as the base Operating System.
pt_br: A versão atual do Elemental conta com um método para criar a própria mídia de instalação. No SUSE Edge 3.3.1, fazemos isso com o Kiwi e o Edge Image Builder, portanto, o sistema resultante é desenvolvido com o <link xl:href="https://www.suse.com/products/micro/">SUSE Linux Micro</link> como o sistema operacional de base.

source: Edge Image Builder 1.2.1 supports customizing SUSE Linux Micro 6.1 images. Older versions, such as SUSE Linux Enterprise Micro 5.5, or 6.0 are not supported.
pt_br: O Edge Image Builder 1.2.1 suporta a personalização de imagens no SUSE Linux Micro 6.1. As versões mais antigas, como o SUSE Linux Enterprise Micro 5.5 ou 6.0, não são compatíveis.

source: The definition file describes the majority of configurable options that the Edge Image Builder supports, a full example of options can be found <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/pkg/image/testdata/full-valid-example.yaml">here</link>, and we would recommend that you take a look at the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">upstream building images guide</link> for more comprehensive examples than the one we’re going to run through below. Let’s start with a very basic definition file for our OS image:
pt_br: O arquivo de definição descreve grande parte das opções configuráveis disponíveis no Edge Image Builder. Um exemplo completo das opções é apresentado <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/pkg/image/testdata/full-valid-example.yaml">aqui</link>, e recomendamos que você leia o <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">guia de imagens de criação upstream</link> para ver exemplos mais detalhados do que vamos executar a seguir. Vamos começar com um arquivo de definição bem básico para a nossa imagem de sistema operacional:

source: It’s also possible to add additional users, create the home directories, set user-id’s, add ssh-key authentication, and modify group information. Please refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">upstream building images guide</link> for further examples.
pt_br: É possível também adicionar outros usuários, criar diretórios pessoais, definir IDs de usuário, adicionar autenticação por chave SSH e modificar informações de grupo. Consulte o <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">guia de criação de imagens upstream</link> para ver mais exemplos.

source: A more comprehensive guide with additional examples can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/installing-packages.md">upstream installing packages guide</link>.
pt_br: Um guia mais completo com exemplos adicionais está disponível no <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/installing-packages.md">guia de instalação de pacotes upstream</link>.

source: This method enables not only the deployment of the customized operating system, but also the ability to specify Kubernetes configuration, any additional layered components via Helm charts, and any user workloads via supplied Kubernetes manifests. However, the design principle behind using this method is that we default to assuming that the user is wanting to air-gap and therefore any items specified in the image definition will be pulled into the image, which includes user-supplied workloads, where EIB will make sure that any discovered images that are required by definitions supplied are copied locally, and are served by the embedded image registry in the resulting deployed system.
pt_br: Com esse método, é possível implantar o sistema operacional personalizado e especificar a configuração do Kubernetes, componentes adicionais em camadas por gráficos Helm e cargas de trabalho de usuários por manifestos fornecidos pelo Kubernetes. No entanto, o princípio do projeto por trás do uso desse método é que já consideramos que o usuário deseja se desconectar e, portanto, os itens especificados na definição da imagem serão inseridos na imagem, o que inclui as cargas de trabalho fornecidas pelo usuário. O EIB garantirá que todas as imagens descobertas necessárias, conforme as definições especificadas, sejam copiadas localmente e enviadas pelo registro de imagens incorporado ao sistema implantado resultante.

source: Further examples of options such as multi-node deployments, custom networking, and Helm chart options/values can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">upstream documentation</link>.
pt_br: Há outros exemplos de opções, como implantações de vários nós, rede personalizada e opções/valores do gráfico Helm, disponíveis na <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md">documentação upstream</link>.

source: If the image build process fails, refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/debugging.md">upstream debugging guide</link>.
pt_br: Se o processo de criação da imagem falhar, consulte o <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/debugging.md">guia de depuração upstream</link>.

source: For instructions on how to test the newly built CRB image, refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/testing-guide.md">upstream image testing guide</link>.
pt_br: Para obter instruções de como testar a imagem CRB recém-criada, consulte o <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/testing-guide.md">guia de teste de imagem upstream</link>.

source: If you already have an instance of the latest version of SUSE Multi-Linux Manager 5.0 running, you can skip this step.
pt_br: Se você já tem uma instância da versão mais recente do SUSE Multi-Linux Manager 5.0 em execução, pode ignorar esta etapa.

source: In this quick start we’re using the "qcow2" image <literal>SUSE-Manager-Server.x86_64-5.0.2-Qcow-2024.12.qcow2</literal> for AMD64/Intel 64 that you can find at <link xl:href="https://www.suse.com/download/suse-manager/">https://www.suse.com/download/suse-manager/</link> or in the SUSE Customer Center. This image will work as a virtual machine on hypervisors like KVM. Please always check for the newest version of the image and use it for new installations.
pt_br: Neste início rápido, usamos a imagem "qcow2" <literal>SUSE-Manager-Server.x86_64-5.0.2-Qcow-2024.12.qcow2</literal> para AMD64/Intel 64, que você encontra em <link xl:href="https://www.suse.com/download/suse-manager/">https://www.suse.com/download/suse-manager/</link> ou no SUSE Customer Center. Essa imagem funciona como uma máquina virtual em hipervisores do tipo KVM. Verifique e use sempre a versão mais recente da imagem para novas instalações.

source: For the next step you need two registration codes that you can find in the SUSE Customer Center:
pt_br: Para a etapa seguinte, são necessários dois códigos de registro, que você encontra no SUSE Customer Center:

source: Your registration code for SLE Micro 5.5
pt_br: Seu código de registro do SLE Micro 5.5

source: Your registration code for the SUSE Multi-Linux Manager Extension
pt_br: Seu código de registro da extensão do SUSE Multi-Linux Manager

source: Before you install and configure the SUSE Multi-Linux Manager Server container, you need to prepare the additional block device that you’ve previously added. For that, you need to know the name the virtual machine has given to the device. For example, if the block device is <literal>/dev/vdb</literal>, you can configure it to be used for SUSE Multi-Linux Manager using the following command:
pt_br: Antes de instalar e configurar o contêiner do SUSE Multi-Linux Manager Server, você precisa preparar o dispositivo de blocos adicional que já incluiu. Para isso, é necessário saber o nome que a máquina virtual atribuiu ao dispositivo. Por exemplo, se o dispositivos de blocos é <literal>/dev/vdb</literal>, configure-o para uso no SUSE Multi-Linux Manager executando o seguinte comando:

source: Select <menuchoice><guimenu>Admin</guimenu> <guimenu>Setup Wizard</guimenu></menuchoice>.
pt_br: Selecione <menuchoice><guimenu>Admin</guimenu> <guimenu>Assistente de configuração</guimenu></menuchoice>.

source: Once the list is populated, you use the filter to only show "Micro 6". Check the box for SUSE Linux Micro 6.1 for the hardware architecture your edge nodes will run on (<literal>x86_64</literal> or <literal>aarch64</literal>).
pt_br: Depois que a lista for preenchida, use o filtro para mostrar apenas "Micro 6". Marque a caixa do SUSE Linux Micro 6.1 relativa à arquitetura de hardware em que seus nós de borda serão executados (<literal>x86_64</literal> ou <literal>aarch64</literal>).

source: Building AArch64 images on an Arm-based build host is a technology preview in SUSE Edge 3.3.1. It will most likely work, but isn’t supported yet. If you want to try it out, you need to be running Podman on a 64-bit Arm machine, and you need to replace "x86_64" in all the examples and code snippets with "aarch64".
pt_br: A criação de imagens AArch64 em hosts de build baseados no Arm é uma prévia de tecnologia no SUSE Edge 3.3.1. É muito provável que ela funcione, mas ainda não tem suporte. Se você quer tentar, precisa ter o Podman em uma máquina Arm de 64 bits e substituir "x86_64" em todos os exemplos e trechos de código por "aarch64".

source: We use the option <literal>noGPGCheck: true</literal> because we aren’t going to provide a GPG key to check RPM packages. A comprehensive guide with a more secure setup that we recommend for production use can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/installing-packages.md">upstream installing packages guide</link>.
pt_br: Usamos a opção <literal>noGPGCheck: true</literal> porque não vamos fornecer uma chave GPG para verificar pacotes RPM. Um guia completo com uma configuração mais segura recomendada para uso em produção está disponível no <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/installing-packages.md">guia de instalação de pacotes upstream</link>.

source: See Rancher documentation at <link xl:href="https://ranchermanager.docs.rancher.com/v2.11">https://ranchermanager.docs.rancher.com/v2.11</link>.
pt_br: Consulte a documentação do Rancher em <link xl:href="https://ranchermanager.docs.rancher.com/v2.11">https://ranchermanager.docs.rancher.com/v2.11</link>.

source: See <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/rancher-extensions">Rancher documentation</link></literal> for general information about Rancher Dashboard Extensions.
pt_br: Consulte a <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/rancher-extensions">documentação do Rancher</link></literal> para obter informações gerais sobre as extensões do Rancher Dashboard.

source: All of the SUSE Edge 3.3.1 components, including dashboard extensions, are distributed as OCI artifacts. To install SUSE Edge Extensions you can use Rancher Dashboard UI, Helm or Fleet:
pt_br: Todos os componentes do SUSE Edge 3.3.1, incluindo as extensões de dashboard, são distribuídos como artefatos OCI. Para instalar as extensões do SUSE Edge, você pode usar a IU do Rancher Dashboard, o Helm ou o Fleet:

source: Once the extension is installed Rancher UI prompts to reload the page as described in the <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/rancher-extensions#installing-extensions">Installing Extensions Rancher documentation page</link></literal>.
pt_br: Depois que a extensão for instalada, a IU do Rancher solicitará que a página seja recarregada, conforme descrito na <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/rancher-extensions#installing-extensions">página da documentação de instalação de extensões do Rancher</link></literal>.

source: For information about how Fleet works, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/architecture">Fleet Architecture</link>.
pt_br: Para obter informações sobre o funcionamento do Fleet, consulte a <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/architecture">arquitetura do Fleet</link>.

source: Comprehensive documentation for the usage and testing of Edge Image Builder can be found <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.2/docs">here</link>.
pt_br: A documentação completa sobre uso e teste do Edge Image Builder está disponível <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.2/docs">aqui</link>.

source: Once you are familiar with this tool, please find some more useful information on our <link xl:href="../tips/eib.adoc">Tips and tricks</link> page.
pt_br: Depois que você se familiarizar com a ferramenta, encontre mais informações úteis em nossa página de <link xl:href="../tips/eib.adoc">dicas de truques</link>.

source: In SUSE Edge 3.3.1 we do <emphasis role="strong">not</emphasis> leverage the operating system management aspects of Elemental, and therefore it’s not possible to manage your operating system patching via Rancher. Instead of using the Elemental tools to build deployment images, SUSE Edge uses the Edge Image Builder tooling, which consumes the registration configuration.
pt_br: No SUSE Edge 3.3.1, <emphasis role="strong">não</emphasis> aproveitamos os aspectos de gerenciamento de sistema operacional do Elemental e, portanto, não é possível gerenciar a aplicação de patches de seu sistema operacional usando o Rancher. Em vez de usar as ferramentas do Elemental para criar imagens de implantação, o SUSE Edge usa as ferramentas do Edge Image Builder, que consome a configuração de registro.

source: For additional help installing open-iscsi, refer to the <link xl:href="https://longhorn.io/docs/1.8.1/deploy/install/#installing-open-iscsi">official Longhorn documentation</link>.
pt_br: Para obter mais ajuda na instalação do open-iscsi, consulte a <link xl:href="https://longhorn.io/docs/1.8.1/deploy/install/#installing-open-iscsi">documentação oficial do Longhorn</link>.

source: There are several ways to install SUSE Storage on your Kubernetes clusters. This guide will follow through the Helm installation, however feel free to follow the <link xl:href="https://longhorn.io/docs/1.8.1/deploy/install/">official documentation</link> if another approach is desired.
pt_br: Há várias maneiras de instalar o SUSE Storage em clusters Kubernetes. Este guia adota a instalação pelo Helm, mas você poderá seguir a <link xl:href="https://longhorn.io/docs/1.8.1/deploy/install/">documentação oficial</link> caso queira outra abordagem.

source: The concept of storage in Kubernetes is a complex, but important topic. We briefly mentioned some of the most common Kubernetes resources, however, we suggest to familiarize yourself with the <link xl:href="https://longhorn.io/docs/1.8.1/terminology/">terminology documentation</link> that Longhorn offers.
pt_br: O conceito de armazenamento no Kubernetes é um tópico complexo, porém importante. Mencionamos rapidamente alguns do recursos mais comuns do Kubernetes, mas sugerimos que você se familiarize com a <link xl:href="https://longhorn.io/docs/1.8.1/terminology/">documentação de terminologia</link> que o Longhorn oferece.

source: Customizing any of the Helm chart values is possible via a separate file provided under <literal>helm.charts[].valuesFile</literal>. Refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#kubernetes">upstream documentation</link> for details.
pt_br: A personalização de qualquer um dos valores do gráfico Helm é possível com um arquivo separado fornecido em <literal>helm.charts[].valuesFile</literal>. Consulte a <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.2/docs/building-images.md#kubernetes">documentação upstream</link> para obter detalhes.

source: SUSE Edge uses MetalLB in two key ways:
pt_br: O SUSE Edge usa o MetalLB de duas maneiras principais:

source: Installation of MetalLB in L2 mode is described in <xref linkend="guides-metallb-k3s"/>.
pt_br: A instalação do MetalLB no modo L2 está descrita no <xref linkend="guides-metallb-k3s"/>.

source: This process can also be done through the Rancher UI, if such is available. For more information, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link>.
pt_br: Também é possível realizar esse processo pela IU do Rancher, se disponível. Para obter mais informações, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Accessing Fleet in the Rancher UI</link> (Acessando o Fleet na IU do Rancher).

source: This will install SUC version 0.15.2 which is needed by the Edge 3.3.1 platform.
pt_br: Isto instalará a versão 0.15.2 do SUC, que é necessária para a plataforma Edge 3.3.1.

source: Pods deployed for SUC Plans are kept alive <emphasis role="strong">15</emphasis> minutes after a successful execution. After that they are removed by the corresponding Job that created them. To have access to the Pod’s logs after this time period, you should enable logging for your cluster. For information on how to do this in Rancher, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/logging">Rancher Integration with Logging Services</link>.
pt_br: Os pods implantados para os planos do SUC se mantêm ativos por <emphasis role="strong">15</emphasis> minutos após a execução bem-sucedida e, depois disso, são removidos pelo job correspondente que os criou. Para ter acesso aos registros do pod após esse período, habilite o registro em seu cluster. Para obter informações sobre como fazer isso no Rancher, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.11/integrations-in-rancher/logging">Rancher Integration with Logging Services</link> (Integração do Rancher a serviços de registro).

source: This guide demonstrates using a MetalLB service to expose the RKE2/K3s API externally on an HA cluster with three control-plane nodes. To achieve this, a Kubernetes Service of type <literal>LoadBalancer</literal> and Endpoints will be manually created. The Endpoints keep the IPs of all control plane nodes available in the cluster. For the Endpoint to be continuously synchronized with the events occurring in the cluster (adding/removing a node or a node goes offline), the Endpoint Copier Operator (<xref linkend="components-eco"/>) will be deployed. The operator monitors the events happening in the default <literal>kubernetes</literal> Endpoint and updates the managed one automatically to keep them in sync. Since the managed Service is of type <literal>LoadBalancer</literal>, MetalLB assigns it a static <literal>ExternalIP</literal>. This <literal>ExternalIP</literal> will be used to communicate with the API Server.
pt_br: Este guia demonstra como usar um serviço do MetalLB para expor a API RKE2/K3s externamente em um cluster de alta disponibilidade com três nós do plano de controle. Para isso, um serviço do Kubernetes do tipo <literal>LoadBalancer</literal> e endpoints serão manualmente criados. Os endpoints armazenam os IPs de todos os nós do plano de controle disponíveis no cluster. Para que o endpoint sempre se mantenha sincronizado com os eventos que ocorrem no cluster (adicionar/remover um nó ou quando um nó fica offline), o Endpoint Copier Operator (<xref linkend="components-eco"/>) é implantado. O operador monitora os eventos ocorridos no endpoint padrão <literal>kubernetes</literal> e atualiza aquele gerenciado automaticamente para mantê-los sincronizados. Como o serviço gerenciado é do tipo <literal>LoadBalancer</literal>, o MetalLB o atribui a um <literal>ExternalIP</literal> estático. Esse <literal>ExternalIP</literal> será usado para comunicação com o API Server.

source: <emphasis role="strong">NOTE:</emphasis> Ensure that the IP addresses of the <literal>ip-pool</literal> IPAddressPool do not overlap with the IP addresses previously selected for the <literal>LoadBalancer</literal> service.
pt_br: <emphasis role="strong">NOTA:</emphasis> Assegure que os endereços IP IPAddressPool do <literal>ip-pool</literal> não sobreponham os endereços IP já selecionados para o serviço <literal>LoadBalancer</literal>.

source: Create a separate <literal>IpAddressPool</literal> that will be used only for the managed Service.
pt_br: Crie um <literal>IpAddressPool</literal> separado para usar apenas para o serviço gerenciado.

source: Now, the <literal>kubernetes-vip</literal> Service should be deployed, which will be reconciled by the operator and an Endpoint with the configured ports and IP will be created.
pt_br: Agora o serviço <literal>kubernetes-vip</literal>, que será reconciliado pelo operador, deve ser implantado, e um endpoint com as portas e o IP configurados será criado.

source: Ensure that the <literal>kubernetes-vip</literal> and <literal>kubernetes</literal> Endpoints resources in the <literal>default</literal> namespace point to the same IPs.
pt_br: Garanta que os recursos dos endpoints <literal>kubernetes-vip</literal> e <literal>kubernetes</literal> no namespace <literal>default</literal> apontem para os mesmos IPs.

source: The <literal>kubernetes</literal> section is optional, and it defines the Kubernetes type and version. We are going to use the RKE2 distribution. Use <literal>kubernetes.version: v1.32.4+k3s1</literal> if K3s is desired instead. Unless explicitly configured via the <literal>kubernetes.nodes</literal> field, all clusters we bootstrap in this guide will be single-node ones.
pt_br: A seção <literal>kubernetes</literal> é opcional e define o tipo e a versão do Kubernetes. Vamos usar a distribuição RKE2. Em vez disso, se você preferir o K3s, use <literal>kubernetes.version: v1.32.4+k3s1</literal>. Exceto se claramente configurado no campo <literal>kubernetes.nodes</literal>, todos os clusters que inicializamos neste guia são de nó único.

source: The <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.11.2">Rancher 2.11.2</link> release assets contain a <literal>rancher-images.txt</literal> file which lists all the images required for an air-gapped installation.
pt_br: Os ativo da versão do <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.11.2">Rancher 2.11.2</link> contêm um arquivo <literal>rancher-images.txt</literal> que lista todas as imagens necessárias para uma instalação air-gapped.
