Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Maintains a flexible platform strategy with vendor-neutral APIs and 100% open source.
es: Mantiene una estrategia de plataforma flexible con API independientes del proveedor y 100 % de código abierto.
ja: ベンダに依存しないAPIを備え、100%オープンソースであるため、柔軟なプラットフォーム戦略を維持します。
pt_br: Mantém uma estratégia de plataforma flexível com APIs independentes de fornecedor e código 100% aberto.
zh_cn: 凭借不限供应商的 API 及 100% 开源特性，保持灵活的平台策略。

source: Concept &amp; Architecture
es: Concepto y arquitectura
ja: コンセプトとアーキテクチャ
pt_br: Conceito e arquitetura
zh_cn: 概念和体系结构

source: SUSE Telco Cloud is a platform designed for hosting modern, cloud native, Telco applications at scale from core to edge.
es: SUSE Telco Cloud es una plataforma diseñada para alojar aplicaciones de telecomunicaciones modernas y nativas de la nube a gran escala, desde el núcleo hasta la periferia.
ja: SUSE Telco Cloudは、クラウドネイティブな最新の通信事業者向けアプリケーションをコアからエッジまで大規模にホストするために設計されたプラットフォームです。
zh_cn: SUSE Telco Cloud 是一个专为大规模托管现代化云原生电信应用程序而设计的平台，支持从核心网络到边缘网络的部署。

source: This page explains the architecture and components used in SUSE Telco Cloud.
es: Esta página explica la arquitectura y los componentes usados en SUSE Telco Cloud.
ja: このページでは、SUSE Telco Cloudで使用されるアーキテクチャとコンポーネントについて説明します。
zh_cn: 本章介绍 SUSE Telco Cloud 所采用的体系结构和组件。

source: SUSE Telco Cloud Architecture
es: Arquitectura de SUSE Telco Cloud
ja: SUSE Telco Cloudアーキテクチャ
zh_cn: SUSE Telco Cloud 体系结构

source: The following diagram shows the high-level architecture of SUSE Telco Cloud:
es: El siguiente diagrama muestra la arquitectura general de SUSE Telco Cloud:
ja: 次の図は、SUSE Telco Cloudの高レベルアーキテクチャを示しています。
zh_cn: 下图显示了 SUSE Telco Cloud 的总体体系结构：

source: product atip architecture1
es: arquitectura de producto atip 1
ja: 製品atipアーキテクチャ1
pt_br: arquitetura1 produto atip
zh_cn: ATIP 产品体系结构 1

source: There are two different blocks, the management stack and the runtime stack:
es: Hay dos bloques diferentes: la pila de gestión y la pila de entorno de ejecución:
ja: 異なる2つのブロックがあります。管理スタックとランタイムスタックです。
pt_br: Há dois blocos diferentes; pilha de gerenciamento e pilha de runtime:
zh_cn: 有两个不同的区块 - 管理堆栈和运行时堆栈：

source: <emphasis role="strong">Management stack</emphasis>: This is the part of SUSE Telco Cloud that is used to manage the provision and lifecycle of the runtime stacks. It includes the following components:
es: <emphasis role="strong">Pila de gestión</emphasis>: es la parte de SUSE Telco Cloud que se emplea para gestionar el aprovisionamiento y el ciclo de vida de las pilas de entornos de ejecución. Incluye los siguientes componentes:
ja: <emphasis role="strong">管理スタック</emphasis>: SUSE Telco Cloud内でランタイムスタックのプロビジョニングとライフサイクルを管理するために使用される部分です。次のコンポーネントが含まれます。
zh_cn: <emphasis role="strong">管理堆栈</emphasis>：SUSE Telco Cloud 的这一组成部分用于管理运行时堆栈的置备和生命周期，包含以下组件：

source: Multi-cluster management in public and private cloud environments with Rancher (<xref linkend="components-rancher"/>)
es: Gestión de múltiples clústeres en entornos de nube pública y privada con Rancher (<xref linkend="components-rancher"/>)
ja: Rancher (<xref linkend="components-rancher"/>)を使用した、パブリッククラウド環境とプライベートクラウド環境のマルチクラスタ管理
pt_br: Gerenciamento multicluster em ambientes de nuvem pública e privada com o Rancher (<xref linkend="components-rancher"/>)
zh_cn: 使用 Rancher 在公有云和私有云环境中进行多群集管理（<xref linkend="components-rancher"/>）

source: Bare-metal support with Metal3 (<xref linkend="components-metal3"/>), MetalLB (<xref linkend="components-metallb"/>) and <literal>CAPI</literal> (Cluster API) infrastructure providers
es: Asistencia bare metal con proveedores de infraestructura Metal3 (<xref linkend="components-metal3"/>), MetalLB (<xref linkend="components-metallb"/>) y <literal>CAPI</literal> (Cluster API)
ja: Metal3 (<xref linkend="components-metal3"/>)、MetalLB (<xref linkend="components-metallb"/>)、および<literal>CAPI</literal> (Cluster API)インフラストラクチャプロバイダを使用したベアメタルサポート
pt_br: Suporte a bare metal com os provedores de infraestrutura Metal3 (<xref linkend="components-metal3"/>), MetalLB (<xref linkend="components-metallb"/>) e <literal>CAPI</literal> (Cluster API)
zh_cn: 使用 Metal3（<xref linkend="components-metal3"/>）、MetalLB（<xref linkend="components-metallb"/>）和 <literal>CAPI</literal> (Cluster API) 基础架构提供程序来提供裸机支持

source: Comprehensive tenant isolation and <literal>IDP</literal> (Identity Provider) integrations
es: Aislamiento completo de inquilinos e integraciones <literal>IDP</literal> (proveedor de identidad)
ja: 包括的なテナント分離と<literal>IDP</literal> (IDプロバイダ)の統合
pt_br: Isolamento completo de locatários e integrações de <literal>IDP</literal> (provedor de identidade)
zh_cn: 全面的租户隔离和 <literal>IDP</literal>（身份提供程序）集成

source: Large marketplace of third-party integrations and extensions
es: Gran mercado de integraciones y extensiones de terceros
ja: サードパーティ統合と拡張機能の大規模なマーケットプレイス
pt_br: Amplo mercado de integrações e extensões de terceiros
zh_cn: 第三方集成和扩展大型商城

source: Vendor-neutral API and rich ecosystem of providers
es: API independiente del proveedor y un rico ecosistema de proveedores
ja: ベンダに依存しないAPIと充実したプロバイダエコシステム
pt_br: API independente de fornecedor e vasto ecossistema de provedores
zh_cn: 不限供应商的 API 和丰富的提供商生态

source: Control the SUSE Linux Micro transactional updates
es: Control de las actualizaciones transaccionales de SUSE Linux Micro
ja: SUSE Linux Microのトランザクション更新の制御
pt_br: Controle das atualizações transacionais do SUSE Linux Micro
zh_cn: 控制 SUSE Linux Micro 事务更新

source: GitOps Engine for managing the lifecycle of the clusters using Git repositories with Fleet (<xref linkend="components-fleet"/>)
es: Motor GitOps para gestionar el ciclo de vida de los clústeres mediante repositorios Git con Fleet (<xref linkend="components-fleet"/>)
ja: GitリポジトリとFleet (<xref linkend="components-fleet"/>)を使用してクラスタのライフサイクルを管理するGitOpsエンジン
pt_br: GitOps Engine para gerenciar o ciclo de vida dos clusters usando repositórios Git com o Fleet (<xref linkend="components-fleet"/>)
zh_cn: GitOps 引擎，可以结合使用 Git 储存库和 Fleet（<xref linkend="components-fleet"/>）来管理群集的生命周期

source: <emphasis role="strong">Runtime stack</emphasis>: This is the part of SUSE Telco Cloud that is used to run the workloads.
es: <emphasis role="strong">Pila de entorno de ejecución</emphasis>: es la parte de SUSE Telco Cloud que se emplea para ejecutar las cargas de trabajo.
ja: <emphasis role="strong">ランタイムスタック</emphasis>: SUSE Telco Cloud内でワークロードを実行するために使用される部分です。
zh_cn: <emphasis role="strong">运行时栈</emphasis>：这是 SUSE Telco Cloud 中用于运行工作负载的部分。

source: RKE2 (<xref linkend="components-rke2"/>) serves as the security-hardened, lightweight Kubernetes distribution, optimized for edge and compliance-focused telecom environments.
es: RKE2 (<xref linkend="components-rke2"/>) es una distribución de Kubernetes ligera y con seguridad reforzada optimizada para entornos periféricos y de telecomunicaciones centrados en el cumplimiento.
ja: RKE2 (<xref linkend="components-rke2"/>)。エッジ環境およびコンプライアンス重視の通信環境向けに最適化された、セキュリティが強化された軽量のKubernetesディストリビューションとして機能します。
zh_cn: RKE2（<xref linkend="components-rke2"/>）是一款经过安全强化的轻量级 Kubernetes 发行版，专为边缘环境和注重合规性的电信环境优化。

source: SUSE Security (<xref linkend="components-suse-security"/>) to enable security features like image vulnerability scanning, deep packet inspection and automatic intra-cluster traffic control.
es: SUSE Security (<xref linkend="components-suse-security"/>) para habilitar funciones de seguridad como el análisis de vulnerabilidades de imágenes, la inspección profunda de paquetes y el control automático del tráfico dentro del clúster.
ja: SUSE Security (<xref linkend="components-suse-security"/>)。イメージの脆弱性スキャン、ディープパケットインスペクション、クラスタ内の自動トラフィック制御などのセキュリティ機能を実現します。
pt_br: SUSE Security (<xref linkend="components-suse-security"/>) para habilitar recursos de segurança, como verificação de vulnerabilidades de imagem, inspeção detalhada de pacotes e controle automático do tráfego intracluster.
zh_cn: SUSE Security（<xref linkend="components-suse-security"/>），可用于实现映像漏洞扫描、深度数据包检测和群集内自动流量控制等安全功能。

source: Block Storage with SUSE Storage (<xref linkend="components-suse-storage"/>) to enable a simple and easy way to use a cloud native storage solution.
es: Almacenamiento en bloques con SUSE Storage (<xref linkend="components-suse-storage"/>) para permitir una forma sencilla y fácil de utilizar una solución de almacenamiento nativa en la nube.
ja: ブロックストレージとSUSE Storage (<xref linkend="components-suse-storage"/>)。クラウドネイティブのストレージソリューションをシンプルかつ簡単に使用できます。
pt_br: Armazenamento em blocos com SUSE Storage (<xref linkend="components-suse-storage"/>) para permitir um meio simples e fácil de usar uma solução de armazenamento nativa de nuvem.
zh_cn: 基于 SUSE Storage（<xref linkend="components-suse-storage"/>）构建的块存储，让您可以方便地使用云原生存储解决方案。

source: Optimized Operating System with SUSE Linux Micro (<xref linkend="components-slmicro"/>) to enable a secure, lightweight and immutable (transactional file system) OS for running containers. SUSE Linux Micro is available on AArch64 and AMD64/Intel 64 architectures, and it also supports <literal>Real-Time Kernel</literal> for Telco and edge use cases.
es: Sistema operativo optimizado con SUSE Linux Micro (<xref linkend="components-slmicro"/>) para habilitar un sistema operativo seguro, ligero e inmutable (sistema de archivos transaccional) para ejecutar contenedores. SUSE Linux Micro está disponible en arquitecturas AArch64 y AMD64/Intel 64, y también es compatible con un <literal>kernel en tiempo real</literal> para casos prácticos de telecomunicaciones y periféricos.
ja: SUSE Linux Micro (<xref linkend="components-slmicro"/>)で最適化されたオペレーティングシステム。コンテナ運用のための、安全、軽量でイミュータブルな(トランザクショナルファイルシステムを備えた) OSを実現します。SUSE Linux Microは、AArch64アーキテクチャとAMD64/Intel 64アーキテクチャで利用でき、通信事業者およびエッジのユースケース向けに<literal>リアルタイムカーネル</literal>もサポートしています。
pt_br: Sistema operacional otimizado com SUSE Linux Micro (<xref linkend="components-slmicro"/>) para oferecer um sistema operacional seguro, leve e imutável (sistema de arquivos transacional) para execução de contêineres. O SUSE Linux Micro está disponível nas arquiteturas AArch64 e AMD64/Intel 64 e oferece suporte ao <literal>kernel Real-Time</literal> para casos de uso de telecomunicações e de borda.
zh_cn: 基于 SUSE Linux Micro（<xref linkend="components-slmicro"/>）打造的优化操作系统，可提供安全、轻量且具备不可变特性（事务性文件系统）的容器运行环境。SUSE Linux Micro 适用于 AArch64 和 AMD64/Intel 64 体系结构，并为电信和边缘使用场景提供<literal>实时内核</literal>支持。

source: Example deployment flows
es: Ejemplo de flujos de despliegue
ja: デプロイメントフローの例
pt_br: Fluxos de implantação de exemplo
zh_cn: 部署流程示例

source: The following are high-level examples of workflows to understand the relationship between the management and the runtime components.
es: A continuación se muestran ejemplos generales de flujos de trabajo para comprender la relación entre los componentes de gestión y los componentes de entorno de ejecución.
ja: 管理コンポーネントとランタイムコンポーネントの関係を理解できるように、以下にワークフローの概要の例を示します。
pt_br: Veja a seguir exemplos de alto nível de fluxos de trabalho para entender o relacionamento entre os componentes de gerenciamento e de runtime.
zh_cn: 下面是工作流程的简要示例，可帮助您了解管理组件与运行时组件之间的关系。

source: Directed network provisioning is the workflow that enables the deployment of a new downstream cluster with all the components preconfigured and ready to run workloads with no manual intervention.
es: El aprovisionamiento de red dirigida es el flujo de trabajo que permite el despliegue de un nuevo clúster descendente con todos los componentes preconfigurados y listos para ejecutar cargas de trabajo sin intervención manual.
ja: ダイレクトネットワークプロビジョニングは、すべてのコンポーネントを事前設定した状態で新しいダウンストリームクラスタをデプロイできるワークフローであり、手動操作なしですぐにワークロードを実行できます。
pt_br: O provisionamento de rede direcionado é o fluxo de trabalho que permite a implantação de um novo cluster downstream com todos os componentes pré-configurados e prontos para executar as cargas de trabalho sem intervenção manual.
zh_cn: 定向网络置备是可用于部署预配置了所有组件，并可以在无需人工干预的情况下运行工作负载的新下游群集的工作流程。

source: Example 1: Deploying a new management cluster with all components installed
es: Ejemplo 1: despliegue de un nuevo clúster de gestión con todos los componentes instalados
ja: 例1: すべてのコンポーネントがインストールされた新しい管理クラスタをデプロイする
pt_br: Exemplo 1: implantação de um novo cluster de gerenciamento com todos os componentes instalados
zh_cn: 示例 1：部署装有所有组件的新管理群集

source: Using the Edge Image Builder (<xref linkend="components-eib"/>) to create a new <literal>ISO</literal> image with the management stack included. You can then use this <literal>ISO</literal> image to install a new management cluster on VMs or bare-metal.
es: Use Edge Image Builder (<xref linkend="components-eib"/>) para crear una imagen <literal>ISO</literal> nueva con la pila de gestión incluida. A continuación, puede utilizar esta imagen <literal>ISO</literal> para instalar un clúster de gestión nuevo en máquinas virtuales o en hardware físico.
ja: Edge Image Builder (<xref linkend="components-eib"/>)を使用して、管理スタックが含まれる新しい<literal>ISO</literal>イメージを作成します。その後、この<literal>ISO</literal>イメージを使用して、新しい管理クラスタをVMまたはベアメタルにインストールできます。
pt_br: Uso do Edge Image Builder (<xref linkend="components-eib"/>) para criar uma nova imagem <literal>ISO</literal> com a pilha de gerenciamento incluída. Você pode usar essa imagem <literal>ISO</literal> para instalar um novo cluster de gerenciamento em VMs ou bare metal.
zh_cn: 使用 Edge Image Builder（<xref linkend="components-eib"/>）创建包含管理堆栈的新 <literal>ISO</literal> 映像。然后，可以使用此 <literal>ISO</literal> 映像在 VM 或裸机上安装新管理群集。

source: product atip architecture2
es: arquitectura de producto atip 2
ja: 製品atipアーキテクチャ2
pt_br: arquitetura2 produto atip
zh_cn: ATIP 产品体系结构 2

source: For more information about how to deploy a new management cluster, see the SUSE Telco Cloud Management Cluster guide (<xref linkend="atip-management-cluster"/>).
es: Para obtener más información sobre cómo desplegar un nuevo clúster de gestión, consulte la guía sobre el clúster de gestión de SUSE Telco Cloud (<xref linkend="atip-management-cluster"/>).
ja: 新しい管理クラスタをデプロイする方法の詳細については、SUSE Telco Cloudの管理クラスタに関するガイド(<xref linkend="atip-management-cluster"/>)を参照してください。
zh_cn: 有关如何部署新管理群集的更多信息，请参见 SUSE Telco Cloud管理群集指南（<xref linkend="atip-management-cluster"/>）。

source: For more information about how to use the Edge Image Builder, see the Edge Image Builder guide (<xref linkend="quickstart-eib"/>).
es: Para obtener más información sobre cómo usar Edge Image Builder, consulte el capítulo sobre Edge Image Builder (<xref linkend="quickstart-eib"/>).
ja: Edge Image Builderの使用方法については、Edge Image Builderのガイド(<xref linkend="quickstart-eib"/>)を参照してください。
pt_br: Para obter mais informações sobre como usar o Edge Image Builder, consulte o respectivo guia (<xref linkend="quickstart-eib"/>).
zh_cn: 有关如何使用 Edge Image Builder 的详细信息，请参见 Edge Image Builder 指南（<xref linkend="quickstart-eib"/>）。

source: Example 2: Deploying a single-node downstream cluster with Telco profiles to enable it to run Telco workloads
es: Ejemplo 2: despliegue de un clúster descendente de un solo nodo con perfiles de telecomunicaciones para permitir la ejecución de cargas de trabajo de telecomunicaciones
ja: 例2: 通信事業者プロファイルを使用してシングルノードのダウンストリームクラスタをデプロイして通信ワークロードを実行可能にする
pt_br: Exemplo 2: implantação de um cluster downstream de nó único com perfis de telecomunicações para que ele possa executar cargas de trabalho de telecomunicações
zh_cn: 示例 2：使用电信配置文件部署单节点下游群集，使其能够运行电信工作负载

source: Once we have the management cluster up and running, we can use it to deploy a single-node downstream cluster with all Telco capabilities enabled and configured using the directed network provisioning workflow.
es: Cuando tengamos el clúster de gestión instalado y en funcionamiento, podremos utilizarlo para desplegar un clúster descendente de un solo nodo con todas las capacidades de telecomunicaciones habilitadas y configuradas mediante el flujo de trabajo de aprovisionamiento de red dirigida.
ja: 管理クラスタが稼働したら、その管理クラスタを使用して、ダイレクトネットワークプロビジョニングワークフローにより、すべての通信機能が有効化および設定された状態でシングルノードのダウンストリームクラスタをデプロイすることができます。
pt_br: Quando o cluster de gerenciamento estiver em funcionamento, poderemos usá-lo para implantar um cluster downstream de nó único com todos os recursos de telecomunicações habilitados e configurados por meio do fluxo de trabalho de provisionamento de rede direcionado.
zh_cn: 启动并运行管理群集后，我们可以使用该群集通过定向网络置备工作流程，来部署启用并配置了所有电信功能的单节点下游群集。

source: The following diagram shows the high-level workflow to deploy it:
es: El siguiente diagrama muestra el flujo de trabajo general para desplegarlo:
ja: 次の図に、これをデプロイするワークフローの概要を示します。
pt_br: O seguinte diagrama mostra o fluxo de trabalho de alto nível para implantá-lo:
zh_cn: 下图显示了部署该群集的概要工作流程：

source: product atip architecture3
es: arquitectura de producto atip 3
ja: 製品atipアーキテクチャ3
pt_br: arquitetura3 produto atip
zh_cn: ATIP 产品体系结构 3

source: For more information about how to deploy a downstream cluster, see the SUSE Telco Cloud Automated Provisioning guide. (<xref linkend="atip-automated-provisioning"/>)
es: Para obtener más información sobre cómo desplegar un clúster descendente, consulte la guía sobre aprovisionamiento automatizado de SUSE Telco Cloud (<xref linkend="atip-automated-provisioning"/>).
ja: ダウンストリームクラスタのデプロイ方法の詳細については、SUSE Telco Cloudの自動化されたプロビジョニングに関するガイド(<xref linkend="atip-automated-provisioning"/>)を参照してください。
zh_cn: 有关如何部署下游群集的详细信息，请参见 SUSE Telco Cloud 自动置备指南（<xref linkend="atip-automated-provisioning"/>）。

source: For more information about Telco features, see the SUSE Telco Cloud Telco Features guide. (<xref linkend="atip-features"/>)
es: Para obtener más información sobre las funciones para telecomunicaciones, consulte la guía de funciones para ese sector de SUSE Telco Cloud (<xref linkend="atip-features"/>).
ja: 通信機能の詳細については、SUSE Telco Cloudの通信機能に関するガイド(<xref linkend="atip-features"/>)を参照してください。
zh_cn: 有关电信功能的详细信息，请参见 SUSE Telco Cloud 电信功能指南（<xref linkend="atip-features"/>）。

source: Example 3: Deploying a high availability downstream cluster using MetalLB as a Load Balancer
es: Ejemplo 3: despliegue de un clúster descendente de alta disponibilidad con MetalLB como equilibrador de carga
ja: 例3: MetalLBをロードバランサとして使用して高可用性ダウンストリームクラスタをデプロイする
pt_br: Exemplo 3: implantação de um cluster downstream de alta disponibilidade usando o MetalLB como balanceador de carga
zh_cn: 示例 3：使用 MetalLB 作为负载平衡器部署高可用性下游群集

source: Once we have the management cluster up and running, we can use it to deploy a high availability downstream cluster with <literal>MetalLB</literal> as a load balancer using the directed network provisioning workflow.
es: Cuando tengamos el clúster de gestión instalado y en funcionamiento, podremos utilizarlo para desplegar un clúster descendente de alta disponibilidad con <literal>MetalLB</literal> como equilibrador de carga mediante el flujo de trabajo de aprovisionamiento de red dirigida.
ja: 管理クラスタが稼働したら、その管理クラスタを使用して、ダイレクトネットワークプロビジョニングワークフローにより、<literal>MetalLB</literal>をロードバランサとして使用する高可用性ダウンストリームクラスタをデプロイすることができます。
pt_br: Depois que o cluster de gerenciamento estiver em funcionamento, poderemos usá-lo para implantar um cluster downstream de alta disponibilidade com o <literal>MetalLB</literal> como balanceador de carga, usando o fluxo de trabalho de provisionamento de rede direcionado.
zh_cn: 启动并运行管理群集后，我们可以使用该群集通过定向网络置备工作流程，来部署使用 <literal>MetalLB</literal> 作为负载平衡器的高可用性下游群集。

source: product atip architecture4
es: arquitectura de producto atip 4
ja: 製品atipアーキテクチャ4
pt_br: arquitetura4 produto atip
zh_cn: ATIP 产品体系结构 4

source: For more information about <literal>MetalLB</literal>, see here: (<xref linkend="components-metallb"/>)
es: Para obtener más información sobre <literal>MetalLB</literal>, consulte el <xref linkend="components-metallb"/>.
ja: <literal>MetalLB</literal>の詳細については、<xref linkend="components-metallb"/>を参照してください。
pt_br: Para obter mais informações sobre o <literal>MetalLB</literal>, consulte: (<xref linkend="components-metallb"/>)
zh_cn: 有关 <literal>MetalLB</literal> 的详细信息，请参见<xref linkend="components-metallb"/>。

source: Requirements &amp; Assumptions
es: Requisitos y supuestos
ja: 要件と前提
pt_br: Requisitos e suposições
zh_cn: 要求和假设

source: Hardware
ja: ハードウェア
zh_cn: 硬件

source: The hardware requirements for SUSE Telco Cloud are as follows:
es: Estos son los requisitos de hardware de SUSE Telco Cloud:
ja: SUSE Telco Cloudのハードウェア要件は次のとおりです。
zh_cn: SUSE Telco Cloud 的硬件要求如下：

source: <emphasis role="strong">Management cluster</emphasis>: The management cluster contains components like <literal>SUSE Linux Micro</literal>, <literal>RKE2</literal>, <literal>SUSE Rancher Prime</literal>, <literal>Metal<superscript>3</superscript></literal>, and it is used to manage several downstream clusters. Depending on the number of downstream clusters to be managed, the hardware requirements for the server could vary.
es: <emphasis role="strong">Clúster de gestión</emphasis>: el clúster de gestión tiene componentes como <literal>SUSE Linux Micro</literal>, <literal>RKE2</literal>, <literal>SUSE Rancher Prime</literal> y <literal>Metal<superscript>3</superscript></literal>, y se utiliza para gestionar varios clústeres descendentes. Dependiendo del número de clústeres descendentes que se vayan a gestionar, los requisitos de hardware para el servidor pueden variar.
ja: <emphasis role="strong">管理クラスタ</emphasis>: 管理クラスタには、<literal>SUSE Linux Micro</literal>、<literal>RKE2</literal>、<literal>SUSE Rancher Prime</literal>、<literal>Metal<superscript>3</superscript></literal>などのコンポーネントが含まれ、管理クラスタを使用して複数のダウンストリームクラスタを管理します。管理するダウンストリームクラスタの数によっては、サーバのハードウェア要件は変わる場合があります。
pt_br: <emphasis role="strong">Cluster de gerenciamento</emphasis>: contém componentes, como <literal>SUSE Linux Micro</literal>, <literal>RKE2</literal>, <literal>SUSE Rancher Prime</literal> e <literal>Metal<superscript>3</superscript></literal>, e é usado para gerenciar vários clusters downstream. Dependendo do número de clusters downstream que será gerenciado, os requisitos de hardware para o servidor podem variar.
zh_cn: <emphasis role="strong">管理群集</emphasis>：管理群集包含 <literal>SUSE Linux Micro</literal>、<literal>RKE2</literal>、<literal>SUSERancher Prime</literal>、<literal>Metal<superscript>3</superscript></literal> 等组件，用于管理多个下游群集。服务器的硬件要求可能会因所要管理的下游群集数量而有所不同。

source: Minimum requirements for the server (<literal>VM</literal> or <literal>bare-metal</literal>) are:
es: Los requisitos mínimos para el servidor (<literal>MV</literal> o <literal>bare metal</literal>) son:
ja: サーバ(<literal>VM</literal>または<literal>ベアメタル</literal>)の最小要件は次のとおりです。
pt_br: Os requisitos mínimos para o servidor (<literal>VM</literal> ou <literal>bare metal</literal>) são:
zh_cn: 服务器（<literal>VM</literal> 或<literal>裸机</literal>）的最低要求如下：

source: RAM: 8 GB Minimum (we recommend at least 16 GB)
es: RAM: 8 GB como mínimo (se recomiendan al menos 16 GB)
ja: RAM: 8GB以上(16GB以上を推奨)
pt_br: RAM: mínimo de 8 GB (recomendamos pelo menos 16 GB)
zh_cn: RAM：至少 8 GB（建议至少提供 16 GB）

source: CPU: 2 Minimum (we recommend at least 4 CPU)
es: CPU: 2 como mínimo (se recomiendan al menos 4 CPU)
ja: CPU: 2個以上(4個以上を推奨)
pt_br: CPU: mínimo de 2 (recomendamos pelo menos 4)
zh_cn: CPU：至少 2 个（建议至少提供 4 个 CPU）
