Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <literal>nmi_watchdog=0</literal> disables the NMI (Non-Maskable Interrupt) watchdog. This can be omitted when <literal>nowatchdog</literal> is used.
es: <literal>nmi_watchdog=0</literal> inhabilita el watchdog de NMI (interrupción no enmascarable). Se puede omitir si se usa <literal>nowatchdog</literal>.
ja: <literal>nmi_watchdog=0</literal>は、NMI (Non-Maskable Interrupt)ウォッチドッグを無効にします。<literal>nowatchdog</literal>が使用される場合は省略できます。
pt_br: <literal>nmi_watchdog=0</literal> desabilita o watchdog de NMI (interrupção não mascarável). Para omiti-lo, use <literal>nowatchdog</literal>.
zh_cn: <literal>nmi_watchdog=0</literal> 会禁用 NMI（不可屏蔽中断）看门狗。当使用 <literal>nowatchdog</literal> 时，可以省略此设置。

source: RCU (Read-Copy-Update) is a kernel mechanism that enables concurrent, lock-free access for many readers to shared data. An RCU callback, a function triggered after a 'grace period', ensures all previous readers have finished so old data can be safely reclaimed. We fine-tune RCU, particularly for sensitive workloads, to offload these callbacks from dedicated (pinned) CPUs, preventing kernel operations from interfering with critical, time-sensitive tasks.
es: RCU (Read-Copy-Update, leer-copiar-actualizar) es un mecanismo del kernel que permite el acceso simultáneo y sin bloqueos de muchos lectores a datos compartidos. Una retrollamada RCU, una función que se activa tras un "periodo de gracia", garantiza que todos los lectores anteriores hayan terminado, de modo que los datos antiguos puedan recuperarse de forma segura. Ajustamos RCU, especialmente para cargas de trabajo sensibles, con el fin de descargar estas retrollamadas de CPU dedicadas (fijadas), evitando que las operaciones del kernel interfieran con tareas críticas y sensibles al tiempo.
ja: RCU (Read-Copy-Update)は、共有データに対して多数のリーダが同時にロックなしでアクセスできるようにするカーネルメカニズムです。RCUコールバックは、一定の「猶予期間」後にトリガされる関数で、すべての以前のリーダが終了していることを確認し、古いデータを安全に再利用できるようにします。SUSEでは、特に機密性の高いワークロード向けにRCUを微調整し、これらのコールバックを専用(ピニングされた)CPUからオフロードすることで、カーネル操作が重要な時間的制約のあるタスクと干渉しないようにしています。
pt_br: RCU (Read-Copy-Update, Ler-Copiar-Atualizar) é um mecanismo que permite o acesso simultâneo e sem bloqueio de vários leitores aos dados compartilhados. O retorno de chamada RCU, função acionada após um "período extra", garante que todos os leitores anteriores tenham finalizado para que os dados antigos possam ser recuperados com segurança. Ajustamos o RCU, especificamente para cargas de trabalho confidenciais, para descarregar esses retornos de chamada das CPUs dedicadas (fixadas), evitando que as operações do kernel interfiram em tarefas críticas e urgentes.
zh_cn: RCU（读取 - 复制 - 更新）是一种内核机制，允许多个读取器以无锁方式并发访问共享数据。RCU 回调是在“宽限期”后触发的函数，确保所有先前的读取器都已完成操作，从而可以安全地回收旧数据。我们对 RCU 进行微调，特别是针对敏感工作负载，将这些回调从专用（绑定的）CPU 卸载，防止内核操作干扰关键的时间敏感型任务。

source: Specify the pinned CPUs in <literal>rcu_nocbs</literal> so that RCU callbacks do not run on them. This helps reducing jitter and latency for the real-time workloads.
es: Especifique las CPU fijadas en <literal>rcu_nocbs</literal> para que las retrollamadas de RCU no se ejecuten en ellas. Esto ayuda a reducir la fluctuación y la latencia de las cargas de trabajo en tiempo real.
ja: <literal>rcu_nocbs</literal>でピニングされたCPUを指定し、RCUコールバックがそのCPU上で実行されないようにします。これにより、リアルタイムワークロードのジッターとレイテンシを軽減できます。
pt_br: Especifique as CPUs fixadas em <literal>rcu_nocbs</literal> para que os retornos de chamada RCU não sejam executados nelas. Isso ajuda a reduzir a instabilidade e a latência para cargas de trabalho em tempo real.
zh_cn: 在 <literal>rcu_nocbs</literal> 中指定绑定的 CPU，使 RCU 回调不会在这些 CPU 上运行。这有助于减轻实时工作负载的抖动和延迟。

source: <literal>rcu_nocb_poll</literal> makes the no-callback CPUs regularly 'poll' to see if callback handling is required. This can reduce the interrupt overhead.
es: <literal>rcu_nocb_poll</literal> hace que las CPU sin retrollamada realicen sondeos periódicos para comprobar si es necesario gestionar la retrollamada. Esto puede reducir la sobrecarga de interrupciones.
ja: <literal>rcu_nocb_poll</literal>は、コールバック処理が必要かどうかを確認するために、no-callback CPUを定期的に「ポーリング」させます。これにより、割り込みのオーバーヘッドを削減できます。
pt_br: O <literal>rcu_nocb_poll</literal> faz com que as CPUs sem retorno de chamada realizem sondagens regulares para ver se há necessidade de gerenciar retornos de chamadas. Isso pode reduzir a sobrecarga de interrupções.
zh_cn: <literal>rcu_nocb_poll</literal> 会使无回调 CPU 定期“轮询”，以确定是否需要处理回调。这可以减少中断开销。

source: <literal>rcupdate.rcu_cpu_stall_suppress=1</literal> suppresses RCU CPU stall warnings, which can sometimes be false positives in heavily loaded real-time systems
es: <literal>rcupdate.rcu_cpu_stall_suppress=1</literal> suprime las advertencias de bloqueo de la CPU por RCU, que en ocasiones pueden ser falsos positivos en sistemas en tiempo real con mucha carga.
ja: <literal>rcupdate.rcu_cpu_stall_suppress=1</literal>は、RCU CPUストール警告を抑制します。これは、高負荷のリアルタイムシステムでは偽陽性となる場合があります。
pt_br: <literal>rcupdate.rcu_cpu_stall_suppress=1</literal> suprime os avisos de parada de RCU da CPU, que às vezes podem ser falsos positivos nos sistemas em tempo real com carga elevada.
zh_cn: <literal>rcupdate.rcu_cpu_stall_suppress=1</literal> 会抑制 RCU CPU 停滞警告，在高负载实时系统中，这些警告有时可能是误报。

source: <literal>rcupdate.rcu_expedited=1</literal> speeds up the grace period for RCU operations, making read-side critical sections more responsive
es: <literal>rcupdate.rcu_expedited=1</literal> acelera el período de gracia para las operaciones RCU, lo que hace que las secciones críticas de lectura sean más receptivas.
ja: <literal>rcupdate.rcu_expedited=1</literal>は、RCU操作の猶予期間を短縮し、読み取り側のクリティカルセクションの応答性を向上させます。
pt_br: <literal>rcupdate.rcu_expedited=1</literal> acelera o período extra das operações RCU, o que torna as seções críticas do lado da leitura mais responsivas.
zh_cn: <literal>rcupdate.rcu_expedited=1</literal> 会加速 RCU 操作的宽限期，使读取端关键部分的响应更加迅速。

source: <literal>rcupdate.rcu_normal_after_boot=1</literal> When used with rcu_expedited, it allows RCU to rever to normal (non-expedited) operation after the system boot.
es: <literal>rcupdate.rcu_normal_after_boot=1</literal>, cuando se usa con rcu_expedited, permite que RCU vuelva al funcionamiento normal (no acelerado) después del arranque del sistema.
ja: <literal>rcupdate.rcu_normal_after_boot=1</literal>: rcu_expeditedとともに使用する場合、システム起動後にRCUが通常の(非迅速)動作に戻ることができます。
pt_br: <literal>rcupdate.rcu_normal_after_boot=1</literal>, quando usado com rcu_expedited, permite que o RCU volte à operação normal (não acelerada) após a inicialização do sistema.
zh_cn: <literal>rcupdate.rcu_normal_after_boot=1</literal> 与 rcu_expedited 一起使用时，允许 RCU 在系统引导后恢复到正常（非加速）操作模式。

source: <literal>rcupdate.rcu_task_stall_timeout=0</literal> disables the RCU task stall detector, preventing potential warnings or system halts from long-running RCU tasks.
es: <literal>rcupdate.rcu_task_stall_timeout=0</literal> inhabilita el detector de bloqueo de tareas RCU, lo que evita posibles advertencias o interrupciones del sistema provocadas por tareas RCU de larga duración.
ja: <literal>rcupdate.rcu_task_stall_timeout=0</literal>は、RCUタスクのストール検出機能を無効にし、長時間実行されるRCUタスクによる潜在的な警告やシステム停止を防止します。
pt_br: <literal>rcupdate.rcu_task_stall_timeout=0</literal> desabilita o detector de paradas de tarefas do RCU, evitando possíveis avisos ou paralisações do sistema provocadas por tarefas do RCU de longa duração.
zh_cn: <literal>rcupdate.rcu_task_stall_timeout=0</literal> 会禁用 RCU 任务停滞检测器，防止长时间运行的 RCU 任务可能引发的警告或系统暂停。

source: <literal>rcutree.kthread_prio=99</literal> sets the priority of the RCU callback kernel thread to the highest possible (99), ensuring it gets scheduled and handles RCU callbacks promptly, when needed.
es: <literal>rcutree.kthread_prio=99</literal> establece la prioridad del subproceso del kernel de retrollamadas de RCU al máximo posible (99), lo que garantiza que se programen y gestionen las retrollamadas de RCU con rapidez cuando sea necesario.
ja: <literal>rcutree.kthread_prio=99</literal>は、RCUコールバックカーネルスレッドの優先度を可能な限り最高(99)に設定し、必要に応じてRCUコールバックがスケジュールされ、迅速に処理されるようにします。
pt_br: <literal>rcutree.kthread_prio=99</literal> define a prioridade do thread do kernel de retorno de chamada RCU como a mais alta possível (99), garantindo que ele seja programado e processe os retornos de chamada RCU prontamente, quando necessário.
zh_cn: <literal>rcutree.kthread_prio=99</literal> 会将 RCU 回调内核线程的优先级设置为可能的最高值 (99)，确保在需要时能够及时调度该线程并处理 RCU 回调。

source: Add <literal>ignition.platform.id=openstack</literal> for Metal3 and Cluster API to successfully provision/deprovision the cluster. This is used by Metal3 Python agent, which originated from Openstack Ironic.
es: Añada <literal>ignition.platform.id=openstack</literal> para Metal3 y Cluster API a fin de aprovisionar/desaprovisionar correctamente el clúster. Esto lo utiliza el agente Python de Metal3, que tiene su origen en Openstack Ironic.
ja: Metal3とCluster APIに<literal>ignition.platform.id=openstack</literal>を追加し、クラスタのプロビジョニング/プロビジョニング解除が正常に実行されるようにします。これは、Openstack Ironic由来のMetal3 Pythonエージェントによって使用されます。
pt_br: Adicione o <literal>ignition.platform.id=openstack</literal> para que o Metal3 e a Cluster API provisionem/desprovisionem o cluster com sucesso. Ele é usado pelo agente Metal3 Python, que teve sua origem no Openstack Ironic.
zh_cn: 为使 Metal3 和 Cluster API 成功置备/取消置备群集，请添加 <literal>ignition.platform.id=openstack</literal>。该配置供 Metal3 Python 代理使用，该代理源自 OpenStack Ironic。

source: Remove <literal>intel_pstate=passive</literal>. This option configures <literal>intel_pstate</literal> to work with generic cpufreq governors, but to make this work, it disables hardware-managed P-states (<literal>HWP</literal>) as a side effect. To reduce the hardware latency, this option is not recommended for real-time workloads.
es: Elimine <literal>intel_pstate=passive</literal>. Esta opción configura <literal>intel_pstate</literal> para que funcione con reguladores cpufreq genéricos; pero, para que esto funcione, inhabilita los estados P gestionados por hardware (<literal>HWP</literal>) como efecto secundario. Para reducir la latencia del hardware, no se recomienda utilizar esta opción para cargas de trabajo en tiempo real.
ja: <literal>intel_pstate=passive</literal>を削除します。このオプションは、<literal>intel_pstate</literal>を汎用cpufreqガバナーと連携するように設定しますが、この連携を行うには、副作用として、ハードウェア管理P状態(<literal>HWP</literal>)を無効にします。ハードウェアのレイテンシを削減するため、このオプションはリアルタイムワークロードには推奨されません。
pt_br: Remova <literal>intel_pstate=passive</literal>. Essa opção configura o <literal>intel_pstate</literal> para operar com controladores cpufreq genéricos. No entanto, para que isso funcione, ele desabilita os estados P gerenciados pelo hardware (<literal>HWP</literal>) como efeito colateral. Para reduzir a latência do hardware, essa opção não é recomendada para cargas de trabalho em tempo real.
zh_cn: 去除 <literal>intel_pstate=passive</literal>。此选项将 <literal>intel_pstate</literal> 配置为与通用 cpufreq 调节器搭配工作，但缺点是，为了实现这一点，它会禁用硬件管理的 P 状态 (<literal>HWP</literal>)。为了减少硬件延迟，不建议将此选项用于实时工作负载。

source: Replace <literal>intel_idle.max_cstate=0 processor.max_cstate=1</literal> with <literal>idle=poll</literal>. To avoid C-State transitions, the <literal>idle=poll</literal> option is used to disable the C-State transitions and keep the CPU in the highest C-State. The <literal>intel_idle.max_cstate=0</literal> option disables <literal>intel_idle</literal>, so <literal>acpi_idle</literal> is used, and <literal>acpi_idle.max_cstate=1</literal> then sets max C-state for acpi_idle. On AMD64/Intel 64 architectures, the first ACPI C-State is always <literal>POLL</literal>, but it uses a <literal>poll_idle()</literal> function, which may introduce some tiny latency by reading the clock periodically, and restarting the main loop in <literal>do_idle()</literal> after a timeout (this also involves clearing and setting the <literal>TIF_POLL</literal> task flag). In contrast, <literal>idle=poll</literal> runs in a tight loop, busy-waiting for a task to be rescheduled. This minimizes the latency of exiting the idle state, but at the cost of keeping the CPU running at full speed in the idle thread.
es: Reemplace <literal>intel_idle.max_cstate=0 processor.max_cstate=1</literal> por <literal>idle=poll</literal>. Para evitar las transiciones de estado C, se usa la opción <literal>idle=poll</literal> para inhabilitar las transiciones de estado C y mantener la CPU en el estado C más alto. La opción <literal>intel_idle.max_cstate=0</literal> inhabilita <literal>intel_idle</literal>, por lo que se usa <literal>acpi_idle</literal>, y <literal>acpi_idle.max_cstate=1</literal> establece el estado C máximo para acpi_idle. En arquitecturas AMD64/Intel 64, el primer estado C de ACPI es siempre <literal>POLL</literal>, pero usa una función <literal>poll_idle()</literal>, que puede introducir una pequeña latencia al leer el reloj periódicamente y reiniciar el bucle principal en <literal>do_idle()</literal> después de un tiempo de espera (esto también implica borrar y establecer el indicador de tarea <literal>TIF_POLL</literal>). Por el contrario, <literal>idle=poll</literal> se ejecuta en un bucle cerrado, esperando activamente a que se reprogramen las tareas. Esto minimiza la latencia al salir del estado de inactividad, pero a costa de mantener la CPU funcionando a toda velocidad en el subproceso inactivo.
ja: <literal>intel_idle.max_cstate=0 processor.max_cstate=1</literal>を<literal>idle=poll</literal>に置き換えます。C-Stateの遷移を回避するには、<literal>idle=poll</literal>オプションを使用してC-Stateの遷移を無効にし、CPUを最高のC-Stateに維持します。<literal>intel_idle.max_cstate=0</literal>オプションは、<literal>intel_idle</literal>を無効にするため、<literal>acpi_idle</literal>が使用され、<literal>acpi_idle.max_cstate=1</literal>がacpi_idleの最大のC-stateを設定します。AMD64/Intel 64アーキテクチャでは、最初のACPI C-Stateは常に<literal>POLL</literal>ですが、<literal>poll_idle()</literal>関数を使用しており、定期的にクロックを読み取ることで、タイムアウト後に <literal>do_idle()</literal>でメインループを再起動する際に、若干のレイテンシが発生する可能性があります(これには<literal>TIF_POLL</literal>タスクフラグのクリアと設定も含まれます)。これに対して、<literal>idle=poll</literal>はタイトなループで実行され、タスクが再スケジュールされるのをビジーウェイトします。これにより、アイドル状態から抜け出すまでのレイテンシが最小化されますが、その代償としてCPUがアイドルスレッドでフルスピードで稼働し続けることになります。
pt_br: Substitua <literal>intel_idle.max_cstate=0 processor.max_cstate=1</literal> por <literal>idle=poll</literal>. Para evitar transições de estado C, a opção <literal>idle=poll</literal> é usada para desabilitar essas transições e manter a CPU no estado C mais alto. A opção <literal>intel_idle.max_cstate=0</literal> desabilita <literal>intel_idle</literal> para que <literal>acpi_idle</literal> seja usado e, em seguida, o <literal>acpi_idle.max_cstate=1</literal> define o estado C máximo para acpi_idle. Nas arquiteturas AMD64/Intel 64, o primeiro estado C da ACPI sempre é <literal>POLL</literal>, mas ela usa uma função <literal>poll_idle()</literal>, que pode gerar uma pequena latência com a leitura periódica do relógio e a reinicialização do loop principal em <literal>do_idle()</literal> após o tempo limite (isso também envolve limpar e definir o sinalizador da tarefa <literal>TIF_POLL</literal>). Por outro lado, <literal>idle=poll</literal> é executado em um loop restrito, mantendo-se em espera ocupada até que uma tarefa seja reprogramada. Isso minimiza a latência de sair do estado ocioso, mas à custa de manter a CPU em execução na máxima velocidade no thread ocioso.
zh_cn: 将 <literal>intel_idle.max_cstate=0 processor.max_cstate=1</literal> 替换为 <literal>idle=poll</literal>。为了避免 C 状态转换，使用 <literal>idle=poll</literal> 选项来禁用 C 状态转换并将 CPU 保持在最高 C 状态。<literal>intel_idle.max_cstate=0</literal> 选项会禁用 <literal>intel_idle</literal>，因此使用 <literal>acpi_idle</literal>，然后 <literal>acpi_idle.max_cstate=1</literal> 会为 acpi_idl 设置最大 C 状态。在 AMD64/Intel 64 体系结构上，第一个 ACPI C 状态始终是<literal>轮询</literal>，但它使用 <literal>poll_idle()</literal> 函数，这可能会因为定期读取时钟并在超时后重启 <literal>do_idle()</literal> 中的主循环（也涉及清除和设置 <literal>TIF_POLL</literal> 任务标志）而导致一些细微的延迟。相比之下，<literal>idle=poll</literal> 以紧凑循环运行，通过忙等待方式等待任务被重新调度。这最大限度地减少了由退出空闲状态造成的延迟，但代价是 CPU 在空闲线程中也要保持全速运行。

source: Disable C1E in BIOS. This option is important to disable the C1E state in the BIOS to avoid the CPU from entering the C1E state when idle. The C1E state is a low-power state that can introduce latency when the CPU is idle.
es: Desactive C1E en BIOS. Es importante desactivar el estado C1E en el BIOS para evitar que la CPU entre en el estado C1E cuando está inactiva. El estado C1E es un estado de bajo consumo que puede introducir latencia cuando la CPU está inactiva.
ja: BIOSのC1Eを無効にします。このオプションは、BIOSでC1E状態を無効にし、アイドル時にCPUがCIE状態になるのを回避します。C1E状態は、CPUがアイドル状態のときにレイテンシを発生される可能性のある低電力状態です。
pt_br: Desabilite C1E no BIOS. Essa opção é importante para desabilitar o estado C1E no BIOS para evitar que a CPU entre no estado C1E quando estiver ociosa. C1E é um estado de baixo consumo que pode gerar latência quando a CPU está ociosa.
zh_cn: 在 BIOS 中禁用 C1E。此选项对于禁用 BIOS 中的 C1E 状态非常重要，可以避免 CPU 在空闲时进入 C1E 状态。C1E 状态是一种低功耗状态，可能会在 CPU 空闲时造成延迟。

source: The rest of this documentation covers additional parameters, including huge pages and IOMMU.
es: El resto de esta documentación trata sobre parámetros adicionales, incluyendo las páginas enormes e IOMMU.
ja: このドキュメントの残りの部分では、追加のパラメータ(Huge PageやIOMMUなど)について説明します。
pt_br: O restante desta documentação aborda parâmetros adicionais, incluindo HugePages e IOMMU.
zh_cn: 本文档的其余部分介绍了其他参数，包括大页和 IOMMU。

source: This provides an example of kernel arguments for a 32-core Intel server, including the aforementioned adjustments:
es: Se proporciona un ejemplo de argumentos del kernel para un servidor Intel de 32 núcleos, que incluye los ajustes mencionados anteriormente:
ja: 以下は、前述の調整を含む32コアのIntelサーバのカーネル引数の例です。
pt_br: Este é um exemplo de argumentos do kernel para um servidor Intel de 32 núcleos, incluindo os ajustes já mencionados:
zh_cn: 以下是一个包含上述调整的 32 核 Intel 服务器的内核参数示例：

source: Here is another configuration example for a 64-core AMD server. Among the 128 logical processors (<literal>0-127</literal>), first 8 cores (<literal>0-7</literal>) are designated for housekeeping, while the remaining 120 cores (<literal>8-127</literal>) are pinned for the applications:
es: Aquí hay otro ejemplo de configuración para un servidor AMD de 64 núcleos. Entre los 128 procesadores lógicos (<literal>0-127</literal>), los primeros 8 núcleos (<literal>0-7</literal>) se destinan a tareas de mantenimiento, mientras que los 120 núcleos restantes (<literal>8-127</literal>) se fijan para las aplicaciones:
ja: 以下は、64コアのAMDサーバのもう1つの設定例です。128個の論理プロセッサ(<literal>0-127</literal>)のうち、最初の8コア(<literal>0-7</literal>)はハウスキーピング用に指定され、残りの120コア(<literal>8-127</literal>)はアプリケーション用に固定されます。
pt_br: Este é outro exemplo de configuração para um servidor AMD de 64 núcleos. Dentre os 128 processadores lógicos (<literal>0-127</literal>), os primeiros 8 núcleos (<literal>0-7</literal>) são destinados à manutenção, enquanto os 120 núcleos restantes (<literal>8-127</literal>) são fixados para os aplicativos:
zh_cn: 以下是一个 64 核 AMD 服务器的配置示例。在 128 个逻辑处理器 (<literal>0-127</literal>) 中，前 8 个核心 (<literal>0-7</literal>) 用于系统管理，而其余 120 个核心 (<literal>8-127</literal>) 专用于运行应用程序：

source: CPU pinning via Tuned and kernel args
es: Fijación de CPU mediante Tuned y argumentos del kernel
ja: Tunedとカーネル引数によるCPUピニング
pt_br: Fixação de CPU via TuneD e argumentos do kernel
zh_cn: 通过 Tuned 和内核参数实现 CPU 绑定

source: <literal>tuned</literal> is a system tuning tool that monitors system conditions to optimize performance using various predefined profiles. A key feature is its ability to isolate CPU cores for specific workloads, like real-time applications. This prevents the OS from utilizing these cores and potentially increasing latency.
es: <literal>tuned</literal> es una herramienta de ajuste del sistema que supervisa las condiciones del sistema para optimizar el rendimiento usando varios perfiles predefinidos. Una característica clave es su capacidad para aislar los núcleos de la CPU para cargas de trabajo específicas, como aplicaciones en tiempo real. Esto evita que el sistema operativo utilice esos núcleos y aumente potencialmente la latencia.
ja: <literal>tuned</literal>は、さまざまな事前定義済みプロファイルを使用して、システム状態を監視し、パフォーマンスを最適化するシステムチューニングツールです。主要な機能は、リアルタイムアプリケーションのなどの特定のワークロードに対してCPUコアを分離する機能です。この機能により、OSがこれらのコアを使用するのを防止し、潜在的にレイテンシが増加するのを回避します。
pt_br: <literal>tuned</literal> é uma ferramenta de ajuste de sistema que monitora as condições do sistema para otimizar o desempenho usando vários perfis predefinidos. Um recurso importante é sua capacidade de isolar os núcleos da CPU para cargas de trabalho específicas, como os aplicativos em tempo real. Isso impede que o sistema operacional use esses núcleos e, possivelmente, aumente a latência.
zh_cn: <literal>Tuned</literal> 是一个系统调优工具，它通过各种预定义配置文件监控系统状况以优化性能。其关键特性之一是能够为特定工作负载（如实时应用程序）隔离 CPU 核心。这可防止操作系统使用这些核心，从而避免潜在的延迟增加。

source: To enable and configure this feature, the first thing is to create a profile for the CPU cores we want to isolate. In this example, among 64 cores, we dedicate 60 cores (<literal>1-30,33-62</literal>) for the application and remaining 4 cores are used for housekeeping. Note that the design of isolated CPUs heavily depends on the real-time applications.
es: Para habilitar y configurar esta función, lo primero es crear un perfil para los núcleos de CPU que se deseen aislar. En este ejemplo, dedicamos 60 de los 64 núcleos (<literal>1-30,33-62</literal>) a la aplicación y los 4 núcleos restantes para tareas de mantenimiento. Tenga en cuenta que el diseño de las CPU aisladas depende en gran medida de las aplicaciones en tiempo real.
ja: この機能を有効にして設定するには、まず、分離するCPUコアのプロファイルを作成します。この例では、64コアのうち、60コア(<literal>1-30、33-62</literal>)をアプリケーション専用にし、残りの4コアをハウスキーピングに使用します。分離されたCPUの設計は、リアルタイムアプリケーションに大きく依存することに注意してください。
pt_br: Para habilitar e configurar esse recurso, a primeira etapa é criar um perfil para os núcleos da CPU que desejamos isolar. Neste exemplo, dos 64 núcleos, dedicamos 60 (<literal>1-30,33-62</literal>) para o aplicativo e os 4 restantes são usados para manutenção. Observe que o design das CPUs isoladas depende significativamente dos aplicativos em tempo real.
zh_cn: 要启用和配置此功能，首先应该为我们想要隔离的 CPU 核心创建一个配置文件。在本示例中，64 个核心中，我们将 60 个核心（<literal>1-30 和 33-62</literal>）专用于应用程序，剩余 4 个核心用于系统管理。需要注意的是，隔离 CPU 的设计在很大程度上取决于实时应用程序的需求。

source: Then we need to modify the GRUB option to isolate CPU cores and other important parameters for CPU usage. The following options are important to be customized with your current hardware specifications:
es: A continuación, debemos modificar la opción GRUB para aislar los núcleos de CPU y otros parámetros importantes para el uso de las CPU. Es importante personalizar las opciones siguientes con las especificaciones reales de su hardware:
ja: 次に、GRUBオプションを変更して、CPUコアと、CPUの使用法に関するその他の重要なパラメータを分離する必要があります。現在のハードウェア仕様で次のオプションをカスタマイズすることが重要です。
pt_br: Na sequência, precisamos modificar a opção GRUB para isolar os núcleos da CPU e outros parâmetros importantes para uso da CPU. É importante personalizar as seguintes opções com suas especificações de hardware atuais:
zh_cn: 然后我们需要修改用于隔离 CPU 核心的 GRUB 选项以及其他重要的 CPU 使用参数。请务必根据您的当前硬件规格自定义以下选项：

source: parameter
es: Parámetro
ja: パラメータ
pt_br: parâmetro
zh_cn: 参数

source: value
es: Valor
ja: 値
pt_br: valor
zh_cn: 值

source: description
es: Descripción
ja: 説明
pt_br: descrição
zh_cn: 说明

source: domain,nohz,managed_irq,1-30,33-62
ja: domain、nohz、&#x200B;managed_irq、1-30、33-62
zh_cn: domain,nohz,&#x200B;managed_irq,1-30,33-62
