Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: On the <emphasis role="strong">Repositories page</emphasis>, click <literal>Create</literal>.
es: En la página <emphasis role="strong">Repositories</emphasis> (Repositorios), haga clic en <literal>Create</literal> (Crear).
ja: <emphasis role="strong">［Repositories (リポジトリ)］</emphasis>ページで、［<literal>Create (作成)</literal>］をクリックします。
pt_br: Na página <emphasis role="strong">Repositories</emphasis> (Repositórios), clique em <literal>Create</literal> (Criar).
zh_cn: 在 <emphasis role="strong">Repositories</emphasis>（储存库）页面上，单击 <literal>Create</literal>（创建）。

source: In the form, specify the repository name and URL, and click <literal>Create</literal>.
es: En el formulario, especifique el nombre y la URL del repositorio y haga clic en <literal>Create</literal> (Crear).
ja: フォームにリポジトリ名とURLを指定して、［<literal>Create (作成)</literal>］をクリックします。
pt_br: No formulário, especifique o nome e o URL do repositório e clique em <literal>Create</literal> (Criar).
zh_cn: 在表单中指定储存库名称和 URL，然后单击 <literal>Create</literal>（创建）。

source: SUSE Edge Helm charts repository URL: <literal>oci://registry.suse.com/edge/charts</literal>
es: URL del repositorio de charts de Helm de SUSE Edge: <literal>oci://registry.suse.com/edge/charts</literal>
ja: SUSE Edge HelmチャートリポジトリURL: <literal>oci://registry.suse.com/edge/charts</literal>
pt_br: URL do repositório de gráficos Helm do SUSE Edge: <literal>oci://registry.suse.com/edge/charts</literal>
zh_cn: SUSE Edge Helm chart 储存库 URL：<literal>oci://registry.suse.com/edge/charts</literal>

source: dashboard extensions create oci repository
es: repositorio de oci para crear extensiones de panel de control
ja: ダッシュボード拡張機能OCIリポジトリの作成
pt_br: criar repositório oci extensões dashboard
zh_cn: 仪表板扩展创建 OCI 储存库

source: You can see that the extension repository is added to the list and is in <literal>Active</literal> state.
es: Puede comprobar que el repositorio de extensiones se ha añadido a la lista y se encuentra en estado <literal>Active</literal> (Activo).
ja: 拡張機能リポジトリがリストに追加され、［<literal>Active (アクティブ)</literal>］状態であることがわかります。
pt_br: Veja que o repositório de extensões foi adicionado à lista com o estado <literal>Active</literal> (Ativo).
zh_cn: 您会看到扩展储存库已添加到列表中，并处于 <literal>Active</literal>（活动）状态。

source: dashboard extensions repositories list
es: lista de repositorios de extensiones de panel de control
ja: ダッシュボード拡張機能リポジトリリスト
pt_br: lista repositórios extensões dashboard
zh_cn: 仪表板扩展 - 储存库列表

source: Navigate back to the <emphasis role="strong">Extensions</emphasis> in the <emphasis role="strong">Configuration</emphasis> section of the navigation sidebar.
es: Vuelva a <emphasis role="strong">Extensions</emphasis> (Extensiones) en la sección <emphasis role="strong">Configuration</emphasis> (Configuración) de la barra lateral de navegación.
ja: ナビゲーションサイドバーの <emphasis role="strong">［Configuration (設定)］</emphasis>セクションの <emphasis role="strong">［Extensions (拡張機能)］</emphasis>に戻ります。
pt_br: Volte para <emphasis role="strong">Extensions</emphasis> (Extensões) na seção <emphasis role="strong">Configuration</emphasis> (Configuração) da barra lateral de navegação.
zh_cn: 导航回导航侧边栏 <emphasis role="strong">Configuration</emphasis>（配置）部分的 <emphasis role="strong">Extensions</emphasis>（扩展）。

source: In the <emphasis role="strong">Available</emphasis> tab you can see the extensions available for installation.
es: En la pestaña <emphasis role="strong">Available</emphasis> (Disponibles), consulte las extensiones disponibles para instalar.
ja: <emphasis role="strong">［Available (利用可能)］</emphasis>タブで、インストール可能な拡張機能を確認できます。
pt_br: Na guia <emphasis role="strong">Available</emphasis> (Disponível), veja as extensões disponíveis para instalação.
zh_cn: 在 <emphasis role="strong">Available</emphasis>（可用）选项卡中，可以看到可供安装的扩展。

source: dashboard extensions available extensions
es: extensiones de panel de control disponibles
ja: ダッシュボード拡張機能利用可能な拡張機能
pt_br: extensões disponíveis extensões dashboard
zh_cn: 仪表板扩展 - 可用扩展

source: On the extension card click <literal>Install</literal> and confirm the installation.
es: En la tarjeta de la extensión, haga clic en <literal>Install</literal> y confirme el proceso.
ja: 拡張機能カードで、［<literal>Install (インストール)</literal>］をクリックし、インストールを確認します。
pt_br: No cartão da extensão, clique em <literal>Install</literal> (Instalar) e confirme a instalação.
zh_cn: 在扩展卡片上单击 <literal>Install</literal>（安装）并确认安装。

source: Once the extension is installed Rancher UI prompts to reload the page as described in the <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions#installing-extensions">Installing Extensions Rancher documentation page</link></literal>.
es: Una vez instalada la extensión, la interfaz de usuario de Rancher solicita que se vuelva a cargar la página, tal y como se describe en la página <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions#installing-extensions">Installing Extensions Rancher</link></literal> (Instalación de extensiones de Rancher) de la documentación.
ja: 拡張機能がインストールされると、Rancher UIによってページの再ロードが促されます。<literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions#installing-extensions">拡張機能のインストールのRancherドキュメントページ</link></literal>を参照してください。
zh_cn: 扩展安装完毕后，Rancher UI 会提示重新加载页面，具体说明请参见 <literal><link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/rancher-extensions#installing-extensions">Rancher 的安装扩展文档页面</link></literal>。

source: Installing with Helm
es: Instalación con Helm
ja: Helmを使用したインストール
pt_br: Instalando com o Helm
zh_cn: 使用 Helm 进行安装

source: The extensions need to be installed in <literal>cattle-ui-plugin-system</literal> namespace.
es: Las extensiones se deben instalar en el espacio de nombres <literal>cattle-ui-plugin-system</literal>.
ja: 拡張機能は<literal>cattle-ui-plugin-system</literal>ネームスペースにインストールする必要があります。
pt_br: É preciso instalar as extensões no namespace <literal>cattle-ui-plugin-system</literal>.
zh_cn: 扩展需安装在 <literal>cattle-ui-plugin-system</literal> 名称空间中。

source: After an extension is installed, Rancher Dashboard UI needs to be reloaded.
es: Después de instalar una extensión, es necesario volver a cargar la interfaz de usuario del panel de control de Rancher.
ja: 拡張機能がインストールされたら、Rancher Dashboard UIを再ロードする必要があります。
pt_br: Após a instalação de uma extensão, a IU do Rancher Dashboard deverá ser recarregada.
zh_cn: 安装扩展后，需要重新加载 Rancher 仪表板 UI。

source: Installing with Fleet
es: Instalación con Fleet
ja: Fleetを使用したインストール
pt_br: Instalando com o Fleet
zh_cn: 使用 Fleet 进行安装

source: Installing Dashboard Extensions with Fleet requires defining a <literal>gitRepo</literal> resource which points to a Git repository with custom <literal>fleet.yaml</literal> bundle configuration file(s).
es: Para instalar extensiones de panel de control con Fleet, es necesario definir un recurso <literal>gitRepo</literal> que apunte a un repositorio Git con archivos de configuración <literal>fleet.yaml</literal> de bundle personalizados.
ja: Fleetを使用してダッシュボード拡張機能をインストールするには、カスタムの<literal>fleet.yaml</literal>バンドル設定ファイルを使用して、Gitリポジトリを指す<literal>gitRepo</literal>リソースを定義する必要があります。
pt_br: A instalação de extensões de dashboard com o Fleet requer a definição de um recurso <literal>gitRepo</literal> que aponte para um repositório Git com um ou mais arquivos de configuração de bundle <literal>fleet.yaml</literal> personalizados.
zh_cn: 使用 Fleet 安装仪表板扩展需要定义一个 <literal>gitRepo</literal> 资源，该资源指向包含自定义 <literal>fleet.yaml</literal> 捆绑包配置文件的 Git 储存库。

source: The <literal>releaseName</literal> property is required and needs to match the extension name to get the extension correctly installed.
es: La propiedad <literal>releaseName</literal> es obligatoria y debe coincidir con el nombre de la extensión para que esta se instale correctamente.
ja: 拡張機能を正しくインストールするには、<literal>releaseName</literal>プロパティが必須であり、拡張機能名と一致している必要があります。
pt_br: A propriedade <literal>releaseName</literal> é necessária e precisa corresponder ao nome da extensão para instalá-la corretamente.
zh_cn: 必须指定 <literal>releaseName</literal> 属性，而且它需要与扩展名称匹配，才能正确安装扩展。

source: For more information, see <xref linkend="components-fleet"/> and the <literal><link xl:href="https://github.com/suse-edge/fleet-examples">fleet-examples</link></literal> repository.
es: Para obtener más información, consulte el <xref linkend="components-fleet"/> y el repositorio <literal><link xl:href="https://github.com/suse-edge/fleet-examples">fleet-examples</link></literal>.
ja: 詳細については、 <xref linkend="components-fleet"/>と<literal><link xl:href="https://github.com/suse-edge/fleet-examples">fleet-examples</link></literal>リポジトリを参照してください。
pt_br: Para obter mais informações, consulte o <xref linkend="components-fleet"/> e o repositório <literal><link xl:href="https://github.com/suse-edge/fleet-examples">fleet-examples</link></literal>.
zh_cn: 有关详细信息，请参见<xref linkend="components-fleet"/>和 <literal><link xl:href="https://github.com/suse-edge/fleet-examples">fleet-examples</link></literal> 储存库。

source: Once the Extensions are installed they are listed in <emphasis role="strong">Extensions</emphasis> section under <emphasis role="strong">Installed</emphasis> tabs. Since they are not installed via Apps/Marketplace, they are marked with <literal>Third-Party</literal> label.
es: Después de que se hayan instalado las extensiones, aparecen en la sección <emphasis role="strong">Extensions</emphasis> (Extensiones) de la pestaña <emphasis role="strong">Installled</emphasis> (Instaladas). Dado que no se instalan a través de Apps/Marketplace, se marcan con la etiqueta <literal>Third-Party</literal> (De terceros).
ja: 拡張機能がインストールされると、その拡張機能が<emphasis role="strong">［Extensions (拡張機能)］</emphasis>セクションの<emphasis role="strong">［Installed (インストール済み)］</emphasis>タブに表示されます。拡張機能はApps/Marketplace経由でインストールされたものではないため、「<literal>Third-Party (サードパーティ)</literal>」というラベルが付きます。
pt_br: Após a instalação das extensões, elas serão listadas na seção <emphasis role="strong">Extensions</emphasis> (Extensões) nas guias <emphasis role="strong">Installed</emphasis> (Instaladas). Como não são instaladas via Apps/Marketplace, elas são marcadas com o rótulo <literal>Third-Party</literal> (Terceiros).
zh_cn: 安装扩展后，它们将列在 <emphasis role="strong">Installed</emphasis>（已安装）选项卡下的 <emphasis role="strong">Extensions</emphasis>（扩展）部分中。由于它们不是通过 Apps/Marketplace 安装的，因此带有 <literal>Third-Party</literal>（第三方）标签。

source: installed dashboard extensions
es: extensiones de panel de control instaladas
ja: インストール済みダッシュボード拡張機能
pt_br: extensões dashboard instaladas
zh_cn: 已安装的仪表板扩展

source: KubeVirt Dashboard Extension
es: Extensión de panel de control KubeVirt
ja: KubeVirtダッシュボード拡張機能
pt_br: Extensão de dashboard KubeVirt
zh_cn: KubeVirt 仪表板扩展

source: KubeVirt Extension provides basic virtual machine management for Rancher dashboard UI. Its capabilities are described in <xref linkend="kubevirt-dashboard-extension-usage"/>.
es: La extensión KubeVirt proporciona funciones básicas de gestión de máquinas virtuales para la interfaz de usuario del panel de control de Rancher. Sus capacidades se describen en la <xref linkend="kubevirt-dashboard-extension-usage"/>.
ja: KubeVirt拡張機能は、Rancher Dashboard UIに基本的な仮想マシン管理機能を提供します。その機能については、<xref linkend="kubevirt-dashboard-extension-usage"/>を参照してください。
pt_br: A extensão KubeVirt fornece gerenciamento de máquinas virtuais básicas para a IU do Rancher Dashboard. Seus recursos estão descrito na <xref linkend="kubevirt-dashboard-extension-usage"/>.
zh_cn: KubeVirt 扩展为 Rancher 仪表板 UI 提供基本虚拟机管理。<xref linkend="kubevirt-dashboard-extension-usage"/>中介绍了其功能。

source: Akri Dashboard Extension
pt_br: Extensão de dashboard Akri
zh_cn: Akri 仪表板扩展

source: Akri is a Kubernetes Resource Interface that lets you easily expose heterogeneous leaf devices (such as IP cameras and USB devices) as resources in a Kubernetes cluster, while also supporting the exposure of embedded hardware resources such as GPUs and FPGAs. Akri continually detects nodes that have access to these devices and schedules workloads based on them.
pt_br: Akri é uma interface de recursos do Kubernetes que permite expor facilmente dispositivos folha heterogêneos (por exemplo, câmeras IP e dispositivos USB) como recursos em um cluster Kubernetes, além de oferecer suporte à exposição de recursos de hardware incorporados, como GPUs e FPGAs. A Akri detecta continuamente os nós com acesso a esses dispositivos e programa as cargas de trabalho com base neles.
zh_cn: Akri 是一个 Kubernetes 资源接口，让您可以轻松地将异构叶设备（例如 IP 摄像头和 USB 设备）公开为 Kubernetes 群集中的资源，同时还支持公开 GPU 和 FPGA 等嵌入式硬件资源。Akri 会持续检测有权访问这些设备的节点，并根据这些节点调度工作负载。

source: Akri Dashboard Extension allows you to use Rancher Dashboard user interface to manage and monitor leaf devices and run workloads once these devices are discovered.
pt_br: Com a extensão de dashboard Akri, você pode usar a interface de usuário do Rancher Dashboard para gerenciar e monitorar dispositivos folha e executar cargas de trabalho após a descoberta desses dispositivos.
zh_cn: Akri 仪表板扩展允许您使用 Rancher 仪表板用户界面来管理和监控叶设备，并在发现这些设备后运行工作负载。

source: Extension capabilities are further described in <xref linkend="akri-dashboard-extension-usage"/>.
pt_br: Há uma descrição mais detalhada dos recursos da extensão na <xref linkend="akri-dashboard-extension-usage"/>.
zh_cn: <xref linkend="akri-dashboard-extension-usage"/>中详细介绍了扩展功能。

source: See Rancher Turtles documentation at <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/">https://documentation.suse.com/cloudnative/cluster-api/</link>
es: Consulte la documentación de Rancher Turtles en <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/">https://documentation.suse.com/cloudnative/cluster-api/</link>
ja: <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/">https://documentation.suse.com/cloudnative/cluster-api/</link>にあるRancher Turtlesのドキュメントを参照してください。
pt_br: Consulte a documentação do Rancher Turtles em <link xl:href="https://documentation.suse.com/cloudnative/cluster-api/">https://documentation.suse.com/cloudnative/cluster-api/</link>
zh_cn: 请参见 Rancher Turtles 文档，网址为：<link xl:href="https://documentation.suse.com/cloudnative/cluster-api/">https://documentation.suse.com/cloudnative/cluster-api/</link>

source: Rancher Turtles is a Kubernetes Operator that provides integration between Rancher Manager and Cluster API (CAPI) with the aim of bringing full CAPI support to Rancher
es: Rancher Turtles es un operador de Kubernetes que proporciona integración entre Rancher Manager y Cluster API (CAPI) con el objetivo de ofrecer compatibilidad total con CAPI a Rancher.
ja: Rancher Turtlesは、Rancher ManagerとCluster API (CAPI)の統合を提供するKubernetes Operatorであり、RancherにCAPIの完全サポートをもたらすことを目的としています。
pt_br: O Rancher Turtles é um operador do Kubernetes que proporciona integração entre o Rancher Manager e a Cluster API (CAPI), com o objetivo de levar suporte completo para CAPI ao Rancher.
zh_cn: Rancher Turtles 是一个 Kubernetes 操作器，它提供 Rancher Manager 与 Cluster API (CAPI) 之间的集成，旨在为 Rancher 添加全面的 CAPI 支持

source: Key Features of Rancher Turtles
es: Funciones principales de Rancher Turtles
ja: Rancher Turtlesの主な機能
pt_br: Principais recursos do Rancher Turtles
zh_cn: Rancher Turtles 的主要功能

source: Automatically import CAPI clusters into Rancher, by installing the Rancher Cluster Agent in CAPI provisioned clusters.
es: Importar automáticamente clústeres CAPI a Rancher instalando el agente Rancher Cluster Agent en clústeres aprovisionados por CAPI.
ja: CAPIでプロビジョニングされたクラスタにRancher Cluster Agentをインストールして、CAPIクラスタをRancherに自動的にインポートします。
pt_br: Importar automaticamente clusters CAPI para o Rancher instalando o Rancher Cluster Agent nos clusters provisionados pela CAPI.
zh_cn: 通过在 CAPI 置备的群集中安装 Rancher 群集代理，自动将 CAPI 群集导入 Rancher。

source: Install and configure CAPI controller dependencies via the <link xl:href="https://cluster-api-operator.sigs.k8s.io/">CAPI Operator</link>.
es: Instalar y configurar las dependencias del controlador CAPI a través de <link xl:href="https://cluster-api-operator.sigs.k8s.io/">CAPI Operator</link>.
ja: <link xl:href="https://cluster-api-operator.sigs.k8s.io/">CAPI Operator</link>を介してCAPIコントローラの依存関係をインストールして設定します。
pt_br: Instalar e configurar as dependências do controlador CAPI pelo <link xl:href="https://cluster-api-operator.sigs.k8s.io/">CAPI Operator</link>.
zh_cn: 通过 <link xl:href="https://cluster-api-operator.sigs.k8s.io/">CAPI 操作器</link>安装并配置 CAPI 控制器依赖项。

source: Rancher Turtles use in SUSE Edge
es: Uso de Rancher Turtles en SUSE Edge
ja: SUSE EdgeでのRancher Turtlesの使用
pt_br: Uso do Rancher Turtles no SUSE Edge
zh_cn: Rancher Turtles 在 SUSE Edge 中的使用

source: The SUSE Edge stack provides a helm wrapper chart which installs Rancher Turtles with a specific configuration that enables:
es: La pila de SUSE Edge proporciona un chart wrapper de Helm que instala Rancher Turtles con una configuración específica que habilita lo siguiente:
ja: SUSE Edgeスタックは、Rancher Turtlesを次のコンポーネントを有効にする特定の設定でインストールするhelmラッパーチャートを提供します。
pt_br: A pilha do SUSE Edge oferece um gráfico Helm agrupador que instala o Rancher Turtles com uma configuração específica que habilita:
zh_cn: SUSE Edge 堆栈提供了一个 Helm 封装 chart，该 chart 可使用特定配置安装 Rancher Turtles，以启用：

source: Core CAPI controller components
es: Los componentes de controlador esenciales de CAPI
ja: コアCAPIコントローラコンポーネント
pt_br: Os principais componentes do controlador da CAPI
zh_cn: 核心 CAPI 控制器组件

source: RKE2 Control Plane and Bootstrap provider components
es: Los componentes de proveedor de plano de control y arranque de RKE2
ja: RKE2コントロールプレーンおよびブートストラッププロバイダコンポーネント
pt_br: Os componentes do provedor de plano de controle e de inicialização do RKE2
zh_cn: RKE2 控制平面和引导提供程序组件

source: Metal3 (<xref linkend="components-metal3"/>) infrastructure provider components
es: Los componentes de proveedor de infraestructura de Metal3 (<xref linkend="components-metal3"/>)
ja: Metal3 (<xref linkend="components-metal3"/>)インフラストラクチャプロバイダコンポーネント
pt_br: Os componentes do provedor de infraestrutura do Metal3 (<xref linkend="components-metal3"/>)
zh_cn: Metal3（<xref linkend="components-metal3"/>）基础架构提供程序组件

source: Only the default providers installed via the wrapper chart are supported - alternative Control Plane, Bootstrap and Infrastructure providers are not currently supported as part of the SUSE Edge stack.
es: Solo se admiten los proveedores predeterminados instalados a través del chart wrapper. Los proveedores alternativos de plano de control, arranque e infraestructura no son compatibles actualmente como parte de la pila de SUSE Edge.
ja: ラッパーチャートを介してインストールされるデフォルトプロバイダのみがサポートされます。代替コントロールプレーン、ブートストラップ、およびインフラストラクチャプロバイダは現在、SUSE Edgeスタックの一部としてサポートされていません。
pt_br: Há suporte apenas para os provedores padrão instalados pelo gráfico agrupador. Os provedores alternativos de plano de controle, inicialização e infraestrutura não são suportados atualmente como parte da pilha do SUSE Edge.
zh_cn: 仅支持通过封装 chart 安装的默认提供程序 - 目前不支持替代的控制平面、引导和基础架构提供程序作为 SUSE Edge 堆栈的一部分。

source: Installing Rancher Turtles
es: Instalación de Rancher Turtles
ja: Rancher Turtlesのインストール
pt_br: Instalando o Rancher Turtles
zh_cn: 安装 Rancher Turtles

source: Rancher Turtles may be installed by following the Metal3 Quickstart (<xref linkend="quickstart-metal3"/>) guide, or the Management Cluster (<xref linkend="atip-management-cluster"/>) documentation.
es: Rancher Turtles se puede instalar siguiendo las instrucciones de la guía de inicio rápido de Metal3 (<xref linkend="quickstart-metal3"/>) o la documentación del clúster de gestión (<xref linkend="atip-management-cluster"/>).
ja: Rancher Turtlesは、Metal3クイックスタート(<xref linkend="quickstart-metal3"/>)ガイド、または管理クラスタ(<xref linkend="atip-management-cluster"/>)ドキュメントに従ってインストールできます。
pt_br: É possível instalar o Rancher Turtles seguindo o Guia de Início Rápido do Metal3 (<xref linkend="quickstart-metal3"/>) ou a documentação do cluster de gerenciamento (<xref linkend="atip-management-cluster"/>).
zh_cn: 可按照 Metal3 快速入门（<xref linkend="quickstart-metal3"/>）指南或管理群集（<xref linkend="atip-management-cluster"/>）文档所述安装 Rancher Turtles。

source: <link xl:href="https://fleet.rancher.io">Fleet</link> is a container management and deployment engine designed to offer users more control on the local cluster and constant monitoring through GitOps. Fleet focuses not only on the ability to scale, but it also gives users a high degree of control and visibility to monitor exactly what is installed on the cluster.
es: <link xl:href="https://fleet.rancher.io">Fleet</link> es un motor de gestión y despliegue de contenedores diseñado para ofrecer a los usuarios un mayor control sobre el clúster local y una supervisión constante a través de GitOps. Fleet no solo se centra en la escalabilidad, sino que también proporciona a los usuarios un alto grado de control y visibilidad para supervisar exactamente lo que hay instalado en el clúster.
ja: <link xl:href="https://fleet.rancher.io">Fleet</link>は、ユーザがローカルクラスタをより細かく制御できるようにするとともに、GitOpsを通じて常時監視を行えるようにすることを目的に設計されたコンテナ管理およびデプロイメントエンジンです。Fleetはスケール能力に重点を置いているだけでなく、クラスタに何がインストールされているかを正確に監視するための高度な制御と可視性もユーザに提供します。
pt_br: <link xl:href="https://fleet.rancher.io">Fleet</link> é um mecanismo de gerenciamento e implantação de contêineres desenvolvido para oferecer aos usuários mais controle sobre o cluster local e monitoramento constante por GitOps. O foco do Fleet não está apenas na capacidade de ajustar a escala, mas também em proporcionar aos usuários um alto grau de controle e visibilidade para monitorar exatamente o que está instalado no cluster.
zh_cn: <link xl:href="https://fleet.rancher.io">Fleet</link> 是一个容器管理和部署引擎，旨在让用户更好地控制本地群集，并通过 GitOps 进行持续监控。Fleet 不仅注重缩放能力，而且还为用户提供很高的控制度和可见性，以准确监控群集上安装的组件。

source: Fleet can manage deployments from Git of raw Kubernetes YAML, Helm charts, Kustomize, or any combination of the three. Regardless of the source, all resources are dynamically turned into Helm charts, and Helm is used as the engine to deploy all resources in the cluster. As a result, users can enjoy a high degree of control, consistency and auditability of their clusters.
es: Fleet puede gestionar despliegues desde Git de YAML sin procesar de Kubernetes, charts de Helm, Kustomize o cualquier combinación de los tres sistemas. Independientemente de la fuente, todos los recursos se convierten dinámicamente en charts de Helm, y Helm se utiliza como motor para desplegar todos los recursos en el clúster. Como resultado, los usuarios disfrutan de un alto grado de control, coherencia y auditabilidad de sus clústeres.
ja: Fleetは、生のKubernetes YAML、Helmチャート、Kustomize、またはこれら3つの組み合わせのGitからデプロイメントを管理できます。ソースにかかわらず、すべてのリソースは動的にHelmチャートに変換され、すべてのリソースをクラスタにデプロイするエンジンとしてHelmが使用されます。その結果、ユーザはクラスタの高度な制御、一貫性、監査能力を実現できます。
pt_br: O Fleet gerencia implantações do Git de arquivos YAML brutos no Kubernetes, gráficos Helm, Kustomize ou qualquer combinação dos três. Seja qual for a fonte, todos os recursos são dinamicamente convertidos em gráficos Helm, e o Helm é usado como mecanismo para implantar todos os recursos no cluster. Como resultado, os usuários aproveitam um alto grau de controle, consistência e auditabilidade dos clusters.
zh_cn: Fleet 可以管理通过原始 Kubernetes YAML、Helm chart、Kustomize 的 Git 软件包或这三者的任意组合完成的部署。无论来源是什么，所有资源都会动态转换为 Helm chart，并使用 Helm 作为引擎在群集中部署所有资源。因此，用户可以获享很高的群集控制度、一致性和可审计性。
