Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Use <literal>curl</literal> from the Metal<superscript>3</superscript> control plane to test connectivity to the BMCs via redfish.
es: Use <literal>curl</literal> desde el plano de control de Metal<superscript>3</superscript> para comprobar la conectividad con los BMC a través de Redfish.
ja: Metal<superscript>3</superscript>コントロールプレーンから<literal>curl</literal>を使用して、RedFishを介してBMCへの接続性をテストします。
pt_br: Use <literal>curl</literal> no plano de controle do Metal<superscript>3</superscript> para testar a conectividade com os BMCs pelo Redfish.
zh_cn: 从 Metal<superscript>3</superscript> 控制平面使用 <literal>curl</literal> 测试能否通过 redfish 连接到 BMC。

source: Ensure correct BMC credentials are provided in the <literal>BareMetalHost-Secret</literal> definition.
es: Asegúrese de que se proporcionan las credenciales de BMC correctas en la definición de <literal>BareMetalHost-Secret</literal>.
ja: <literal>BareMetalHost-Secret</literal>定義に正しいBMC資格情報が提供されていることを確認します。
pt_br: Garanta que as credenciais corretas do BMC sejam fornecidas na definição de <literal>BareMetalHost-Secret</literal>.
zh_cn: 确保在 <literal>BareMetalHost-Secret</literal> 定义中提供了正确的 BMC 身份凭证。

source: <emphasis role="strong">Verify turtles/CAPI/metal3 pod status</emphasis>: Ensure the containers on the management cluster are up and running: <literal>kubectl get pods -n metal3-system</literal> and <literal>kubectl get pods -n rancher-turtles-system</literal> (also see <literal>capi-system</literal>, <literal>capm3-system</literal>, <literal>rke2-bootstrap-system</literal> and <literal>rke2-control-plane-system</literal>).
es: <emphasis role="strong">Verifique el estado del pod de turtles/CAPI/metal3</emphasis>: asegúrese de que los contenedores del clúster de gestión estén activos y en ejecución: <literal>kubectl get pods -n metal3-system</literal> y <literal>kubectl get pods -n rancher-turtles-system</literal> (consulte también <literal>capi-system</literal>, <literal>capm3-system</literal>, <literal>rke2-bootstrap-system</literal> y <literal>rke2-control-plane-system</literal>).
ja: <emphasis role="strong">turtles/CAPI/metal3 Podのステータスの確認</emphasis>: 管理クラスタ上のコンテナが稼働中であることを確認します: <literal>kubectl get pods -n metal3-system</literal>および<literal>kubectl get pods -n rancher-turtles-system</literal> (<literal>capi-system</literal>、<literal>capm3-system</literal>、<literal>rke2-bootstrap-system</literal>、および<literal>rke2-control-plane-system</literal>も参照)。
pt_br: <emphasis role="strong">Verifique o status dos pods turtles/CAPI/metal3</emphasis>: garanta que os contêineres no cluster de gerenciamento estejam em funcionamento: <literal>kubectl get pods -n metal3-system</literal> e <literal>kubectl get pods -n rancher-turtles-system</literal> (veja também <literal>capi-system</literal>, <literal>capm3-system</literal>, <literal>rke2-bootstrap-system</literal> e <literal>rke2-control-plane-system</literal>).
zh_cn: <emphasis role="strong">验证 Turtles/CAPI/Metal3 Pod 状态</emphasis>：分别使用以下命令确保管理群集上的容器处于正常运行状态：<literal>kubectl get pods -n metal3-system</literal> 和 <literal>kubectl get pods -n rancher-turtles-system</literal>（另请参见 <literal>capi-system</literal>、<literal>capm3-system</literal>、<literal>rke2-bootstrap-system</literal> 和 <literal>rke2-control-plane-system</literal>）。

source: <emphasis role="strong">Verify the ironic endpoint is reachable from the host being provisioned</emphasis>: The host being provisioned needs to be able to reach out the Ironic endpoint to report back to Metal<superscript>3</superscript>. Check the IP with <literal>kubectl get svc -n metal3-system metal3-metal3-ironic</literal> and try to reach it via <literal>curl/nc</literal>.
es: <emphasis role="strong">Verifique que se pueda acceder al punto final de Ironic desde el host que se está aprovisionando</emphasis>: el host que se está aprovisionando debe poder acceder al punto final de Ironic para informar a Metal<superscript>3</superscript>. Compruebe la IP con <literal>kubectl get svc -n metal3-system metal3-metal3-ironic</literal> e intente acceder a ella mediante <literal>curl/nc</literal>.
ja: <emphasis role="strong">Ironicエンドポイントにプロビジョニング中のホストからアクセスできることを確認する</emphasis>: プロビジョニング中のホストは、レポートをMetal<superscript>3</superscript>に返すため、Ironicエンドポイントにアクセスできる必要があります。<literal>kubectl get svc -n metal3-system metal3-metal3-ironic</literal>を使用してIPを確認し、<literal>curl/nc</literal>経由でアクセスを試みてください。
pt_br: <emphasis role="strong">Verifique se o endpoint do Ironic é acessível ao host provisionado</emphasis>: o host provisionado precisa acessar o endpoint do Ironic para retornar os relatórios ao Metal<superscript>3</superscript>. Verifique o IP com <literal>kubectl get svc -n metal3-system metal3-metal3-ironic</literal> e tente acessá-lo via <literal>curl/nc</literal>.
zh_cn: <emphasis role="strong">验证待置备的主机可访问 Ironic 端点</emphasis>：待置备的主机需要能够访问 Ironic 端点以向 Metal<superscript>3</superscript> 回传状态信息。请使用 <literal>kubectl get svc -n metal3-system metal3-metal3-ironic</literal> 获取 IP，然后通过 <literal>curl/nc</literal> 尝试访问该端点。

source: <emphasis role="strong">Verify the IPA image is reachable from the BMC</emphasis>: IPA is being served by the Ironic endpoint and it needs to be reachable from the BMC as it is being used as a virtual CD.
es: <emphasis role="strong">Verifique que se pueda acceder a la imagen IPA desde el BMC</emphasis>: el punto final Ironic proporciona la imagen IPA, a la que se debe poder acceder desde el BMC, ya que se utiliza como un CD virtual.
ja: <emphasis role="strong">IPAイメージがBMCからアクセスできることを確認する</emphasis>: IPAはIronicエンドポイントによって提供されており、仮想CDとして使用されているため、BMCからアクセスできる必要があります。
pt_br: <emphasis role="strong">Verifique se a imagem do IPA é acessível ao BMC</emphasis>: o IPA é fornecido pelo endpoint do Ironic e precisa ser acessível ao BMC porque é usado como CD virtual.
zh_cn: <emphasis role="strong">验证 BMC 可访问 IPA 映像</emphasis>：IPA 由 Ironic 端点提供，BMC 必须能够访问 IPA，因为后者用作虚拟 CD。

source: <emphasis role="strong">Verify the OS image is reachable from the host being provisioned</emphasis>: The image being used to provision the host needs to be reachable from the host itself (when running IPA) as it will be downloaded temporarily and written to the disk.
es: <emphasis role="strong">Verifique que se pueda acceder a la imagen del sistema operativo desde el host que se está aprovisionando</emphasis>: debe poder accederse a la imagen que se utiliza para aprovisionar el host desde el propio host (cuando se ejecuta IPA), ya que se descargará temporalmente y se escribirá en el disco.
ja: <emphasis role="strong">OSイメージがプロビジョニング中のホストからアクセスできることを確認する</emphasis>: ホストのプロビジョニングに使用されるイメージは、一時的にダウンロードされ、ディスクに書き込まれるため、ホスト自体からアクセスできる必要があります(IPA実行時)。
pt_br: <emphasis role="strong">Verifique se a imagem do sistema operacional é acessível ao host provisionado</emphasis>: a imagem usada para provisionar o host precisa ser acessível ao próprio host (ao executar o IPA) já que ela será baixada temporariamente e gravada no disco.
zh_cn: <emphasis role="strong">验证待置备的主机可访问操作系统映像</emphasis>：运行 IPA 时，待置备主机自身必须能够访问用于置备该主机的映像，因为该映像会被临时下载并写入磁盘。

source: <emphasis role="strong">Examine Metal<superscript>3</superscript> component logs</emphasis>: See above.
es: <emphasis role="strong">Examine los registros de componentes de Metal<superscript>3</superscript></emphasis>: consulte las secciones anteriores.
ja: <emphasis role="strong">Metal<superscript>3</superscript>コンポーネントログの調査</emphasis>: 上記を参照してください。
pt_br: <emphasis role="strong">Examine os registros do componente Metal<superscript>3</superscript></emphasis>: veja acima.
zh_cn: <emphasis role="strong">检查 Metal<superscript>3</superscript> 组件日志</emphasis>：请参见上文。

source: <emphasis role="strong">Retrigger BMH Insepction</emphasis>: If an inspection failed or the hardware of an available host changed, a new inspection process can be triggered by annotating the BMH object with <literal>inspect.metal3.io: ""</literal>. See the <link xl:href="https://book.metal3.io/bmo/inspect_annotation">Metal<superscript>3</superscript> Controlling inspection</link> guide for more information.
es: <emphasis role="strong">Vuelva a lanzar la inspección de BMH</emphasis>: si una inspección falla o cambia el hardware de un host disponible, se puede iniciar un nuevo proceso de inspección anotando el objeto BMH con <literal>inspect.metal3.io: ""</literal>. Consulte la guía de <link xl:href="https://book.metal3.io/bmo/inspect_annotation">inspección de control de Metal<superscript>3</superscript></link> para obtener más información.
ja: <emphasis role="strong">BMH検査の再トリガ</emphasis>: 検査に失敗するか、使用可能なホストのハードウェアが変更された場合、BMHオブジェクトに<literal>inspect.metal3.io: ""</literal>というアノテーションを付けることで、新しい検査プロセスをトリガできます。詳細については、<link xl:href="https://book.metal3.io/bmo/inspect_annotation">Metal<superscript>3</superscript>の「Controlling inspection (検査の制御)」</link>ガイドを参照してください。
pt_br: <emphasis role="strong">Acione novamente a inspeção do BMH</emphasis>: se houver falha em uma inspeção ou se o hardware de um host disponível for modificado, um novo processo de inspeção poderá ser acionado anotando o objeto BMH com <literal>inspect.metal3.io: ""</literal>. Consulte o guia <link xl:href="https://book.metal3.io/bmo/inspect_annotation">Metal<superscript>3</superscript> Controlling inspection</link> (Inspeção de controle do Metal³) para obter mais informações.
zh_cn: <emphasis role="strong">重新触发 BMH 检查</emphasis>：如果检查失败或可用主机的硬件发生变化，可通过为 BMH 对象添加注解 <literal>inspect.metal3.io: ""</literal> 触发新的检查过程。有关详细信息，请参见 <link xl:href="https://book.metal3.io/bmo/inspect_annotation">Metal<superscript>3</superscript> 控制检查</link>指南。

source: <emphasis role="strong">Bare metal IPA console</emphasis>: To troubleshoot IPA issues a couple of alternatives exist:
es: <emphasis role="strong">Panel de control IPA bare metal</emphasis>: para solucionar problemas relacionados con IPA, existen varias alternativas:
ja: <emphasis role="strong">ベアメタルIPAコンソール</emphasis>: IPAの問題をトラブルシューティングするには、いくつかの代替手段が存在します。
pt_br: <emphasis role="strong">Console do IPA bare metal</emphasis>: para solucionar problemas do IPA, há algumas alternativas:
zh_cn: <emphasis role="strong">裸机 IPA 控制台</emphasis>：您可以通过以下几种方法来排查 IPA 问题：

source: Enable “autologin”. This enables the root user to be logged automatically when connecting to the IPA console.
es: Habilite el "inicio de sesión automático". Esto permite que el usuario root inicie sesión automáticamente al conectarse al panel de control de IPA.
ja: 「自動ログイン」を有効にします。これにより、IPAコンソールへの接続時に、ルートユーザが自動的にログインできるようになります。
pt_br: Habilite o "login automático". Isso habilita o login automático do usuário root ao se conectar ao console do IPA.
zh_cn: 启用“自动登录”：这样 root 用户在连接到 IPA 控制台时便会自动登录。

source: This is only for debug purposes as it gives full access to the host.
es: Esto es solo para fines de depuración, ya que proporciona acceso completo al host.
ja: これはホストへの完全なアクセス権を付与するため、デバッグ目的のみに使用されます。
pt_br: Isso é apenas para fins de depuração, já que concede acesso total ao host.
zh_cn: 此功能仅用于调试目的，因为这会授予对主机的完全访问权限。

source: To enable autologin, the Metal3 helm <literal>global.ironicKernelParams</literal> value should look like: <literal>console=ttyS0 suse.autologin=ttyS0</literal> (depending on the console, <literal>ttyS0</literal> can be changed). Then a redeployment of the Metal<superscript>3</superscript> chart should be performed. (Note <literal>ttyS0</literal> is an example, this should match the actual terminal e.g may be <literal>tty1</literal> in many cases on bare metal, this can be verified by looking at the console output from the IPA ramdisk on boot where <literal>/etc/issue</literal> prints the console name).
es: Para habilitar el inicio de sesión automático, el valor de helm <literal>global.ironicKernelParams</literal> de Metal3 debe tener el siguiente aspecto: <literal>console=ttyS0 suse.autologin=ttyS0</literal> (dependiendo del panel de control, <literal>ttyS0</literal> puede cambiarse). A continuación, se debe realizar un nuevo despliegue del chart de Metal<superscript>3</superscript>. (Nota: <literal>ttyS0</literal> es un ejemplo, debe coincidir con el terminal real, por ejemplo, puede ser <literal>tty1</literal> en muchos casos en bare metal. Esto se puede verificar mirando la salida del panel de control desde el ramdisk de IPA al arrancar, donde <literal>/etc/issue</literal> produce el nombre del panel de control).
ja: 自動ログインを有効にするには、Metal3 helmの<literal>global.ironicKernelParams</literal>値が<literal>console=ttyS0 suse.autologin=ttyS0</literal>のようになる必要があります(コンソールによっては、<literal>ttyS0</literal>を変更できます)。次にMetal<superscript>3</superscript>チャートの再デプロイメントを実行する必要があります(<literal>ttyS0</literal>は一例であり、実際の端末と一致する必要があることに注意してください。たとえば、ベアメタルでは多くの場合<literal>tty1</literal>となります。これは、起動時にIPA RAMディスクのコンソール出力で<literal>/etc/issue</literal>にコンソール名が表示されていることを見ることで確認できます)。
pt_br: Para habilitar o login automático, o valor <literal>global.ironicKernelParams</literal> do Helm do Metal3 deve ser assim: <literal>console=ttyS0 suse.autologin=ttyS0</literal> (dependendo do console, <literal>ttyS0</literal> pode ser alterado). Em seguida, é necessário reimplantar o gráfico do Metal<superscript>3</superscript>. (Observe que <literal>ttyS0</literal> é um exemplo, ele deve corresponder ao terminal real, por exemplo, em muitos casos, pode ser <literal>tty1</literal> em bare metal. Para confirmar isso, observe a saída do console do ramdisk IPA na inicialização, em que <literal>/etc/issue</literal> mostra o nome do console).
zh_cn: 要启用自动登录功能，应将 Metal3 helm 的 <literal>global.ironicKernelParams</literal> 设置为 <literal>console=ttyS0 suse.autologin=ttyS0</literal>（根据控制台的不同，可将 <literal>ttyS0</literal> 替换为其他值）。然后需要重新部署 Metal<superscript>3</superscript> chart。（注意：<literal>ttyS0</literal> 是示例，具体的值应与实际终端匹配。例如在裸机上，该值通常为 <literal>tty1</literal>，可通过查看主机引导时 IPA 内存盘的控制台输出来确定，因为其中的 <literal>/etc/issue</literal> 会列显控制台名称。）

source: Another way to do it is by changing the <literal>IRONIC_KERNEL_PARAMS</literal> parameter on the <literal>ironic-bmo</literal> configmap on the <literal>metal3-system</literal> namespace. This can be easier as it can be done via <literal>kubectl</literal> edit but it will be overwritten when updating the chart. Then the Metal<superscript>3</superscript> pod needs to be restarted with <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>.
es: Otra forma de hacerlo es cambiando el parámetro <literal>IRONIC_KERNEL_PARAMS</literal> en el mapa de configuración <literal>ironic-bmo</literal> del espacio de nombres <literal>metal3-system</literal>. Esto puede resultar más sencillo, ya que se puede hacer editando <literal>kubectl</literal>, pero se sobrescribirá al actualizar el chart. A continuación, es necesario reiniciar el pod de Metal<superscript>3</superscript> con <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>.
ja: 別の方法は、<literal>metal3-system</literal>ネームスペースの<literal>ironic-bmo</literal> configmapの<literal>IRONIC_KERNEL_PARAMS</literal>パラメータを変更することです。この方法は、<literal>kubectl</literal> editで実行できるため簡単ですが、チャートを更新すると上書きされます。その後、Metal<superscript>3</superscript> Podを<literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>で再起動する必要があります。
pt_br: Outra maneira de fazer isso é alterar o parâmetro <literal>IRONIC_KERNEL_PARAMS</literal> no mapa de configuração <literal>ironic-bmo</literal> do namespace <literal>metal3-system</literal>. Isso pode ser mais fácil porque é feito pela edição de <literal>kubectl</literal>, mas será substituído ao atualizar o gráfico. Depois disso, o pod do Metal<superscript>3</superscript> precisará ser reiniciado com <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>.
zh_cn: 另一种方法是更改 <literal>metal3-system</literal> 名称空间内 <literal>ironic-bmo</literal> configmap 中的 <literal>IRONIC_KERNEL_PARAMS</literal> 参数。通过 <literal>kubectl</literal> edit 进行操作会更简单，但更新 chart 时，该参数会被覆盖。之后需要使用 <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal> 重启 Metal<superscript>3</superscript> Pod。

source: Inject an ssh key for the root user on the IPA.
es: Inyecte una clave ssh para el usuario root en el IPA.
ja: IPAにルートユーザのsshキーを挿入します。
pt_br: Injete uma chave SSH para o usuário root no IPA.
zh_cn: 为 IPA 的 root 用户注入 SSH 密钥。

source: To inject the ssh key for the root user, the Metal<superscript>3</superscript> helm <literal>debug.ironicRamdiskSshKey</literal> value should be used. Then a redeployment of the Metal<superscript>3</superscript> chart should be performed.
es: Para inyectar la clave ssh para el usuario root, se debe utilizar el valor de helm <literal>debug.ironicRamdiskSshKey</literal> de Metal<superscript>3</superscript>. A continuación, se debe realizar un nuevo despliegue del chart de Metal<superscript>3</superscript>.
ja: ルートユーザのsshキーを挿入するには、Metal<superscript>3</superscript> helm <literal>debug.ironicRamdiskSshKey</literal>値を使用する必要があります。その後、Metal<superscript>3</superscript> チャートの再デプロイメントを実行する必要があります。
pt_br: Para injetar a chave SSH para o usuário root, o valor <literal>debug.ironicRamdiskSshKey</literal> do Helm do Metal<superscript>3</superscript> deve ser usado. Em seguida, reimplante o gráfico do Metal<superscript>3</superscript>.
zh_cn: 可通过 Metal<superscript>3</superscript> Helm 的 <literal>debug.ironicRamdiskSshKey</literal> 参数注入 root 用户的 SSH 密钥。然后需要重新部署 Metal<superscript>3</superscript> chart。

source: Another way to do it is by changing the <literal>IRONIC_RAMDISK_SSH_KEY</literal> parameter on the <literal>ironic-bmo configmap</literal> on the <literal>metal3-system</literal> namespace. This can be easier as it can be done via <literal>kubectl</literal> edit but it will be overwritten when updating the chart. Then the Metal<superscript>3</superscript> pod needs to be restarted with <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>
es: Otra forma de hacerlo es cambiando el parámetro <literal>IRONIC_RAMDISK_SSH_KEY</literal> en el mapa de configuración <literal>ironic-bmo</literal> del espacio de nombres <literal>metal3-system</literal>. Esto puede resultar más sencillo, ya que se puede hacer editando <literal>kubectl</literal>, pero se sobrescribirá al actualizar el chart. A continuación, es necesario reiniciar el pod de Metal<superscript>3</superscript> con <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>.
ja: 別の方法は、<literal>metal3-system</literal>ネームスペースの<literal>ironic-bmo configmap</literal>の<literal>IRONIC_RAMDISK_SSH_KEY</literal>パラメータを変更することです。この方法は、<literal>kubectl</literal> editで実行できるため簡単ですが、チャートを更新すると上書きされます。その後、Metal<superscript>3</superscript> Podを<literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>で再起動する必要があります。
pt_br: Outra maneira de fazer isso é alterar o parâmetro <literal>IRONIC_RAMDISK_SSH_KEY</literal> no <literal>ironic-bmo configmap</literal> do namespace <literal>metal3-system</literal>. Isso pode ser mais fácil porque é feito pela edição de <literal>kubectl</literal>, mas será substituído durante a atualização do gráfico. Em seguida, o pod do Metal<superscript>3</superscript> precisa ser reiniciado com <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal>
zh_cn: 另一种方法是更改 <literal>metal3-system</literal> 名称空间内 <literal>ironic-bmo configmap</literal> 中的 <literal>IRONIC_RAMDISK_SSH_KEY</literal> 参数。通过 <literal>kubectl</literal> edit 进行操作会更简单，但更新 chart 时，该参数会被覆盖。之后需要使用 <literal>kubectl delete pod -n metal3-system -l app.kubernetes.io/component=ironic</literal> 重启 Metal<superscript>3</superscript> Pod。

source: Check the <link xl:href="https://cluster-api.sigs.k8s.io/user/troubleshooting">CAPI troubleshooting</link> and <link xl:href="https://book.metal3.io/troubleshooting">Metal<superscript>3</superscript> troubleshooting</link> guides.
es: Consulte las guías de <link xl:href="https://cluster-api.sigs.k8s.io/user/troubleshooting">resolución de problemas de CAPI</link> y de <link xl:href="https://book.metal3.io/troubleshooting">resolución de problemas de Metal<superscript>3</superscript></link>.
ja: <link xl:href="https://cluster-api.sigs.k8s.io/user/troubleshooting">CAPIトラブルシューティング</link>ガイドと<link xl:href="https://book.metal3.io/troubleshooting">Metal<superscript>3</superscript>トラブルシューティング</link>ガイドを確認してください。
pt_br: Consulte os guias de <link xl:href="https://cluster-api.sigs.k8s.io/user/troubleshooting">solução de problemas da CAPI</link> e de <link xl:href="https://book.metal3.io/troubleshooting">solução de problemas do Metal<superscript>3</superscript></link>.
zh_cn: 请参见 <link xl:href="https://cluster-api.sigs.k8s.io/user/troubleshooting">CAPI 查错</link>指南和 <link xl:href="https://book.metal3.io/troubleshooting">Metal<superscript>3</superscript> 查错</link>指南。

source: Troubleshooting Other components
es: Resolución de problemas de otros componentes
ja: その他のコンポーネントのトラブルシューティング
pt_br: Solução de problemas de outros componentes
zh_cn: 对其他组件查错

source: Other SUSE Edge components troubleshooting guides can be consulted on their official documentation:
es: Es posible consultar otras guías de resolución de problemas de componentes de SUSE Edge en su documentación oficial respectiva:
ja: その他のSUSE Edgeコンポーネントのトラブルシューティングガイドについては、それぞれの公式ドキュメントを参照してください。
pt_br: Consulte os guias de solução de problemas de outros componentes do SUSE Edge na respectiva documentação oficial:
zh_cn: 其他 SUSE Edge 组件的查错指南可在相应组件的官方文档中找到：

source: <link xl:href="https://documentation.suse.com/smart/micro-clouds/html/SLE-Micro-5.5-admin/index.html#id-1.10">SUSE Linux Micro Troubleshooting</link>
es: <link xl:href="https://documentation.suse.com/smart/micro-clouds/html/SLE-Micro-5.5-admin/index.html#id-1.10">Resolución de problemas de SUSE Linux Micro</link>
ja: <link xl:href="https://documentation.suse.com/smart/micro-clouds/html/SLE-Micro-5.5-admin/index.html#id-1.10">SUSE Linux Microのトラブルシューティング</link>
pt_br: <link xl:href="https://documentation.suse.com/smart/micro-clouds/html/SLE-Micro-5.5-admin/index.html#id-1.10">Solução de problemas do SUSE Linux Micro</link>
zh_cn: <link xl:href="https://documentation.suse.com/smart/micro-clouds/html/SLE-Micro-5.5-admin/index.html#id-1.10">SUSE Linux Micro 查错</link>

source: <link xl:href="https://docs.rke2.io/known_issues">RKE2 Known Issues</link>
es: <link xl:href="https://docs.rke2.io/known_issues">Problemas conocidos de RKE2</link>
ja: <link xl:href="https://docs.rke2.io/known_issues">RKE2の既知の問題</link>
pt_br: <link xl:href="https://docs.rke2.io/known_issues">Problemas conhecidos do RKE2</link>
zh_cn: <link xl:href="https://docs.rke2.io/known_issues">RKE2 已知问题</link>

source: <link xl:href="https://docs.k3s.io/known-issues">K3s Known Issues</link>
es: <link xl:href="https://docs.k3s.io/known-issues">Problemas conocidos de K3s</link>
ja: <link xl:href="https://docs.k3s.io/known-issues">K3sの既知の問題</link>
pt_br: <link xl:href="https://docs.k3s.io/known-issues">Problemas conhecidos do K3s</link>
zh_cn: <link xl:href="https://docs.k3s.io/known-issues">K3s 已知问题</link>

source: <link xl:href="https://ranchermanager.docs.rancher.com/troubleshooting/general-troubleshooting">Rancher General Troubleshooting</link>
es: <link xl:href="https://ranchermanager.docs.rancher.com/troubleshooting/general-troubleshooting">Resolución de problemas generales de Rancher</link>
ja: <link xl:href="https://ranchermanager.docs.rancher.com/troubleshooting/general-troubleshooting">Rancherの一般的なトラブルシューティング</link>
pt_br: <link xl:href="https://ranchermanager.docs.rancher.com/troubleshooting/general-troubleshooting">Solução de problemas gerais do Rancher</link>
zh_cn: <link xl:href="https://ranchermanager.docs.rancher.com/troubleshooting/general-troubleshooting">Rancher 常规查错</link>
