Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The following code defines a ClusterClass resource, a declarative template for consistently deploying a specific type of Kubernetes cluster. This specification includes common infrastructure and control plane configurations, enabling efficient provisioning and uniform lifecycle management across a cluster fleet. There are some variables in the following clusterclass example, that will be replaced during the cluster instatiation process using the real values. The following variables are used in the example:
es: El siguiente código define un recurso ClusterClass, una plantilla declarativa para desplegar de forma coherente un tipo específico de clúster de Kubernetes. Esta especificación incluye configuraciones comunes de infraestructura y plano de control, lo que permite un aprovisionamiento eficiente y una gestión uniforme del ciclo de vida en toda una flota de clústeres. En el siguiente ejemplo de ClusterClass, algunas variables se sustituirán durante el proceso de instanciación del clúster por los valores reales. En el ejemplo se utilizan las siguientes variables:
ja: 以下のコードは、特定のタイプのKubernetesクラスタを一貫してデプロイするための宣言型テンプレートである、ClusterClassリソースを定義します。この仕様には、共通のインフラストラクチャとコントロールプレーンの設定が含まれており、クラスタフリート全体にわたる効率的なプロビジョニングと統一されたライフサイクル管理が可能になります。以下のClusterClassの例にはいくつかの変数があり、実際の値を使用してクラスタインスタンス化プロセス中に置き換えられます。例では次の変数が使用されています。
pt_br: O código a seguir define o recurso ClusterClass, um gabarito declarativo para implantação consistente de um tipo específico de cluster Kubernetes. Essa especificação inclui as configurações comuns de infraestrutura e de plano de controle, o que permite o provisionamento eficiente e o gerenciamento do ciclo de vida uniforme de toda a frota de clusters. Há algumas variáveis no exemplo abaixo do clusterclass que serão substituídas pelos valores reais durante o processo de criação de instância do cluster. As seguintes variáveis são usadas no exemplo:
zh_cn: 以下代码定义了一个 ClusterClass 资源，这是一个用于采用一致方式部署特定 Kubernetes 群集类型的声明式模板。该规范包含通用的基础架构和控制平面配置，可实现群集 Fleet 的高效置备和统一生命周期管理。下面的 clusterclass 示例中包含一些变量，这些变量将在群集实例化过程中被实际值替换。示例中使用的变量如下：

source: <literal>controlPlaneMachineTemplate</literal>: This is the name to define the ControlPlane Machine Template reference to be used
es: <literal>controlPlaneMachineTemplate</literal>: este es el nombre que define la referencia de la plantilla del equipo de plano de control que se va a utilizar.
ja: <literal>controlPlaneMachineTemplate</literal>: 使用されるControlPlane Machine Template参照を定義する名前です
pt_br: <literal>controlPlaneMachineTemplate</literal>: esse é o nome para definir a referência de gabarito da máquina do ControlPlane que será usada
zh_cn: <literal>controlPlaneMachineTemplate</literal>：这是用于定义要使用的控制平面计算机模板引用的名称

source: <literal>controlPlaneEndpointHost</literal>: This is the host name or IP address of the control plane endpoint
es: <literal>controlPlaneEndpointHost</literal>: este es el nombre de host o la dirección IP del punto final del plano de control.
ja: <literal>controlPlaneEndpointHost</literal>: コントロールプレーンエンドポイントのホスト名またはIPアドレスです
pt_br: <literal>controlPlaneEndpointHost</literal>: esse é o nome de host ou endereço IP do endpoint do plano de controle
zh_cn: <literal>controlPlaneEndpointHost</literal>：这是控制平面端点的主机名或 IP 地址

source: <literal>tlsSan</literal>: This is the TLS Subject Alternative Name for the control plane endpoint
es: <literal>tlsSan</literal>: este es el nombre alternativo del sujeto TLS para el punto final del plano de control.
ja: <literal>tlsSan</literal>: コントロールプレーンエンドポイントのTLSサブジェクト代替名です
pt_br: <literal>tlsSan</literal>: esse é o nome alternativo da entidade TLS para o endpoint do plano de controle
zh_cn: <literal>tlsSan</literal>：这是控制平面端点的 TLS 主题备用名称

source: The clusterclass definition file is defined based on the 3 following resources:
es: El archivo de definición de ClusterClass se basa en los tres recursos siguientes:
ja: ClusterClass定義ファイルは、次の3つのリソースに基づいて定義されます。
pt_br: O arquivo de definição de clusterclass é definido com base nos três recursos a seguir:
zh_cn: clusterclass 定义文件基于以下 3 种资源定义：

source: <emphasis role="strong">ClusterClass</emphasis>: This resource encapsulates the entire cluster class definition, including the control plane and infrastructure templates. Moreover, it include the list of variables that will be replaced during the instantiation process.
es: <emphasis role="strong">ClusterClass</emphasis>: este recurso encapsula toda la definición de ClusterClass, incluyendo el plano de control y las plantillas de infraestructura. Además, incluye la lista de variables que se sustituirán durante el proceso de instanciación.
ja: <emphasis role="strong">ClusterClass</emphasis>: このリソースは、コントロールプレーンとインフラストラクチャテンプレートを含むClusterClass定義全体をカプセル化します。また、インスタンス化プロセス中に置き換えられる変数のリストも含まれます。
pt_br: <emphasis role="strong">ClusterClass</emphasis>: esse recurso encapsula a definição da classe do cluster inteira, incluindo os gabaritos de plano de controle e de infraestrutura. Além disso, ele inclui a lista das variáveis que serão substituídas durante o processo de criação de instâncias.
zh_cn: <emphasis role="strong">ClusterClass</emphasis>：此资源封装了整个群集类定义，包括控制平面和基础架构模板。此外，它还包含在实例化过程中将被替换的变量列表。

source: <emphasis role="strong">RKE2ControlPlaneTemplate</emphasis>: This resource defines the control plane template, specifying the desired configuration for the control plane nodes. It includes parameters such as the number of replicas, the Kubernetes version, and the CNI to be used. Also, some paremeters will be replaced with the right values during the instantiation process.
es: <emphasis role="strong">RKE2ControlPlaneTemplate</emphasis>: este recurso define la plantilla del plano de control y especifica la configuración deseada para los nodos de plano de control. Incluye parámetros como el número de réplicas, la versión de Kubernetes y la CNI que se va a utilizar. Además, algunos parámetros se sustituirán por los valores correctos durante el proceso de instanciación.
ja: <emphasis role="strong">RKE2ControlPlaneTemplate</emphasis>: このリソースは、コントロールプレーンテンプレートを定義し、コントロールプレーンノードの目的の設定を指定します。レプリカ数、Kubernetesバージョン、使用するCNIなどのパラメータが含まれます。また、一部のパラメータは、インスタンス化プロセス中に適切な値に置き換えられます。
pt_br: <emphasis role="strong">RKE2ControlPlaneTemplate</emphasis>: esse recurso define o gabarito do plano de controle, especificando a configuração desejada para os nós do plano de controle. Ele inclui os parâmetros, como número de réplicas, versão do Kubernetes e CNI, que serão usados. Alguns parâmetros também serão substituídos pelos valores corretos durante o processo de criação de instâncias.
zh_cn: <emphasis role="strong">RKE2ControlPlaneTemplate</emphasis>：此资源定义控制平面模板，指定期望的控制平面节点配置。它包含复本数量、Kubernetes 版本、要使用的 CNI 等参数。此外，一些参数在实例化过程中将被替换为适当的值。

source: <emphasis role="strong">Metal3ClusterTemplate</emphasis>: This resource defines the infrastructure template, specifying the desired configuration for the underlying infrastructure. It includes parameters such as the control plane endpoint and the noCloudProvider flag. Also, some paremeters will be replaced with the right values during the instantiation process.
es: <emphasis role="strong">Metal3ClusterTemplate</emphasis>: este recurso define la plantilla de infraestructura y especifica la configuración deseada para la infraestructura subyacente. Incluye parámetros como el punto final del plano de control y el indicador noCloudProvider. Además, algunos parámetros se sustituirán por los valores correctos durante el proceso de instanciación.
ja: <emphasis role="strong">Metal3ClusterTemplate</emphasis>: このリソースは、インフラストラクチャテンプレートを定義し、基盤となるインフラストラクチャの目的の設定を指定します。コントロールプレーンエンドポイントやnoCloudProviderフラグなどのパラメータが含まれます。また、一部のパラメータは、インスタンス化プロセス中に適切な値に置き換えられます。
pt_br: <emphasis role="strong">Metal3ClusterTemplate</emphasis>: esse recurso define o gabarito de infraestrutura, especificando a configuração desejada da infraestrutura subjacente. Ele inclui parâmetros, como o endpoint do plano de controle e o sinalizador noCloudProvider. Alguns parâmetros também serão substituídos pelos valores corretos durante o processo de criação de instâncias.
zh_cn: <emphasis role="strong">Metal3ClusterTemplate</emphasis>：此资源定义基础架构模板，指定期望的底层基础架构配置。它包含控制平面端点、noCloudProvider 标志等参数。此外，一些参数在实例化过程中将被替换为适当的值。

source: Cluster instance definition
es: Definición de la instancia del clúster
ja: クラスタインスタンス定義
pt_br: Definição da instância do cluster
zh_cn: 群集实例定义

source: Within the context of ClusterClass, a cluster instance refers to a specific, running instantiation of a cluster that has been created based on a defined ClusterClass. It represents a concrete deployment with its unique configurations, resources, and operational state, directly derived from the blueprint specified in the ClusterClass. This includes the specific set of machines, networking configurations, and associated Kubernetes components that are actively running. Understanding the cluster instance is crucial for managing the lifecycle, performing upgrades, executing scaling operations, and conducting monitoring of a particular deployed cluster that was provisioned using the ClusterClass framework.
es: En el contexto de ClusterClass, una instancia de clúster es una instancia concreta y en ejecución de un clúster creado a partir de una ClusterClass definida. Representa un despliegue concreto con sus configuraciones, recursos y estado operativo únicos, que se derivan directamente del modelo especificado en la ClusterClass. Esto incluye el conjunto específico de equipos, configuraciones de red y componentes de Kubernetes asociados que se están ejecutando activamente. Comprender la instancia del clúster es fundamental para gestionar su ciclo de vida, realizar actualizaciones, ejecutar operaciones de escalado y supervisar un clúster desplegado concreto que se ha aprovisionado utilizando el marco ClusterClass.
ja: ClusterClassのコンテキストにおいて、クラスタインスタンスとは、定義されているClusterClassに基づいて作成されたクラスタの特定の実行中のインスタンスを指します。これは、ClusterClassで指定されたブループリントから直接派生した固有の設定、リソース、および運用状態を持つ具体的なデプロイメントを表します。これには、アクティブに実行されている特定のマシンのセット、ネットワーキング設定、および関連するKubernetesコンポーネントが含まれます。クラスタインスタンスを理解することは、ClusterClassフレームワークを使用してプロビジョニングされた特定のデプロイ済みクラスタのライフサイクルの管理、アップグレードの実行、スケーリング操作の実行、および監視の実行に必要不可欠です。
pt_br: No contexto do ClusterClass, uma instância de cluster se refere à criação de instância em execução específica de um cluster que foi criado com base no ClusterClass definido. Isso representa a implantação concreta com suas configurações, recursos e estado operacional exclusivos, derivados diretamente do diagrama de referência especificado no ClusterClass. Isso inclui o conjunto específico de máquinas, as configurações de rede e os componentes associados do Kubernetes que estão ativamente em execução. Saber o que é uma instância de cluster é essencial para gerenciar o ciclo de vida, fazer upgrades, executar operações de ajuste de escala e monitorar um determinado cluster implantado que foi provisionado usando a estrutura do ClusterClass.
zh_cn: 在 ClusterClass 的概念中，群集实例指的是基于定义的 ClusterClass 创建且已实例化的特定运行中群集。它代表一个具体的部署，基于 ClusterClass 中指定的蓝图直接衍生而成，具有独特的配置、资源和运行状态。这包括正在运行的一组特定计算机、网络配置以及相关的 Kubernetes 组件。要管理使用 ClusterClass 框架置备的特定已部署群集的生命周期、执行升级、进行扩容操作和实施监控，理解群集实例至关重要。

source: To define a cluster instance we need to define the following resources:
es: Para definir una instancia de clúster, debemos definir los siguientes recursos:
ja: クラスタインスタンスを定義するには、次のリソースを定義する必要があります。
pt_br: Para definir uma instância de cluster, precisamos definir os seguintes recursos:
zh_cn: 要定义一个群集实例，需要定义以下资源：

source: Cluster
zh_cn: 群集

source: The variables defined previously in the template (clusterclass definition file) will be replaced with the final values for this instantiation of cluster:
es: Las variables definidas previamente en la plantilla (archivo de definición de ClusterClass) se sustituirán por los valores finales para esta instanciación del clúster:
ja: テンプレート(ClusterClass定義ファイル)で以前に定義された変数は、クラスタのインスタンス化の最終値に置き換えられます。
pt_br: As variáveis definidas no gabarito (arquivo de definição de clusterclass) serão substituídas pelos valores finais para esta criação de instância do cluster:
zh_cn: 之前在模板（clusterclass 定义文件）中定义的变量将被替换为该群集实例化后的最终值：

source: This approach allows for a more streamlined process, deploying a cluster with only 3 resources once you have defined the clusterclass.
es: Este enfoque permite un proceso más ágil, ya que es posible desplegar un clúster con solo 3 recursos una vez que se ha definido ClusterClass.
ja: このアプローチにより、ClusterClassを定義したら、3つのみのリソースでクラスタをデプロイする、より効率的なプロセスが可能になります。
pt_br: Essa abordagem permite um processo mais ágil, implantando um cluster com apenas três recursos assim que você define o clusterclass.
zh_cn: 这种方法使整个过程更加精简，一旦定义了 clusterclass，只需定义 3 种资源即可部署一个群集。

source: Tips and Tricks
es: Consejos y trucos
ja: ヒントとコツ
pt_br: Dicas e truques
zh_cn: 提示和技巧

source: Tips and tricks for Edge components
es: Consejos y trucos para componentes de Edge
ja: Edgeコンポーネントのヒントとコツ
pt_br: Dicas e truques para componentes do Edge
zh_cn: 关于 Edge 组件的提示和技巧

source: Common
es: Comunes
ja: 一般
pt_br: Comuns
zh_cn: 通用

source: If you are in a non-Linux environment and following these instructions to build an image, then you are likely running <literal>Podman</literal> via a virtual machine. By default, this virtual machine will be configured to have a small amount of system resources allocated to it and can cause instability for <literal>Edge Image Builder</literal> during resource intensive operations, such as the RPM resolution process. You will need to adjust the resources of the podman machine, either by using Podman Desktop (settings cogwheel → podman machine edit icon) or directly via the <literal>podman-machine-set</literal> <link xl:href="https://docs.podman.io/en/stable/markdown/podman-machine-set.1.html">command</link>
es: Si se encuentra en un entorno que no sea Linux y sigue estas instrucciones para crear una imagen, es probable que esté ejecutando <literal>Podman</literal> a través de una máquina virtual. De forma predeterminada, esta máquina virtual estará configurada para tener asignada una pequeña cantidad de recursos del sistema, lo que puede provocar inestabilidad en <literal>Edge Image Builder</literal> durante operaciones que consumen muchos recursos, como el proceso de resolución de RPM. Deberá ajustar los recursos de la máquina de Podman, ya sea utilizando Podman Desktop (icono de configuración → icono de edición de máquina de Podman) o directamente mediante el <link xl:href="https://docs.podman.io/en/stable/markdown/podman-machine-set.1.html">comando</link> <literal>podman-machine-set</literal>.
ja: Linux以外の環境でこれらの手順に従ってイメージを構築する場合、仮想マシン経由で<literal>Podman</literal>を実行している可能性があります。デフォルトでは、この仮想マシンにはシステムリソースが少量割り当てられるように設定され、RPM解決プロセスなどのリソース集約的な操作を実行する際に、<literal>Edge Image Builder</literal>が不安定な動作を引き起こす可能性があります。その場合は、Podmanマシンのリソースを調整する必要があります。調整するには、Podman Desktop (設定の歯車→Podmanマシン編集アイコン)を使用するか、直接<literal>podman-machine-set</literal><link xl:href="https://docs.podman.io/en/stable/markdown/podman-machine-set.1.html">コマンド</link>を実行してください。
pt_br: Se você está em um ambiente não Linux e seguindo estas instruções para criar uma imagem, provavelmente está executando o <literal>Podman</literal> em uma máquina virtual. Por padrão, essa máquina virtual está configurada para ter uma pequena quantidade de recursos do sistema alocada para ela e pode provocar instabilidade no <literal>Edge Image Builder</literal> durante operações de uso intensivo de recursos, como o processo de resolução de RPM. Será necessário ajustar os recursos da máquina do podman usando o Podman Desktop (ícone de engrenagem de configurações → ícone de edição da máquina do podman) ou diretamente pelo <link xl:href="https://docs.podman.io/en/stable/markdown/podman-machine-set.1.html">comando</link> <literal>podman-machine-set</literal>.
zh_cn: 如果您处于非 Linux 环境中，并且按照这些说明来构建映像，那么您可能是通过虚拟机运行 <literal>Podman</literal> 的。默认情况下配置的此类虚拟机只会分配到少量系统资源，这可能会在 <literal>Edge Image Builder</literal> 执行资源密集型操作（如 RPM 解析过程）时产生不稳定因素。您需要调整 Podman 计算机的资源，可通过 Podman Desktop（设置齿轮图标→Podman 计算机编辑图标）或直接使用 <literal>podman-machine-set</literal> <link xl:href="https://docs.podman.io/en/stable/markdown/podman-machine-set.1.html">命令</link>来完成。

source: At this point in time, the <literal>Edge Image Builder</literal> is not able to build images in a cross architecture setup, i.e. you have to run it on:
es: En este momento, <literal>Edge Image Builder</literal> no puede crear imágenes en una configuración de arquitectura cruzada, es decir, debe ejecutarlo en:
ja: 現時点では、<literal>Edge Image Builder</literal>はクロスアーキテクチャセットアップでイメージを構築できません。すなわち、以下の環境で実行する必要があります。
pt_br: Neste momento, o <literal>Edge Image Builder</literal> não pode criar imagens em uma configuração de arquitetura cruzada, ou seja, você deve executá-lo em:
zh_cn: 目前，<literal>Edge Image Builder</literal> 无法在跨体系结构环境中构建映像，也就是说，您必须在适当系统中运行该工具来构建相应映像：

source: AArch64 systems (such as Apple Silicon) to build SL Micro <literal>aarch64</literal> images
es: Sistemas AArch64 (como Apple Silicon) para crear imágenes <literal>aarch64</literal> de SL Micro
ja: SL Micro <literal>aarch64</literal>イメージを構築する場合は、AArch64システム(Apple Siliconなど)
pt_br: Sistemas AArch64 (como Apple Silicon) para criar imagens <literal>aarch64</literal> do SL Micro
zh_cn: 在 AArch64 系统（如 Apple Silicon） 中构建 SL Micro <literal>aarch64</literal> 映像

source: AMD64/Intel 64 systems to build SL Micro <literal>x86_64</literal> images.
es: Sistemas AMD64/Intel 64 para crear imágenes <literal>x86_64</literal> de SL Micro
ja: SL Micro <literal>x86_64</literal>イメージを構築する場合は、AMD64/Intel 64システム
pt_br: Sistemas AMD64/Intel 64 para criar imagens <literal>x86_64</literal> do SL Micro
zh_cn: 在 AMD64/Intel 64 系统中构建 SL Micro <literal>x86_64</literal>映像。

source: Creating multi node Kubernetes clusters requires adjusting the <literal>kubernetes</literal> section in the definition file to:
es: Para crear clústeres de Kubernetes de varios nodos, es necesario ajustar la sección <literal>kubernetes</literal> del archivo de definición para:
ja: マルチノードのKubernetesクラスタを作成するには、定義ファイルの<literal>kubernetes</literal>セクションを以下を実行するように調整する必要があります。
pt_br: A criação de clusters Kubernetes de vários nós requer o ajuste da seção <literal>kubernetes</literal> no arquivo de definição para:
zh_cn: 如要创建多节点 Kubernetes 群集，则需要对定义文件中的 <literal>kubernetes</literal> 部分进行以下调整：

source: list all server and agent nodes under <literal>kubernetes.nodes</literal>
es: Mostrar todos los nodos de servidor y agente de <literal>kubernetes.nodes</literal>
ja: <literal>kubernetes.nodes</literal>の下にすべてのサーバおよびエージェントノードをリストする。
pt_br: listar todos os nós de servidor e de agente em <literal>kubernetes.nodes</literal>
zh_cn: 在 <literal>kubernetes.nodes</literal> 下列出所有服务器节点和代理节点

source: set a virtual IP address that would be used for all non-initializer nodes to join the cluster under <literal>kubernetes.network.apiVIP</literal>
es: Establecer una dirección IP virtual que se utilizaría para que todos los nodos no inicializadores se unan al clúster en <literal>kubernetes.network.apiVIP</literal>
ja: <literal>kubernetes.network.apiVIP</literal>の下に、すべてのnon-initializerノードがクラスタに参加するために使用する仮想IPアドレスを設定する。
pt_br: definir um endereço IP virtual que será usado para que todos os nós não inicializadores ingressem no cluster em <literal>kubernetes.network.apiVIP</literal>
zh_cn: 在 <literal>kubernetes.network.apiVIP</literal> 下设置一个虚拟 IP 地址，供所有非初始化节点加入群集时使用

source: optionally, set an API host to specify a domain address for accessing the cluster under <literal>kubernetes.network.apiHost</literal> To learn more about this configuration, please refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">Kubernetes section docs</link>.
es: Opcionalmente, configurar un host de API para especificar una dirección de dominio de acceso al clúster en <literal>kubernetes.network.apiHost</literal>. Para obtener más información sobre esta configuración, consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">sección sobre Kubernetes de la documentación</link>.
ja: オプションで、<literal>kubernetes.network.apiHost</literal>の下に、クラスタにアクセスするためのドメインアドレスを指定するようにAPIホストを設定する。この設定の詳細については、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">Kubernetesセクションのドキュメント</link>を参照してください。
pt_br: (opcional) definir um host de API para especificar o endereço do domínio para acessar o cluster em <literal>kubernetes.network.apiHost</literal>. Para saber mais sobre essa configuração, consulte os <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">documentos da seção do Kubernetes</link>
zh_cn: （可选）在 <literal>kubernetes.network.apiHost</literal> 下设置一个 API 主机，以指定用于访问群集的域名地址。要了解有关此配置的详细信息，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/main/docs/building-images.md#kubernetes">介绍 Kubernetes 各部分的文档</link>。

source: <literal>Edge Image Builder</literal> relies on the hostnames of the different nodes to determine their Kubernetes type (<literal>server</literal> or <literal>agent</literal>). While this configuration is managed in the definition file, for the general networking setup of the machines we can utilize either DHCP configuration as described in <xref linkend="components-nmc"/>.
es: <literal>Edge Image Builder</literal> se basa en los nombres de host de los diferentes nodos para determinar su tipo de Kubernetes (<literal>server</literal> o <literal>agent</literal>). Aunque esta configuración se gestiona en el archivo de definición, para la configuración general de red de las máquinas podemos utilizar la configuración DHCP, tal y como se describe en el <xref linkend="components-nmc"/>.
ja: <literal>Edge Image Builder</literal>は、異なるノードのホスト名に基づいてそのKubernetesタイプ(<literal>サーバ</literal>または<literal>エージェント</literal>)を決定します。この設定は定義ファイルで管理されていますが、マシンの一般的なネットワーキングセットアップには、<xref linkend="components-nmc"/>で説明されているDHCP設定を使用できます。
pt_br: O <literal>Edge Image Builder</literal> se baseia nos nomes de host dos diferentes nós para determinar o tipo de Kubernetes deles (<literal>server</literal> ou <literal>agent</literal>). Essa configuração é gerenciada no arquivo de definição, mas para a configuração geral de rede das máquinas, podemos usar a configuração de DHCP, conforme descrito no <xref linkend="components-nmc"/>.
zh_cn: <literal>Edge Image Builder</literal> 通过不同节点的主机名来确定它们的 Kubernetes 类型（<literal>服务器</literal>或<literal>代理</literal>）。虽然此配置在定义文件中进行管理，但对于计算机的一般网络设置，我们可以使用<xref linkend="components-nmc"/>中所述的 DHCP 配置。

source: Expose Rancher service
es: Exposición del servicio Rancher
ja: Rancherサービスの公開
pt_br: Expor o serviço do Rancher
zh_cn: 公开 Rancher 服务
