Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Edge Image Builder is using <emphasis>definition files</emphasis> to modify the SUSE Linux Micro images. These files contain the majority of configurable options. Many of these options will be repeated across the different component sections, so we will list and explain those here.
es: Edge Image Builder usa <emphasis>archivos de definición</emphasis> para modificar las imágenes de SUSE Linux Micro. Estos archivos contienen la mayoría de las opciones configurables. Muchas de estas opciones se repetirán en las diferentes secciones de los componentes, por lo que las mostraremos y explicaremos aquí.
ja: Edge Image Builderでは、<emphasis>定義ファイル</emphasis>を使用してSUSE Linux Microイメージを変更します。定義ファイルには、設定可能なオプションの大部分が含まれています。これらのオプションの多くは、異なるコンポーネントのセクションで繰り返し使用されるため、ここで一覧にして説明します。
pt_br: O Edge Image Builder usa <emphasis>arquivos de definição</emphasis> para modificar as imagens do SUSE Linux Micro. Esses arquivos contêm a maioria das opções configuráveis. Muitas dessas opções se repetem nas diferentes seções de componentes, portanto, vamos listá-las e explicá-las aqui.
zh_cn: Edge Image Builder 使用<emphasis>定义文件</emphasis>来修改 SUSE Linux Micro 映像。这些文件包含大部分可配置选项。其中的许多选项将在不同的组件部分中重复出现，因此下面列出并解释了这些选项。

source: Full list of customization options in the definition file can be found in the <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.1/docs/building-images.md#image-definition-file">upstream documentation</link>
es: La lista completa de opciones de personalización del archivo de definición se encuentra en la <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.1/docs/building-images.md#image-definition-file">documentación original</link>.
ja: 定義ファイルのカスタマイズオプションの全リストについては、<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.1/docs/building-images.md#image-definition-file">アップストリームドキュメント</link>を参照してください。
pt_br: A lista completa das opções de personalização no arquivo de definição está disponível na <link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.1/docs/building-images.md#image-definition-file">documentação upstream</link>
zh_cn: 定义文件中自定义选项的完整列表可以在<link xl:href="https://github.com/suse-edge/edge-image-builder/blob/release-1.1/docs/building-images.md#image-definition-file">上游文档</link>中找到

source: We will take a look at the following fields which will be present in all definition files:
es: Veamos los campos que estarán presentes en todos los archivos de definición:
ja: すべての定義ファイルに存在する次のフィールドを見てみましょう。
pt_br: Vamos analisar os seguintes campos que estarão presentes em todos os arquivos de definição:
zh_cn: 我们来看看所有定义文件中的以下字段：

source: The <literal>image</literal> section is required, and it specifies the input image, its architecture and type, as well as what the output image will be called.
es: La sección <literal>image</literal> es obligatoria y especifica la imagen de entrada, su arquitectura y su tipo, y cómo se llamará la imagen de salida.
ja: <literal>image</literal>セクションは必須であり、入力イメージ、そのアーキテクチャとタイプ、および出力イメージの名前を指定します。
pt_br: A seção <literal>image</literal> é obrigatória e especifica a imagem de entrada, sua arquitetura e tipo, além do nome da imagem de saída.
zh_cn: <literal>image</literal> 部分是必需的，用于指定输入映像、输入映像的体系结构和类型，以及输出映像的名称。

source: The <literal>operatingSystem</literal> section is optional, and contains configuration to enable login on the provisioned systems with the <literal>root/eib</literal> username/password.
es: La sección <literal>operatingSystem</literal> es opcional y contiene la configuración para permitir el inicio de sesión en los sistemas aprovisionados con el nombre de usuario/contraseña <literal>root/eib</literal>.
ja: <literal>operatingSystem</literal>セクションはオプションであり、プロビジョニングされたシステムに<literal>root/eib</literal>のユーザ名/パスワードでログインできるようにするための設定が含まれます。
pt_br: A seção <literal>operatingSystem</literal> é opcional e contém uma configuração para permitir o login nos sistemas provisionados com o nome de usuário/senha <literal>root/eib</literal>.
zh_cn: <literal>operatingSystem</literal> 部分是可选的，其中包含的配置允许用户通过 <literal>root/eib</literal> 用户名/口令登录到置备的系统。

source: The <literal>kubernetes</literal> section is optional, and it defines the Kubernetes type and version. We are going to use the RKE2 distribution. Use <literal>kubernetes.version: v1.33.3+k3s1</literal> if K3s is desired instead. Unless explicitly configured via the <literal>kubernetes.nodes</literal> field, all clusters we bootstrap in this guide will be single-node ones.
es: La sección <literal>kubernetes</literal> es opcional y define el tipo y versión de Kubernetes. Se va a usar la distribución de RKE2. Si lo desea, use <literal>kubernetes.version: v1.33.3+k3s1</literal> en su lugar. A no ser que se configure de forma explícita en el campo <literal>kubernetes.nodes</literal>, todos los clústeres que se describen en esta guía son de un único nodo.
ja: <literal>kubernetes</literal>セクションはオプションであり、Kubernetesタイプとバージョンを定義しています。RKE2ディストリビューションを使用します。代わりにK3sが必要な場合は、<literal>kubernetes.version: v1.33.3+k3s1</literal>を使用します。<literal>kubernetes.nodes</literal>フィールドを介して明示的に設定しない限り、このガイドでブートストラップするすべてのクラスタは、シングルノードクラスタになります。
zh_cn: <literal>kubernetes</literal> 部分为可选配置，用于定义 Kubernetes 的类型和版本。本指南中我们将使用 RKE2 发行版。如果需要使用 K3s，则将配置改为 <literal>kubernetes.version: v1.33.3+k3s1</literal>。除非通过 <literal>kubernetes.nodes</literal> 字段明确配置，否则本指南中引导的所有群集均为单节点群集。

source: The <literal>embeddedArtifactRegistry</literal> section will include all images which are only referenced and pulled at runtime for the specific component.
es: La sección <literal>embeddedArtifactRegistry</literal> incluirá todas las imágenes a las que solo se hace referencia y solo se extraen en el tiempo de ejecución del componente específico.
ja: <literal>embeddedArtifactRegistry</literal>セクションには、実行時に特定のコンポーネントでのみ参照されてプルされるイメージがすべて含まれます。
pt_br: A seção <literal>embeddedArtifactRegistry</literal> incluirá todas as imagens que apenas são referenciadas e extraídas em runtime para o componente específico.
zh_cn: <literal>embeddedArtifactRegistry</literal> 部分包含仅在运行时为特定组件引用和提取的所有映像。

source: Rancher Installation
es: Instalación de Rancher
ja: Rancherのインストール
pt_br: Instalação do Rancher
zh_cn: Rancher 安装

source: The Rancher (<xref linkend="components-rancher"/>) deployment that will be demonstrated will be highly slimmed down for demonstration purposes. For your actual deployments, additional artifacts may be necessary depending on your configuration.
es: El despliegue de Rancher (<xref linkend="components-rancher"/>) de este ejemplo es muy reducido para que sea más fácil de explicar. En sus despliegues reales, pueden ser necesarios artefactos adicionales, dependiendo de su configuración.
ja: デモで示すRancher (<xref linkend="components-rancher"/>)のデプロイメントは、デモのために非常にスリム化されています。実際のデプロイメントでは、設定に応じて追加のアーティファクトが必要な場合があります。
pt_br: A exibição da implantação do Rancher (<xref linkend="components-rancher"/>) será muito reduzida para fins de demonstração. Em sua implantação real, podem ser necessários artefatos adicionais, dependendo da sua configuração.
zh_cn: 为便于演示，我们将大幅精简演示用的 Rancher（<xref linkend="components-rancher"/>）部署。对于实际部署，可能需要根据您的配置添加其他制品。

source: The <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">Rancher 2.12.1</link> release assets contain a <literal>rancher-images.txt</literal> file which lists all the images required for an air-gapped installation.
es: Los recursos de la versión <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">Rancher 2.12.1</link> contienen un archivo <literal>rancher-images.txt</literal> que muestra todas las imágenes necesarias para una instalación en entorno aislado.
ja: <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">Rancher 2.12.1</link>リリースアセットには、エアギャップインストールに必要なすべてのイメージをリストする<literal>rancher-images.txt</literal>ファイルが含まれています。
zh_cn: <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.12.1">Rancher 2.12.1</link> 发行版资产中包含 <literal>rancher-images.txt</literal> 文件，该文件列出了隔离式安装所需的所有映像。

source: There are over 600 container images in total which means that the resulting CRB image would be roughly 30GB. For our Rancher installation, we will strip down that list to the smallest working configuration. From there, you can add back any images you may need for your deployments.
es: Hay más de 600 imágenes de contenedor en total, lo que significa que la imagen lista para arrancar resultante tendría aproximadamente 30 GB. Para nuestra instalación de Rancher, reduciremos la lista a la configuración de trabajo más pequeña posible. A partir de ahí, es posible añadir cualquier imagen que necesite en sus despliegues.
ja: コンテナイメージは合計で600個以上あり、結果として得られるCRBイメージは約30GBになります。Rancherのインストールでは、そのリストを最小の動作設定にまで削減します。そこから、デプロイメントに必要なイメージを追加し直すことができます。
pt_br: Há mais de 600 imagens do contêiner no total, o que significa que a imagem CRB resultante teria cerca de 30 GB. No caso da nossa instalação do Rancher, vamos reduzir a lista para a menor configuração de trabalho. A partir disso, você pode readicionar qualquer imagem que possa precisar em sua implantação.
zh_cn: 总共有超过 600 个容器映像，这意味着生成的 CRB 映像的大小约为 30GB。对于我们的 Rancher 安装，我们将精简该列表，使之与最小有效配置相当。您可以在该列表中重新添加部署所需的任何映像。

source: We will create the definition file and include the stripped down image list:
es: Crearemos el archivo de definición e incluiremos la lista de imágenes desglosada:
ja: 定義ファイルを作成し、必要最小限のイメージリストを含めます。
pt_br: Vamos criar o arquivo de definição e incluir a lista de imagens reduzida:
zh_cn: 创建定义文件并在其中包含精简的映像列表：

source: As compared to the full list of 600+ container images, this slimmed down version only contains ~60 which makes the new CRB image only about 7GB.
es: En comparación con la lista completa de más de 600 imágenes, esta versión reducida solo tiene unas 60, por lo que la nueva imagen lista para arrancar solo ocupa unos 7 GB.
ja: 600個以上のコンテナイメージの全リストと比較すると、このスリム化されたバージョンには約60個しか含まれておらず、新しいCRBイメージは約7GBになります。
pt_br: Em comparação com a lista completa de mais de 600 imagens do contêiner, essa versão reduzida contém apenas cerca de 60, o que faz com que a nova imagem CRB tenha somente 7 GB.
zh_cn: 与包含 600 多个容器映像的完整列表相比，此精简版本仅包含约 60 个容器映像，因此新 CRB 映像的大小只有大约 7GB。

source: We also need to create a Helm values file for Rancher:
es: También necesitamos crear un archivo de valores de Helm para Rancher:
ja: RancherのHelm値も作成する必要があります。
pt_br: Vamos criar também um arquivo de valores do Helm para o Rancher:
zh_cn: 我们还需要为 Rancher 创建 Helm values 文件：

source: Setting the <literal>systemDefaultRegistry</literal> to <literal>registry.rancher.com</literal> allows Rancher to automatically look for images in the embedded artifact registry started within the CRB image at boot. Omitting this field may result in failure to find the container images on the node.
es: Establece en <literal>systemDefaultRegistry</literal> el valor <literal>registry.rancher.com</literal> permite a Rancher buscar automáticamente imágenes en el registro de artefactos integrados iniciado dentro de la imagen lista para arrancar en el arranque. Si se omite este campo, quizás no se encuentren las imágenes de contenedor en el nodo.
ja: <literal>systemDefaultRegistry</literal>を<literal>registry.rancher.com</literal>に設定することで、Rancherは、ブート時にCRBイメージ内で起動される組み込みのアーティファクトレジストリ内でイメージを自動的に検索できます。このフィールドを省略すると、ノードでコンテナイメージを見つけられない場合があります。
pt_br: A definição de <literal>systemDefaultRegistry</literal> como <literal>registry.rancher.com</literal> permite que o Rancher procure automaticamente as imagens no registro de artefatos incorporado que foi iniciado na imagem CRB no momento da inicialização. A omissão desse campo pode impedir que as imagens do contêiner sejam encontradas no nó.
zh_cn: 将 <literal>systemDefaultRegistry</literal> 设置为 <literal>registry.rancher.com</literal> 可让 Rancher 在引导时，在 CRB 映像内启动的嵌入式制品仓库中自动查找映像。省略此字段可能会导致无法在节点上找到容器映像。

source: Once a node using the built image is provisioned, we can verify the Rancher installation:
es: Una vez que se aprovisiona un nodo que usa la imagen creada, es posible verificar la instalación de Rancher:
ja: 構築したイメージを使用するノードがプロビジョニングされたら、Rancherのインストールを確認できます。
pt_br: Após o provisionamento do nó usando a imagem criada, poderemos verificar a instalação do Rancher:
zh_cn: 置备使用构建映像的节点后，可以校验 Rancher 安装：

source: The output should be similar to the following, showing that everything has been successfully deployed:
es: El resultado debería ser similar a lo siguiente, donde se muestra que todo se ha desplegado correctamente:
ja: 出力は次のようになり、すべてが正常にデプロイされていることがわかります。
pt_br: A saída deve mostrar que tudo foi implantado com sucesso, com uma aparência similar a esta:
zh_cn: 输出应类似于以下内容，这表明已成功部署所有组件：

source: And when we go to <literal>https://192.168.100.50.sslip.io</literal> and log in with the <literal>adminadminadmin</literal> password that we set earlier, we are greeted with the Rancher dashboard:
es: Cuando vamos a <literal>https://192.168.100.50.sslip.io</literal> e iniciamos sesión con la contraseña <literal>adminadminadmin</literal> que establecimos anteriormente, accedemos al panel de control de Rancher:
ja: また、<literal>https://192.168.100.50.sslip.io</literal>に移動し、以前に設定した<literal>adminadminadmin</literal>パスワードでログインすると、Rancherダッシュボードが表示されます。
pt_br: Vamos acessar <literal>https://192.168.100.50.sslip.io</literal> e fazer login com a senha <literal>adminadminadmin</literal> que já definimos, o que nos leva ao dashboard do Rancher:
zh_cn: 当我们访问 <literal>https://192.168.100.50.sslip.io</literal> 并使用先前设置的 <literal>adminadminadmin</literal> 口令登录后，Rancher 仪表板即会显示：

source: air gapped rancher
es: rancher en entorno aislado
ja: エアギャップRancher
pt_br: rancher air-gapped
zh_cn: 隔离式 Rancher

source: SUSE Security Installation
es: Instalación de SUSE Security
ja: SUSE Securityのインストール
pt_br: Instalação do SUSE Security
zh_cn: SUSE Security 安装

source: Unlike the Rancher installation, the SUSE Security installation does not require any special handling in EIB. EIB will automatically air-gap every image required by its underlying component NeuVector.
es: A diferencia de la instalación de Rancher, la instalación de SUSE Security no requiere ningún tratamiento especial en EIB. EIB instalará en un entorno aislado automáticamente todas las imágenes requeridas por su componente subyacente NeuVector.
ja: Rancherのインストールとは異なり、SUSE SecurityのインストールではEIBで特別な処理を行う必要はありません。EIBは基盤となるコンポーネントNeuVectorに必要なすべてのイメージを自動的にエアギャップ化します。
pt_br: Ao contrário da instalação do Rancher, a do SUSE Security não requer nenhum processamento adicional no EIB. O EIB isola automaticamente as imagens necessárias ao seu componente subjacente NeuVector.
zh_cn: 与 Rancher 安装不同，SUSE Security 安装不需要在 EIB 中进行任何特殊处理。EIB 将自动隔离底层组件 NeuVector 所需的每个映像。

source: We will create the definition file:
es: Vamos a crear el archivo de definición:
ja: 定義ファイルを作成します。
pt_br: Vamos criar o arquivo de definição:
zh_cn: 创建定义文件：

source: We will also create a Helm values file for NeuVector:
es: También crearemos un archivo de valores de Helm para NeuVector:
ja: NeuVector用のHelm値ファイルも作成します。
pt_br: Vamos criar também um arquivo de valores do Helm para o NeuVector:
zh_cn: 另外，为 NeuVector 创建 Helm 值文件：

source: Once a node using the built image is provisioned, we can verify the SUSE Security installation:
es: Después de que se haya aprovisionado un nodo con la imagen creada, podemos verificar la instalación de SUSE Security:
ja: 構築したイメージを使用するノードがプロビジョニングされたら、SUSE Securityのインストールを確認できます。
pt_br: Após o provisionamento do nó usando a imagem criada, poderemos verificar a instalação do SUSE Security:
zh_cn: 置备使用构建映像的节点后，可以校验 SUSE Security 安装：

source: SUSE Storage Installation
es: Instalación de SUSE Storage
ja: SUSE Storageのインストール
pt_br: Instalação do SUSE Storage
zh_cn: SUSE Storage 安装

source: The <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/airgap/">official documentation</link> for Longhorn contains a <literal>longhorn-images.txt</literal> file which lists all the images required for an air-gapped installation. We will be including their mirrored counterparts from the Rancher container registry in our definition file. Let’s create it:
es: La <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/airgap/">documentación oficial</link> de Longhorn contiene un archivo <literal>longhorn-images.txt</literal> que muestra todas las imágenes necesarias para una instalación en entorno aislado. Se incluirá su contraparte duplicada del registro del contenedor de Rancher en nuestro archivo de definición. Para crearlo:
ja: Longhornの<link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/airgap/">公式ドキュメント</link>には、エアギャップインストールに必要なすべてのイメージをリストした<literal>longhorn-images.txt</literal>ファイルが含まれています。定義ファイルには、Rancherコンテナレジストリからのミラー化された対応するイメージを含めます。作成してみましょう。
zh_cn: Longhorn <link xl:href="https://longhorn.io/docs/1.9.1/deploy/install/airgap/">官方文档</link>中包含 <literal>longhorn-images.txt</literal> 文件，该文件列出了隔离式安装所需的所有映像。我们将在定义文件中包含来自 Rancher 容器仓库的相应镜像副本。请按以下方式创建定义文件：

source: You will notice that the definition file lists the <literal>open-iscsi</literal> package. This is necessary since Longhorn relies on a <literal>iscsiadm</literal> daemon running on the different nodes to provide persistent volumes to Kubernetes.
es: Observará que el archivo de definición muestra el paquete <literal>open-iscsi</literal>. Este paquete es obligatorio, ya que Longhorn se basa en un daemon <literal>iscsiadm</literal> que se ejecuta en los diferentes nodos para proporcionar volúmenes persistentes a Kubernetes.
ja: 定義ファイルには<literal>open-iscsi</literal>パッケージがリストされていることに気づくでしょう。これは、LonghornがKubernetesに永続ボリュームを提供するために、さまざまなノードで実行されている<literal>iscsiadm</literal>デーモンに依存しているために必要です。
pt_br: Veja que o arquivo de definição lista o pacote <literal>open-iscsi</literal>. Ele é necessário porque o Longhorn precisa que o daemon <literal>iscsiadm</literal> seja executado em nós diferentes para fornecer volumes persistentes ao Kubernetes.
zh_cn: 您会注意到，定义文件列出了 <literal>open-iscsi</literal> 软件包。该软件包是必需的组件，因为 Longhorn 依赖于不同节点上运行的 <literal>iscsiadm</literal> 守护程序来为 Kubernetes 提供持久性卷。

source: Once a node using the built image is provisioned, we can verify the Longhorn installation:
es: Una vez aprovisionado un nodo con la imagen creada, podemos verificar la instalación de Longhorn:
ja: 構築したイメージを使用するノードがプロビジョニングされたら、Longhornのインストールを確認できます。
pt_br: Após o provisionamento do nó usando a imagem criada, poderemos verificar a instalação do Longhorn:
zh_cn: 置备使用构建映像的节点后，可以校验 Longhorn 安装：

source: KubeVirt and CDI Installation
es: Instalación de KubeVirt y CDI
ja: KubeVirtとCDIのインストール
pt_br: Instalação do KubeVirt e CDI
zh_cn: KubeVirt 和 CDI 安装

source: The Helm charts for both KubeVirt and CDI are only installing their respective operators. It is up to the operators to deploy the rest of the systems which means we will have to include all necessary container images in our definition file. Let’s create it:
es: Los charts de Helm tanto para KubeVirt como para CDI solo instalan sus operadores respectivos. Depende de los operadores desplegar el resto de sistemas, lo que significa que tendremos que incluir todas las imágenes de contenedor necesarias en nuestro archivo de definición. Vamos a crearlo:
ja: KubeVirtとCDIの両方のHelmチャートでインストールされるのは、それぞれのオペレータのみです。残りのシステムのデプロイはオペレータに任されています。つまり、必要なコンテナイメージすべてを定義ファイルに含める必要があります。作成してみましょう。
pt_br: Os gráficos Helm para KubeVirt e CDI instalam apenas os respectivos operadores. Cabe aos operadores implantar o restante dos sistemas, ou seja, precisamos incluir todas as imagens do contêiner necessárias em nosso arquivo de definição. Vamos criá-lo:
zh_cn: KubeVirt 和 CDI 的 Helm chart 只会安装各自的操作器。系统的其余组件将由操作器来部署，这意味着，我们必须在定义文件中包含所有必要的容器映像。我们来创建定义文件：

source: Once a node using the built image is provisioned, we can verify the installation of both KubeVirt and CDI.
es: Una vez aprovisionado un nodo con la imagen construida, podemos verificar la instalación tanto de KubeVirt como de CDI.
ja: 構築したイメージを使用するノードがプロビジョニングされたら、KubeVirtとCDIの両方のインストールを確認できます。
pt_br: Após o provisionamento do nó usando a imagem criada, poderemos verificar a instalação do KubeVirt e do CDI.
zh_cn: 置备使用构建映像的节点后，可以校验 KubeVirt 和 CDI 的安装。

source: Verify KubeVirt:
es: Verifique KubeVirt:
ja: KubeVirtを確認します。
pt_br: Verifique o KubeVirt:
zh_cn: 校验 KubeVirt：

source: Verify CDI:
es: Verifique CDI:
ja: CDIを確認します。
pt_br: Verifique o CDI:
zh_cn: 校验 CDI：

source: Troubleshooting
es: Solución de problemas
ja: トラブルシューティング
pt_br: Solução de problemas
zh_cn: 查错

source: If you run into any issues while building the images or are looking to further test and debug the process, please refer to the <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.1/docs">upstream documentation</link>.
es: Si tiene algún problema al crear las imágenes o desea probar y depurar el proceso, consulte la <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.1/docs">documentación original</link>.
ja: イメージの構築中に問題が発生した場合、またはプロセスをさらにテストおよびデバッグしたい場合は、<link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.1/docs">アップストリームドキュメント</link>を参照してください。
pt_br: Se você tiver problemas ao criar as imagens ou se quiser testar e depurar o processo em mais detalhes, consulte a <link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.1/docs">documentação upstream</link>.
zh_cn: 如果您在构建映像时遇到任何问题，或者想要进一步测试和调试该过程，请参见<link xl:href="https://github.com/suse-edge/edge-image-builder/tree/release-1.1/docs">上游文档</link>。

source: Building Updated SUSE Linux Micro Images with Kiwi
es: Creación de imágenes actualizadas de SUSE Linux Micro con Kiwi
ja: Kiwiを使用したSUSE Linux Microの更新イメージの構築
pt_br: Criando imagens atualizadas do SUSE Linux Micro com o Kiwi
zh_cn: 使用 Kiwi 构建更新的 SUSE Linux Micro 映像
