Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Upon startup, <literal>RKE2</literal> checks if a <literal>registries.yaml</literal> file exists at <literal>/etc/rancher/rke2/</literal> and instructs <literal>containerd</literal> to use any registries defined in the file. If you wish to use a private registry, create this file as root on each node that will use the registry.
es: Durante el inicio, <literal>RKE2</literal> comprueba si existe un archivo <literal>registries.yaml</literal> en <literal>/etc/rancher/rke2/</literal> y ordena a <literal>containerd</literal> que use cualquier registro definido en el archivo. Si desea utilizar un registro privado, cree este archivo como usuario root en cada nodo que vaya a utilizar el registro.
ja: 起動時に、<literal>RKE2</literal>は、<literal>registries.yaml</literal>ファイルが<literal>/etc/rancher/rke2/</literal>に存在するかどうかを確認し、このファイルで定義されたレジストリを使用するように<literal>containerd</literal>に指示します。プライベートレジストリを使用するには、このファイルを、レジストリを使用する各ノードにルートとして作成します。
pt_br: Na inicialização, o <literal>RKE2</literal> verifica se existe um arquivo <literal>registries.yaml</literal> em <literal>/etc/rancher/rke2/</literal> e instrui o <literal>containerd</literal> a usar os registros definidos no arquivo. Para usar um registro particular, crie esse arquivo como raiz em cada nó que usará o registro.
zh_cn: 启动时，<literal>RKE2</literal> 会检查 <literal>/etc/rancher/rke2/</literal> 中是否存在 <literal>registries.yaml</literal> 文件，并指示 <literal>containerd</literal> 使用该文件中定义的任何仓库。如果您希望使用某个专用仓库，请在要使用该仓库的每个节点上以 root 身份创建此文件。

source: To add the private registry, create the file <literal>/etc/rancher/rke2/registries.yaml</literal> with the following content:
es: Para añadir el registro privado, cree el archivo <literal>/etc/rancher/rke2/registries.yaml</literal> con el siguiente contenido:
ja: プライベートレジストリを追加するには、ファイル<literal>/etc/rancher/rke2/registries.yaml</literal>を作成して次の内容を設定します。
pt_br: Para adicionar o registro particular, crie o arquivo <literal>/etc/rancher/rke2/registries.yaml</literal> com o seguinte conteúdo:
zh_cn: 要添加专用仓库，请创建包含以下内容的 <literal>/etc/rancher/rke2/registries.yaml</literal> 文件：

source: or without authentication:
es: o sin autenticación:
ja: または、認証を使用しない場合は次のように設定します。
pt_br: ou sem autenticação:
zh_cn: 或者不设置身份验证：

source: For the registry changes to take effect, you need to either configure this file before starting RKE2 on the node, or restart RKE2 on each configured node.
es: Para que los cambios en el registro surtan efecto, debe configurar este archivo antes de iniciar RKE2 en el nodo, o bien reiniciar RKE2 en cada nodo configurado.
ja: レジストリの変更を有効にするには、ノード上でRKE2を起動する前にこのファイルを設定するか、または設定した各ノードでRKE2を再起動します。
pt_br: Para que as alterações no registro entrem em vigor, você precisa configurar esse arquivo antes de iniciar o RKE2 no nó ou reiniciar o RKE2 em cada nó configurado.
zh_cn: 要使仓库更改生效，需要先配置此文件再在节点上启动 RKE2，或者在配置的每个节点上重启 RKE2。

source: For more information about this, please check <link xl:href="https://documentation.suse.com/cloudnative/rke2/latest/en/install/containerd_registry_configuration.html#_registries_configuration_file">containerd registry configuration rke2</link>.
es: Para obtener más información, consulte <link xl:href="https://documentation.suse.com/cloudnative/rke2/latest/en/install/containerd_registry_configuration.html#_registries_configuration_file">containerd registry configuration rke2</link> (Configuración del registro containerd en RKE2).
ja: この詳細については、「<link xl:href="https://documentation.suse.com/cloudnative/rke2/latest/en/install/containerd_registry_configuration.html#_registries_configuration_file">containerd registry configuration rke2 (containerdレジストリ設定rke2)</link>」を確認してください。
pt_br: Para obter mais informações sobre isso, acesse a <link xl:href="https://documentation.suse.com/cloudnative/rke2/latest/en/install/containerd_registry_configuration.html#_registries_configuration_file">configuração de registro containerd para RKE2</link>.
zh_cn: 有关详细信息，请查看 <link xl:href="https://documentation.suse.com/cloudnative/rke2/latest/en/install/containerd_registry_configuration.html#_registries_configuration_file">RKE2 containerd 仓库配置</link>。

source: Precision Time Protocol
es: Protocolo de tiempo de precisión (PTP)
zh_cn: 精确时间协议

source: Precision Time Protocol (PTP) is a network protocol developed by the Institute of Electrical and Electronics Engineers (IEEE) to enable sub-microsecond time synchronization in a computer network. Since its inception and for a couple of decades now, PTP has been in use in many industries. It has recently seen a growing adoption in the telecommunication networks as a vital element to 5G networks. While being a relatively simple protocol, its configuration can change significantly depending on the application. For this reason, multiple profiles have been defined and standardized.
es: El protocolo de tiempo de precisión (PTP) es un protocolo de red desarrollado por el IEEE (Instituto de Ingenieros Eléctricos y Electrónicos) para permitir la sincronización del tiempo en submicrosegundos en una red informática. Desde su creación y durante las últimas dos décadas, el PTP se ha utilizado en muchos sectores. Recientemente, se ha observado un aumento de su adopción en las redes de telecomunicaciones como elemento fundamental para las redes 5G. Aunque se trata de un protocolo relativamente sencillo, su configuración puede variar significativamente en función de la aplicación. Por ese motivo, se han definido y estandarizado múltiples perfiles.
ja: Precision Time Protocol (PTP)は、 電気電子学会(IEEE)によって開発されたネットワークプロトコルで、コンピュータネットワークにおけるサブマイクロ秒単位の時間同期を可能にします。PTPは、その誕生以来数十年にわたり、多くの業界で利用されてきました。最近では、5Gネットワークの重要な要素として、通信ネットワークにおける採用が急増しています。比較的シンプルなプロトコルであるものの、アプリケーションに応じて設定が大幅に異なります。そのため、複数のプロファイルが定義され標準化されています。
pt_br: Precision Time Protocol (PTP) é um protocolo de rede desenvolvido pelo Institute of Electrical and Electronics Engineers (IEEE) para permitir a sincronização de tempo em submicrossegundos em uma rede de computadores. Desde a sua origem e durante as duas últimas décadas, o PTP tem sido usado em diversos setores. Recentemente, observamos uma crescente adoção nas redes de telecomunicações como elemento essencial a redes 5G. Apesar de ser um protocolo relativamente simples, sua configuração pode mudar bastante de acordo com o aplicativo. Por essa razão, foram definidos e padronizados vários perfis.
zh_cn: 精确时间协议 (PTP) 是由电气和电子工程师协会 (IEEE) 开发的一种网络协议，旨在实现计算机网络中的亚微秒级时间同步。自诞生以来的几十年里，PTP 已在许多行业广泛应用。近年来，随着其作为 5G 网络关键要素的重要性凸显，在电信网络中的采用率不断提升。尽管 PTP 协议相对简单，但其配置会因应用场景的不同而有显著差异。为此，已定义并标准化多个配置文件。

source: In this section, only telco-specific profiles will be covered. Consequently time-stamping capability and a PTP hardware clock (PHC) in the NIC will be assumed. Nowadays, all telco-grade network adapters come with PTP support in hardware, but you can verify such capabilities with the following command:
es: En esta sección solo se tratan los perfiles específicos de telecomunicaciones. Por lo tanto, se dará por sentado que la NIC cuenta con capacidad de marcación de tiempo y con un reloj de hardware PTP (PHC). Hoy en día, todos los adaptadores de red para telecomunicaciones incluyen compatibilidad con PTP en el hardware, pero puede verificarlo con el siguiente comando:
ja: このセクションでは、通信事業者固有のプロファイルのみについて説明します。そのため、NICにタイムスタンプ機能とPTPハードウェアクロック(PHC)が搭載されていることを前提とします。現在、すべての通信事業者グレードのネットワークアダプタにはハードウェアPTPサポートが付属していますが、以下のコマンドでその機能を確認できます。
pt_br: Nesta seção, apenas os perfis específicos de telecomunicações serão apresentados. Portanto, vamos considerar o recurso de marcação de data e hora e um relógio de hardware PTP (PHC, PTP Hardware Clock) na NIC. Hoje em dia, todos os adaptadores de rede para telecomunicações contam com suporte a PTP no hardware, mas você pode verificar esses recursos com o seguinte comando:
zh_cn: 本节仅介绍专用于电信行业的配置文件。因此，假设 NIC 具备时间戳能力和 PTP 硬件时钟 (PHC)。如今，所有电信级网络适配器均在硬件层面支持 PTP，但您可以通过以下命令验证此类功能：

source: Replace <literal>p1p1</literal> with name of the interface to be used for PTP.
es: Sustituya <literal>p1p1</literal> por el nombre de la interfaz que se utilizará para PTP.
ja: <literal>p1p1</literal>を、PTPに使用されるインタフェースの名前に置き換えます。
pt_br: Substitua <literal>p1p1</literal> pelo nome da interface usada para PTP.
zh_cn: 将 <literal>p1p1</literal> 替换为用于 PTP 的接口名称。

source: The following sections will provide guidance on how to install and configure PTP on SUSE Telco Cloud specifically, but familiarity with basic PTP concepts is expected. For a brief overview of PTP and the implementation included in SUSE Telco Cloud, refer to <link xl:href="https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html">https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html</link>.
es: Las siguientes secciones explican cómo instalar y configurar PTP en SUSE Telco Cloud específicamente, pero se espera que el usuario esté familiarizado con los conceptos básicos de PTP. Para obtener una breve descripción general de PTP y la implementación incluida en SUSE Telco Cloud, consulte <link xl:href="https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html">https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html</link>.
ja: 以下のセクションでは、SUSE Telco CloudにPTPをインストールして設定する方法について具体的に説明しますが、PTPの基本的な概念を理解していることが前提となります。PTPの概要と、SUSE Telco Cloudに含まれる実装については、<link xl:href="https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html">https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html</link>を参照してください。
zh_cn: 以下章节将提供有关如何在 SUSE Telco Cloud 中安装和配置 PTP 的指导，但要求您已熟悉基本的 PTP 概念。如需简要了解 PTP 以及 SUSE Telco Cloud 中包含的 PTP 实现，请访问 <link xl:href="https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html">https://documentation.suse.com/sles/html/SLES-all/cha-tuning-ptp.html</link>。

source: Install PTP software components
es: Instalación de los componentes de software de PTP
ja: PTPソフトウェアコンポーネントのインストール
pt_br: Instalar os componentes de software PTP
zh_cn: 安装 PTP 软件组件

source: In SUSE Telco Cloud, the PTP implementation is provided by the <literal>linuxptp</literal> package, which includes two components:
es: En SUSE Telco Cloud, la implementación de PTP se proporciona con el paquete <literal>linuxptp</literal>, que incluye dos componentes:
ja: SUSE Telco Cloudでは、PTP実装が<literal>linuxptp</literal>パッケージで提供されています。このパッケージには次の2つのコンポーネントが含まれています。
zh_cn: 在 SUSE Telco Cloud 中，PTP 功能通过 <literal>linuxptp</literal> 软件包实现，该软件包包含两个组件：

source: <literal>ptp4l</literal>: a daemon that controls the PHC on the NIC and runs the PTP protocol
es: <literal>ptp4l</literal>: un daemon que controla el PHC en la NIC y ejecuta el protocolo PTP
ja: <literal>ptp4l</literal>: NIC上のPHCを制御し、PTPプロトコルを実行するデーモン
pt_br: <literal>ptp4l</literal>: um daemon que controla o PHC na NIC e executa o protocolo PTP
zh_cn: <literal>ptp4l</literal>：控制 NIC 上的 PHC 并运行 PTP 协议的守护程序

source: <literal>phc2sys</literal>: a daemon that keeps the system clock in sync with the PTP-synchronized PHC on the NIC
es: <literal>phc2sys</literal>: un daemon que mantiene el reloj del sistema sincronizado con el PHC sincronizado por PTP en la NIC
ja: <literal>phc2sys</literal>: NIC上のPTP同期PHCとシステムクロックとの同期を維持するデーモン
pt_br: <literal>phc2sys</literal>: um daemon que mantém a sincronização do relógio do sistema com o PHC sincronizado por PTP na NIC
zh_cn: <literal>phc2sys</literal>：将系统时钟与 NIC 上经 PTP 同步的 PHC 保持同步的守护程序

source: Both daemons are required for the system synchronization to fully work and must be correctly configured according to your setup. This is covered in <xref linkend="ptp-telco-config"/>.
es: Ambos daemons son necesarios para que la sincronización del sistema funcione correctamente y deben estar configurados adecuadamente según su configuración. Esto se explica en la <xref linkend="ptp-telco-config"/>.
ja: システム同期が完全に機能するには、両方のデーモンが必要であり、セットアップに従って正しく設定する必要があります。詳細については、<xref linkend="ptp-telco-config"/>を参照してください。
pt_br: Os dois daemons são necessários para que a sincronização do sistema funcione por completo e devem ser definidos de maneira correta com a sua configuração, o que foi abordado na <xref linkend="ptp-telco-config"/>.
zh_cn: 要使系统同步正常工作，就必须运行这两个守护程序，并且必须根据您的设置正确配置它们。相关信息，请参见<xref linkend="ptp-telco-config"/>。

source: The easiest and best way to integrate PTP in your downstream cluster is to add the <literal>linuxptp</literal> package under <literal>packageList</literal> in the Edge Image Builder (EIB) definition file. This way the PTP control plane software will be installed automatically during the cluster provisioning. See the EIB documentation (<xref linkend="eib-configuring-rpm-packages"/>) for more information on installing packages.
es: La mejor manera, y la más fácil, de integrar PTP en su clúster descendente es añadir el paquete <literal>linuxptp</literal> en <literal>packageList</literal> en el archivo de definición de Edge Image Builder (EIB). De esta forma, el software del plano de control de PTP se instalará automáticamente durante el aprovisionamiento del clúster. Consulte la documentación de EIB (<xref linkend="eib-configuring-rpm-packages"/>) para obtener más información sobre la instalación de paquetes.
ja: ダウンストリームクラスタにPTPを統合する最も簡単で最良の方法は、Edge Image Builder (EIB)定義ファイルの<literal>packageList</literal>の下に<literal>linuxptp</literal>パッケージを追加することです。これにより、クラスタプロビジョニング中にPTPコントロールプレーンソフトウェアが自動的にインストールされます。パッケージのインストールの詳細については、EIBのドキュメント(<xref linkend="eib-configuring-rpm-packages"/>)を参照してください。
pt_br: A maneira melhor e mais fácil de integrar o PTP ao cluster downstream é adicionar o pacote <literal>linuxptp</literal> em <literal>packageList</literal> ao arquivo de definição do Edge Image Builder (EIB). Desse modo, o software de plano de controle PTP será instalado automaticamente durante o provisionamento do cluster. Consulte a documentação do EIB (<xref linkend="eib-configuring-rpm-packages"/>) para obter mais informações sobre como instalar os pacotes.
zh_cn: 在下游群集中集成 PTP 最简单且最佳的方式是，在 Edge Image Builder (EIB) 定义文件的 <literal>packageList</literal> 下添加 <literal>linuxptp</literal> 软件包。这样，在群集置备期间就会自动安装 PTP 控制平面软件。有关安装软件包的详细信息，请参见 EIB 文档（<xref linkend="eib-configuring-rpm-packages"/>）。

source: Below find a sample EIB manifest with <literal>linuxptp</literal>:
es: Esto es un ejemplo de manifiesto de EIB con <literal>linuxptp</literal>:
ja: 以下に、<literal>linuxptp</literal>を使用したEIBマニフェストのサンプルを示します。
pt_br: Veja a seguir um manifesto do EIB de amostra com <literal>linuxptp</literal>:
zh_cn: 以下是包含 <literal>linuxptp</literal> 的 EIB 清单示例：

source: The <literal>linuxptp</literal> package included in SUSE Telco Cloud does not enable <literal>ptp4l</literal> and <literal>phc2sys</literal> by default. If their system-specific configuration files are deployed at provisioning time (see <xref linkend="ptp-capi"/>), they should be enabled. Do so by adding them to the <literal>systemd</literal> section of the manifest, as in the example above.
es: El paquete <literal>linuxptp</literal> incluido en SUSE Telco Cloud no habilita <literal>ptp4l</literal> ni <literal>phc2sys</literal> por defecto. Si sus archivos de configuración específicos de cada sistema se despliegan durante el aprovisionamiento (consulte la <xref linkend="ptp-capi"/>), se deben habilitar. Para ello, añádalos a la sección <literal>systemd</literal> del manifiesto, como en el ejemplo anterior.
ja: SUSE Telco Cloudに含まれる<literal>linuxptp</literal>パッケージでは、デフォルトで<literal>ptp4l</literal>および<literal>phc2sys</literal>が有効になりません。プロビジョニング時にシステム固有の設定ファイルがデプロイされている場合は(<xref linkend="ptp-capi"/>を参照)、これらを有効にする必要があります。上記の例のように、マニフェストの<literal>systemd</literal>セクションに追加して有効にしてください。
zh_cn: SUSE Telco Cloud 中包含的 <literal>linuxptp</literal> 软件包默认不会启用 <literal>ptp4l</literal> 和 <literal>phc2sys</literal>。如果在置备时部署了针对特定系统的配置文件（请参见<xref linkend="ptp-capi"/>），则应启用它们。可通过将其添加到清单的 <literal>systemd</literal> 部分来实现，如上例所示。

source: Follow the usual process to build the image as described in the EIB Documentation (<xref linkend="eib-how-to-build-image"/>) and use it to deploy your cluster. If you are new to EIB, start from <xref linkend="components-eib"/> instead.
es: Siga el proceso habitual para crear la imagen que se describe en la documentación de EIB (<xref linkend="eib-how-to-build-image"/>) y utilícela para desplegar su clúster. Si no tiene experiencia con EIB, comience por el <xref linkend="components-eib"/>.
ja: EIBのドキュメントで説明されている通常のプロセスに従って、イメージを構築し(<xref linkend="eib-how-to-build-image"/>)、そのイメージを使用してクラスタをデプロイします。EIBを初めて使用する場合は、<xref linkend="components-eib"/>から開始してください。
pt_br: Siga o processo normal para criar a imagem conforme descrito na documentação do EIB (<xref linkend="eib-how-to-build-image"/>) e use-a para implantar o cluster. Se você não tem experiência com o EIB, comece pelo <xref linkend="components-eib"/>.
zh_cn: 按照 EIB 文档（<xref linkend="eib-how-to-build-image"/>）中所述的常规过程构建映像，并使用该映像部署群集。如果您是 EIB 新手，请从<xref linkend="components-eib"/>开始。

source: Configure PTP for telco deployments
es: Configuración de PTP para despliegues de telecomunicaciones
ja: 通信事業者のデプロイメント向けPTPの設定
pt_br: Configurar o PTP para implantações de telecomunicações
zh_cn: 为电信部署配置 PTP

source: Many telco applications require strict phase and time synchronization with little deviance, which resulted in a definition of two telco-oriented profiles: the ITU-T G.8275.1 and ITU-T G.8275.2. They both have a high rate of sync messages and other distinctive traits, such as the use of an alternative Best Master Clock Algorithm (BMCA). Such behavior mandates specific settings in the configuration file consumed by <literal>ptp4l</literal>, provided in the following sections as a reference.
es: Muchas aplicaciones de telecomunicaciones requieren una sincronización estricta de fase y tiempo con poca desviación. Por eso, se definieron dos perfiles orientados a las telecomunicaciones: el ITU-T G.8275.1 y el ITU-T G.8275.2. Ambos tienen una alta tasa de mensajes de sincronización y otras características distintivas, como el uso de un algoritmo de reloj maestro óptimo (BMCA) alternativo. Este comportamiento exige ajustes específicos en el archivo de configuración utilizado por <literal>ptp4l</literal>, que se proporcionan en las siguientes secciones como referencia.
ja: 多くの通信事業者向けアプリケーションでは、わずかな偏差で厳格な位相と時刻同期が求められるため、通信事業者向けの2つのプロファイルが定義されました(ITU-T G.8275.1とITU-T G.8275.2)。これら両プロファイルは、同期メッセージの送信頻度が高く、代替Best Master Clock Algorithm (BMCA)の使用など、他の特徴的な特性を備えています。このような動作は、<literal>ptp4l</literal>が使用する設定ファイルに特定の設定を必要とします。これらの設定は以下のセクションで参照用に提供されています。
pt_br: Muitos aplicativos de telecomunicações exigem uma sincronização rígida de fase e de tempo com pouca variação, o que resultou na definição de dois perfis orientados a telecomunicações: ITU-T G.8275.1 e ITU-T G.8275.2. Os dois têm alta taxa de mensagens de sincronização e outros aspectos diferenciados, como uso de um algoritmo BMCA (Best Master Clock Algorithm) alternativo. Esse comportamento exige definições específicas no arquivo de configuração consumido pelo <literal>ptp4l</literal>, apresentadas nas seções a seguir como referência.
zh_cn: 许多电信应用场景要求严格保持偏差极小的相位和时间同步，为此定义了两个面向电信的配置文件：ITU-T G.8275.1 和 ITU-T G.8275.2。这两个配置文件均设置了高频率同步消息，以及其他独特特性（如使用替代的最佳主时钟算法 (BMCA)）。这种特性要求 <literal>ptp4l</literal> 所使用的配置文件中包含特定设置，以下几节将提供相关参考信息。

source: Both sections only cover the case of an ordinary clock in Time Receiver configuration.
es: Ambas secciones solo cubren el caso de un reloj normal con una configuración de recepción de hora.
ja: 両セクションは、タイムレシーバー設定の通常のクロックの場合のみを対象としてます。
pt_br: As duas seções abordam apenas o caso de um relógio comum na configuração de receptor de tempo.
zh_cn: 以下两节仅介绍时间接收器配置中的普通时钟场景。

source: Any such profile must be used in a well-planned PTP infrastructure.
es: Los perfiles de este tipo deben utilizarse en una infraestructura PTP bien planificada.
ja: このようなプロファイルは、適切に計画されたPTPインフラストラクチャで使用する必要があります。
pt_br: Esse tipo de perfil deve ser usado em uma infraestrutura PTP bem planejada.
zh_cn: 对于任何此类配置文件，都必须在精心规划的 PTP 基础架构中使用。

source: Your specific PTP network may require additional configuration tuning, make sure to review and adapt the provided examples if needed.
es: Es posible que su red PTP específica requiera ajustes de configuración adicionales. Asegúrese de revisar y adaptar los ejemplos proporcionados si es necesario.
ja: 特定のPTPネットワークには、追加の設定の調整が必要な場合があります。必要に応じて、提供された例を確認して調整してください。
pt_br: Sua rede PTP específica pode exigir um ajuste de configuração adicional. Revise os exemplos apresentados e adapte-os se necessário.
zh_cn: 要用于您的特定 PTP 网络，可能需要额外微调配置，请务必检查并根据需要调整所提供的示例。

source: PTP profile ITU-T G.8275.1
es: Perfil ITU-T G.8275.1 de PTP
ja: PTPプロファイルITU-T G.8275.1
pt_br: Perfil de PTP ITU-T G.8275.1
zh_cn: PTP 配置文件 ITU-T G.8275.1

source: The G.8275.1 profile has the following specifics:
es: El perfil G.8275.1 tiene las siguientes especificaciones:
ja: G.8275.1プロファイルには、次の特徴があります。
pt_br: O perfil G.8275.1 tem as seguintes especificações:
zh_cn: G.8275.1 配置文件具有以下特点：

source: Runs directly on Ethernet and requires full network support (adjacent nodes/switches must support PTP).
es: Se ejecuta directamente en Ethernet y requiere soporte de red completo (los nodos/conmutadores adyacentes deben ser compatibles con PTP).
ja: Ethernet上で直接実行し、完全なネットワークサポートが必要です(隣接するノード/スイッチはPTPをサポートしている必要があります)。
pt_br: Executado diretamente em Ethernet e requer suporte completo à rede (nós/comutadores adjacentes devem dar suporte a PTP).
zh_cn: 直接运行在以太网上，需要完整的网络支持（相邻节点/交换机必须支持 PTP）。

source: The default domain setting is 24.
es: La configuración predeterminada del dominio es 24.
ja: デフォルトのドメイン設定は24です。
pt_br: A configuração de domínio padrão é 24.
zh_cn: 默认域设置为 24。

source: Dataset comparison is based on the G.8275.x algorithm and its <literal>localPriority</literal> values after <literal>priority2</literal>.
es: La comparación de conjuntos de datos se basa en el algoritmo G.8275.x y sus valores <literal>localPriority</literal> después de <literal>priority2</literal>.
ja: データセットの比較は、G.8275.xアルゴリズムと、<literal>priority2</literal>以降の <literal>localPriority</literal>値に基づいています。
pt_br: A comparação de conjunto de dados baseia-se no algoritmo G.8275.x e nos valores <literal>localPriority</literal> depois de <literal>priority2</literal>.
zh_cn: 数据集比较基于 G.8275.x 算法及其在 <literal>priority2</literal> 之后的 <literal>localPriority</literal> 值。

source: Copy the following content to a file named <literal>/etc/ptp4l-G.8275.1.conf</literal>:
es: Copie el siguiente contenido en un archivo llamado <literal>/etc/ptp4l-G.8275.1.conf</literal>:
ja: 次のコンテンツを<literal>/etc/ptp4l-G.8275.1.conf</literal>という名前のファイルにコピーします。
pt_br: Copie o seguinte conteúdo para um arquivo chamado <literal>/etc/ptp4l-G.8275.1.conf</literal>:
zh_cn: 将以下内容复制到名为 <literal>/etc/ptp4l-G.8275.1.conf</literal> 的文件中：

source: Once the file has been created, it must be referenced in <literal>/etc/sysconfig/ptp4l</literal> for the daemon to start correctly. This can be done by changing the <literal>OPTIONS=</literal> line to:
es: Una vez creado el archivo, debe hacerse referencia a él en <literal>/etc/sysconfig/ptp4l</literal> para que el daemon se inicie correctamente. Puede hacerlo cambiando la línea <literal>OPTIONS=</literal> por:
ja: ファイルが作成されたら、デーモンが正常に起動するように<literal>/etc/sysconfig/ptp4l</literal>で参照される必要があります。これを行うには、 <literal>OPTIONS=</literal>行を次のように変更します。
pt_br: Após a criação do arquivo, faça referência a ele em <literal>/etc/sysconfig/ptp4l</literal> para o daemon ser iniciado corretamente. Para fazer isso, altere a linha <literal>OPTIONS=</literal>:
zh_cn: 创建好文件后，必须在 <literal>/etc/sysconfig/ptp4l</literal> 中引用该文件，才能使守护程序正确启动。可通过将 <literal>OPTIONS=</literal> 行更改为以下内容实现：

source: More precisely:
es: En concreto:
ja: より正確な説明は次のとおりです。
pt_br: Mais precisamente:
zh_cn: 具体说明：
