Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The real-time kernel image is not necessarily better than a standard kernel. It is a different kernel tuned to a specific use case. The real-time kernel is tuned for lower latency at the cost of throughput. The real-time kernel is not recommended for general purpose use, but in our case, this is the recommended kernel for Telco Workloads where latency is a key factor.
es: Usar una imagen de kernel en tiempo real no es necesariamente mejor que usar un kernel estándar. Se trata de un kernel diferente, optimizado para un caso práctico concreto. El kernel en tiempo real está optimizado para reducir la latencia a costa del rendimiento. No se recomienda el uso del kernel en tiempo real para fines generales, pero en nuestro caso, es el kernel recomendado para cargas de trabajo de telecomunicaciones, donde la latencia es un factor clave.
ja: リアルタイムカーネルイメージは必ずしも標準カーネルより優れているとは限りません。リアルタイムカーネルは、特定のユースケース用に調整された別のカーネルです。低レイテンシを実現するために調整されていますが、その結果、スループットが犠牲になります。リアルタイムカーネルは一般的な用途には推奨されませんが、ここでは低レイテンシが重要な要因である通信ワークロード用のカーネルとして推奨されています。
pt_br: A imagem do kernel Real-Time não é necessariamente melhor do que o kernel padrão. Trata-se de um kernel diferente adaptado a um caso de uso específico. O kernel Real-Time é adaptado para latência mais baixa em detrimento da taxa de transferência. Ele não é recomendado para fins de uso geral; mas, no nosso caso, esse é o kernel recomendado para cargas de trabalho de telecomunicações em que a latência é um fator importante.
zh_cn: 实时内核映像不一定比标准内核更好。它是针对特定用例进行微调的另一种内核。经过微调的实时内核可以降低延迟，但代价是降低了吞吐量。不建议将实时内核用于一般用途，但在本例中，它是建议用于电信工作负载的内核，因为其中的延迟是一项关键考虑因素。

source: There are four top features:
es: Hay cuatro funciones principales:
ja: 主に4つの機能があります。
pt_br: Há quatro recursos principais:
zh_cn: 实时内核有四大特性：

source: Deterministic execution:
es: Ejecución determinista:
ja: 決定論的実行:
pt_br: Execução determinística:
zh_cn: 确定性执行：

source: Get greater predictability — ensure critical business processes complete in time, every time and deliver high-quality service, even under heavy system loads. By shielding key system resources for high-priority processes, you can ensure greater predictability for time-sensitive applications.
es: Se consigue una mayor previsibilidad: se garantiza que los procesos empresariales críticos se completan a tiempo, siempre, y ofrece un servicio de alta calidad, incluso con cargas elevadas del sistema. Al proteger los recursos clave del sistema para los procesos de alta prioridad, se garantiza una mayor previsibilidad para las aplicaciones en las que el tiempo es importante.
ja: 予測可能性の向上 — 高負荷状態でも重要なビジネスプロセスが期限内に確実に完了し、常に高品質なサービスを提供します。高優先度プロセスのために重要なシステムリソースを保護することで、時間に依存するアプリケーションの予測可能性を向上できます。
pt_br: Aumente a previsibilidade: garanta que os processos de negócios críticos sejam sempre concluídos dentro do prazo e ofereçam um serviço de alta qualidade, mesmo com cargas pesadas do sistema. Ao proteger os recursos importantes do sistema nos processos de alta prioridade, você garante maior previsibilidade para aplicativos urgentes.
zh_cn: 获得更高的可预测性 — 确保关键业务流程每次都能及时完成并提供高质量的服务，即使系统负载极高的情况下也不例外。通过围隔出关键系统资源供高优先级流程使用，可以确保为时间敏感型应用程序提供更高的可预测性。

source: Low jitter:
es: Baja fluctuación:
ja: 低ジッター:
pt_br: Baixa instabilidade:
zh_cn: 低抖动：

source: The low jitter built upon the highly deterministic technology helps to keep applications synchronized with the real world. This helps services that need ongoing and repeated calculation.
es: La baja fluctuación basada en la tecnología altamente determinista ayuda a mantener las aplicaciones sincronizadas con el mundo real. Esto ayuda a los servicios que necesitan cálculos continuos y repetidos.
ja: 高度に決定論的な技術に基づいてジッターが低く抑えられているため、アプリケーションと実世界との同期を維持できます。これは、継続的に繰り返し計算を行う必要があるサービスで役立ちます。
pt_br: A baixa instabilidade decorrente da tecnologia altamente determinística ajuda a manter a sincronização dos aplicativos com o mundo real. Isso ajuda os serviços que precisam de cálculo contínuo e repetido.
zh_cn: 基于高确定性技术的低抖动有助于应用程序与现实世界保持同步。这可以为那些需要持续重复计算的服务提供帮助。

source: Priority inheritance:
es: Herencia de prioridad:
ja: 優先度の継承:
pt_br: Herança de prioridade:
zh_cn: 优先级继承：

source: Priority inheritance refers to the ability of a lower priority process to assume a higher priority when there is a higher priority process that requires the lower priority process to finish before it can accomplish its task. SUSE Linux Enterprise Real Time solves these priority inversion problems for mission-critical processes.
es: La herencia de prioridad hace referencia a la capacidad de un proceso de subir de prioridad si existe un proceso de mayor prioridad que requiere que el de menor prioridad finalice antes para poder completar su tarea. SUSE Linux Enterprise Real Time resuelve estos problemas de inversión de prioridad para los procesos críticos.
ja: 優先度の継承とは、優先度の高いプロセスがある状況において、そのプロセスがタスクを完了するためには優先度の低いプロセスが完了するのを待つ必要がある場合に、優先度の低いプロセスが高優先度を一時的に引き受ける機能です。SUSE Linux Enterprise Real Timeは、ミッションクリティカルなプロセスにおけるこのような優先度の逆転の問題を解決します。
pt_br: A herança de prioridade refere-se à capacidade de um processo de prioridade mais baixa assumir a prioridade mais alta quando há um processo de maior prioridade que requer a conclusão do processo de menor prioridade para então finalizar sua tarefa. O SUSE Linux Enterprise Real Time resolve esses problemas de inversão de prioridade para processos de extrema importância.
zh_cn: 优先级继承是指当较高优先级的进程在完成其任务之前需要先等待较低优先级的进程完成时，较低优先级的进程可以提升为较高优先级的功能。SUSE Linux Enterprise Real Time 解决了任务关键型进程的优先级倒置问题。

source: Thread interrupts:
es: Interrupciones de subprocesos:
ja: スレッドの割り込み:
pt_br: Interrupções de threads:
zh_cn: 线程中断：

source: Processes running in interrupt mode in a general-purpose operating system are not preemptible. With SUSE Linux Enterprise Real Time, these interrupts have been encapsulated by kernel threads, which are interruptible, and allow the hard and soft interrupts to be preempted by user-defined higher priority processes.
es: En un sistema operativo de uso general, no se pueden interrumpir los procesos que se ejecutan en modo de interrupción. Con SUSE Linux Enterprise Real Time, estas interrupciones se encapsulan en subprocesos del kernel, que son interrumpibles. De esta forma, los procesos de mayor prioridad definidos por el usuario pueden interrumpir tanto interrupciones duras como suaves.
ja: 一般的なオペレーティングシステムでは、割り込みモードで実行中のプロセスはプリエンプト可能ではありません。SUSE Linux Enterprise Real Timeでは、このような割り込みをカーネルスレッドでカプセル化して割り込み可能にし、ユーザが定義した高優先度プロセスでハード割り込みとソフト割り込みをプリエンプトできます。
pt_br: Os processos executados no modo de interrupção em um sistema operacional de uso geral não são preemptíveis. Com o SUSE Linux Enterprise Real Time, essas interrupções foram encapsuladas pelos threads do kernel, que são interrompíveis e permitem a preempção de interrupções fixas e flexíveis por processos de prioridade mais alta definidos pelo usuário.
zh_cn: 在通用操作系统中以中断模式运行的进程不可抢占。在 SUSE Linux Enterprise Real Time 中，这些中断已由可中断的内核线程封装，并允许用户定义的较高优先级进程抢占硬中断和软中断。

source: In our case, if you have installed a real-time image like <literal>SUSE Linux Micro RT</literal>, kernel real time is already installed. From the <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, you can download the real-time kernel image.
es: En nuestro caso, si ha instalado una imagen en tiempo real como <literal>SUSE Linux Micro RT</literal>, el kernel en tiempo real ya está instalado. Puede descargar la imagen del kernel en tiempo real del <link xl:href="https://scc.suse.com/">Centro de servicios al cliente de SUSE</link>.
ja: ここでは、<literal>SUSE Linux Micro RT</literal>のようなリアルタイムイメージをインストール済みの場合、カーネルリアルタイムはすでにインストールされています。リアルタイムカーネルイメージは<link xl:href="https://scc.suse.com/">SUSE Customer Center</link>からダウンロードできます。
pt_br: No nosso caso, se você instalou uma imagem em tempo real, como <literal>SUSE Linux Micro RT</literal>, o kernel Real-Time já está instalado. Você pode fazer download da imagem do kernel Real-Time pelo <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>.
zh_cn: 在本例中，如果您安装了 <literal>SUSE Linux Micro RT</literal> 之类的实时映像，那么就已经安装了实时内核。可以从 <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> 下载实时内核映像。

source: For more information about the real-time kernel, visit <link xl:href="https://www.suse.com/products/realtime/">SUSE Real Time</link>.
es: Para obtener más información sobre el kernel en tiempo real, visite <link xl:href="https://www.suse.com/products/realtime/">SUSE Real Time</link>.
ja: リアルタイムカーネルの詳細については、<link xl:href="https://www.suse.com/products/realtime/">SUSE Real Time</link>を参照してください。
pt_br: Para obter mais informações sobre o kernel Real-Time, visite <link xl:href="https://www.suse.com/products/realtime/">SUSE Real Time</link>.
zh_cn: 有关实时内核的详细信息，请访问 <link xl:href="https://www.suse.com/products/realtime/">SUSE Real Time</link>。

source: Kernel arguments for low latency and high performance
es: Argumentos del kernel para baja latencia y alto rendimiento
ja: 低レイテンシとハイパフォーマンスのためのカーネル引数
pt_br: Argumentos do kernel para baixa latência e alto desempenho
zh_cn: 实现低延迟和高性能需指定的内核参数

source: The kernel arguments are important to be configured to enable the real-time kernel to work properly giving the best performance and low latency to run telco workloads. There are some important concepts to keep in mind when configuring the kernel arguments for this use case:
es: Es importante configurar los argumentos del kernel para que el kernel en tiempo real funcione correctamente y ofrezca el mejor rendimiento y una baja latencia para ejecutar cargas de trabajo de telecomunicaciones. Hay algunos conceptos importantes que hay que tener en cuenta al configurar los argumentos del kernel para este caso práctico:
ja: リアルタイムカーネルを適切に動作させ、通信ワークロードを実行する際には、最高のパフォーマンスと低レイテンシ実現できるようにカーネル引数を設定することが重要です。このユースケースのカーネル引数を設定する際には、いくつかの重要な概念を念頭に置く必要があります。
pt_br: É importante configurar os argumentos do kernel para que o kernel Real-Time funcione corretamente, apresentando o melhor desempenho e a baixa latência para executar as cargas de trabalho de telecomunicações. Há alguns conceitos importantes para manter em mente na hora de configurar os argumentos do kernel para este caso de uso:
zh_cn: 内核参数必须进行配置，以便实时内核能够正常工作，从而为运行电信工作负载提供最佳性能和低延迟。在为此使用场景配置内核参数时，需要特别注意一些重要的概念：

source: Remove <literal>kthread_cpus</literal> when using SUSE real-time kernel. This parameter controls on which CPUs kernel threads are created. It also controls which CPUs are allowed for PID 1 and for loading kernel modules (the kmod user-space helper). This parameter is not recognized and does not have any effect.
es: Elimine <literal>kthread_cpus</literal> cuando use el kernel en tiempo real de SUSE. Este parámetro controla en qué CPU se crean los subprocesos del kernel. También controla qué CPU están permitidas para el PID 1 y para cargar módulos del kernel (el ayudante del espacio de usuario kmod). Este parámetro no se reconoce y no tiene ningún efecto.
ja: SUSEリアルタイムカーネルを使用する際には、<literal>kthread_cpus</literal>を削除します。このパラメータは、カーネルスレッドが作成されるCPUを制御します。また、PID 1とカーネルモジュール(kmodユーザスペースヘルパー)のロードにどのCPUが許可されるかも制御します。このパラメータは認識されず、影響は何もありません。
pt_br: Remova o <literal>kthread_cpus</literal> ao usar o kernel Real-Time da SUSE. Esse parâmetro controla em quais CPUs os threads do kernel serão criados. Ele também controla quais CPUs têm permissão para PID 1 e para carregar módulos do kernel (o auxiliar de espaço do usuário kmod). Esse parâmetro não é reconhecido e não tem nenhum efeito.
zh_cn: 使用 SUSE 实时内核时需去除 <literal>kthread_cpus</literal>。此参数控制在哪些 CPU 上创建内核线程。它还控制允许哪些 CPU 用于 PID 1 及加载内核模块（由 kmod 用户空间辅助工具加载）。此参数无法被 SUSE 实时内核识别，因此没有任何效果。

source: Isolate the CPU cores using <literal>isolcpus</literal>, <literal>nohz_full</literal>, <literal>rcu_nocbs</literal>, and <literal>irqaffinity</literal>. For a comprehensive list of CPU pinning techniques, refer to CPU Pinning via Tuned and kernel args (<xref linkend="cpu-tuned-configuration"/>) chapter.
es: Use <literal>isolcpus</literal>, <literal>nohz_full</literal>, <literal>rcu_nocbs</literal> e <literal>irqaffinity</literal> para aislar los núcleos de CPU. Para obtener una lista completa de las técnicas de fijación de CPU, consulte el capítulo sobre fijación de CPU mediante Tuned y argumentos del kernel (<xref linkend="cpu-tuned-configuration"/>).
ja: <literal>isolcpus</literal>、<literal>nohz_full</literal>、<literal>rcu_nocbs</literal>、および<literal>irqaffinity</literal>を使用して、CPUコアを分離します。CPUピニング技術の包括的なリストについては、「Tunedとカーネル引数によるCPUピニング」(<xref linkend="cpu-tuned-configuration"/>)の章を参照してください。
pt_br: Isole os núcleos da CPU usando <literal>isolcpus</literal>, <literal>nohz_full</literal>, <literal>rcu_nocbs</literal> e <literal>irqaffinity</literal>. Para acessar a lista completa de técnicas de fixação de CPU, consulte o capítulo Fixação de CPU via TuneD e argumentos do kernel (<xref linkend="cpu-tuned-configuration"/>).
zh_cn: 通过 <literal>isolcpus</literal>、<literal>nohz_full</literal>、<literal>rcu_nocbs</literal> 和 <literal>irqaffinity</literal> 隔离 CPU 核心。有关 CPU 绑定技术的完整列表，请参见<xref linkend="cpu-tuned-configuration"/>。

source: Add <literal>domain,nohz,managed_irq</literal> flags to <literal>isolcpus</literal> kernel argument. Without any flags, <literal>isolcpus</literal> is equivalent to specifying only the <literal>domain</literal> flag. This isolates the specified CPUs from scheduling, including kernel tasks. The <literal>nohz</literal> flag stops the scheduler tick on the specified CPUs (if only one task is runnable on a CPU), and the <literal>managed_irq</literal> flag avoids routing managed external (device) interrupts at the specified CPUs. Note that the IRQ lines of NVMe devices are fully managed by the kernel and will be routed to the non-isolated (housekeeping) cores as a consequence. For example, the command line provided at the end of this section will result in only four queues (plus an admin/control queue) allocated on the system:
es: Añade los indicadores <literal>domain,nohz,managed_irq</literal> al argumento del kernel <literal>isolcpus</literal>. Si no se añade ningún indicador, <literal>isolcpus</literal> equivale a especificar solo el indicador <literal>domain</literal>. Esto aísla las CPU especificadas de la programación, incluidas las tareas del kernel. El indicador <literal>nohz</literal> detiene la marca del programador en las CPU especificadas (si solo se puede ejecutar una tarea en una CPU), y el indicador <literal>managed_irq</literal> evita el enrutamiento de interrupciones externas gestionadas (dispositivos) en las CPU especificadas. Tenga en cuenta que las líneas IRQ de los dispositivos NVMe están totalmente gestionadas por el kernel y, como consecuencia, se enrutarán a los núcleos no aislados (de mantenimiento). Por ejemplo, la línea de comandos que se proporciona al final de esta sección dará como resultado que solo se asignen cuatro colas (más una cola de administración/control) en el sistema:
ja: <literal>domain,nohz,managed_irq</literal>フラグを<literal>isolcpus</literal>カーネル引数に追加します。何もフラグを指定しない場合、<literal>isolcpus</literal>は<literal>domain</literal>フラグのみを指定するのと同等になります。これにより、指定したCPUがカーネルタスクを含むスケジューリングから分離されます。<literal>nohz</literal>フラグは指定されたCPUのスケジューラティックを停止し(CPUで実行できるタスクが1つのみの場合)、<literal>managed_irq</literal>フラグは指定したCPUの管理対象の外部(デバイス)割り込みのルーティングを回避します。NVMeデバイスのIRQラインはカーネルによって完全に管理されており、その結果、非分離(ハウスキーピング)コアにルーティングされることに注意してください。たとえば、このセクションの最後に示されたコマンドラインを実行すると、システムに割り当てられるキューは4つ(および管理/制御キュー)のみとなります。
pt_br: Adicione os sinalizadores <literal>domain,nohz,managed_irq</literal> ao argumento do kernel <literal>isolcpus</literal>. Sem os sinalizadores, o <literal>isolcpus</literal> equivale a especificar apenas o sinalizador <literal>domain</literal>. Isso isola as CPUs especificadas da programação, incluindo as tarefas do kernel. O sinalizador <literal>nohz</literal> interrompe o tick do programador nas CPUs especificadas (se apenas uma tarefa for executável em determinada CPU), e o sinalizador <literal>managed_irq</literal> evita o roteamento de interrupções externas gerenciadas (dispositivos) nas CPUs especificadas. Observe que as linhas da IRQ dos dispositivos NVMe são totalmente gerenciadas pelo kernel e serão roteadas para os núcleos não isolados (manutenção) como consequência. Por exemplo, a linha de comando inserida no fim desta seção resultará apenas em quatro filas (mais uma fila de admin/controle) alocadas no sistema:
zh_cn: 将 <literal>domain,nohz,managed_irq</literal> 标志添加到 <literal>isolcpus</literal> 内核参数。如果没有任何标志，<literal>isolcpus</literal> 相当于只指定 <literal>domain</literal> 标志。这将导致指定的 CPU 无法进行调度，包括内核任务。<literal>nohz</literal> 标志会停止指定 CPU 上运行的调度器节拍（如果一个 CPU 上只有一个任务可运行），<literal>managed_irq</literal> 标志可避免在指定 CPU 上路由受管理的外部（设备）中断。需要注意的是，NVMe 设备的中断请求 (IRQ) 线路由内核全权管理，因此会被路由至非隔离（系统管理）核心。例如，本节末尾提供的命令行会导致系统中仅分配 4 个队列（外加 1 个管理/控制队列）：

source: This behavior prevents any disruption caused by disk I/O to any time sensitive application running on the isolated cores, but might require attention and careful design for storage focused workloads.
es: Este comportamiento evita cualquier interrupción causada por la E/S del disco en cualquier aplicación sensible al tiempo que se ejecute en los núcleos aislados, pero puede requerir atención y un diseño cuidadoso para las cargas de trabajo centradas en el almacenamiento.
ja: この動作は、分離されたコア上で実行中の時間的制約のあるアプリケーションに対するディスク I/O による中断を防止します。ただし、ストレージに重点を置いたワークロードの場合、注意と慎重な設計が必要になる可能性があります。
pt_br: Esse comportamento impede interrupções causadas por E/S do disco em qualquer aplicativo urgente executado nos núcleos isolados, mas pode exigir atenção e definição cuidadosa para cargas de trabalho com foco em armazenamento.
zh_cn: 此行为可防止磁盘 I/O 对运行在隔离核心上的任何时间敏感型应用程序造成干扰，但可能需要对以存储为重点的工作负载进行关注和精心设计。

source: Tune the ticks (kernel’s periodic timer interrupts):
es: Ajuste las marcas (ticks, interrupciones periódicas del temporizador del kernel):
ja: ティック(カーネルの定期的なタイマー割り込み)を調整します。
pt_br: Ajuste os ticks (interrupções periódicas do temporizador do kernel):
zh_cn: 调整节拍（内核的周期性定时器中断）：

source: <literal>skew_tick=1</literal>: ticks can sometimes happen simultaenously. Instead of all CPUs receiving their timer tick at the exact same moment, <literal>skew_tick=1</literal> makes them occur at slightly offset times. This helps reduce system jitter, resulting in more consistent and lower interrupt response times (an essential requirement for latency-sensitive applications).
es: <literal>skew_tick=1</literal>: a veces, las marcas pueden ocurrir simultáneamente. En lugar de que todas las CPU reciban su marca de temporizador exactamente al mismo tiempo, <literal>skew_tick=1</literal> hace que se produzcan en momentos ligeramente distintos. Esto ayuda a reducir la fluctuación del sistema, lo que se traduce en tiempos de respuesta a las interrupciones más consistentes y más bajos (un requisito esencial para las aplicaciones sensibles a la latencia).
ja: <literal>skew_tick=1</literal>: ティックは同時に発生する場合があります。<literal>skew_tick=1</literal>を指定すると、すべてのCPUがタイマーティックを正確に同じタイミングで受信するのではなく、わずかにオフセットされたタイミングで発生させます。これにより、システムジッターが軽減され、より一貫性があり低い割り込み応答時間(レイテンシに敏感なアプリケーションにとって不可欠な要件)が可能になります。
pt_br: <literal>skew_tick=1</literal>: os ticks às vezes podem ocorrer ao mesmo tempo. Em vez de todas as CPUs receberem o tick do temporizador exatamente no mesmo momento, o <literal>skew_tick=1</literal> faz com que ele ocorra em horários um pouco diferentes. Isso ajuda a reduzir a instabilidade do sistema, resultando em tempos de resposta mais consistentes e com menos interrupções (um requisito essencial para aplicativos sensíveis à latência).
zh_cn: <literal>skew_tick=1</literal>：有时可能同时发生多个节拍。指定 <literal>skew_tick=1</literal> 可使所有 CPU 不在同一时刻接收定时器节拍，而是在略微错开的时间点接收。这有助于减少系统抖动，从而实现更一致且更低的中断响应时间（这是对延迟敏感型应用程序的基本要求）。

source: <literal>nohz=on</literal>: stops the periodic timer tick on idle CPUs.
es: <literal>nohz=on</literal>: detiene la marca del temporizador periódico en las CPU inactivas.
ja: <literal>nohz=on</literal>: アイドル状態のCPUにおける定期的なタイマーティックを停止します。
pt_br: <literal>nohz=on</literal>: interrompe o tick periódico do temporizador em CPUs ociosas.
zh_cn: <literal>nohz=on</literal>：停止空闲 CPU 上的周期性定时器节拍。

source: <literal>nohz_full=&lt;cpu-cores&gt;</literal>: Stops the periodic timer tick on specified CPUs that are dedicated for real-time applications.
es: <literal>nohz_full=&lt;cpu-cores&gt;</literal>: detiene la marca del temporizador periódico en las CPU especificadas que están dedicadas a aplicaciones en tiempo real.
ja: <literal>nohz_full=&lt;cpu-cores&gt;</literal>: リアルタイムアプリケーション専用の指定されたCPUにおける定期的なタイマーティックを停止します。
zh_cn: <literal>nohz_full=&lt;cpu-cores&gt;</literal>：停止专用于实时应用程序的指定 CPU 上的周期性定时器节拍。

source: Disable Machine Check Exception (MCE) handling by specifying <literal>mce=off</literal>. MCEs are hardware errors detected by the processor and disabling them can avoid noisy logs.
es: Inhabilite la gestión de excepciones de comprobación de máquina (MCE) especificando <literal>mce=off</literal>. Las MCE son errores de hardware detectados por el procesador y desactivarlas puede evitar que los registros sean excesivamente grandes.
ja: <literal>mce=off</literal>を指定して、マシンチェック例外(MCE)の処理を無効にします。MCEはプロセッサによって検出されるハードウェアエラーであり、無効にすることで、ノイズの多いログを回避できます。
pt_br: Desabilite o processamento de exceção de verificação de máquina (MCE, Machine Check Exception) especificando <literal>mce=off</literal>. As MCEs são erros do hardware detectados pelo processador, e sua desabilitação pode evitar registros com muito ruído.
zh_cn: 通过指定 <literal>mce=off</literal> 禁用计算机检查异常 (MCE) 处理。MCE 是处理器检测到的硬件错误，禁用它们可以避免产生冗余日志。

source: Add <literal>nowatchdog</literal> to disable the soft-lockup watchdog which is implemented as a timer running in the timer hard-interrupt context. When it expires (i.e. a soft lockup is detected), it will print a warning (in the hard interrupt context), running any latency targets. Even if it never expires, it goes onto the timer list, slightly increasing the overhead of every timer interrupt. This option also disables the NMI watchdog, so NMIs cannot interfere.
es: Añada <literal>nowatchdog</literal> para inhabilitar el watchdog de bloqueo suave, que se implementa como un temporizador que se ejecuta en el contexto de interrupción dura del temporizador. Cuando caduca (es decir, cuando se detecta un bloqueo suave), muestra una advertencia (en el contexto de interrupción dura) y ejecuta cualquier objetivo de latencia. Incluso si no caduca nunca, pasa a la lista de temporizadores, lo que aumenta ligeramente la sobrecarga de cada interrupción del temporizador. Esta opción también inhabilita el watchdog de NMI, por lo que las NMI no pueden interferir.
ja: <literal>nowatchdog</literal>を追加して、タイマーのハード割り込みコンテキストで実行されるタイマーとして実装されるソフトロックアップウォッチドッグを無効にします。有効期限が切れると(すなわち、ソフトロックアップが検出されると)、(ハード割り込みコンテキストで)警告が出力され、あらゆるレイテンシターゲットを実行します。有効期限が切れていない場合でも、タイマーリストに追加され、タイマー割り込みのオーバーヘッドがわずかに増加します。このオプションは、NMIウォッチドッグも無効にするため、NMIが干渉できなくなります。
pt_br: Adicione <literal>nowatchdog</literal> para desabilitar o watchdog de bloqueio flexível que é implementado como um temporizador em execução no contexto de interrupção fixa do temporizador. Quando ele expira (ou seja, um bloqueio flexível é detectado), um aviso é exibido (no contexto de interrupção fixa), executando os destinos de latência. Mesmo que nunca expire, ele é incluído na lista do temporizador, o que aumenta levemente a sobrecarga de cada interrupção do temporizador. Essa opção também desabilita o watchdog de NMI, assim as NMIs não podem interferir.
zh_cn: 添加 <literal>nowatchdog</literal> 以禁用软锁死看门狗，该看门狗通过运行在定时器硬中断上下文中的定时器实现。当定时器到期时（即检测到软锁死），它会（在硬中断上下文中）打印警告，违背所有延迟目标。即便从未到期，它也会加入定时器列表，略微增加每次定时器中断的开销。此选项还会禁用 NMI 看门狗，因此 NMI 不会造成干扰。
