Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The Secret username/password must be base64 encoded. Note this should not include any trailing newlines (for example, use <literal>echo -n</literal>, not just <literal>echo</literal>!)
es: El nombre de usuario y la contraseña del secreto deben estar cifrados en base64. No deben incluir saltos de línea al final (por ejemplo, use <literal>echo -n</literal>, no solo <literal>echo</literal>)
ja: シークレットのユーザ名/パスワードはbase64でエンコードされている必要があります。また、末尾に改行を含めないでください(たとえば、単なる<literal>echo</literal>ではなく、<literal>echo ‑n</literal>を使用してください)。
pt_br: O nome de usuário/senha do segredo deve ser codificado com base64. Observe que ele não deve incluir novas linhas à direita (por exemplo, usar <literal>echo -n</literal>, não apenas <literal>echo</literal>!)
zh_cn: 机密用户名/口令必须采用 base64 编码。请注意，此值不能包含任何尾部换行符（例如，应使用 <literal>echo-n</literal>，而不是简单地使用 <literal>echo</literal>！）

source: The <literal>cluster-role</literal> label may be set now or later on cluster creation. In the example below, we expect <literal>control-plane</literal> or <literal>worker</literal>
es: La etiqueta <literal>cluster-role</literal> se puede establecer ahora o más adelante, durante la creación del clúster. En el ejemplo siguiente, se espera <literal>control-plane</literal> o <literal>worker</literal>
ja: <literal>cluster-role</literal>ラベルは、この時点で設定することも、後でクラスタの作成時に設定することもできます。以下の例では、<literal>control-plane</literal>または<literal>worker</literal>を想定しています。
pt_br: É possível definir o rótulo <literal>cluster-role</literal> agora ou mais tarde, durante a criação do cluster. No exemplo abaixo, esperamos <literal>control-plane</literal> ou <literal>worker</literal>
zh_cn: 可以现在设置 <literal>cluster-role</literal> 标签，也可以稍后在创建群集时设置。在以下示例中，应该设置 <literal>control-plane</literal> 或 <literal>worker</literal>

source: <literal>bootMACAddress</literal> must be a valid MAC that matches the control plane NIC of the host
es: <literal>bootMACAddress</literal> debe ser una dirección MAC válida que coincida con la NIC de plano de control del host
ja: <literal>bootMACAddress</literal>は、ホストのコントロールプレーンNICに一致する有効なMACである必要があります。
pt_br: <literal>bootMACAddress</literal> deve ser um MAC válido correspondente à NIC de plano de controle do host
zh_cn: <literal>bootMACAddress</literal> 必须是与主机的控制平面 NIC 匹配的有效 MAC

source: The <literal>bmc</literal> address is the connection to the BMC management API, the following are supported:
es: La dirección <literal>bmc</literal> es la conexión a la API de gestión de BMC. Se admiten las siguientes:
ja: <literal>bmc</literal>のアドレスはBMC管理APIへの接続です。次のアドレスがサポートされています。
pt_br: O endereço <literal>bmc</literal> é a conexão com a API de gerenciamento de BMC. As seguintes opções são suportadas:
zh_cn: <literal>bmc</literal> 地址用于连接 BMC 管理 API，支持以下类型：

source: <literal>redfish-virtualmedia://&lt;IP ADDRESS&gt;/redfish/v1/Systems/&lt;SYSTEM ID&gt;</literal>: Redfish virtual media, for example, SuperMicro
es: <literal>redfish-virtualmedia://&lt;DIRECCIÓN IP&gt;/redfish/v1/Systems/&lt;ID DEL SISTEMA&gt;</literal>: medio virtual Redfish, por ejemplo, SuperMicro
ja: <literal>redfish-virtualmedia://&lt;IP ADDRESS&gt;/redfish/v1/Systems/&lt;SYSTEM ID&gt;</literal>: Redfish仮想メディア(たとえば、SuperMicro)
pt_br: <literal>redfish-virtualmedia://&lt;ENDEREÇO IP&gt;/redfish/v1/Systems/&lt;ID DO SISTEMA&gt;</literal>: mídia virtual Redfish, por exemplo, SuperMicro
zh_cn: <literal>redfish-virtualmedia://&lt;IP 地址&gt;/redfish/v1/Systems/&lt;系统 ID&gt;</literal>：Redfish 虚拟媒体，例如 SuperMicro

source: <literal>idrac-virtualmedia://&lt;IP ADDRESS&gt;/redfish/v1/Systems/System.Embedded.1</literal>: Dell iDRAC
es: <literal>idrac-virtualmedia://&lt;DIRECCIÓN IP&gt;/redfish/v1/Systems/System.Embedded.1</literal>: iDRAC de Dell
pt_br: <literal>idrac-virtualmedia://&lt;ENDEREÇO IP&gt;/redfish/v1/Systems/System.Embedded.1</literal>: iDRAC da Dell
zh_cn: <literal>idrac-virtualmedia://&lt;IP 地址&gt;/redfish/v1/Systems/System.Embedded.1</literal>：Dell iDRAC

source: See the <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">Upstream API docs</link> for more details on the BareMetalHost API
es: Consulte la <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">documentación original de la API</link> para obtener más información sobre la API de BareMetalHost
ja: BareMetalHost APIの詳細については、<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">アップストリームのAPIドキュメント</link>を参照してください。
pt_br: Consulte os <link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">documentos da API upstream</link> para obter mais detalhes sobre a API BareMetalHost
zh_cn: 有关 BareMetalHost API 的详细信息，请参见<link xl:href="https://github.com/metal3-io/baremetal-operator/blob/main/docs/api.md">上游 API 文档</link>

source: Configuring Static IPs
es: Configuración de IP estáticas
ja: 静的IPの設定
pt_br: Configurando IPs estáticos
zh_cn: 配置静态 IP

source: The BareMetalHost example above assumes DHCP provides the controlplane network configuration, but for scenarios where manual configuration is needed such as static IPs it is possible to provide additional configuration, as described below.
es: El ejemplo anterior de BareMetalHost presupone que DHCP proporciona la configuración de red del plano de control, pero para situaciones en las que se necesite una configuración manual, como en el caso de las IP estáticas, es posible proporcionar una configuración adicional, como se describe a continuación.
ja: 上記のBareMetalHostの例では、DHCPでコントロールプレーンネットワークの設定を提供することを想定していますが、静的IPなどの手動設定が必要なシナリオでは、以下に説明するように追加の設定を指定できます。
pt_br: O exemplo do BareMetalHost acima considera que o DHCP configura a rede do plano de controle, mas nos cenários em que a configuração manual é necessária, como no caso dos IPs estáticos, é possível definir uma configuração adicional, conforme descrito abaixo.
zh_cn: 上面的 BareMetalHost 示例假设 DHCP 提供控制平面网络配置，但对于需要手动配置（例如静态 IP）的情况，可以提供附加配置，如下所述。

source: Additional script for static network configuration
es: Guion adicional para la configuración de la red estática
ja: 静的ネットワーク設定用の追加スクリプト
pt_br: Script adicional para configuração de rede estática
zh_cn: 用于静态网络配置的附加脚本

source: When creating the base image with Edge Image Builder, in the <literal>network</literal> folder, create the following <literal>configure-network.sh</literal> file.
es: Al crear la imagen base con Edge Image Builder, en la carpeta de <literal>network</literal>, cree el archivo <literal>configure-network.sh</literal> siguiente.
ja: Edge Image Builderでゴールデンイメージを作成する際には、<literal>network</literal>フォルダ内に次の<literal>configure-network.sh</literal>ファイルを作成します。
pt_br: Ao criar a imagem base com o Edge Image Builder, na pasta <literal>network</literal>, crie o arquivo <literal>configure-network.sh</literal> a seguir.
zh_cn: 使用 Edge Image Builder 创建基础映像时，请在 <literal>network</literal> 文件夹中创建以下 <literal>configure-network.sh</literal> 文件。

source: This consumes configuration drive data on first-boot, and configures the host networking using the <link xl:href="https://github.com/suse-edge/nm-configurator">NM Configurator tool</link>.
es: Esto consume datos de la unidad de configuración en el primer arranque y configura la red del host usando la <link xl:href="https://github.com/suse-edge/nm-configurator">herramienta NM Configurator</link>.
ja: このファイルにより、初回ブート時に設定ドライブのデータを使用して、<link xl:href="https://github.com/suse-edge/nm-configurator">NM Configuratorツール</link>を使ってホストネットワーキングを設定します。
pt_br: Esse procedimento consome os dados da unidade de configuração na primeira inicialização e configura a rede do host usando a <link xl:href="https://github.com/suse-edge/nm-configurator">ferramenta NM Configurator</link>.
zh_cn: 这会在首次引导时使用配置驱动器数据，并使用 <link xl:href="https://github.com/suse-edge/nm-configurator">NM Configurator 工具</link>来配置主机网络。

source: Additional secret with host network configuration
es: Secreto adicional con configuración de red de host
ja: ホストネットワーク設定の追加シークレット
pt_br: Segredo adicional com a configuração de rede do host
zh_cn: 包含主机网络配置的附加机密

source: An additional secret containing data in the <link xl:href="https://nmstate.io/">nmstate</link> format supported by NM Configurator (<xref linkend="components-nmc"/>) can be defined for each host.
es: Se puede definir un secreto adicional que contenga datos en el formato <link xl:href="https://nmstate.io/">nmstate</link> compatible con NM Configurator (<xref linkend="components-nmc"/>) para cada host.
ja: NM Configurator (<xref linkend="components-nmc"/>)でサポートされている<link xl:href="https://nmstate.io/">nmstate</link>形式のデータを含む追加シークレットをホストごとに定義できます。
pt_br: É possível definir um segredo adicional com os dados no formato <link xl:href="https://nmstate.io/">nmstate</link> suportado pela ferramenta NM Configurator (<xref linkend="components-nmc"/>) para cada host.
zh_cn: 可为每个主机定义一个附加机密，其中包含采用 NM Configurator（<xref linkend="components-nmc"/>）所支持的 <link xl:href="https://nmstate.io/">nmstate</link> 格式的数据。

source: The secret is then referenced in the <literal>BareMetalHost</literal> resource via the <literal>preprovisioningNetworkDataName</literal> spec field.
es: A continuación, se hace referencia al secreto en el recurso <literal>BareMetalHost</literal> mediante el campo de especificación <literal>preprovisioningNetworkDataName</literal>.
ja: その後、このシークレットは、<literal>BareMetalHost</literal>リソースで<literal>preprovisioningNetworkDataName</literal>の指定フィールドを使用して参照されます。
pt_br: Depois disso, o segredo será referenciado no recurso <literal>BareMetalHost</literal> pelo campo de especificação <literal>preprovisioningNetworkDataName</literal>.
zh_cn: 然后通过 <literal>preprovisioningNetworkDataName</literal> 规范字段在 <literal>BareMetalHost</literal> 资源中引用该机密。

source: In some circumstances the MAC address may be omitted. See <xref linkend="networking-unified"/> for additional details.
es: En algunas circunstancias, la dirección MAC puede omitirse. Consulte la <xref linkend="networking-unified"/> para obtener más detalles.
ja: 状況によっては、MACアドレスが省略される場合があります。詳細については、<xref linkend="networking-unified"/>を参照してください。
pt_br: Em algumas situações, é possível omitir o endereço MAC. Consulte a <xref linkend="networking-unified"/> para obter mais detalhes.
zh_cn: 在某些情况下，可以省略 MAC 地址。请参见<xref linkend="networking-unified"/>了解更多信息。

source: BareMetalHost preparation
es: Preparación de BareMetalHost
ja: BareMetalHostの準備
pt_br: Preparação do BareMetalHost
zh_cn: BareMetalHost 准备

source: After creating the BareMetalHost resource and associated secrets as described above, a host preparation workflow is triggered:
es: Después de crear el recurso BareMetalHost y los secretos asociados como se ha descrito, se activa un flujo de trabajo de preparación del host:
ja: 上記の説明に従ってBareMetalHostリソースと関連するシークレットを作成すると、次のようにホスト準備ワークフローがトリガされます。
pt_br: Depois de criar o recurso BareMetalHost e os segredos associados conforme descrito acima, será acionado um fluxo de trabalho de preparação do host:
zh_cn: 按照上述步骤创建 BareMetalHost 资源和关联的机密后，将触发主机准备工作流程：

source: A ramdisk image is booted by virtualmedia attachment to the target host BMC
es: Se arranca una imagen ramdisk mediante la conexión de un dispositivo virtual al BMC del host de destino
ja: ターゲットホストのBMCに接続された仮想メディアによってramdiskイメージがブートされる
pt_br: Uma imagem de disco RAM será iniciada depois de conectar a mídia virtual ao BMC do host de destino
zh_cn: 通过将虚拟媒体挂接到目标主机 BMC，引导内存盘映像

source: The ramdisk inspects hardware details, and prepares the host for provisioning (for example by cleaning disks of previous data)
es: El ramdisk inspecciona los detalles del hardware y prepara el host para el aprovisionamiento (por ejemplo, limpiando los discos de datos anteriores)
ja: ramdiskがハードウェア詳細を検査し、ホストをプロビジョニング用に準備する(たとえば、ディスクから以前のデータを消去する)
pt_br: O disco RAM inspeciona os detalhes do hardware e prepara o host para provisionamento (por exemplo, limpando os discos de dados anteriores)
zh_cn: 内存盘会检查硬件细节，并为主机做好置备准备（例如，清理磁盘中的旧数据）

source: On completion of this process, hardware details in the BareMetalHost <literal>status.hardware</literal> field are updated and can be verified
es: Una vez completado este proceso, se actualizan los detalles del hardware en el campo <literal>status.hardware</literal> de BareMetalHost y se pueden verificar
ja: このプロセスが完了すると、BareMetalHostの<literal>status.hardware</literal>フィールドのハードウェア詳細が更新され、検証可能になる
pt_br: Ao término desse processo, os detalhes do hardware no campo <literal>status.hardware</literal> do BareMetalHost serão atualizados e poderão ser verificados
zh_cn: 完成此过程后，BareMetalHost <literal>status.hardware</literal> 字段中的硬件细节将会更新并可供验证

source: This process can take several minutes, but when completed you should see the BareMetalHost state become <literal>available</literal>:
es: Este proceso puede tardar varios minutos, pero una vez completado, debería ver que el estado de BareMetalHost pasa a ser <literal>available</literal> (disponible):
ja: このプロセスには数分かかる場合がありますが、完了すると、BareMetalHostの状態が<literal>available</literal>になります。
pt_br: Esse processo pode levar bastante tempo, mas quando for concluído, você verá que o estado do BareMetalHost deve mudar para <literal>available</literal>:
zh_cn: 此过程可能需要几分钟时间，但完成后，您应该会看到 BareMetalHost 状态变为 <literal>available</literal>：

source: Creating downstream clusters
es: Creación de clústeres descendentes
ja: ダウンストリームクラスタの作成
pt_br: Criando clusters downstream
zh_cn: 创建下游群集

source: We now create Cluster API resources which define the downstream cluster, and Machine resources which will cause the BareMetalHost resources to be provisioned, then bootstrapped to form an RKE2 cluster.
es: Ahora creamos recursos de Cluster API que definen el clúster descendente y recursos del equipo que provocarán que se aprovisionen los recursos de BareMetalHost y, a continuación, se arranquen para formar un clúster RKE2.
ja: 続いて、ダウンストリームクラスタを定義するCluster APIリソースと、BareMetalHostリソースをプロビジョニングしてからブートストラップを実行してRKE2クラスタを形成するマシンリソースを作成します。
pt_br: Agora criamos os recursos de Cluster API que definem o cluster downstream e os recursos de Machine que provisionam e, depois, iniciam os recursos do BareMetalHost para formar um cluster RKE2.
zh_cn: 现在创建用于定义下游群集的 Cluster API 资源，以及创建计算机资源，后者会导致置备 BareMetalHost 资源，然后引导这些资源以形成 RKE2 群集。

source: Control plane deployment
es: Despliegue del plano de control
ja: コントロールプレーンのデプロイメント
pt_br: Implantação do plano de controle
zh_cn: 控制平面部署

source: To deploy the controlplane we define a yaml manifest similar to the one below, which contains the following resources:
es: Para desplegar el plano de control, se define un manifiesto YAML similar al que se muestra a continuación, que contiene los siguientes recursos:
ja: コントロールプレーンをデプロイするために、以下のリソースを含む次のようなyamlマニフェストを定義します。
pt_br: Para implantar o plano de controle, definimos um manifesto YAML semelhante ao mostrado abaixo, que contém os seguintes recursos:
zh_cn: 为了部署控制平面，我们需要定义一个如下所示的 yaml 清单，其中包含以下资源：

source: Cluster resource defines the cluster name, networks, and type of controlplane/infrastructure provider (in this case RKE2/Metal3)
es: El recurso Cluster define el nombre del clúster, las redes y el tipo de proveedor de plano de control/infraestructura (en este caso, RKE2/Metal3)
ja: クラスタリソースでは、クラスタ名、ネットワーク、およびコントロールプレーン/インフラストラクチャプロバイダのタイプ(この場合はRKE2/Metal3)を定義します。
pt_br: O recurso Cluster define o nome do cluster, as redes e o tipo de provedor de plano de controle/infraestrutura (neste caso, RKE2/Metal3)
zh_cn: 群集资源定义群集名称、网络和控制平面/基础架构提供程序的类型（在本例中为 RKE2/Metal3）

source: Metal3Cluster defines the controlplane endpoint (host IP for single-node, LoadBalancer endpoint for multi-node, this example assumes single-node)
es: Metal3Cluster define el punto final del plano de control (IP del host para un solo nodo, punto final LoadBalancer para varios nodos; en este ejemplo se supone que hay un solo nodo)
ja: Metal3Clusterでは、コントロールプレーンのエンドポイント(シングルノードの場合はホストIP、マルチノードの場合はLoadBalancerエンドポイント。この例ではシングルノードを想定)を定義します。
pt_br: Metal3Cluster define o endpoint do plano de controle (IP do host para nó único, endpoint LoadBalancer para vários nós; neste exemplo, foi considerado o nó único)
zh_cn: Metal3Cluster 定义控制平面端点（单节点群集的主机 IP，多节点群集的负载平衡器端点，本示例假设使用单节点群集）

source: RKE2ControlPlane defines the RKE2 version and any additional configuration needed during cluster bootstrapping
es: RKE2ControlPlane define la versión de RKE2 y cualquier configuración adicional necesaria durante el arranque del clúster
ja: RKE2ControlPlaneでは、RKE2のバージョンと、クラスタのブートストラップ時に必要な追加設定を定義します。
pt_br: RKE2ControlPlane define a versão RKE2 e a configuração adicional necessária durante a inicialização do cluster
zh_cn: RKE2ControlPlane 定义 RKE2 版本，以及群集引导期间所需的任何其他配置

source: Metal3MachineTemplate defines the OS Image to be applied to the BareMetalHost resources, and the hostSelector defines which BareMetalHosts to consume
es: Metal3MachineTemplate define la imagen del sistema operativo que se aplicará a los recursos BareMetalHost, y hostSelector define qué recursos BareMetalHost se consumirán
ja: Metal3MachineTemplateではBareMetalHostリソースに適用するOSイメージを定義し、hostSelectorでは使用するBareMetalHostを定義します。
pt_br: Metal3MachineTemplate define a imagem do sistema operacional que será aplicada aos recursos do BareMetalHost, e hostSelector define quais BareMetalHosts serão consumidos
zh_cn: Metal3MachineTemplate 定义要应用于 BareMetalHost 资源的操作系统映像，hostSelector 定义要使用的 BareMetalHost

source: Metal3DataTemplate defines additional metaData to be passed to the BareMetalHost (note networkData is not currently supported in the Edge solution)
es: Metal3DataTemplate define los metadatos adicionales que se pasarán a BareMetalHost (tenga en cuenta que networkData no es compatible actualmente con Edge)
ja: Metal3DataTemplateでは、BareMetalHostに渡す追加のメタデータを定義します(networkDataは現在のところEdgeソリューションではサポートされていないことに注意してください)。
pt_br: Metal3DataTemplate define o metaData adicional que será passado para o BareMetalHost (veja que o networkData não é suportado na solução Edge)
zh_cn: Metal3DataTemplate 定义要传递给 BareMetalHost 的其他元数据（请注意，Edge 解决方案目前不支持 networkData）

source: For simplicity this example assumes a single-node control plane where the BareMetalHost is configured with an IP of <literal>192.168.125.200</literal>. For more advanced multi-node examples, please see <xref linkend="atip-automated-provisioning"/>.
es: Para simplificar, en este ejemplo se entiende que hay un plano de control de un solo nodo en el que BareMetalHost se ha configurado con la IP <literal>192.168.125.200</literal>. Para ejemplos más avanzados de varios nodos, consulte el <xref linkend="atip-automated-provisioning"/>.
ja: 簡潔にするため、この例では、BareMetalHostのIPアドレスが<literal>192.168.125.200</literal>で設定されている単一ノードのコントロールプレーンを想定しています。より高度なマルチノードの例については、<xref linkend="atip-automated-provisioning"/>を参照してください。
pt_br: Para simplificar, este exemplo considera um plano de controle de nó único em que o BareMetalHost está configurado com o IP <literal>192.168.125.200</literal>. Para ver exemplos mais avançados de vários nós, consulte o <xref linkend="atip-automated-provisioning"/>.
zh_cn: 为简单起见，本示例假设使用单节点控制平面，其中 BareMetalHost 配置了 IP <literal>192.168.125.200</literal>。有关更高级的多节点示例，请参见<xref linkend="atip-automated-provisioning"/>。

source: Once adapted to your environment, you can apply the example via <literal>kubectl</literal> and then monitor the cluster status via <literal>clusterctl</literal>.
es: Una vez adaptado a su entorno, puede aplicar el ejemplo mediante <literal>kubectl</literal> y, a continuación, supervisar el estado del clúster mediante <literal>clusterctl</literal>.
ja: 自身の環境に合わせて調整したら、<literal>kubectl</literal>を使用して例を適用し、その後 <literal>clusterctl</literal>を使用してクラスタのステータスを監視できます。
pt_br: Depois de adaptado ao seu ambiente, aplique o exemplo usando o <literal>kubectl</literal> e monitore o status do cluster por meio do <literal>clusterctl</literal>.
zh_cn: 根据您的环境对该示例清单进行调整后，便可通过 <literal>kubectl</literal> 应用该清单，然后通过 <literal>clusterctl</literal> 监控群集状态。

source: Worker/Compute deployment
es: Despliegue de trabajadores/computación
ja: ワーカー/コンピュートのデプロイメント
pt_br: Implantação de worker/computação
zh_cn: 工作/计算节点部署

source: Similar to the control plane deployment, we define a YAML manifest which contains the following resources:
es: De forma similar al despliegue del plano de control, se define un manifiesto YAML que contiene los siguientes recursos:
ja: コントロールプレーンのデプロイメントと同様に、次のリソースを含むYAMLマニフェストを定義します。
pt_br: De maneira semelhante à implantação do plano de controle, definimos um manifesto YAML que contém os seguintes recursos:
zh_cn: 与部署控制平面时一样，我们需要定义一个 YAML 清单，其中包含以下资源：

source: MachineDeployment defines the number of replicas (hosts) and the bootstrap/infrastructure provider (in this case RKE2/Metal3)
es: MachineDeployment define el número de réplicas (hosts) y el proveedor de arranque/infraestructura (en este caso, RKE2/Metal3)
ja: MachineDeploymentでは、レプリカ(ホスト)の数とブートストラップ/インフラストラクチャプロバイダ(この場合はRKE2/Metal3)を定義します。
pt_br: MachineDeployment define o número de réplicas (hosts) e o provedor de inicialização/infraestrutura (neste caso, RKE2/Metal3)
zh_cn: MachineDeployment 定义复本（主机）数量和引导/基础架构提供程序（在本例中为 RKE2/Metal3）

source: RKE2ConfigTemplate describes the RKE2 version and first-boot configuration for agent host bootstrapping
es: RKE2ConfigTemplate describe la versión de RKE2 y la configuración de arranque inicial para el arranque del host del agente
ja: RKE2ConfigTemplateでは、エージェントホストのブートストラップ用のRKE2のバージョンと初回ブート設定を記述します。
pt_br: RKE2ConfigTemplate descreve a versão RKE2 e a configuração da primeira inicialização para inicializar o host do agente
zh_cn: RKE2ConfigTemplate 描述代理主机引导的 RKE2 版本和首次引导配置

source: Metal3MachineTemplate defines the OS Image to be applied to the BareMetalHost resources, and the host selector defines which BareMetalHosts to consume
es: Metal3MachineTemplate define la imagen del sistema operativo que se aplicará a los recursos BareMetalHost, y el selector de host define qué recursos BareMetalHost se consumirán
ja: Metal3MachineTemplateではBareMetalHostリソースに適用するOSイメージを定義し、hostSelectorでは使用するBareMetalHostを定義します。
pt_br: Metal3MachineTemplate define a imagem do sistema operacional que será aplicada aos recursos do BareMetalHost, e o seletor de host define quais BareMetalHosts serão consumidos
zh_cn: Metal3MachineTemplate 定义要应用于 BareMetalHost 资源的操作系统映像，主机选择器定义要使用的 BareMetalHost

source: Metal3DataTemplate defines additional metadata to be passed to the BareMetalHost (note that <literal>networkData</literal> is not currently supported)
es: Metal3DataTemplate define los metadatos adicionales que se pasarán a BareMetalHost (tenga en cuenta que <literal>networkData</literal> no es compatible actualmente)
ja: Metal3DataTemplateでは、BareMetalHostに渡す追加のメタデータを定義します(<literal>networkData</literal>は現在サポートされていないことに注意してください)。
pt_br: Metal3DataTemplate define os metadados adicionais que serão passados para o BareMetalHost (veja que o <literal>networkData</literal> não é suportado atualmente)
zh_cn: Metal3DataTemplate 定义要传递给 BareMetalHost 的其他元数据（请注意，目前不支持 <literal>networkData</literal>）

source: When the example above has been copied and adapted to suit your environment, it can be applied via <literal>kubectl</literal> then the cluster status can be monitored with <literal>clusterctl</literal>
es: Una vez copiado y adaptado el ejemplo anterior a su entorno, se puede aplicar mediante <literal>kubectl</literal> y, a continuación, se puede supervisar el estado del clúster con <literal>clusterctl</literal>.
ja: 上記の例をコピーし、自身の環境に合わせて調整したら、<literal>kubectl</literal>を使用して適用し、<literal>clusterctl</literal>でクラスタのステータスを監視できます。
pt_br: Quando o exemplo acima for copiado e adaptado ao seu ambiente, ele poderá ser aplicado usando o <literal>kubectl</literal> e, depois, o status do cluster poderá ser monitorado com o <literal>clusterctl</literal>
zh_cn: 复制以上示例并根据您的环境进行修改后，可以通过 <literal>kubectl</literal> 应用该示例，然后使用 <literal>clusterctl</literal> 监控群集状态
