Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The output of this command should show you something similar to the following output, noting that in the example below, we have two GPUs:
es: El resultado de este comando debería mostrar algo similar a lo siguiente, teniendo en cuenta que en este ejemplo tenemos dos GPU:
ja: このコマンドの出力は次のような出力になります。以下の例では、GPUが2つあることに注意してください。
pt_br: A saída desse comando deve ser similar à mostrada abaixo, levando em consideração que temos duas GPUs no exemplo a seguir:
zh_cn: 此命令应显示如下所示的输出，请注意，以下示例中显示了两个 GPU：

source: This concludes the installation and verification process for the NVIDIA drivers on your SUSE Linux Micro system.
es: Con esto concluye el proceso de instalación y verificación de los controladores NVIDIA en su sistema SUSE Linux Micro.
ja: これで、SUSE Linux MicroシステムへのNVIDIAドライバのインストールと検証プロセスは完了です。
pt_br: E assim concluímos o processo de instalação e verificação dos drivers da NVIDIA no sistema SUSE Linux Micro.
zh_cn: 在 SUSE Linux Micro 系统上安装和校验 NVIDIA 驱动程序的过程到此结束。

source: Further validation of the manual installation
es: Validación adicional de la instalación manual
ja: 手動インストールの追加検証
pt_br: Validação adicional da instalação manual
zh_cn: 进一步验证手动安装

source: At this stage, all we have been able to verify is that, at the host level, the NVIDIA device can be accessed and that the drivers are loading successfully. However, if we want to be sure that it is functioning, a simple test would be to validate that the GPU can take instructions from a user-space application, ideally via a container, and through the CUDA library, as that is typically what a real workload would use. For this, we can make a further modification to the host OS by installing the <literal>nvidia-container-toolkit</literal> (<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html#installing-with-zypper">NVIDIA Container Toolkit</link>). First, open another <literal>transactional-update</literal> shell, noting that we could have done this in a single transaction in the previous step, and see how to do this fully automated in a later section:
es: En esta fase, lo único que hemos podido verificar es que, a nivel del host, se puede acceder al dispositivo NVIDIA y que los controladores se cargan correctamente. Sin embargo, si queremos asegurarnos de que funcionan, una prueba sencilla sería validar que la GPU puede recibir instrucciones de una aplicación del espacio de usuarios, idealmente a través de un contenedor y mediante la biblioteca CUDA, ya que eso es lo que normalmente utilizaría una carga de trabajo real. Para ello, podemos realizar una modificación adicional en el sistema operativo del host instalando <literal>nvidia-container-toolkit</literal> (<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html#installing-with-zypper">NVIDIA Container Toolkit</link>). En primer lugar, abra otra shell <literal>transactional-update</literal>, teniendo en cuenta que podríamos haberlo hecho en una sola transacción en el paso anterior. Veremos cómo hacerlo de forma totalmente automatizada en una sección posterior:
ja: この段階で確認できるのは、ホストレベルでNVIDIAデバイスにアクセスできること、およびドライバが正常にロードされていることだけです。ただし、それが機能していることを確認したい場合は、簡単なテストを実施して、GPUがユーザスペースアプリケーションから、理想的にはコンテナ経由で命令を受け取れること、および実際のワークロードが通常使用するものであるCUDAライブラリを通じて命令を受け取れることを検証します。このためには、<literal>nvidia-container-toolkit</literal> (<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html#installing-with-zypper">NVIDIA Container Toolkit</link>)をインストールしてホストOSにさらに変更を加えることができます。まず、別の<literal>transactional-update</literal>シェルを開きます。前の手順ではこれを1つのトランザクションで実行できたことに注目し、後のセクションでこれを完全に自動的に実行する方法を確認します。
pt_br: Neste estágio, a única coisa que podemos verificar é que, no nível do host, é possível acessar o dispositivo NVIDIA e os drivers são carregados com sucesso. No entanto, para garantir que tudo esteja funcionando, há um teste simples para comprovar que a GPU pode receber as instruções de um aplicativo no espaço do usuário, de preferência por meio de um contêiner, e pela biblioteca CUDA, que é o mais comum para uma carga de trabalho real. Para isso, é possível fazer outra modificação no sistema operacional host instalando o <literal>nvidia-container-toolkit</literal> (<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html#installing-with-zypper">NVIDIA Container Toolkit</link>). Em primeiro lugar, abra outro shell <literal>transactional-update</literal>, lembrando que talvez isso já tenha sido feito em uma transação única na etapa anterior, e veja como fazer isso de maneira totalmente automatizada em uma seção posterior:
zh_cn: 在此阶段，我们只能确认的是，在主机级别，可以访问 NVIDIA 设备，并且驱动程序可以成功加载。但是，如果我们想要确保设备正常运行，可以通过一项简单测试来验证 GPU 是否可以从用户空间应用程序接收指令，最好是通过容器和 CUDA 库接收，因为实际工作负载通常使用这种方法。为此，我们可以通过安装 <literal>nvidia-container-toolkit</literal> (<link xl:href="https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html#installing-with-zypper">NVIDIA Container Toolkit</link>) 来进一步修改主机操作系统。首先，打开另一个 <literal>transactional-update</literal> 外壳，请注意，在上一步骤中我们可能是通过单个事务执行此操作，后面的章节将介绍如何完全自动地执行此操作：

source: Next, install the <literal>nvidia-container-toolkit</literal> package from the NVIDIA Container Toolkit repo:
es: A continuación, instale el paquete <literal>nvidia-container-toolkit</literal> desde el repositorio de NVIDIA Container Toolkit:
ja: 次に、NVIDIA Container Toolkitリポジトリから<literal>nvidia-container-toolkit</literal>パッケージをインストールします。
pt_br: Em seguida, instale o pacote <literal>nvidia-container-toolkit</literal> do repositório NVIDIA Container Toolkit:
zh_cn: 接下来，安装来自 NVIDIA Container Toolkit 储存库的 <literal>nvidia-container-toolkit</literal> 软件包：

source: The <literal>nvidia-container-toolkit.repo</literal> below contains a stable (<literal>nvidia-container-toolkit</literal>) and an experimental (<literal>nvidia-container-toolkit-experimental</literal>) repository. The stable repository is recommended for production use. The experimental repository is disabled by default.
es: El archivo <literal>nvidia-container-toolkit.repo</literal> que aparece a continuación contiene un repositorio estable (<literal>nvidia-container-toolkit</literal>) y otro experimental (<literal>nvidia-container-toolkit-experimental</literal>). Se recomienda utilizar el repositorio estable para uso en producción. El repositorio experimental está inhabilitado de forma predeterminada.
ja: 次の<literal>nvidia-container-toolkit.repo</literal>には、安定版(<literal>nvidia-container-toolkit</literal>)と実験版(<literal>nvidia-container-toolkit-experimental</literal>)のリポジトリが含まれています。運用環境での使用には、安定版リポジトリをお勧めします。実験版リポジトリはデフォルトで無効になっています。
pt_br: O <literal>nvidia-container-toolkit.repo</literal> a seguir contém um repositório estável (<literal>nvidia-container-toolkit</literal>) e outro experimental (<literal>nvidia-container-toolkit-experimental</literal>). O repositório estável é recomendado para uso em produção. O repositório experimental está desabilitado por padrão.
zh_cn: 下面的 <literal>nvidia-container-toolkit.repo</literal> 包含稳定储存库 (<literal>nvidia-container-toolkit</literal>) 和实验性储存库 (<literal>nvidia-container-toolkit-experimental</literal>)。对于生产用途，建议使用稳定储存库。默认会禁用实验性储存库。

source: When you are ready, you can exit the <literal>transactional-update</literal> shell:
es: Cuando esté listo, puede salir de la shell <literal>transactional-update</literal>:
ja: 準備ができたら、<literal>transactional-update</literal>シェルを終了できます。
pt_br: Quando estiver pronto, saia do shell <literal>transactional-update</literal>:
zh_cn: 准备就绪后，可以退出 <literal>transactional-update</literal> 外壳：

source: …​and reboot the machine into the new snapshot:
es: ... y reiniciar el equipo en la nueva instantánea:
ja: …​そして新しいスナップショットでマシンを再起動します。
pt_br: …​e reinicie a máquina em um novo instantâneo:
zh_cn: ... 然后将计算机重引导至新快照：

source: As before, you need to ensure that you have exited the <literal>transactional-shell</literal> and rebooted the machine for your changes to be enacted.
es: Como antes, debe asegurarse de que ha salido de <literal>transactional-shell</literal> y ha reiniciado el equipo para que los cambios surtan efecto.
ja: 前述同様に、変更を有効にするには、必ず<literal>transactional-shell</literal>を終了し、マシンを再起動する必要があります。
pt_br: Como antes, você precisa garantir que saiu do <literal>transactional-shell</literal> e reinicializou a máquina para que as alterações tenham efeito.
zh_cn: 如前文所述，需确保已退出 <literal>transactional-update</literal> 外壳并重引导计算机，使更改生效。

source: With the machine rebooted, you can verify that the system can successfully enumerate the devices using the NVIDIA Container Toolkit. The output should be verbose, with INFO and WARN messages, but no ERROR messages:
es: Una vez reiniciada el equipo, compruebe que el sistema puede mostrar correctamente los dispositivos que usan NVIDIA Container Toolkit. El resultado debe ser detallado, con mensajes INFO y WARN, pero sin mensajes ERROR:
ja: マシンが再起動したら、システムがNVIDIA Container Toolkitを使用してデバイスを正常に列挙できることを確認できます。出力は詳細で、INFOとWARNのメッセージがありますが、ERRORのメッセージはありません。
pt_br: Depois que a máquina for reinicializada, verifique se o sistema pode enumerar corretamente os dispositivos usando o NVIDIA Container Toolkit. A saída deve ser detalhada, com mensagens INFO e WARN, mas sem mensagens ERROR:
zh_cn: 重引导计算机后，可以校验系统是否可以使用 NVIDIA Container Toolkit 成功枚举设备。输出应该非常详细，包含 INFO 和 WARN 消息，但不包含 ERROR 消息：

source: This ensures that any container started on the machine can employ NVIDIA GPU devices that have been discovered. When ready, you can then run a podman-based container. Doing this via <literal>podman</literal> gives us a good way of validating access to the NVIDIA device from within a container, which should give confidence for doing the same with Kubernetes at a later stage. Give <literal>podman</literal> access to the labeled NVIDIA devices that were taken care of by the previous command, based on <link xl:href="https://registry.suse.com/repositories/bci-bci-base-15sp6">SLE BCI</link>, and simply run the Bash command:
es: Esto garantiza que cualquier contenedor iniciado en el equipo pueda emplear los dispositivos GPU NVIDIA que se hayan detectado. Cuando esté listo, ejecute un contenedor basado en Podman. Ejecutarlo con <literal>Podman</literal> es una buena forma de validar el acceso al dispositivo NVIDIA desde dentro de un contenedor, lo que debería dar confianza para hacer lo mismo con Kubernetes en una fase posterior. Otorgue a <literal>Podman</literal> acceso a los dispositivos NVIDIA etiquetados que se gestionaron con el comando anterior, basándose en <link xl:href="https://registry.suse.com/repositories/bci-bci-base-15sp6">SLE BCI</link> y ejecute el comando Bash:
ja: これにより、そのマシンで起動するコンテナはすべて、検出されたNVIDIA GPUデバイスを使用できることが確認されます。準備ができたら、podmanベースのコンテナを実行できます。これを<literal>podman</literal>を介して行うことで、コンテナ内からNVIDIAデバイスへのアクセスを効果的に検証することができ、後の段階でKubernetesで同じ操作をするための自信が得られます。<literal>podman</literal>に対し、前のコマンドで<link xl:href="https://registry.suse.com/repositories/bci-bci-base-15sp6">SLE BCI</link>に基づいて処理したラベル付きのNVIDIAデバイスへのアクセス権を与え、バッシュコマンドを実行します。
pt_br: Esse procedimento garante que os contêineres iniciados na máquina possam usar os dispositivos de GPU NVIDIA que foram descobertos. Quando estiver pronto, você poderá executar um contêiner baseado em podman. Usar o <literal>podman</literal> é uma boa forma de validar o acesso ao dispositivo NVIDIA de dentro de um contêiner, o que traz segurança para fazer o mesmo com o Kubernetes no futuro. Conceda ao <literal>podman</literal> acesso para os dispositivos NVIDIA identificados que foram processados pelo comando anterior, com base na <link xl:href="https://registry.suse.com/repositories/bci-bci-base-15sp6">SLE BCI</link>, e simplesmente execute o comando Bash:
zh_cn: 这可确保计算机上启动的任何容器都可以采用已发现的 NVIDIA GPU 设备。准备就绪后，可以运行基于 podman 的容器。通过 <literal>podman</literal> 执行此操作可以方便地从容器内部验证对 NVIDIA 设备的访问，稍后还可以放心地对 Kubernetes 执行同样的操作。根据 <link xl:href="https://registry.suse.com/repositories/bci-bci-base-15sp6">SLE BCI</link>，为 <literal>podman</literal> 授予对上一条命令处理过的带标签 NVIDIA 设备的访问权限，然后直接运行 Bash 命令：

source: You will now execute commands from within a temporary podman container. It does not have access to your underlying system and is ephemeral, so whatever we do here will not persist, and you should not be able to break anything on the underlying host. As we are now in a container, we can install the required CUDA libraries, again checking the correct CUDA version for your driver <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">here</link>, although the previous output of <literal>nvidia-smi</literal> should show the required CUDA version. In the example below, we are installing <emphasis>CUDA 12.3</emphasis> and pulling many examples, demos and development kits so you can fully validate the GPU:
es: Ahora ejecutará comandos desde un contenedor de Podman temporal. No tiene acceso a su sistema subyacente y es efímero, por lo que cualquier acción que realicemos aquí no será permanente y no debería poder dañar nada en el host subyacente. Como ahora estamos en un contenedor, podemos instalar las bibliotecas CUDA necesarias, comprobando de nuevo la versión correcta de CUDA para su controlador <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">aquí</link>, aunque el resultado anterior de <literal>nvidia-smi</literal> debería mostrar la versión de CUDA necesaria. En el ejemplo siguiente, vamos a instalar <emphasis>CUDA 12.3</emphasis> y a extraer muchos ejemplos, demostraciones y kits de desarrollo para que pueda validar completamente la GPU:
ja: 続いて、一時的なpodmanコンテナ内からコマンドを実行します。このコンテナは基盤となるシステムにはアクセスできず一時的であるため、ここで行う操作は永続せず、基盤となるホスト上にあるものを壊すことは一切できないはずです。現在はコンテナ内で作業しているため、必要なCUDAライブラリをインストールできます。ここでもう一度、ご使用のドライバにあったCUDAバージョンを<link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">こちら</link>で確認してください。ただし、必要なCUDAバージョンは<literal>nvidia-smi</literal>の前の出力に表示されているはずです。以下の例では、<emphasis>CUDA 12.3</emphasis>をインストールして多数の例、デモ、開発キットをプルし、GPUを完全に検証できるようにしています。
pt_br: Agora você executará os comandos de um contêiner podman temporário. Ele não tem acesso ao seu sistema subjacente e é efêmero, portanto, o que quer que se faça nele não vai persistir, e você não poderá danificar nada no host subjacente. Como estamos em um contêiner, podemos instalar as bibliotecas CUDA necessárias; mais uma vez, verificando a versão correta do CUDA para seu driver <link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">aqui</link>, embora a saída anterior de <literal>nvidia-smi</literal> deva mostrar a versão necessária do CUDA. No exemplo a seguir, vamos instalar o <emphasis>CUDA 12.3</emphasis> e extrair muitos exemplos, demonstrações e kits de desenvolvimento para você validar o GPU na íntegra:
zh_cn: 现在，您将从临时 podman 容器内部执行命令。该容器无权访问您的底层系统，并且是临时性的，因此我们在此处执行的所有操作都不会保存，并且您无法破坏底层主机上的任何设置。由于我们现在处于容器中，因此可以安装所需的 CUDA 库。请再次对照<link xl:href="https://docs.nvidia.com/cuda/cuda-toolkit-release-notes/">此页面</link>检查驱动程序的 CUDA 版本是否正确，不过，先前 <literal>nvidia-smi</literal> 命令的输出应该也会显示所需的 CUDA 版本。以下示例将安装 <emphasis>CUDA 12.3</emphasis> 并提取许多示例、演示和开发包，以便您可以全面验证 GPU：

source: Once this has been installed successfully, do not exit the container. We will run the <literal>deviceQuery</literal> CUDA example, which comprehensively validates GPU access via CUDA, and from within the container itself:
es: Cuando se haya instalado correctamente, no salga del contenedor. Ejecutaremos el ejemplo de CUDA <literal>deviceQuery</literal>, que valida de forma exhaustiva el acceso a la GPU a través de CUDA, y desde el propio contenedor:
ja: これが正常にインストールされた後にコンテナを終了しないでください。<literal>deviceQuery</literal> CUDAの例を実行し、CUDAを介して、およびコンテナ自体からGPUアクセスを包括的に検証します。
pt_br: Após a devida instalação, não saia do contêiner. Executaremos o exemplo <literal>deviceQuery</literal> de CUDA, que valida de maneira completa o acesso da GPU por CUDA, e de dentro do próprio contêiner:
zh_cn: 成功安装后，请不要退出容器。我们将运行 <literal>deviceQuery</literal> CUDA 示例，它会全面验证通过 CUDA 以及从容器本身内部进行 GPU 访问的情况：

source: If successful, you should see output that shows similar to the following, noting the <literal>Result = PASS</literal> message at the end of the command, and noting that in the output below, the system correctly identifies two GPUs, whereas your environment may only have one:
es: Si todo va bien, debería ver un resultado similar al siguiente. Fíjese en el mensaje <literal>Result = PASS</literal> al final del comando y en que, en el resultado, el sistema identifica correctamente dos GPU, mientras que es posible que su entorno solo tenga una:
ja: 成功すると、次のような出力が表示されます。コマンドの最後にある「<literal>Result = PASS</literal>」というメッセージに注意してください。また、次の出力では2つのGPUが正しく識別されていますが、ご使用の環境では1つしかない場合があることにも注意してください。
pt_br: Se tudo correr bem, você verá uma saída como esta mostrada a seguir, com destaque para a mensagem <literal>Result = PASS</literal> no fim do comando e para a identificação correta das duas GPUs feita pelo sistema, considerando que seu ambiente pode ter apenas uma:
zh_cn: 如果成功，您应会看到如下所示的输出，请注意命令结束后返回的 <literal>Result = PASS</literal> 消息，并注意在以下输出中，系统正确识别了两个 GPU，而您的环境中可能只有一个 GPU：

source: From here, you can continue to run any other CUDA workload — use compilers and any other aspect of the CUDA ecosystem to run further tests. When done, you can exit from the container, noting that whatever you have installed in there is ephemeral (so will be lost!), and has not impacted the underlying operating system:
es: Desde aquí, puede continuar ejecutando cualquier otra carga de trabajo CUDA. Utilice compiladores y cualquier otro aspecto del ecosistema CUDA para realizar más pruebas. Cuando haya terminado, puede salir del contenedor, pero tenga en cuenta que todo lo que haya instalado en él es efímero (por lo que se perderá) y no ha afectado al sistema operativo subyacente:
ja: ここから、続いて他のCUDAワークロードを実行できます。コンパイラやCUDAエコシステムの他の側面を使用して、さらにテストを実行できます。完了したら、コンテナを終了できます。コンテナにインストールしたものはすべて一時的なものであるため(したがって失われるため)、基盤となるオペレーティングシステムには影響がないことに注意してください。
pt_br: A partir deste ponto, você pode continuar executando qualquer outra carga de trabalho CUDA. Use os compiladores e qualquer outro elemento do ecossistema CUDA para realizar mais testes. Ao concluir, saia do contêiner, lembrando que tudo o que você instalou nele é efêmero (será perdido!) e não afeta o sistema operacional subjacente:
zh_cn: 在此处，您可以继续运行任何其他 CUDA 工作负载 — 使用编译器以及 CUDA 生态系统的任何其他组件来运行进一步的测试。完成后，可以退出容器，请注意您在容器中安装的任何内容都是临时性的（因此会丢失！），并且底层操作系统不会受到影响：

source: Implementation with Kubernetes
es: Implementación con Kubernetes
ja: Kubernetesを使用した実装
pt_br: Implementação com o Kubernetes
zh_cn: 使用 Kubernetes 实现

source: Now that we have proven the installation and use of the NVIDIA open-driver on SUSE Linux Micro, let us explore configuring Kubernetes on the same machine. This guide does not walk you through deploying Kubernetes, but it assumes that you have installed <link xl:href="https://k3s.io/">K3s</link> or <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> and that your kubeconfig is configured accordingly, so that standard <literal>kubectl</literal> commands can be executed as the superuser. We assume that your node forms a single-node cluster, although the core steps should be similar for multi-node clusters. First, ensure that your <literal>kubectl</literal> access is working:
es: Ahora que hemos probado la instalación y el uso del controlador de código abierto de NVIDIA en SUSE Linux Micro, veamos cómo configurar Kubernetes en el mismo equipo. Esta guía no le guiará a través del despliegue de Kubernetes, pero se entiende que ha instalado <link xl:href="https://k3s.io/">K3s</link> o <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> y que su kubeconfig se ha configurado en consecuencia, de modo que puede ejecutar como superusuario los comandos estándares de <literal>kubectl</literal>. Se sobrentiende que su nodo forma un clúster de un solo nodo, aunque los pasos básicos deberían ser similares para clústeres de varios nodos. En primer lugar, asegúrese de que su acceso a <literal>kubectl</literal> funciona:
ja: open版NVIDIAドライバをSUSE Linux Microにインストールして使用できることが証明されたので、同じマシンにKubernetesを設定してみましょう。このガイドでは、Kubernetesのデプロイについては説明しませんが、<link xl:href="https://k3s.io/">K3s</link>または<link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>をインストール済みで、kubeconfigが適宜設定されており、標準の<literal>kubectl</literal>コマンドをスーパーユーザとして実行できることを前提としています。ここではノードがシングルノードクラスタを形成していることを想定していますが、中心となる手順はマルチノードクラスタでも同様です。まず、<literal>kubectl</literal>のアクセスが機能していることを確認します。
pt_br: Agora que comprovamos a instalação e o uso do driver de código aberto da NVIDIA no SUSE Linux Micro, vamos explorar a configuração do Kubernetes na mesma máquina. Este guia não orienta na implantação do Kubernetes, mas ele considera que você já tenha o <link xl:href="https://k3s.io/">K3s</link> ou o <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link> instalado e que o kubeconfig esteja devidamente configurado, de modo que os comandos <literal>kubectl</literal> padrão possam ser executados como superusuário. Supomos que o seu nó forme um cluster de nó único, embora as etapas principais sejam similares nos clusters de vários nós. Primeiramente, garanta que o acesso ao <literal>kubectl</literal> esteja funcionando:
zh_cn: 确认已在 SUSE Linux Micro 上安装并使用 NVIDIA 开放驱动程序后，我们来了解如何在同一台计算机上配置 Kubernetes。本指南不会指导您部署 Kubernetes，但假设您已安装 <link xl:href="https://k3s.io/">K3s</link> 或 <link xl:href="https://docs.rke2.io/install/quickstart">RKE2</link>，并且已相应地配置 kubeconfig，以便能够以超级用户的身份执行标准 <literal>kubectl</literal> 命令。假设您的节点构成了单节点群集，不过，对多节点群集可以使用类似的核心步骤。首先，请确保可以正常进行 <literal>kubectl</literal> 访问：

source: What you should find is that your k3s/rke2 installation has detected the NVIDIA Container Toolkit on the host and auto-configured the NVIDIA runtime integration into <literal>containerd</literal> (the Container Runtime Interface that k3s/rke2 use). Confirm this by checking the containerd <literal>config.toml</literal> file:
es: Debería ver que su instalación de k3s/rke2 ha detectado NVIDIA Container Toolkit en el host y ha configurado automáticamente la integración del entorno de ejecución de NVIDIA en <literal>containerd</literal> (la interfaz de entorno de ejecución de contenedores que utiliza k3s/rke2). Confírmelo comprobando el archivo <literal>config.toml</literal> de containerd:
ja: k3s/rke2のインストールによってホスト上のNVIDIA Container Toolkitが検出され、NVIDIAランタイム統合が<literal>containerd</literal> (k3s/rke2が使用するContainer Runtime Interface)に自動設定されていることを確認する必要があります。確認するには、containerdの<literal>config.toml</literal>ファイルをチェックします。
pt_br: Você deve descobrir que a instalação do k3s/rke2 detectou o NVIDIA Container Toolkit no host e configurou automaticamente a integração do runtime NVIDIA ao <literal>containerd</literal> (a interface de tempo de execução do contêiner que o k3s/rke2 usa). Para confirmar isso, verifique o arquivo <literal>config.toml</literal> de containerd:
zh_cn: 您会发现，k3s/rke2 安装已检测到主机上的 NVIDIA Container Toolkit，并已将 NVIDIA 运行时集成自动配置到 <literal>containerd</literal>（k3s/rke2 使用的容器运行时接口）中。这一点可以通过检查 containerd <literal>config.toml</literal> 文件来确认：

source: This must show something akin to the following. The equivalent K3s location is <literal>/var/lib/rancher/k3s/agent/etc/containerd/config.toml</literal>:
es: El resultado debe ser similar a lo siguiente. La ubicación equivalente de K3s es <literal>/var/lib/rancher/k3s/agent/etc/containerd/config.toml</literal>:
ja: 次のような画面が表示される必要があります。K3sの場合に相当する場所は<literal>/var/lib/rancher/k3s/agent/etc/containerd/config.toml</literal>です。
pt_br: Isso deve retornar algo semelhante ao que está mostrado a seguir. O local equivalente do K3s é <literal>/var/lib/rancher/k3s/agent/etc/containerd/config.toml</literal>:
zh_cn: 此命令必须显示如下所示的内容。对应的 K3s 位置是 <literal>/var/lib/rancher/k3s/agent/etc/containerd/config.toml</literal>：
