Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: This section explains how to generate updated SUSE Linux Micro images to be used with Edge Image Builder, with Cluster API (CAPI) + Metal<superscript>3</superscript>, or to write the disk image directly to a block device. This process is useful in situations where the latest patches are required to be included in the initial system boot images (to minimise patch transfer post-installation), or for scenarios where CAPI is used, where it’s preferred to reinstall the operating system with a new image rather than upgrading the hosts in place.
es: En esta sección se explica cómo generar imágenes actualizadas de SUSE Linux Micro para utilizarlas con Edge Image Builder, con Cluster API (CAPI) + Metal<superscript>3</superscript>, o para escribir la imagen de disco directamente en un dispositivo de bloques. Este proceso resulta útil en situaciones en las que es necesario incluir los parches más recientes en las imágenes de arranque iniciales del sistema inicial (para minimizar la transferencia de parches tras la instalación), o para situaciones en las que se usa CAPI, donde se prefiere reinstalar el sistema operativo con una imagen nueva en lugar de actualizar los hosts in situ.
ja: このセクションでは、SUSE Linux Microの更新イメージを生成して、Edge Image BuilderまたはCluster API (CAPI) + Metal<superscript>3</superscript>で使用するか、あるいはディスクイメージをブロックデバイスに直接書き込む方法について説明します。このプロセスは、初期のシステムブートイメージに最新のパッチを含める必要がある状況や(インストール後のパッチ転送を最小化するため)、CAPIを使用するシナリオにおいて、ホストをインプレースでアップグレードするのではなく、新しいイメージを使用してオペレーティングシステムを再インストールする場合に役立ちます。
pt_br: Esta seção explica como gerar imagens atualizadas do SUSE Linux Micro para usar com o Edge Image Builder, usando Cluster API (CAPI) + Metal<superscript>3</superscript>, ou como gravar a imagem do disco diretamente em um dispositivo em blocos. Esse processo é útil quando há necessidade de incluir os patches mais recentes nas imagens de inicialização do sistema inicial (para minimizar a transferência de patches após a instalação) ou quando a CAPI é usada, em que é preferível reinstalar o sistema operacional com uma nova imagem em vez de fazer upgrade dos hosts no local.
zh_cn: 本章将说明如何生成更新的 SUSE Linux Micro 映像，这些映像可用于 Edge Image Builder、Cluster API (CAPI) + Metal<superscript>3</superscript>，或直接将磁盘映像写入块设备。此流程适用于需要在初始系统引导映像中包含最新补丁（以减少安装后的补丁传输量）的场景，或使用 CAPI 的场景，在该场景中，更适合使用新映像重新安装操作系统，而非就地升级主机。

source: This process makes use of <link xl:href="https://osinside.github.io/kiwi/">Kiwi</link> to run the image build. SUSE Edge ships with a containerized version that simplifies the overall process with a helper utility baked in, allowing to specify the target <emphasis role="strong">profile</emphasis> required. The profile defines the type of output image that is required, with the common ones listed below:
es: Este proceso hace uso de <link xl:href="https://osinside.github.io/kiwi/">Kiwi</link> para crear la imagen. SUSE Edge incluye una versión en contenedor que simplifica todo el proceso con una utilidad de ayuda integrada que permite especificar el <emphasis role="strong">perfil</emphasis> de destino necesario. El perfil define el tipo de imagen de destino que se requiere. A continuación se muestran los tipos más comunes:
ja: このプロセスでは、<link xl:href="https://osinside.github.io/kiwi/">Kiwi</link>を利用してイメージの構築を実行します。SUSE Edgeには、組み込みのヘルパーユーティリティによって全体的なプロセスが簡素化されるコンテナ化バージョンが付属しており、必要なターゲット<emphasis role="strong">プロファイル</emphasis>を指定できます。このプロファイルで、必要な出力イメージのタイプを定義します。以下に一般的なものを示します。
pt_br: Esse processo usa o <link xl:href="https://osinside.github.io/kiwi/">Kiwi</link> para a criação da imagem. O SUSE Edge vem com uma versão conteinerizada que simplifica o processo geral com um utilitário auxiliar integrado, o que permite especificar o <emphasis role="strong">perfil</emphasis> de destino obrigatório. O perfil define o tipo de imagem de saída necessário, sendo os mais comuns relacionados a seguir:
zh_cn: 该流程借助 <link xl:href="https://osinside.github.io/kiwi/">Kiwi</link> 来执行映像构建。SUSE Edge 随附容器化版本，其中内置了实用辅助工具，可简化整体流程，并支持指定所需的目标<emphasis role="strong">配置文件</emphasis>。配置文件定义了所需输出映像的类型，常见类型如下：

source: "<emphasis role="strong">Base</emphasis>" - A SUSE Linux Micro disk image with a reduced package set (it includes podman).
es: "<emphasis role="strong">Base</emphasis>": una imagen de disco de SUSE Linux Micro con un conjunto de paquetes reducido (incluye Podman).
ja: 「<emphasis role="strong">Base</emphasis>」 - 縮小版のパッケージセットが含まれるSUSE Linux Microディスクイメージ(podmanを含む)。
pt_br: "<emphasis role="strong">Base</emphasis>": uma imagem de disco do SUSE Linux Micro com um conjunto de pacotes reduzido (inclui o podman).
zh_cn: “<emphasis role="strong">Base</emphasis>”- SUSE Linux Micro 磁盘映像，包含精简的软件包集合（含 podman）。

source: "<emphasis role="strong">Base-SelfInstall</emphasis>" - A SelfInstall image based on the "Base" above.
es: "<emphasis role="strong">Base-SelfInstall</emphasis>": una imagen de autoinstalación basada en la imagen "Base" anterior.
ja: 「<emphasis role="strong">Base-SelfInstall</emphasis>」 - 上の「Base」に基づくセルフインストールイメージ。
pt_br: "<emphasis role="strong">Base-SelfInstall</emphasis>": uma imagem SelfInstall conforme a imagem "Base" acima.
zh_cn: “<emphasis role="strong">Base-SelfInstall</emphasis>”- 基于上述“Base”的自安装映像。

source: "<emphasis role="strong">Base-RT</emphasis>" - Same as "Base" above but using a real-time (rt) kernel instead.
es: "<emphasis role="strong">Base-RT</emphasis>": igual que "Base", pero usa un kernel en tiempo real (rt).
ja: 「<emphasis role="strong">Base-RT</emphasis>」 - 上の「Base」と同じですが、代わりにリアルタイム(rt)カーネルを使用します。
pt_br: "<emphasis role="strong">Base-RT</emphasis>": igual à imagem "Base" acima, mas usa o kernel em tempo real (rt) no lugar.
zh_cn: “<emphasis role="strong">Base-RT</emphasis>”- 与上述“Base”相同，但使用实时 (rt) 内核。

source: "<emphasis role="strong">Base-RT-SelfInstall</emphasis>" - A SelfInstall image based on the "Base-RT" above
es: "<emphasis role="strong">Base-RT-SelfInstall</emphasis>": una imagen de autoinstalación basada en la imagen "Base-RT" anterior.
ja: 「<emphasis role="strong">Base-RT-SelfInstall</emphasis>」 - 上の「Base-RT」に基づくセルフインストールイメージ。
pt_br: "<emphasis role="strong">Base-RT-SelfInstall</emphasis>": uma imagem SelfInstall conforme a "Base-RT" acima.
zh_cn: “<emphasis role="strong">Base-RT-SelfInstall</emphasis>”- 基于上述“Base-RT”的自安装映像。

source: "<emphasis role="strong">Default</emphasis>" - A SUSE Linux Micro disk image based on the "Base" above but with a few more tools, including the virtualization stack, Cockpit and salt-minion.
es: "<emphasis role="strong">Default</emphasis>": una imagen de disco de SUSE Linux Micro basada en la imagen "Base" anterior, pero con algunas herramientas más, como la pila de virtualización, Cockpit y salt-minion.
ja: 「<emphasis role="strong">Default</emphasis>」 - 上の「Base」に基づくSUSE Linux Microディスクイメージですが、仮想化スタック、Cockpit、salt-minionなどのツールがいくつか追加されています。
pt_br: "<emphasis role="strong">Default</emphasis>": uma imagem de disco do SUSE Linux Micro conforme a "Base" acima, mas com algumas outras ferramentas, como pilha de virtualização, Cockpit e salt-minion.
zh_cn: “<emphasis role="strong">Default</emphasis>”- 基于上述“Base”的 SUSE Linux Micro 磁盘映像，另外还包含其他工具，如虚拟化堆栈、Cockpit 和 salt-minion。

source: "<emphasis role="strong">Default-SelfInstall</emphasis>" - A SelfInstall image based on the "Default" above
es: "<emphasis role="strong">Default-SelfInstall</emphasis>": una imagen de autoinstalación basada en la imagen "Default" anterior.
ja: 「<emphasis role="strong">Default-SelfInstall</emphasis>」 - 上の「Default」に基づくセルフインストールイメージ。
pt_br: "<emphasis role="strong">Default-SelfInstall</emphasis>": uma imagem SelfInstall conforme a imagem "Default" acima.
zh_cn: “<emphasis role="strong">Default-SelfInstall</emphasis>”- 基于上述“Default”的自安装映像。

source: See <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-images/index.html#alp-images-installer-type">SUSE Linux Micro 6.1</link> documentation for more details.
es: Consulte la documentación de <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-images/index.html#alp-images-installer-type">SUSE Linux Micro 6.1</link> para obtener más detalles.
ja: 詳細については、<link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-images/index.html#alp-images-installer-type">SUSE Linux Micro 6.1</link>のドキュメントを参照してください。
pt_br: Consulte a documentação do <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-images/index.html#alp-images-installer-type">SUSE Linux Micro 6.1</link> para obter mais detalhes.
zh_cn: 有关详细信息，请参见 <link xl:href="https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-images/index.html#alp-images-installer-type">SUSE Linux Micro 6.1</link> 文档。

source: This process works for both AMD64/Intel 64 and AArch64 architectures, although not all image profiles are available for both architectures, e.g. in SUSE Edge 3.4, where SUSE Linux Micro 6.1 is used, a profile with a real-time kernel (i.e. "Base-RT" or "Base-RT-SelfInstall") is not currently available for AArch64.
es: Este proceso funciona tanto para AMD64/Intel 64 como para AArch64, aunque no todos los perfiles de imagen están disponibles para ambas arquitecturas; por ejemplo, en SUSE Edge 3.4, donde se usa SUSE Linux Micro 6.1, no hay disponible un perfil con un kernel en tiempo real ("Base-RT" o "Base-RT-SelfInstall") para AArch64.
ja: このプロセスはAMD64/Intel 64およびAArch64のどちらのアーキテクチャでも動作しますが、両方のアーキテクチャですべてのイメージプロファイルが利用できるわけではありません。たとえば、SUSE Edge 3.4では、SUSE Linux Micro 6.1が使用されており、リアルタイムカーネルが含まれるプロファイル(つまり「Base-RT」または「Base-RT-SelfInstall」)は現在のところAArch64では利用できません。
zh_cn: 此过程适用于 AMD64/Intel 64 和 AArch64 两种体系结构，但并非所有映像配置文件都支持这两种体系结构。例如，在使用 SUSE Linux Micro 6.1 的 SUSE Edge 3.4 中，目前暂不提供适用于 AArch64 体系结构的实时内核配置文件（即“Base-RT”或“Base-RT-SelfInstall”）。

source: It is required to use a build host with the same architecture of the images being built. In other words, to build an AArch64 image, it is required to use an AArch64 build host, and vice-versa for AMD64/Intel 64 - cross-builds are not supported at this time.
es: Es preciso usar un host de creación con la misma arquitectura de las imágenes que se están creando. En otras palabras, para crear una imagen AArch64, hay que utilizar un host de creación AArch64; y lo mismo ocurre para AMD64/Intel 64. Actualmente, no se admiten las creaciones cruzadas.
ja: 構築するイメージと同じアーキテクチャの構築ホストを使用する必要があります。つまり、AArch64のイメージを構築するにはAArch64の構築ホストを使用する必要があり、AMD64/Intel 64の場合も同様です。クロス構築は現在のところサポートされていません。
pt_br: É necessário usar um host de build com a mesma arquitetura das imagens que estão sendo criadas. Em outras palavras, para criar uma imagem AArch64, é necessário usar um host de build AArch64, e vice-versa para AMD64/Intel 64. Não há suporte para builds cruzados no momento.
zh_cn: 构建主机的体系结构必须与待构建映像的体系结构一致。也就是说，要构建 AArch64 体系结构的映像，必须使用 AArch64 体系结构的构建主机；AMD64/Intel 64 体系结构同样如此 - 目前不支持跨体系结构构建。

source: Kiwi image builder requires the following:
es: El creador de imágenes Kiwi requiere lo siguiente:
ja: Kiwi Image Builderには以下が必要です。
pt_br: O construtor de imagens Kiwi requer o seguinte:
zh_cn: Kiwi 映像构建器的要求如下：

source: A SUSE Linux Micro 6.1 host ("build system") with the same architecture of the image being built.
es: Un host ("sistema de creación") SUSE Linux Micro 6.1 con la misma arquitectura que la imagen que se va a crear.
ja: 構築するイメージと同じアーキテクチャのSUSE Linux Micro 6.1ホスト(「構築システム」)。
pt_br: Um host SUSE Linux Micro 6.1 ("sistema de build") com a mesma arquitetura da imagem que está sendo criada.
zh_cn: 一台体系结构与待构建映像体系结构相同的 SUSE Linux Micro 6.1 主机（即“构建系统”）。

source: The build system needs to be already registered via <literal>SUSEConnect</literal> (the registration is used to pull the latest packages from the SUSE repositories)
es: El sistema de creación debe haberse registrado vía <literal>SUSEConnect</literal> (el registro se utiliza para extraer los paquetes más recientes de los repositorios de SUSE).
ja: 構築システムは<literal>SUSEConnect</literal>を介して登録済みである必要があります(この登録を使用してSUSEリポジトリから最新のパッケージをプルします)。
pt_br: O sistema de build já deve ter sido registrado pelo <literal>SUSEConnect</literal> (o registro é usado para obter os pacotes mais recentes dos repositórios SUSE).
zh_cn: 构建系统需已通过 <literal>SUSEConnect</literal> 完成注册（注册是为了从 SUSE 储存库提取最新软件包）。

source: An internet connection that can be used to pull the required packages. If connected via proxy, the build host needs to be pre-configured.
es: Una conexión a Internet que pueda usarse para extraer los paquetes necesarios. Si se conecta a través de proxy y el host de creación debe estar preconfigurado.
ja: 必要なパッケージをプルするために使用できるインターネット接続。プロキシ経由で接続している場合、構築ホストを再設定する必要があります。
pt_br: Uma conexão de Internet para obter os pacotes necessários. Se conectado por proxy, o host de build precisa ser pré-configurado.
zh_cn: 能够连接互联网以提取所需软件包；如果通过代理连接，需预先配置构建主机的代理设置。

source: SELinux needs to be disabled on the build host (as SELinux labelling takes place in the container and it can conflict with the host policy)
es: SELinux debe estar inhabilitado en el host de creación (ya que el etiquetado de SELinux tiene lugar en el contenedor y puede entrar en conflicto con la directiva del host).
ja: 構築ホスト上でSELinuxを無効化する必要があります(コンテナ内でSELinuxのラベル付けが実行され、これがホストのポリシーと競合する可能性があるためです)。
pt_br: É necessário desabilitar o SELinux no host de build (já que ocorre a rotulagem do SELinux no contêiner e isso pode entrar em conflito com a política do host).
zh_cn: 构建主机上需禁用 SELinux（因为 SELinux 标签会在容器内生成，可能与主机策略冲突）。

source: At least 10GB free disk space to accommodate the container image, the build root, and the resulting output image(s)
es: Al menos 10 GB de espacio libre en disco para alojar la imagen de contenedor, la raíz de creación y las imágenes de salida resultantes.
ja: コンテナイメージ、構築ホスト、および作成される出力イメージを格納するための10GB以上の空きディスク容量。
pt_br: Pelo menos 10 GB de espaço livre no disco para acomodar a imagem do contêiner, a raiz do build e uma ou mais imagens de saída resultantes.
zh_cn: 至少需要 10GB 可用磁盘空间，以容纳容器映像、构建根目录及最终生成的输出映像。

source: Getting Started
es: Inicio
ja: はじめに
pt_br: Introdução
zh_cn: 入门指南

source: Due to certain limitations, it is currently required to disable SELinux. Connect to the SUSE Linux Micro 6.1 image build host and ensure SELinux is disabled:
es: Debido a ciertas limitaciones, actualmente es necesario inhabilitar SELinux. Conéctese al host de creación de imágenes de SUSE Linux Micro 6.1 y asegúrese de que SELinux está inhabilitado:
ja: 特定の制限のため、現在はSELinuxを無効化する必要があります。SUSE Linux Micro 6.1イメージ構築ホストに接続し、SELinuxを確実に無効化します。
pt_br: Devido a algumas limitações, é necessário desabilitar o SELinux. Conecte-se ao host de build da imagem do SUSE Linux Micro 6.1 e confirme se o SELinux está desabilitado:
zh_cn: 由于存在某些限制，目前需要禁用 SELinux。请连接到 SUSE Linux Micro 6.1 映像构建主机，并确保 SELinux 已禁用：

source: Create an output directory to be shared with the Kiwi build container to save the resulting images:
es: Cree un directorio de salida que se compartirá con el contenedor de creación de Kiwi para guardar las imágenes resultantes:
ja: 作成されるイメージを保存するためにKiwi構築コンテナと共有する出力ディレクトリを作成します。
pt_br: Crie um diretório de saída para compartilhar com o contêiner de build do Kiwi no qual salvar as imagens resultantes:
zh_cn: 创建一个将与 Kiwi 构建容器共享的输出目录，用于保存生成的映像：

source: Pull the latest Kiwi builder image from the SUSE Registry:
es: Obtenga la imagen más reciente de Kiwi Builder del registro de SUSE:
ja: SUSEレジストリから最新のKiwi Builderイメージをプルします。
pt_br: Extraia a imagem mais recente do construtor Kiwi do SUSE Registry:
zh_cn: 从 SUSE 仓库提取最新的 Kiwi 构建器映像：

source: Building the Default Image
es: Creación de la imagen por defecto
ja: デフォルトイメージの構築
pt_br: Criando a imagem padrão
zh_cn: 构建默认映像

source: This is the default behavior of the Kiwi image container if no arguments are provided during the container image run. The following command runs <literal>podman</literal> with two directories mapped to the container:
es: Este es el comportamiento por defecto del contenedor de imágenes de Kiwi si no se proporcionan argumentos durante la ejecución de la imagen del contenedor. El comando siguiente ejecuta <literal>Podman</literal> con dos directorios asignados al contenedor:
ja: コンテナイメージの実行時に引数が指定されていない場合、これがKiwiイメージコンテナのデフォルトの動作です。以下のコマンドは、次の2つのディレクトリをコンテナにマップした状態で<literal>podman</literal>を実行します。
pt_br: Este é o comportamento padrão do contêiner de imagens do Kiwi quando nenhum argumento é inserido durante a execução da imagem do contêiner. O seguinte comando executa o <literal>podman</literal> com dois diretórios mapeados para o contêiner:
zh_cn: 如果运行容器映像时未提供任何参数，这就是 Kiwi 映像容器的默认行为。以下命令运行 <literal>podman</literal> 时会将两个目录映射到容器：

source: The <literal>/etc/zypp/repos.d</literal> SUSE Linux Micro package repository directory from the underlying host.
es: El directorio del repositorio de paquetes <literal>/etc/zypp/repos.d</literal> de SUSE Linux Micro del host subyacente.
ja: 基になるホストのSUSE Linux Microパッケージリポジトリディレクトリである<literal>/etc/zypp/repos.d</literal>。
pt_br: O diretório do repositório de pacotes <literal>/etc/zypp/repos.d</literal> do SUSE Linux Micro do host subjacente.
zh_cn: 底层主机的 <literal>/etc/zypp/repos.d</literal> SUSE Linux Micro 软件包储存库目录。

source: The output <literal>~/output</literal> directory created above.
es: El directorio de salida <literal>~/output</literal> creado arriba.
ja: 上記で作成される出力の<literal>~/output</literal>ディレクトリ。
pt_br: O diretório de saída <literal>~/output</literal> criado acima.
zh_cn: 上文创建的输出目录 <literal>~/output</literal>。

source: The Kiwi image container requires to run the <literal>build-image</literal> helper script as:
es: El contenedor de imágenes de Kiwi requiere que se ejecute el guion de ayuda <literal>build-image</literal> como:
ja: Kiwiイメージコンテナでは、<literal>build-image</literal>ヘルパースクリプトを次のように実行する必要があります。
pt_br: O contêiner de imagens do Kiwi requer a execução do script auxiliar <literal>build-image</literal> como:
zh_cn: Kiwi 映像容器需要按如下方式运行 <literal>build-image</literal> 辅助脚本：

source: It’s expected that if you’re running this script for the first time that it will <emphasis role="strong">fail</emphasis> shortly after starting with "<emphasis role="strong">ERROR: Early loop device test failed, please retry the container run.</emphasis>", this is a symptom of loop devices being created on the underlying host system that are not immediately visible inside of the container image. Simply re-run the command again and it should proceed without issue.
es: Es de esperar que, si ejecuta este guion por primera vez, <emphasis role="strong">falle</emphasis> poco después de comenzar con el error "<emphasis role="strong">ERROR: Early loop device test failed, please retry the container run.</emphasis>" (La prueba del dispositivo de bucle temprano ha fallado. Vuelva a intentar la ejecución del contenedor). Esto es un síntoma de que se están creando dispositivos de bucle en el sistema host subyacente que no son inmediatamente visibles dentro de la imagen del contenedor. Solo tiene que ejecutar de nuevo el comando y el guion continuará sin más problemas.
ja: このスクリプトを初めて実行すると、開始直後にスクリプトが<emphasis role="strong">失敗</emphasis>し、「<emphasis role="strong">ERROR: Early loop device test failed, please retry the container run. (エラー: ループデバイスの早期テストが失敗しました。もう一度コンテナの実行を試してください。)</emphasis>」というエラーが発生すると予想されます。これは、基になるホストシステム上に作成されるループデバイスがすぐにはコンテナイメージ内に表示されないことを示す症状です。単にコマンドを再実行すれば、問題なく続行されるはずです。
pt_br: Se você está executando o script pela primeira vez, é esperado que ocorra uma <emphasis role="strong">falha</emphasis> nele logo depois de ser iniciado com o erro: "<emphasis role="strong">ERROR: Early loop device test failed, please retry the container run.</emphasis>" (ERRO: Falha no teste do dispositivo no ciclo inicial. Tente executar o contêiner novamente.). Trata-se de um sintoma em que os dispositivos que são criados em loop no sistema host subjacente não ficam imediatamente visíveis dentro da imagem do contêiner. Você apenas precisa executar o comando novamente, e ele deverá prosseguir sem problemas.
zh_cn: 如果您是首次运行此脚本，脚本预计会在启动后不久<emphasis role="strong">失败</emphasis>，并显示“<emphasis role="strong">ERROR: Early loop device test failed, please retry the container run.</emphasis>”，这是由于底层主机系统上创建的循环设备无法立即在容器映像内可见所致。只需重新运行该命令，即可顺利执行。

source: After a few minutes the images can be found in the local output directory:
es: Al cabo de unos minutos, las imágenes se encuentran en el directorio de salida local:
ja: 数分後、ローカルのoutputディレクトリ内にイメージを確認できます。
pt_br: Após alguns minutos, as imagens estarão disponíveis no diretório de saída local:
zh_cn: 几分钟后，即可在本地输出目录中找到映像：

source: Building images with other profiles
es: Creación de imágenes con otros perfiles
ja: 他のプロファイルを使用したイメージの構築
pt_br: Criando imagens com outros perfis
zh_cn: 使用其他配置文件构建映像

source: In order to build different image profiles, the "<emphasis role="strong">-p</emphasis>" command option in the Kiwi container image helper script is used. For example, to build the "<emphasis role="strong">Default-SelfInstall</emphasis>" ISO image:
es: Para crear perfiles de imagen distintos, se utiliza la opción de comando "<emphasis role="strong">-p</emphasis>" en el guion de ayuda de la imagen del contenedor de Kiwi. Por ejemplo, para crear la imagen ISO "<emphasis role="strong">Default-SelfInstall</emphasis>":
ja: 異なるイメージプロファイルを構築するには、Kiwiコンテナイメージのヘルパースクリプトで「<emphasis role="strong">-p</emphasis>」コマンドオプションを使用します。たとえば、「<emphasis role="strong">Default-SelfInstall</emphasis>」のISOイメージを構築するには、次のコマンドを使用します。
pt_br: Para criar perfis de imagens diferentes, é usada a opção de comando "<emphasis role="strong">-p</emphasis>" no script auxiliar da imagem do contêiner do Kiwi. Por exemplo, para criar a imagem ISO "<emphasis role="strong">Default-SelfInstall</emphasis>":
zh_cn: 要构建不同的映像配置文件，需要使用 Kiwi 容器映像辅助脚本中的“<emphasis role="strong">-p</emphasis>”命令选项。例如，要构建“<emphasis role="strong">Default-SelfInstall</emphasis>”ISO 映像，请运行：

source: To avoid data loss, Kiwi will refuse to run if there are images in the <literal>output</literal> directory. It is required to remove the contents of the output directory before proceeding with <literal>rm -f output/*</literal>.
es: Para evitar la pérdida de datos, Kiwi negará a ejecutarse si hay imágenes en el directorio <literal>output</literal>. Es necesario eliminar el contenido del directorio de salida antes de proceder con <literal>rm -f output/*</literal>.
ja: データの消失を防ぐため、Kiwiは、<literal>output</literal>ディレクトリにイメージが存在する場合、実行を拒否します。<literal>rm -f output/*</literal>を使用して続行する前に、outputディレクトリの内容を削除する必要があります。
pt_br: Para evitar perda de dados, o Kiwi recusará a execução se houver imagens no diretório <literal>output</literal>. É necessário remover o conteúdo do diretório de saída antes de prosseguir com o <literal>rm -f output/*</literal>.
zh_cn: 如果 <literal>output</literal> 目录中存在映像，Kiwi 将拒绝运行，以免数据丢失。继续操作前，需要使用 <literal>rm -f output/*</literal> 命令去除输出目录中的内容。

source: Alternatively, to build a SelfInstall ISO image with the RealTime kernel ("<emphasis role="strong">kernel-rt</emphasis>"):
es: Como alternativa, puede crear una imagen ISO de autoinstalación con el kernel en tiempo real ("<emphasis role="strong">kernel-rt</emphasis>"):
ja: または、リアルタイムカーネル(「<emphasis role="strong">kernel-rt</emphasis>」)を使用してSelfInstall ISOイメージを構築するには、次のコマンドを使用します。
pt_br: Uma alternativa é criar a imagem ISO SelfInstall com o kernel RealTime ("<emphasis role="strong">kernel-rt</emphasis>"):
zh_cn: 或者，要构建包含实时内核（“<emphasis role="strong">kernel-rt</emphasis>”）的自安装 ISO 映像，请运行：

source: Building images with large sector sizes
es: Creación de imágenes con sectores de gran tamaño
ja: 大きいセクタサイズを使用したイメージの構築
pt_br: Criando imagens com tamanho de setor grande
zh_cn: 构建大扇区大小的映像
