Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: <emphasis>On a machine with internet access:</emphasis>
es: <emphasis>En un equipo con acceso a Internet:</emphasis>
ja: <emphasis>インターネットにアクセスできるマシンで次の手順を実行します。</emphasis>
pt_br: <emphasis>Em uma máquina com acesso à Internet:</emphasis>
zh_cn: <emphasis>在可以访问互联网的计算机上：</emphasis>

source: Make <literal>edge-save-images.sh</literal> executable:
es: Permita que <literal>edge-save-images.sh</literal> se pueda ejecutar:
ja: <literal>edge-save-images.sh</literal>を実行可能にします。
pt_br: Torne o <literal>edge-save-images.sh</literal> executável:
zh_cn: 将 <literal>edge-save-images.sh</literal> 设为可执行文件：

source: Generate the image archive:
es: Genere el archivo de imagen:
ja: イメージアーカイブを生成します。
pt_br: Gere o arquivo de imagens:
zh_cn: 生成映像归档：

source: This will create a ready to load archive named <literal>edge-images.tar.gz</literal>.
es: Esto creará un archivo listo para cargar llamado <literal>edge-images.tar.gz</literal>.
ja: これにより、<literal>edge-images.tar.gz</literal>という名前のすぐにロードできるアーカイブが作成されます。
pt_br: Esse procedimento cria um arquivo pronto para carregamento chamado <literal>edge-images.tar.gz</literal>.
zh_cn: 这将创建一个名为 <literal>edge-images.tar.gz</literal> 的可加载归档。

source: If the <literal>-i|--images</literal> option is specified, the name of the archive may differ.
es: Si se especifica la opción <literal>-i|--images</literal>, el nombre del archivo puede ser diferente.
ja: <literal>-i|--images</literal>オプションが指定される場合、アーカイブの名前は異なる場合があります。
pt_br: Se a opção <literal>-i|--images</literal> foi especificada, o nome do arquivo pode ser diferente.
zh_cn: 如果指定了 <literal>-i|--images</literal> 选项，归档的名称可能会不同。

source: Copy this archive to your <emphasis role="strong">air-gapped</emphasis> machine:
es: Copie este archivo a su equipo <emphasis role="strong">aislado</emphasis>:
ja: このアーカイブを<emphasis role="strong">エアギャップ</emphasis>マシンにコピーします。
pt_br: Copie esse arquivo para sua máquina <emphasis role="strong">air-gapped</emphasis>:
zh_cn: 将此归档复制到<emphasis role="strong">隔离的</emphasis>计算机：

source: Create the Edge OCI chart images archive
es: Cree el archivo de imágenes del chart OCI de Edge
ja: Edge OCIチャートイメージアーカイブの作成
pt_br: Criar o arquivo de imagens de gráfico OCI do Edge
zh_cn: 创建 Edge OCI chart 映像归档

source: Make <literal>edge-save-oci-artefacts.sh</literal> executable:
es: Permita que <literal>edge-save-oci-artefacts.sh</literal> se pueda ejecutar:
ja: <literal>edge-save-oci-artefacts.sh</literal>を実行可能にします。
pt_br: Torne o <literal>edge-save-oci-artefacts.sh</literal> executável:
zh_cn: 将 <literal>edge-save-oci-artefacts.sh</literal> 设为可执行文件：

source: Generate the OCI chart image archive:
es: Genere el archivo de imagen del chart OCI:
ja: OCIチャートイメージアーカイブを生成します。
pt_br: Gere o arquivo de imagens de gráfico OCI:
zh_cn: 生成 OCI chart 映像归档：

source: This will create an archive named <literal>oci-artefacts.tar.gz</literal>.
es: Esto creará un archivo denominado <literal>oci-artefacts.tar.gz</literal>.
ja: これにより、 <literal>oci-artefacts.tar.gz</literal>という名前のアーカイブが作成されます。
pt_br: Esse procedimento cria um arquivo chamado <literal>oci-artefacts.tar.gz</literal>.
zh_cn: 这将创建一个名为 <literal>oci-artefacts.tar.gz</literal> 的归档。

source: If the <literal>-a|--archive</literal> option is specified, the name of the archive may differ.
es: Si se especifica la opción <literal>-a|--archive</literal>, el nombre del archivo puede ser distinto.
ja: <literal>-a|--archive</literal>オプションが指定される場合、アーカイブの名前は異なる場合があります。
pt_br: Se a opção <literal>-a|--archive</literal> foi especificada, o nome do arquivo pode ser diferente.
zh_cn: 如果指定了 <literal>-a|--archive</literal> 选项，归档的名称可能会不同。

source: Load Edge release images to your air-gapped machine
es: Cargue las imágenes de la versión de Edge en su equipo aislado
ja: Edgeリリースイメージをエアギャップマシンにロード
pt_br: Carregar as imagens da versão do Edge para sua máquina air-gapped
zh_cn: 将 Edge 版本映像加载到隔离的计算机上

source: <emphasis>On your air-gapped machine:</emphasis>
es: <emphasis>En su equipo aislado:</emphasis>
ja: <emphasis>エアギャップマシンで次の手順を実行します。</emphasis>
pt_br: <emphasis>Na máquina air-gapped:</emphasis>
zh_cn: <emphasis>在隔离的计算机上：</emphasis>

source: Log into your private registry (if required):
es: Inicie sesión en su registro privado (si es necesario):
ja: プライベートレジストリにログインします(必要な場合)。
pt_br: Faça login no seu registro particular (se necessário):
zh_cn: 登录到专用仓库（如果需要）：

source: Make <literal>edge-load-images.sh</literal> executable:
es: Permita que <literal>edge-load-images.sh</literal> se pueda ejecutar:
ja: <literal>edge-load-images.sh</literal>を実行可能にします。
pt_br: Torne o <literal>edge-load-images.sh</literal> executável:
zh_cn: 将 <literal>edge-load-images.sh</literal> 设为可执行文件：

source: Execute the script, passing the previously <emphasis role="strong">copied</emphasis> <literal>edge-images.tar.gz</literal> archive:
es: Ejecute el guion pasando el archivo <literal>edge-images.tar.gz</literal> <emphasis role="strong">copiado</emphasis> anteriormente:
ja: 以前に<emphasis role="strong">コピーした</emphasis> <literal>edge-images.tar.gz</literal>アーカイブを渡して、スクリプトを実行します。
pt_br: Execute o script, especificando o arquivo já <emphasis role="strong">copiado</emphasis> <literal>edge-images.tar.gz</literal>:
zh_cn: 执行脚本，传递之前<emphasis role="strong">复制的</emphasis> <literal>edge-images.tar.gz</literal> 归档：

source: This will load all images from the <literal>edge-images.tar.gz</literal>, retag and push them to the registry specified under the <literal>--registry</literal> option.
es: Esto cargará todas las imágenes desde <literal>edge-images.tar.gz</literal>, las volverá a etiquetar y las enviará al registro especificado en la opción <literal>--registry</literal>.
ja: これにより、<literal>edge-images.tar.gz</literal>からすべてのイメージがロードされ、再タグ付けされて、それらを<literal>--registry</literal>オプションで指定されているレジストリにプッシュします。
pt_br: Desse modo, todas as imagens do <literal>edge-images.tar.gz</literal> serão carregadas, remarcadas e enviadas ao registro especificado na opção <literal>--registry</literal>.
zh_cn: 这将从 <literal>edge-images.tar.gz</literal> 加载所有映像，并将它们重新标记并推送到 <literal>--registry</literal> 选项下指定的仓库。

source: Load the Edge OCI chart images to your air-gapped machine
es: Cargue las imágenes del chart OCI de Edge en su equipo aislado
ja: Edge OCIチャートイメージのエアギャップマシンへのロード
pt_br: Carregar as imagens de gráfico OCI do Edge em sua máquina air-gapped
zh_cn: 将 Edge OCI chart 映像加载到隔离的计算机上

source: Make <literal>edge-load-oci-artefacts.sh</literal> executable:
es: Permita que <literal>edge-load-oci-artefacts.sh</literal> se pueda ejecutar:
ja: <literal>edge-load-oci-artefacts.sh</literal>を実行可能にします。
pt_br: Torne o <literal>edge-load-oci-artefacts.sh</literal> executável:
zh_cn: 将 <literal>edge-load-oci-artefacts.sh</literal> 设为可执行文件：

source: Untar the copied <literal>oci-artefacts.tar.gz</literal> archive:
es: Desempaquete el archivo <literal>oci-artefacts.tar.gz</literal> copiado:
ja: コピーした<literal>oci-artefacts.tar.gz</literal>アーカイブをuntarします。
pt_br: Descompacte o arquivo <literal>oci-artefacts.tar.gz</literal> copiado:
zh_cn: 解压缩复制的 <literal>oci-artefacts.tar.gz</literal> 归档：

source: This will produce a directory with the naming template <literal>edge-release-oci-tgz-&lt;date&gt;</literal>
es: Esto generará un directorio con el formato de nombre <literal>edge-release-oci-tgz-&lt;fecha&gt;</literal>.
ja: 命名テンプレート<literal>edge-release-oci-tgz-&lt;date&gt;</literal>を含むディレクトリが生成されます。
pt_br: Isso cria um diretório com o gabarito de nomenclatura <literal>edge-release-oci-tgz-&lt;data&gt;</literal>.
zh_cn: 这会使用命名模板 <literal>edge-release-oci-tgz-&lt;date&gt;</literal> 生成一个目录

source: Pass this directory to the <literal>edge-load-oci-artefacts.sh</literal> script to load the Edge OCI chart images to your private registry:
es: Pase este directorio al guion <literal>edge-load-oci-artefacts.sh</literal> para cargar las imágenes del chart OCI de Edge a su registro privado:
ja: このディレクトリを<literal>edge-load-oci-artefacts.sh</literal>スクリプトに渡し、Edge OCIチャートイメージをプライベートレジストリにロードします。
pt_br: Especifique esse diretório no script <literal>edge-load-oci-artefacts.sh</literal> para carregar as imagens de gráfico OCI do Edge em seu registro particular:
zh_cn: 将此目录传递给 <literal>edge-load-oci-artefacts.sh</literal> 脚本，以将 Edge OCI chart 映像加载到专用仓库中：

source: This script assumes the <literal>helm</literal> CLI has been pre-installed on your environment. For Helm installation instructions, see <link xl:href="https://helm.sh/docs/intro/install/">Installing Helm</link>.
es: Este guion presupone que la interfaz de línea de comandos de <literal>Helm</literal> ya está preinstalada en su entorno. Para obtener instrucciones sobre la instalación de Helm, consulte <link xl:href="https://helm.sh/docs/intro/install/">Installing Helm</link> (Instalación de Helm).
ja: このスクリプトは、<literal>Helm</literal> CLIが環境にプリインストールされていることを想定しています。Helmのインストール手順については、「<link xl:href="https://helm.sh/docs/intro/install/">Installing Helm (Helmのインストール)</link>」を参照してください。
pt_br: Esse script assume que a CLI <literal>helm</literal> foi pré-instalada em seu ambiente. Para obter instruções de instalação do Helm, consulte <link xl:href="https://helm.sh/docs/intro/install/">Installing Helm</link> (Instalando o Helm).
zh_cn: 此脚本假设您的环境中已预装了 <literal>Helm</literal> CLI。有关 Helm 安装说明，请参见<link xl:href="https://helm.sh/docs/intro/install/">安装 Helm</link>。

source: Configure your private registry in your Kubernetes distribution
es: Configure el registro privado en su distribución de Kubernetes
ja: Kubernetesディストリビューションでプライベートレジストリを設定する
pt_br: Configurar o registro particular na distribuição Kubernetes
zh_cn: 在 Kubernetes 发行版中配置专用仓库

source: For RKE2, see <link xl:href="https://docs.rke2.io/install/private_registry">Private Registry Configuration</link>
es: Para RKE2, consulte <link xl:href="https://docs.rke2.io/install/private_registry">Private Registry Configuration</link> (Configuración del registro privado)
ja: RKE2の場合は、「<link xl:href="https://docs.rke2.io/install/private_registry">Private Registry Configuration (プライベートレジストリの設定)</link>」を参照してください。
pt_br: Para RKE2, consulte <link xl:href="https://docs.rke2.io/install/private_registry">Private Registry Configuration</link> (Configuração de registro particular)
zh_cn: 对于 RKE2，请参见 <link xl:href="https://docs.rke2.io/install/private_registry">Private Registry Configuration</link>

source: For K3s, see <link xl:href="https://docs.k3s.io/installation/private-registry">Private Registry Configuration</link>
es: Para K3s, consulte <link xl:href="https://docs.k3s.io/installation/private-registry">Private Registry Configuration</link> (Configuración del registro privado)
ja: K3sの場合は、「<link xl:href="https://docs.k3s.io/installation/private-registry">Private Registry Configuration (プライベートレジストリの設定)</link>」を参照してください。
pt_br: Para K3s, consulte <link xl:href="https://docs.k3s.io/installation/private-registry">Private Registry Configuration</link> (Configuração de registro particular)
zh_cn: 对于 K3s，请参见 <link xl:href="https://docs.k3s.io/installation/private-registry">Private Registry Configuration</link>

source: Upgrade procedure
es: Procedimiento de actualización
ja: アップグレード手順
pt_br: Procedimento de upgrade
zh_cn: 升级过程

source: This section focuses on the following Helm upgrade procedure use-cases:
es: Esta sección se centra en los siguientes casos prácticos del procedimiento de actualización de Helm:
ja: このセクションでは、Helmアップグレード手順の次のユースケースを中心に説明します。
pt_br: Esta seção tem como foco os seguintes casos de uso do procedimento de upgrade do Helm:
zh_cn: 本节重点介绍以下使用场景的 Helm 升级过程：

source: Manually deployed Helm charts cannot be reliably upgraded. We suggest to redeploy the Helm chart using the <xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster"/> method.
es: Los charts de Helm desplegados manualmente no se pueden actualizar de forma fiable. Recomendamos volver a desplegar el chart de Helm utilizando el método <xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster"/>.
ja: 手動でデプロイしたHelmチャートを確実にアップグレードすることはできません。<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster"/>で説明する方法を使用してHelmチャートを再デプロイすることをお勧めします。
pt_br: Não é possível fazer upgrade confiável de gráficos Helm implantados manualmente. Sugerimos reimplantá-los usando o método da <xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster"/>.
zh_cn: 手动部署的 Helm chart 无法可靠升级。我们建议使用<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster"/>中所述的方法重新部署这些 Helm chart。

source: I have a new cluster and would like to deploy and manage an Edge Helm chart
es: Tengo un nuevo clúster y me gustaría desplegar y gestionar un chart de Helm de Edge
ja: 新しいクラスタがあり、Edge Helmチャートをデプロイして管理したい
pt_br: Eu tenho um novo cluster e desejo implantar e gerenciar um gráfico Helm do Edge
zh_cn: 我有一个新群集，想要部署和管理 Edge Helm chart

source: This section covers how to:
es: En esta sección se trata lo siguiente:
ja: このセクションでは、以下の実行方法について説明します。
pt_br: Esta seção aborda o seguinte:
zh_cn: 本节介绍如何：

source: Prepare the fleet resources for your chart
es: Prepare los recursos de Fleet para su chart
ja: チャートのFleetリソースの準備
pt_br: Preparar os recursos do Fleet para seu gráfico
zh_cn: 为您的 chart 准备 Fleet 资源

source: Acquire the chart’s Fleet resources from the Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag that you wish to use.
es: Adquiera los recursos de Fleet del chart desde la etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de Edge que desee usar.
ja: チャートのFleetリソースを、使用するEdge<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグから取得します。
pt_br: Adquira os recursos do Fleet do gráfico com base na tag da <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> do Edge que deseja usar.
zh_cn: 从您要使用的 Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记处获取 Chart 的 Fleet 资源。

source: Navigate to the Helm chart fleet (<literal>fleets/day2/chart-templates/&lt;chart&gt;</literal>)
es: Diríjase a la flota del chart de Helm (<literal>fleets/day2/chart-templates/&lt;chart&gt;</literal>).
ja: HelmチャートのFleet (<literal>fleets/day2/chart-templates/&lt;chart&gt;</literal>)に移動します。
pt_br: Navegue até a instância do Fleet do gráfico Helm (<literal>fleets/day2/chart-templates/&lt;gráfico&gt;</literal>).
zh_cn: 导航到 Helm chart Fleet (<literal>fleets/day2/chart-templates/&lt;chart&gt;</literal>)

source: <emphasis role="strong">If you intend to use a GitOps workflow</emphasis>, copy the chart Fleet directory to the Git repository from where you will do GitOps.
es: <emphasis role="strong">Si tiene intención de utilizar un flujo de trabajo de GitOps</emphasis>, copie el directorio Fleet del chart en el repositorio Git desde donde realizará la operación de GitOps.
ja: <emphasis role="strong">GitOpsワークフローを使用する場合は</emphasis>、チャートFleetディレクトリをGitOpsを実行するGitリポジトリにコピーします。
pt_br: <emphasis role="strong">Se você pretende usar um fluxo de trabalho do GitOps</emphasis>, copie o diretório do Fleet do gráfico para o repositório Git do qual você vai executar o GitOps.
zh_cn: <emphasis role="strong">如果您打算使用 GitOps 工作流程</emphasis>，请将 chart Fleet 目录复制到 Git 储存库，从那里执行 GitOps。

source: <emphasis role="strong">Optionally</emphasis>, if the Helm chart requires configurations to its <emphasis role="strong">values</emphasis>, edit the <literal>.helm.values</literal> configuration inside the <literal>fleet.yaml</literal> file of the copied directory.
es: <emphasis role="strong">Opcionalmente</emphasis>, si el chart de Helm requiere que se configuren sus <emphasis role="strong">valores</emphasis>, edite la configuración de <literal>.helm.values</literal> dentro del archivo <literal>fleet.yaml</literal> del directorio copiado.
ja: <emphasis role="strong">(任意)</emphasis> Helmチャートで<emphasis role="strong">値</emphasis>を設定する必要がある場合は、コピーしたディレクトリの<literal>fleet.yaml</literal>ファイルに含まれる設定<literal>.helm.values</literal>を編集します。
pt_br: <emphasis role="strong">Opcionalmente</emphasis>, se o gráfico Helm exigir configurações em seus <emphasis role="strong">valores</emphasis>, edite a configuração <literal>.helm.values</literal> no arquivo <literal>fleet.yaml</literal> do diretório copiado.
zh_cn: <emphasis role="strong">（可选）</emphasis>如果需要配置 Helm chart 的<emphasis role="strong">值</emphasis>才能使用 Helm chart，请编辑复制的目录中 <literal>fleet.yaml</literal> 文件内的 <literal>.helm.values</literal> 配置。

source: <emphasis role="strong">Optionally</emphasis>, there may be use-cases where you need to add additional resources to your chart’s fleet so that it can better fit your environment. For information on how to enhance your Fleet directory, see <link xl:href="https://fleet.rancher.io/gitrepo-content">Git Repository Contents</link>.
es: <emphasis role="strong">Opcionalmente</emphasis>, puede haber casos en los que sea necesario añadir recursos adicionales a la flota de su chart para que se adapte mejor a su entorno. Para obtener información sobre cómo mejorar su directorio de Fleet, consulte <link xl:href="https://fleet.rancher.io/gitrepo-content">Git Repository Contents</link> (Contenido del repositorio Git).
ja: <emphasis role="strong">(任意)</emphasis> 環境に合わせて、チャートのFleetにリソースを追加しなければならないユースケースがあります。Fleetディレクトリを拡張する方法については、「<link xl:href="https://fleet.rancher.io/gitrepo-content">Git Repository Contents (Gitリポジトリのコンテンツ)</link>」を参照してください。
pt_br: <emphasis role="strong">Opcionalmente</emphasis>, pode haver casos de uso em que você tenha que adicionar outros recursos à instância do Fleet do seu gráfico para que se adapte melhor ao seu ambiente. Para obter informações de como aprimorar o diretório do Fleet, consulte <link xl:href="https://fleet.rancher.io/gitrepo-content">Git Repository Contents</link> (Conteúdo do repositório Git).
zh_cn: <emphasis role="strong">（可选）</emphasis>在某些使用场景中，您可能需要向 chart 的 Fleet 目录添加其他资源，使该目录能够更好地适应您的环境。有关如何增强 Fleet 目录的信息，请参见 <link xl:href="https://fleet.rancher.io/gitrepo-content">Git 储存库内容</link>。

source: In some cases, the default timeout Fleet uses for Helm operations may be insufficient, resulting in the following error:
es: En algunos casos, el tiempo de espera predeterminado que Fleet usa para las operaciones de Helm puede ser insuficiente, lo que da lugar al siguiente error:
ja: 場合によっては、Fleet がHelm操作に使用するデフォルトのタイムアウトが不十分で、次のエラーが発生する可能性があります。
pt_br: Em alguns casos, o tempo limite padrão que o Fleet usa nas operações do Helm pode ser insuficiente e resultar no seguinte erro:
zh_cn: 在某些情况下，Fleet 为 Helm 操作设置的默认超时时长可能不足，导致发生以下错误：

source: In such cases, add the <link xl:href="https://fleet.rancher.io/ref-crds#helmoptions">timeoutSeconds</link> property under the <literal>helm</literal> configuration of your <literal>fleet.yaml</literal> file.
es: Si fuera el caso, añada la propiedad <link xl:href="https://fleet.rancher.io/ref-crds#helmoptions">timeoutSeconds</link> en la configuración de <literal>helm</literal> de su archivo <literal>fleet.yaml</literal>.
ja: このような場合は、<literal>fleet.yaml</literal>ファイルの<literal>helm</literal>設定の下に、<link xl:href="https://fleet.rancher.io/ref-crds#helmoptions">timeoutSeconds</link>プロパティを追加してください。
pt_br: Nesses casos, adicione a propriedade <link xl:href="https://fleet.rancher.io/ref-crds#helmoptions">timeoutSeconds</link> à configuração <literal>helm</literal> do arquivo <literal>fleet.yaml</literal>.
zh_cn: 在此类情况下，请在 <literal>fleet.yaml</literal> 文件的 <literal>helm</literal> 配置下添加 <link xl:href="https://fleet.rancher.io/ref-crds#helmoptions">timeoutSeconds</link> 属性。

source: An <emphasis role="strong">example</emphasis> for the <literal>longhorn</literal> helm chart would look like:
es: Esto es un <emphasis role="strong">ejemplo</emphasis> del aspecto que tendría el chart de Helm de <literal>longhorn</literal>:
ja: <literal>longhorn</literal> Helmチャートの<emphasis role="strong">例</emphasis>は次のようになります。
pt_br: Esta é a aparência de um <emphasis role="strong">exemplo</emphasis> de gráfico Helm do <literal>longhorn</literal>:
zh_cn: <literal>longhorn</literal> Helm chart 的<emphasis role="strong">示例</emphasis>如下：

source: User Git repository structure:
es: Estructura del repositorio Git del usuario:
ja: ユーザGitリポジトリ構造:
pt_br: Estrutura de repositórios Git do usuário:
zh_cn: 用户 Git 储存库结构：

source: <literal>fleet.yaml</literal> content populated with user <literal>Longhorn</literal> data:
es: Contenido de <literal>fleet.yaml</literal> con datos de <literal>Longhorn</literal> del usuario:
ja: ユーザの<literal>Longhorn</literal>データが入力された<literal>fleet.yaml</literal>の内容:
pt_br: Conteúdo do <literal>fleet.yaml</literal> preenchido com os dados do <literal>Longhorn</literal> do usuário:
zh_cn: 填充了用户 <literal>Longhorn</literal> 数据的 <literal>fleet.yaml</literal> 内容：

source: These are just example values that are used to illustrate custom configurations over the <literal>longhorn</literal> chart. They should <emphasis role="strong">NOT</emphasis> be treated as deployment guidelines for the <literal>longhorn</literal> chart.
es: Estos son solo valores de ejemplo que se utilizan para mostrar configuraciones personalizadas en el chart de <literal>longhorn</literal>. <emphasis role="strong">NO</emphasis> deben considerarse directrices de despliegue para el chart de <literal>longhorn</literal>.
ja: これらは値の例であり、<literal>longhorn</literal>チャートのカスタム設定を示すために使用しているだけです。<literal>longhorn</literal>チャートのデプロイメントのガイドラインと<emphasis role="strong">みなさない</emphasis>でください。
pt_br: Estes são apenas valores de exemplo usados para ilustrar as configurações comuns no gráfico do <literal>longhorn</literal>. Eles <emphasis role="strong">NÃO</emphasis> devem ser considerados diretrizes de implantação para o gráfico do <literal>longhorn</literal>.
zh_cn: 上面只是一些示例值，用于演示基于 <literal>longhorn</literal> chart 创建的自定义配置。<emphasis role="strong">不应</emphasis>将它们视为 <literal>longhorn</literal> chart 的部署指南。

source: Deploy the fleet for your chart
es: Despliegue la flota en su chart
ja: チャートのFleetのデプロイ
pt_br: Implantar o Fleet para seu gráfico
zh_cn: 部署您的 chart 的 Fleet

source: You can deploy the fleet for your chart by either using a GitRepo (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>) or Bundle (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>).
es: Puede desplegar la flota de su chart usando GitRepo (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>) o Bundle (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>).
ja: チャートのFleetをデプロイするには、GitRepo (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>)またはバンドル(<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>)のいずれかを使用できます。
pt_br: É possível implantar o Fleet para seu gráfico usando o GitRepo (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>) ou o bundle (<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>).
zh_cn: 您可以使用 GitRepo（<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-gitrepo"/>）或捆绑包（<xref linkend="management-day2-fleet-helm-upgrade-procedure-new-cluster-deploy-bundle"/>）来部署 chart 的 Fleet。
