Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The <link xl:href="https://github.com/suse-edge/upgrade-controller">Upgrade Controller</link> streamlines the upgrade process for the components mentioned above by encapsulating their complexities within a single <literal>user-facing</literal> resource that serves as a <emphasis role="strong">trigger</emphasis> for the upgrade. Users only need to configure this resource and the <literal>Upgrade Controller</literal> takes care of the rest.
es: <link xl:href="https://github.com/suse-edge/upgrade-controller">Upgrade Controller</link> optimiza el proceso de actualización de esto componentes encapsulando sus complejidades en un único recurso <literal>orientado al usuario</literal> que sirve como <emphasis role="strong">activador</emphasis> de la actualización. Los usuarios solo tienen que configurar este recurso y <literal>Upgrade Controller</literal> se encarga del resto.
ja: <link xl:href="https://github.com/suse-edge/upgrade-controller">Upgrade Controller</link>は、アップグレードの<emphasis role="strong">トリガ</emphasis>として機能する単一の<literal>ユーザ向け</literal>リソース内に上記コンポーネントの複雑さをカプセル化することで、アップグレードプロセスを効率化します。ユーザはこのリソースを設定する必要があるのみで、<literal>Upgrade Controller</literal>が残りの作業を行います。
pt_br: O <link xl:href="https://github.com/suse-edge/upgrade-controller">Controller de upgrade</link> otimiza o processo de upgrade dos componentes mencionados acima, pois encapsula suas complexidades em um único recurso <literal>voltado para o usuário</literal> que funciona como um <emphasis role="strong">acionador</emphasis> de upgrade. Os usuários precisam apenas configurar esse recurso, e o <literal>Controller de upgrade</literal> cuida do restante.
zh_cn: <link xl:href="https://github.com/suse-edge/upgrade-controller">升级控制器</link>通过将上述组件的复杂性封装在一个<literal>面向用户</literal>的资源（该资源可作为升级<emphasis role="strong">触发器</emphasis>）中，来简化这些组件的升级过程。用户只需配置此资源，其余工作均由<literal>升级控制器</literal>处理。

source: The <literal>Upgrade Controller</literal> currently supports SUSE Edge platform upgrades only for <emphasis role="strong">non air-gapped management</emphasis> clusters. Refer to the <xref linkend="components-upgrade-controller-known-issues"/> section for more information.
es: <literal>Upgrade Controller</literal> actualmente solo admite actualizaciones de la plataforma SUSE Edge para clústeres <emphasis role="strong">de gestión que no estén en entornos aislados</emphasis>. Consulte la <xref linkend="components-upgrade-controller-known-issues"/> para obtener más información.
ja: <literal>Upgrade Controller</literal>は現在、<emphasis role="strong">非エアギャップ管理</emphasis>クラスタに対してのみSUSE Edgeプラットフォームのアップグレードをサポートしています。詳細については、<xref linkend="components-upgrade-controller-known-issues"/>セクションを参照してください。
pt_br: Atualmente, o <literal>Controller de upgrade</literal> oferece suporte a upgrades da plataforma SUSE Edge apenas para clusters de <emphasis role="strong">gerenciamento não air-gapped</emphasis>. Consulte a <xref linkend="components-upgrade-controller-known-issues"/> para obter mais informações.
zh_cn: 目前，<literal>升级控制器</literal>仅支持为<emphasis role="strong">非隔离管理</emphasis>群集进行 SUSE Edge 平台升级。有关详细信息，请参见<xref linkend="components-upgrade-controller-known-issues"/>。

source: How does SUSE Edge use Upgrade Controller?
es: ¿Cómo se usa Upgrade Controller en SUSE Edge?
ja: SUSE EdgeでのUpgrade Controllerの用途
pt_br: Como o SUSE Edge usa o Controller de upgrade?
zh_cn: SUSE Edge 如何使用升级控制器？

source: The <emphasis role="strong">Upgrade Controller</emphasis> is essential in automating the (formerly manual) "Day 2" operations required to upgrade management clusters from one SUSE Edge release version to the next.
es: <emphasis role="strong">Upgrade Controller</emphasis> es esencial para automatizar las operaciones de "día 2" (que antes eran manuales) necesarias para actualizar los clústeres de gestión desde una versión de SUSE Edge a la siguiente.
ja: <emphasis role="strong">Upgrade Controller</emphasis>は、管理クラスタをあるSUSE Edgeリリースバージョンから次のバージョンにアップグレードするために必要な(以前は手動の)「Day 2」操作を自動化するために必要不可欠です。
pt_br: O <emphasis role="strong">Controller de upgrade</emphasis> é essencial para automação das operações de "dia 2" (que antes eram manuais) necessárias para fazer upgrade dos clusters de gerenciamento de uma versão de lançamento do SUSE Edge para a seguinte.
zh_cn: <emphasis role="strong">升级控制器</emphasis>对于将管理群集从一个 SUSE Edge 版本升级到下一个版本时需自动执行（以前是手动执行）的“Day 2”操作至关重要。

source: To achieve this automation, the Upgrade Controller utilizes tools such as the System Upgrade Controller (<xref linkend="components-system-upgrade-controller"/>) and the <link xl:href="https://github.com/k3s-io/helm-controller/">Helm Controller</link>.
es: Para lograr esta automatización, Upgrade Controller usa herramientas como System Upgrade Controller (<xref linkend="components-system-upgrade-controller"/>) y <link xl:href="https://github.com/k3s-io/helm-controller/">Helm Controller</link>.
ja: この自動化のために、Upgrade ControllerはSystem Upgrade Controller (<xref linkend="components-system-upgrade-controller"/>)や<link xl:href="https://github.com/k3s-io/helm-controller/">Helm Controller</link>などのツールを利用します。
pt_br: Para atingir essa automação, o Controller de upgrade usa ferramentas como o System Upgrade Controller (<xref linkend="components-system-upgrade-controller"/>) e o <link xl:href="https://github.com/k3s-io/helm-controller/">Helm Controller</link>.
zh_cn: 为了实现这种自动化，升级控制器使用了系统升级控制器（<xref linkend="components-system-upgrade-controller"/>）和 <link xl:href="https://github.com/k3s-io/helm-controller/">Helm 控制器</link>等工具。

source: For further details on how the Upgrade Controller works, see <xref linkend="components-upgrade-controller-how"/>.
es: Para obtener más detalles sobre cómo funciona Upgrade Controller, consulte la <xref linkend="components-upgrade-controller-how"/>.
ja: Upgrade Controllerの仕組みの詳細については、<xref linkend="components-upgrade-controller-how"/>を参照してください。
pt_br: Para obter mais detalhes de como o Controller de upgrade funciona, consulte a <xref linkend="components-upgrade-controller-how"/>.
zh_cn: 有关升级控制器工作原理的详细信息，请参见<xref linkend="components-upgrade-controller-how"/>。

source: For known limitations that the Upgrade Controller has, see <xref linkend="components-upgrade-controller-known-issues"/>.
es: Para ver las limitaciones de Upgrade Controller, consulte la <xref linkend="components-upgrade-controller-known-issues"/>.
ja: Upgrade Controllerの既知の制限事項については、<xref linkend="components-upgrade-controller-known-issues"/>を参照してください。
pt_br: Para saber as limitações conhecidas do Controller de upgrade, consulte a <xref linkend="components-upgrade-controller-known-issues"/>.
zh_cn: 有关升级控制器的已知限制，请参见<xref linkend="components-upgrade-controller-known-issues"/>。

source: For information on the difference between the Upgrade Controller and the System Upgrade Controller, see <xref linkend="components-upgrade-controller-uc-vs-suc"/>.
es: Para ver las diferencias entre Upgrade Controller y System Upgrade Controller, consulte la <xref linkend="components-upgrade-controller-uc-vs-suc"/>.
ja: Upgrade ControllerとSystem Upgrade Controllerの違いについては、<xref linkend="components-upgrade-controller-uc-vs-suc"/>を参照してください。
pt_br: Para obter informações sobre a diferença entre o Controller de upgrade e o System Upgrade Controller, consulte a <xref linkend="components-upgrade-controller-uc-vs-suc"/>.
zh_cn: 如需了解升级控制器与系统升级控制器的区别，请参见<xref linkend="components-upgrade-controller-uc-vs-suc"/>。

source: Upgrade Controller vs System Upgrade Controller
es: Diferencias entre Upgrade Controller y System Upgrade Controller
ja: Upgrade ControllerとSystem Upgrade Controller
pt_br: Comparação entre Controller de upgrade e System Upgrade Controller
zh_cn: 升级控制器与系统升级控制器

source: The System Upgrade Controller (SUC) (<xref linkend="components-system-upgrade-controller"/>) is a general-purpose tool that propagates upgrade instructions to specific Kubernetes nodes.
es: System Upgrade Controller (SUC) (<xref linkend="components-system-upgrade-controller"/>) es una herramienta de uso general que propaga instrucciones de actualización a nodos específicos de Kubernetes.
ja: System Upgrade Controller (SUC) (<xref linkend="components-system-upgrade-controller"/>)は、アップグレード手順を特定のKubernetesノードに伝播する汎用ツールです。
pt_br: O System Upgrade Controller (SUC) (<xref linkend="components-system-upgrade-controller"/>) é uma ferramenta de uso geral que propaga as instruções de upgrade para os nós específicos do Kubernetes.
zh_cn: 系统升级控制器 (SUC)（<xref linkend="components-system-upgrade-controller"/>）是一款通用工具，负责将升级指令分发到特定的 Kubernetes 节点。

source: While it supports some "Day 2" operations for the SUSE Edge platform, it <emphasis role="strong">does not</emphasis> cover all of them. Moreover, even for supported operations, users have to manually configure, maintain, and deploy multiple <literal>SUC Plans</literal> — an error-prone process that can lead to unexpected issues.
es: Aunque admite algunas operaciones de "día 2" para la plataforma SUSE Edge, <emphasis role="strong">no</emphasis> las cubre todas. Además, incluso en el caso de las operaciones admitidas, los usuarios tienen que configurar, mantener y desplegar manualmente múltiples <literal>planes de SUC</literal>, un proceso propenso a errores que puede dar lugar a problemas inesperados.
ja: System Upgrade ControllerはSUSE Edgeプラットフォームの一部の「Day 2」操作をサポートしていますが、すべてをカバー<emphasis role="strong">しているわけではありません</emphasis>。また、サポートされている操作であっても、ユーザは複数の<literal>SUC Plan</literal>を手動で設定、維持、およびデプロイする必要があります。これはエラーが発生しやすいプロセスであり、予期しない問題が発生する可能性があります。
pt_br: Apesar de oferecer suporte a algumas operações de "dia 2" para a plataforma SUSE Edge, ele <emphasis role="strong">não</emphasis> abrange todas elas. Mesmo para as operações com suporte, os usuários ainda precisam configurar, manter e implantar manualmente vários <literal>planos do SUC</literal>, um processo propenso a erros que pode provocar problemas inesperados.
zh_cn: 虽然它支持 SUSE Edge 平台的部分“Day 2”操作，但<emphasis role="strong">并未</emphasis>涵盖所有此类操作。此外，即便是对于受支持的操作，用户也必须手动配置、维护和部署多个 <literal>SUC 计划</literal>，因为这一过程容易出错，可能导致意外问题。

source: This led to the need for a tool that <emphasis role="strong">automates</emphasis> and <emphasis role="strong">abstracts</emphasis> the complexity of managing various "Day 2" operations for the SUSE Edge platform. Thus, the <literal>Upgrade Controller</literal> was developed. It simplifies the upgrade process by introducing a single <literal>user-facing resource</literal> that drives the upgrade. Users only need to manage this resource, while the <literal>Upgrade Controller</literal> takes care of the rest.
es: Esto llevó a la necesidad de una herramienta que <emphasis role="strong">automatizara</emphasis> y <emphasis role="strong">resumiera</emphasis> la complejidad de gestionar diversas operaciones de "día 2" para la plataforma SUSE Edge. Así, se desarrolló <literal>Upgrade Controller</literal>, que simplifica el proceso de actualización al introducir un único <literal>recurso orientado al usuario</literal> que se encarga de la actualización. Los usuarios solo tienen que gestionar este recurso y <literal>Upgrade Controller</literal> se encarga del resto.
ja: これにより、SUSE Edgeプラットフォームのさまざまな「Day 2」操作の複雑さを<emphasis role="strong">自動化</emphasis>および<emphasis role="strong">抽象化</emphasis>するツールが必要になりました。こうして<literal>Upgrade Controller</literal>が 開発されました。Upgrade Controllerは、アップグレードを推進する単一の<literal>ユーザ向けリソース</literal>を導入することで、アップグレードプロセスをシンプルにします。ユーザはこのリソースを管理する必要があるのみで、 <literal>Upgrade Controller</literal>が残りの作業を行います。
pt_br: Isso levou à necessidade de uma ferramenta para <emphasis role="strong">automatizar</emphasis> e <emphasis role="strong">abstrair</emphasis> a complexidade de gerenciar várias operações de "dia 2" na plataforma SUSE Edge. E, assim, o <literal>Controller de upgrade</literal> foi desenvolvido. Ele simplifica o processo de upgrade com a introdução de um único <literal>recurso voltado para o usuário</literal> que conduz o upgrade. Os usuários precisam gerenciar apenas esse recurso, e o <literal>Controller de upgrade</literal> cuida do restante.
zh_cn: 这就催生了对下面这样的工具的需求：该工具能够<emphasis role="strong">自动化</emphasis>并<emphasis role="strong">抽象化</emphasis> SUSE Edge 平台各类“Day 2”操作管理的复杂性。因此，<literal>升级控制器</literal>应运而生。它通过引入一个<literal>面向用户的单一资源</literal>来驱动升级，从而简化了升级过程。用户只需管理这一资源，其余工作均由<literal>升级控制器</literal>处理。

source: Installing the Upgrade Controller
es: Instalación de Upgrade Controller
ja: Upgrade Controllerのインストール
pt_br: Instalando o Controller de upgrade
zh_cn: 安装升级控制器

source: System Upgrade Controller (<xref linkend="components-system-upgrade-controller-install"/>)
zh_cn: 系统升级控制器（<xref linkend="components-system-upgrade-controller-install"/>）

source: A Kubernetes cluster; either K3s or RKE2
es: Un clúster de Kubernetes; puede ser K3s o RKE2
ja: Kubernetesクラスタ: K3sまたはRKE2のいずれか
pt_br: Um cluster Kubernetes; seja K3s ou RKE2
zh_cn: 一个 Kubernetes 群集，可以是 K3s 或 RKE2

source: Steps
es: Pasos
ja: 手順
pt_br: Etapas
zh_cn: 步骤

source: Install the Upgrade Controller Helm chart on your management cluster:
es: Instale el chart de Helm de Upgrade Controller en el clúster de gestión:
ja: 管理クラスタにUpgrade Controller Helmチャートをインストールします。
pt_br: Instale o gráfico Helm do Controller de upgrade no cluster de gerenciamento:
zh_cn: 在您的管理群集上安装升级控制器 Helm chart：

source: Validate the Upgrade Controller deployment:
es: Compruebe que Upgrade Controller se ha desplegado:
ja: Upgrade Controllerのデプロイメントを検証します。
pt_br: Valide a implantação do Controller de upgrade:
zh_cn: 验证升级控制器部署：

source: Validate the Upgrade Controller pod:
es: Compruebe el pod de Upgrade Controller:
ja: Upgrade Controller Podを検証します。
pt_br: Valide o pod do Controller de upgrade:
zh_cn: 验证升级控制器 Pod：

source: Validate the Upgrade Controller pod logs:
es: Compruebe los registros del pod de Upgrade Controller:
ja: Upgrade Controller Podログを検証します。
pt_br: Valide os registros do pod do Controller de upgrade:
zh_cn: 验证升级控制器 Pod 日志：

source: How does the Upgrade Controller work?
es: ¿Cómo funciona Upgrade Controller?
ja: Upgrade Controllerの仕組み
pt_br: Como funciona o Controller de upgrade?
zh_cn: 升级控制器的工作原理

source: In order to perform an Edge release upgrade, the Upgrade Controller introduces two new Kubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">custom resources</link>:
es: Para actualizar la versión de Edge, Upgrade Controller introduce dos nuevos <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> de Kubernetes:
ja: Edgeリリースのアップグレードを実行するため、Upgrade Controllerでは2つの新しいKubernetes<link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">カスタムリソース</link>が導入されました。
pt_br: Para fazer upgrade de uma versão do Edge, o Controller de upgrade lança dois novos <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">recursos personalizados</link> do Kubernetes:
zh_cn: 为了执行 Edge 版本升级，升级控制器引入了两个新的 Kubernetes <link xl:href="https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/">自定义资源</link>：

source: UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>) - created by the user; holds configurations regarding an Edge release upgrade.
es: UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>): creado por el usuario; contiene configuraciones relacionadas con la actualización de una versión de Edge.
ja: UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>) - ユーザが作成、Edgeリリースアップグレードに関する設定を保持。
pt_br: UpgradePlan (<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>): criado pelo usuário; armazena as configurações referentes ao upgrade de uma versão do Edge.
zh_cn: UpgradePlan（<xref linkend="components-upgrade-controller-extensions-upgrade-plan"/>）- 由用户创建；保存有关 Edge 版本升级的配置。

source: ReleaseManifest (<xref linkend="components-upgrade-controller-extensions-release-manifest"/>) - created by the Upgrade Controller; holds component versions specific to a particular Edge release version. <emphasis role="strong">This file must not be edited by users.</emphasis>
es: ReleaseManifest (<xref linkend="components-upgrade-controller-extensions-release-manifest"/>): creado por Upgrade Controller; contiene las versiones de los componentes específicas de una versión concreta de Edge. <emphasis role="strong">Este archivo no debe ser editado por los usuarios.</emphasis>
ja: ReleaseManifest (<xref linkend="components-upgrade-controller-extensions-release-manifest"/>) - Upgrade Controllerが作成。特定のEdgeリリースバージョンに固有のコンポーネントバージョンを保持する。<emphasis role="strong">このファイルはユーザが編集する必要はありません。</emphasis>
pt_br: ReleaseManifest (<xref linkend="components-upgrade-controller-extensions-release-manifest"/>): criado pelo Controller de upgrade; armazena as versões de componente específicas a uma determinada versão de lançamento do Edge. <emphasis role="strong">Os usuários não devem editar esse arquivo.</emphasis>
zh_cn: ReleaseManifest（<xref linkend="components-upgrade-controller-extensions-release-manifest"/>）- 由升级控制器创建；保存特定的 Edge 版本所对应的组件版本。<emphasis role="strong">用户不得编辑此文件。</emphasis>

source: The Upgrade Controller proceeds to create a <literal>ReleaseManifest</literal> resource that holds the component data for the Edge release version specified by the user under the <literal>releaseVersion</literal> property in the <literal>UpgradePlan</literal> resource.
es: Upgrade Controller crea un recurso <literal>ReleaseManifest</literal> que contiene los datos de los componentes de la versión de Edge especificada por el usuario en la propiedad <literal>releaseVersion</literal> del recurso <literal>UpgradePlan</literal>.
ja: Upgrade Controllerは、 <literal>UpgradePlan</literal>リソースの<literal>releaseVersion</literal>プロパティでユーザによって指定されたEdgeリリースバージョンのコンポーネントデータを保持する<literal>ReleaseManifest</literal>リソースの作成に進みます。
pt_br: O Controller de upgrade cria um recurso <literal>ReleaseManifest</literal> que armazena os dados do componente referentes à versão de lançamento do Edge especificada pelo usuário na propriedade <literal>releaseVersion</literal> do recurso <literal>UpgradePlan</literal>.
zh_cn: 升级控制器还会创建一个 <literal>ReleaseManifest</literal> 资源，该资源保存用户在 <literal>UpgradePlan</literal> 资源的 <literal>releaseVersion</literal> 属性下指定的 Edge 版本的组件数据。

source: Using the component data from the <literal>ReleaseManifest</literal>, the Upgrade Controller proceeds to upgrade the Edge release components in the following order:
es: Con los datos de los componentes de <literal>ReleaseManifest</literal>, Upgrade Controller actualiza los componentes de la versión de Edge en el orden siguiente:
ja: Upgrade Controllerは、<literal>ReleaseManifest</literal>のコンポーネントデータを使用して、次の順序のEdgeリリースコンポーネントのアップグレードに進みます。
pt_br: Usando os dados do componente do <literal>ReleaseManifest</literal>, o Controller de upgrade faz upgrade do componente da versão do Edge na seguinte ordem:
zh_cn: 之后，升级控制器会使用 <literal>ReleaseManifest</literal> 中的组件数据，按以下顺序升级 Edge 版本组件：

source: Operating System (OS) (<xref linkend="components-upgrade-controller-how-os"/>).
es: Sistema operativo (SO) (<xref linkend="components-upgrade-controller-how-os"/>)
ja: オペレーティングシステム(OS) (<xref linkend="components-upgrade-controller-how-os"/>)
pt_br: Sistema operacional (SO) (<xref linkend="components-upgrade-controller-how-os"/>).
zh_cn: 操作系统 (OS)（<xref linkend="components-upgrade-controller-how-os"/>）。

source: Additional components (<xref linkend="components-upgrade-controller-how-additional"/>).
es: Componentes adicionales (<xref linkend="components-upgrade-controller-how-additional"/>)
ja: 追加のコンポーネント(<xref linkend="components-upgrade-controller-how-additional"/>)
pt_br: Componentes adicionais (<xref linkend="components-upgrade-controller-how-additional"/>).
zh_cn: 其他组件（<xref linkend="components-upgrade-controller-how-additional"/>）。

source: During the upgrade process, the Upgrade Controller continually outputs upgrade information to the created <literal>UpgradePlan</literal>. For more information on how to track the upgrade process, see Tracking the upgrade process (<xref linkend="components-upgrade-controller-how-track"/>).
es: Durante el proceso de actualización, Upgrade Controller envía continuamente información sobre la actualización al recurso <literal>UpgradePlan</literal> creado. Para obtener más información sobre cómo realizar un seguimiento del proceso de actualización, consulte la sección correspondiente (<xref linkend="components-upgrade-controller-how-track"/>).
ja: アップグレードプロセス中に、Upgrade Controllerは、作成した<literal>UpgradePlan</literal>にアップグレード情報を絶えず出力します。アップグレードプロセスを追跡する方法の詳細については、 「アップグレードプロセスの追跡」(<xref linkend="components-upgrade-controller-how-track"/>)を参照してください。
pt_br: Durante o processo de upgrade, o Controller de upgrade envia continuamente as informações de upgrade para o <literal>UpgradePlan</literal> criado. Para obter mais informações sobre como acompanhar o processo de upgrade, consulte Acompanhando o processo de upgrade (<xref linkend="components-upgrade-controller-how-track"/>).
zh_cn: 在升级过程中，升级控制器会持续向创建的 <literal>UpgradePlan</literal> 输出升级信息。有关如何跟踪升级过程的详细信息，请参见<xref linkend="components-upgrade-controller-how-track"/>。

source: Operating System upgrade
es: Actualización del sistema operativo
ja: オペレーティングシステムのアップグレード
pt_br: Upgrade do sistema operacional
zh_cn: 操作系统升级

source: To upgrade the operating system, the Upgrade Controller creates SUC (<xref linkend="components-system-upgrade-controller"/>) Plans that have the following naming template:
es: Para actualizar el sistema operativo, Upgrade Controller crea planes de SUC (<xref linkend="components-system-upgrade-controller"/>) que siguen este formato de nombre:
ja: オペレーティングシステムをアップグレードするため、Upgrade Controllerは、次の命名テンプレートを持つSUC (<xref linkend="components-system-upgrade-controller"/>) Planを作成します。
pt_br: Para fazer upgrade do sistema operacional, o Controller de upgrade cria planos do SUC (<xref linkend="components-system-upgrade-controller"/>) com o seguinte gabarito de nomenclatura:
zh_cn: 升级操作系统时，升级控制器会创建命名模板如下的 SUC（<xref linkend="components-system-upgrade-controller"/>）计划：

source: For SUC Plans related to control plane node OS upgrades - <literal>control-plane-&lt;os-name&gt;-&lt;os-version&gt;-&lt;suffix&gt;</literal>.
es: Para los planes de SUC relacionados con actualizaciones del SO del nodo de plano de control: <literal>control-plane-&lt;nombre-so&gt;-&lt;versión-so&gt;-&lt;sufijo&gt;</literal>.
ja: コントロールプレーンノードのOSアップグレードに関連するSUC Planの場合 - <literal>control-plane-&lt;os-name&gt;-&lt;os-version&gt;-&lt;suffix&gt;</literal>
pt_br: Para planos do SUC relacionados a upgrades de sistema operacional de nó do plano de controle: <literal>control-plane-&lt;nome-do-so&gt;-&lt;versão-do-so&gt;-&lt;sufixo&gt;</literal>.
zh_cn: 对于与控制平面节点操作系统升级相关的 SUC 计划 - <literal>control-plane-&lt;os-name&gt;-&lt;os-version&gt;-&lt;suffix&gt;</literal>。

source: For SUC Plans related to worker node OS upgrades - <literal>workers-&lt;os-name&gt;-&lt;os-version&gt;-&lt;suffix&gt;</literal>.
es: Para los planes de SUC relacionados con actualizaciones del SO del nodo de trabajador: <literal>workers-&lt;nombre-so&gt;-&lt;versión-so&gt;-&lt;sufijo&gt;</literal>.
ja: ワーカーノードのOSアップグレードに関連するSUC Planの場合 - <literal>workers-&lt;os-name&gt;-&lt;os-version&gt;-&lt;suffix&gt;</literal>
pt_br: Para planos do SUC relacionados a upgrades de sistema operacional de nó do worker: <literal>workers-&lt;nome-do-so&gt;-&lt;versão-do-so&gt;-&lt;sufixo&gt;</literal>.
zh_cn: 对于与工作节点操作系统升级相关的 SUC 计划 - <literal>workers-&lt;os-name&gt;-&lt;os-version&gt;-&lt;suffix&gt;</literal>。
