Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: While deploying your Fleet, if you get a <literal>Modified</literal> message, make sure to add a corresponding <literal>comparePatches</literal> entry to the Fleet’s <literal>diff</literal> section. For more information, see <link xl:href="https://fleet.rancher.io/bundle-diffs">Generating Diffs to Ignore Modified GitRepos</link>.
es: Al desplegar su flota, si recibe un mensaje con la indicación <literal>Modified</literal> (Modificado), asegúrese de añadir la entrada <literal>comparePatches</literal> correspondiente a la sección <literal>diff</literal> del Fleet. Para obtener más información, consulte <link xl:href="https://fleet.rancher.io/bundle-diffs">Generating Diffs to Ignore Modified GitRepos</link> (Generación de diffs para ignorar recursos GitRepo modificados).
ja: Fleetをデプロイする場合に、<literal>Modified</literal>メッセージを取得した場合、Fleetの<literal>diff</literal>セクションに対応する<literal>comparePatches</literal>エントリを追加してください。詳細については、「<link xl:href="https://fleet.rancher.io/bundle-diffs">Generating Diffs to Ignore Modified GitRepos (変更されたGitReposを無視する差分を生成する)</link> 」を参照してください。
pt_br: Durante a implantação do Fleet, se você receber a mensagem <literal>Modified</literal> (Modificado), adicione uma entrada <literal>comparePatches</literal> correspondente à seção <literal>diff</literal> do Fleet. Para obter mais informações, consulte <link xl:href="https://fleet.rancher.io/bundle-diffs">Generating Diffs to Ignore Modified GitRepos</link> (Gerando diffs para ignorar GitRepos modificados).
zh_cn: 部署 Fleet 时，如果收到资源<literal>已修改</literal>消息，请确保在 Fleet 的 <literal>diff</literal> 部分添加相应的 <literal>comparePatches</literal> 项。有关详细信息，请参见 <link xl:href="https://fleet.rancher.io/bundle-diffs">Generating Diffs to Ignore Modified GitRepos</link>。

source: Fleet’s <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link> resource holds information on how to access your chart’s Fleet resources and to which clusters it needs to apply those resources.
es: El recurso <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link> de Fleet incluye información sobre cómo acceder a los recursos de Fleet de su chart y a qué clústeres deben aplicarse esos recursos.
ja: Fleetの<link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link>リソースは、チャートのFleetリソースへのアクセス方法、それらのリソースを適用するのに必要なクラスタに関する情報を保持しています。
pt_br: O recurso <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link> do Fleet armazena as informações sobre como acessar os recursos do Fleet do seu gráfico e a quais clusters ele precisa aplicar esses recursos.
zh_cn: Fleet 的 <link xl:href="https://fleet.rancher.io/ref-gitrepo">GitRepo</link> 资源包含如何访问 chart 的 Fleet 资源以及需要将这些资源应用于哪些群集的相关信息。

source: The <literal>GitRepo</literal> resource can be deployed through the <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Rancher UI</link>, or manually, by <link xl:href="https://fleet.rancher.io/tut-deployment">deploying</link> the resource to the <literal>management cluster</literal>.
es: El recurso <literal>GitRepo</literal> se puede desplegar mediante la <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">interfaz de usuario de Rancher</link> o, manualmente, <link xl:href="https://fleet.rancher.io/tut-deployment">desplegando</link> el recurso en el <literal>clúster de gestión</literal>.
ja: <literal>GitRepo</literal>リソースは、<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Rancher UI</link>を通じて、または手動で<literal>管理クラスタ</literal>にリソースを<link xl:href="https://fleet.rancher.io/tut-deployment">デプロイ</link>することで、デプロイできます。
zh_cn: 可以通过 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/fleet/overview#accessing-fleet-in-the-rancher-ui">Rancher UI</link> 部署 <literal>GitRepo</literal> 资源，也可以通过将该资源部署到<literal>管理群集</literal>的方式手动<link xl:href="https://fleet.rancher.io/tut-deployment">部署</link>该资源。

source: Example <emphasis role="strong">Longhorn</emphasis> <literal>GitRepo</literal> resource for <emphasis role="strong">manual</emphasis> deployment:
es: Recurso <literal>GitRepo</literal> de <emphasis role="strong">Longhorn</emphasis> de ejemplo para el despliegue <emphasis role="strong">manual</emphasis>:
ja: <emphasis role="strong">手動</emphasis>デプロイメントの<emphasis role="strong">Longhorn</emphasis> <literal>GitRepo</literal>リソースの例:
pt_br: Exemplo de recurso <literal>GitRepo</literal> do <emphasis role="strong">Longhorn</emphasis> para implantação <emphasis role="strong">manual</emphasis>:
zh_cn: 用于<emphasis role="strong">手动</emphasis>部署的 <emphasis role="strong">Longhorn</emphasis> <literal>GitRepo</literal> 资源示例：

source: <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> resources hold the raw Kubernetes resources that need to be deployed by Fleet. Normally it is encouraged to use the <literal>GitRepo</literal> approach, but for use-cases where the environment is air-gapped and cannot support a local Git server, <literal>Bundles</literal> can help you in propagating your Helm chart Fleet to your target clusters.
es: Los recursos <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> contienen los recursos sin procesar de Kubernetes que debe desplegar Fleet. Normalmente, se recomienda utilizar el enfoque de <literal>GitRepo</literal>, pero en entornos aislados o que no admitan un servidor Git local, los <literal>Bundles</literal> pueden ayudarle a propagar su chart de Helm de Fleet a los clústeres de destino.
ja: <link xl:href="https://fleet.rancher.io/bundle-add">バンドル</link>リソースは、Fleetによってデプロイされる必要がある生のKubernetesリソースを保持しています。通常、<literal>GitRepo</literal>アプローチを使用することを推奨されますが、 環境がエアギャップされ、ローカルGitサーバをサポートできないユースケース用に、<literal>バンドル</literal>がHelmチャートFleetをターゲットクラスタに伝播するのに役立ちます。
pt_br: Os recursos <link xl:href="https://fleet.rancher.io/bundle-add">Bundle</link> armazenam os recursos brutos do Kubernetes que o Fleet precisa implantar. Normalmente, a recomendação é usar a abordagem do <literal>GitRepo</literal>, mas para casos de uso em que o ambiente é air-gapped e não oferece suporte a um servidor Git local, os <literal>Bundles</literal> podem ajudar na propagação do Fleet do gráfico Helm aos clusters de destino.
zh_cn: <link xl:href="https://fleet.rancher.io/bundle-add">捆绑包</link>资源包含需要由 Fleet 部署的原始 Kubernetes 资源。一般情况下，建议使用 <literal>GitRepo</literal> 方法，但对于无法支持本地 Git 服务器的隔离环境，<literal>捆绑包</literal>可以帮助您将 Helm chart Fleet 传播到目标群集。

source: A <literal>Bundle</literal> can be deployed either through the Rancher UI (<literal>Continuous Delivery → Advanced → Bundles → Create from YAML</literal>) or by manually deploying the <literal>Bundle</literal> resource in the correct Fleet namespace. For information about Fleet namespaces, see the upstream <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">documentation</link>.
es: Es posible desplegar un <literal>Bundle</literal> mediante la interfaz de usuario de Rancher seleccionando <literal>Continuous Delivery → Advanced → Bundles → Create from YAML</literal> (Entrega continua → Avanzado → Bundles → Crear desde YAML)) o desplegando manualmente el recurso <literal>Bundle</literal> en el espacio de nombres de Fleet correcto. Para obtener información sobre los espacios de nombres de Fleet, consulte la <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">documentación original</link>.
ja: <literal>バンドル</literal>は、Rancher UI (<literal>［Continuous Delivery (継続的デリバリ)］ → ［Advanced (詳細) ］→ ［Bundles (バンドル)］ → ［Create from YAML (YALMから作成)］</literal>)を介して、または<literal>バンドル</literal>リソースを正しいFleetネームスペースに手動でデプロイして、デプロイできます。Fleetネームスペースについては、アップストリーム<link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">ドキュメント</link>を参照してください。
pt_br: É possível implantar um <literal>Bundle</literal> pela IU do Rancher (<literal>Continuous Delivery → Advanced → Bundles → Create from YAML</literal> (Entrega contínua → Avançado → Bundles → Criar do YAML)) ou pela implantação manual do recurso <literal>Bundle</literal> no namespace correto do Fleet. Para obter informações sobre os namespaces do Fleet, consulte a <link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">documentação</link> upstream.
zh_cn: <literal>捆绑包</literal>的部署可以通过 Rancher UI（<literal>Continuous Delivery（持续交付）→ Advanced（高级）→ Bundles（捆绑包）→ Create from YAML（基于 YAML 创建）</literal>）进行，也可以通过在正确的 Fleet 名称空间中手动部署<literal>捆绑包</literal>资源来完成。有关 Fleet 名称空间的信息，请参见上游<link xl:href="https://fleet.rancher.io/namespaces#gitrepos-bundles-clusters-clustergroups">文档</link>。

source: <literal>Bundles</literal> for Edge Helm charts can be created by utilizing Fleet’s <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link> approach.
es: Es posible crear <literal>Bundles</literal> para los charts de Helm de Edge <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">convirtiendo un chart de Helm en un Bundle de Fleet</link>.
ja: Edge Helmチャートの<literal>バンドル</literal>は、Fleetの 「<link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle (Helmチャートをバンドルに変換する)</link>」 アプローチを利用して作成できます。
pt_br: É possível criar <literal>Bundles</literal> para gráficos Helm do Edge usando a abordagem <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Converter um gráfico Helm em bundle</link> do Fleet.
zh_cn: 可以利用 Fleet 的<link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">将 Helm Chart 转换为捆绑包</link>方法创建用于 Edge Helm chart 的<literal>捆绑包</literal>。

source: Below you can find an example on how to create a <literal>Bundle</literal> resource from the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> and <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> Helm chart fleet templates and manually deploy this bundle to your <literal>management cluster</literal>.
es: A continuación, hay un ejemplo de cómo crear un recurso <literal>Bundle</literal> a partir de plantillas de flota de un chart de Helm de <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> y <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> y cómo desplegar manualmente este Bundle en su <literal>clúster de gestión</literal>.
ja: 以下に、<literal>バンドル</literal>リソースを<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link>と<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> HelmチャートFleetテンプレートから作成し、このバンドルを<literal>管理クラスタ</literal>に手動でデプロイする方法の例を示します。
zh_cn: 下面的示例展示了如何基于 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> 和 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> Helm chart Fleet 模板创建<literal>捆绑包</literal>资源，以及如何手动将此捆绑包部署到<literal>管理群集</literal>。

source: To illustrate the workflow, the below example uses the <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> directory structure.
es: Para ilustrar el flujo de trabajo, el siguiente ejemplo usa la estructura de directorio <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>.
ja: ワークフローを説明するため、以下の例では<link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>ディレクトリ構造を使用しています。
pt_br: Para ilustrar o fluxo de trabalho, o exemplo a seguir usa a estrutura de diretório <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>.
zh_cn: 为了阐明工作流程，下面的示例使用了 <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> 目录结构。

source: Navigate to the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> Chart fleet template:
es: Diríjase a la plantilla de flota de chart de <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link>:
ja: <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link>チャートFleetテンプレートに移動します。
zh_cn: 导航到 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn/fleet.yaml">longhorn</link> chart Fleet 模板：

source: Create a <literal>targets.yaml</literal> file that will instruct Fleet to which clusters it should deploy the Helm chart:
es: Cree un archivo <literal>targets.yaml</literal> que indicará a Fleet en qué clústeres debe desplegar el chart de Helm:
ja: FleetにHelmチャートのデプロイ先クラスタを指示する<literal>targets.yaml</literal>ファイルを作成します。
pt_br: Crie um arquivo <literal>targets.yaml</literal> para instruir o Fleet sobre os clusters em que ele deve implantar o gráfico Helm:
zh_cn: 创建 <literal>targets.yaml</literal> 文件，该文件将指示 Fleet 应将 Helm chart 部署到哪些群集：

source: There are some use-cases where your local cluster could have a different name.
es: Hay casos prácticos en los que el clúster local podría tener un nombre diferente.
ja: ローカルクラスタの名前が異なる場合があるユースケースがいくつかあります。
pt_br: Em alguns casos de uso, o nome do seu cluster local pode ser diferente.
zh_cn: 在某些使用场景中，您的本地群集的名称可能会有所不同。

source: To retrieve your local cluster name, execute the command below:
es: Para recuperar el nombre del clúster local, ejecute el siguiente comando:
ja: ローカルクラスタ名を取得するには、次のコマンドを実行します。
pt_br: Para recuperar o nome do seu cluster local, execute este comando:
zh_cn: 要获取本地群集名称，请执行以下命令：

source: Convert the <literal>Longhorn</literal> Helm chart Fleet to a Bundle resource using the <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
es: Convierta la flota de chart de Helm de <literal>Longhorn</literal> en un recurso Bundle mediante <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
ja: <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>を使用して、<literal>Longhorn</literal> HelmチャートFleetをバンドルリソースに変換します。
pt_br: Converta o gráfico Helm <literal>Longhorn</literal> do Fleet em um recurso bundle usando <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
zh_cn: 使用 <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link> 将 <literal>Longhorn</literal> Helm chart Fleet 转换为捆绑包资源。

source: Fleet’s CLI can be retrieved from their <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">release</link> <emphasis role="strong">Assets</emphasis> page (<literal>fleet-linux-amd64</literal>).
es: Puede obtener la interfaz de línea de comandos de Fleet (<literal>fleet-linux-amd64</literal>) de la página <emphasis role="strong">Assets</emphasis> (Recursos) de su <link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">versión</link>.
ja: FleetのCLI は、<link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">リリース</link><emphasis role="strong">アセット</emphasis>ページから取得できます(<literal>fleet-linux-amd64</literal>)。
zh_cn: 可从 Fleet 的<link xl:href="https://github.com/rancher/fleet/releases/tag/v0.13.1">版本</link><emphasis role="strong">资产</emphasis>页面获取 Fleet 的 CLI(<literal>fleet-linux-amd64</literal>).。

source: Navigate to the <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> Chart fleet template:
es: Diríjase a la plantilla de flota de chart de <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link>:
ja: <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link>チャートFleetテンプレートに移動します。
zh_cn: 导航到 <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/fleets/day2/chart-templates/longhorn/longhorn-crd/fleet.yaml">longhorn-crd</link> chart Fleet 模板：

source: Convert the <literal>Longhorn CRD</literal> Helm chart Fleet to a Bundle resource using the <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
es: Convierta la flota de chart de Helm de la <literal>CRD de Longhorn</literal> en un recurso Bundle mediante <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
ja: <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>を使用して、<literal>Longhorn CRD</literal> HelmチャートFleetをバンドルリソースに変換します。
pt_br: Converta o gráfico Helm <literal>Longhorn CRD</literal> do Fleet em um recurso bundle usando <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link>.
zh_cn: 使用 <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet">fleet-cli</link> 将 <literal>Longhorn CRD</literal> Helm chart Fleet 转换为捆绑包资源。

source: Deploy the <literal>longhorn-bundle.yaml</literal> and <literal>longhorn-crd-bundle.yaml</literal> files to your <literal>management cluster</literal>:
es: Despliegue los archivos <literal>longhorn-bundle.yaml</literal> y <literal>longhorn-crd-bundle.yaml</literal> en su <literal>clúster de gestión</literal>:
ja: <literal>longhorn-bundle.yaml</literal>と<literal>longhorn-crd-bundle.yaml</literal>ファイルを<literal>管理クラスタ</literal>にデプロイします。
pt_br: Implante os arquivos <literal>longhorn-bundle.yaml</literal> e <literal>longhorn-crd-bundle.yaml</literal> no <literal>cluster de gerenciamento</literal>:
zh_cn: 将 <literal>longhorn-bundle.yaml</literal> 和 <literal>longhorn-crd-bundle.yaml</literal> 文件部署到<literal>管理群集</literal>：

source: Following these steps will ensure that <literal>SUSE Storage</literal> is deployed on all of the specified management cluster.
es: Siga estos pasos para asegurarse de que <literal>SUSE Storage</literal> se despliega en todos los clústeres de gestión especificados.
ja: これらの手順に従うと、<literal>SUSE Storage</literal>が指定された管理クラスタのすべてにデプロイされます。
pt_br: Siga estas etapas para garantir que o <literal>SUSE Storage</literal> seja implantado em todos os clusters de gerenciamento especificados.
zh_cn: 按照以上步骤操作，将 <literal>SUSE Storage</literal> 部署到所有指定的管理群集上。

source: Manage the deployed Helm chart
es: Gestione el chart de Helm desplegado
ja: デプロイされたHelmチャートの管理
pt_br: Gerenciar o gráfico Helm implantado
zh_cn: 管理部署的 Helm chart

source: Once deployed with Fleet, for Helm chart upgrades, see <xref linkend="management-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>.
es: Cuando se complete el despliegue con Fleet, para actualizaciones de charts de Helm, consulte la <xref linkend="management-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>.
ja: Fleetでデプロイした後のHelmチャートのアップグレードについては、<xref linkend="management-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>を参照してください。
pt_br: Após a implantação com o Fleet, para fazer upgrade dos gráficos Helm, consulte a <xref linkend="management-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>.
zh_cn: 通过 Fleet 完成部署后，若要进行 Helm chart 升级，请参见<xref linkend="management-day2-fleet-helm-upgrade-procedure-fleet-managed-chart"/>。

source: I would like to upgrade a Fleet managed Helm chart
es: Quiero actualizar un chart de Helm gestionado por Fleet
ja: Fleetで管理されているHelmチャートをアップグレードしたい場合
pt_br: Quero fazer upgrade de um gráfico Helm gerenciado pelo Fleet
zh_cn: 我想升级 Fleet 管理的 Helm chart

source: Determine the version to which you need to upgrade your chart so that it is compatible with the desired Edge release. Helm chart version per Edge release can be viewed from the release notes (<xref linkend="release-notes"/>).
es: Determine la versión a la que debe actualizar su chart para que sea compatible con la versión deseada de Edge. Puede consultar la versión del chart de Helm para cada versión de Edge en las notas de la versión (<xref linkend="release-notes"/>).
ja: 目的のEdgeリリースと互換性を持つように、チャートをアップブレードする必要があるバージョンを決定します。EdgeリリースごとのHelmチャートバージョンはリリースノート(<xref linkend="release-notes"/>)から表示できます。
pt_br: Determine a versão para a qual você precisa fazer upgrade do seu gráfico para que ele fique compatível com o lançamento desejado do Edge. Você encontra a versão do gráfico Helm por lançamento do Edge nas Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: 确定需要将 chart 升级到哪个版本，以使其与目标 Edge 版本兼容。有关每个 Edge 版本兼容的 Helm chart 版本，可参见发行说明（<xref linkend="release-notes"/>）。

source: In your Fleet monitored Git repository, edit the Helm chart’s <literal>fleet.yaml</literal> file with the correct chart <emphasis role="strong">version</emphasis> and <emphasis role="strong">repository</emphasis> from the release notes (<xref linkend="release-notes"/>).
es: En su repositorio Git supervisado por Fleet, edite el archivo <literal>fleet.yaml</literal> del chart de Helm con la <emphasis role="strong">versión</emphasis> y el <emphasis role="strong">repositorio</emphasis> correctos del chart, tal y como se indica en las notas de la versión (<xref linkend="release-notes"/>).
ja: Fleetで監視されているGitリポジトリで、Helmチャートの<literal>fleet.yaml</literal>ファイルを、リリースノート(<xref linkend="release-notes"/>)から取得した正しいチャートの<emphasis role="strong">バージョン</emphasis>と<emphasis role="strong">リポジトリ</emphasis>で編集します。
pt_br: No repositório Git monitorado pelo Fleet, edite o arquivo <literal>fleet.yaml</literal> do gráfico Helm com a <emphasis role="strong">versão</emphasis> e o <emphasis role="strong">repositório</emphasis> corretos do gráfico conforme as Notas de lançamento (<xref linkend="release-notes"/>).
zh_cn: 在 Fleet 监控的 Git 储存库中，根据发行说明（<xref linkend="release-notes"/>）中所述，将 Helm chart 的 <literal>fleet.yaml</literal> 文件中的 chart <emphasis role="strong">版本</emphasis>和<emphasis role="strong">储存库</emphasis>更改为正确的值。

source: After committing and pushing the changes to your repository, this will trigger an upgrade of the desired Helm chart
es: Después de confirmar y enviar los cambios al repositorio, se activará una actualización del chart de Helm deseado.
ja: 変更をコミットしてリポジトリにプッシュした後で、目的のHelmチャートのアップグレードがトリガされます。
pt_br: Depois de confirmar e enviar as alterações ao repositório, será acionado um upgrade do gráfico Helm desejado.
zh_cn: 提交更改并将其推送到储存库后，会触发所需 Helm chart 的升级

source: I would like to upgrade a Helm chart deployed via EIB
es: Quiero actualizar un chart de Helm desplegado mediante EIB
ja: EIBを介してデプロイされたHelmチャートをアップグレードしたい
pt_br: Quero fazer upgrade de um gráfico Helm implantado pelo EIB
zh_cn: 我要升级通过 EIB 部署的 Helm chart
