Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Bundle creation - Rancher UI
es: Creación de Bundle - Interfaz de usuario de Rancher
ja: バンドルの作成 - Rancher UI
pt_br: Criação do bundle – IU do Rancher
zh_cn: 捆绑包创建 - Rancher UI

source: The Edge team maintains a ready to use <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">bundle</link> that can be used in the below steps.
es: El equipo de Edge mantiene un <link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">bundle</link> listo para usar que puede emplear en los pasos que se indican a continuación.
ja: Edgeチームは、以下の手順で使用可能な、すぐに使用できる<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">バンドル</link>を維持しています。
zh_cn: Edge 团队维护着一个可在以下步骤中使用的即用型<link xl:href="https://github.com/suse-edge/fleet-examples/blob/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">捆绑包</link>。

source: Always use this bundle from a valid Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag.
es: Use siempre este bundle desde una etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> válida de Edge.
ja: このバンドルは常に有効なEdge<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグから使用してください。
pt_br: Sempre use esse bundle de uma tag de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> válida do Edge.
zh_cn: 请务必通过有效的 Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记使用此捆绑包。

source: To create a bundle through Rancher’s UI:
es: Para crear un bundle con la interfaz de usuario de Rancher:
ja: RancherのUIを通じてバンドルを作成するには、次の手順に従います。
pt_br: Para criar um bundle pela IU do Rancher:
zh_cn: 要通过 Rancher 的 UI 创建捆绑包，请执行以下操作：

source: In the upper left corner, click <emphasis role="strong">☰ → Continuous Delivery</emphasis>
es: En la esquina superior izquierda, haga clic en <emphasis role="strong">☰ → Continuous Delivery</emphasis> (☰ → Entrega continua).
ja: 左上隅で、<emphasis role="strong">［☰］ → ［Continuous Delivery (継続的デリバリ)］</emphasis>をクリックします。
pt_br: No canto superior esquerdo, clique em <emphasis role="strong">☰ → Continuous Delivery</emphasis> (Entrega contínua).
zh_cn: 单击左上角的 <emphasis role="strong">☰ → Continuous Delivery（持续交付）</emphasis>

source: Go to <emphasis role="strong">Advanced</emphasis> &gt; <emphasis role="strong">Bundles</emphasis>
es: Diríjase a <emphasis role="strong">Advanced</emphasis> &gt; <emphasis role="strong">Bundles</emphasis> (Avanzado > Bundles).
ja: <emphasis role="strong">［Advanced (詳細)］</emphasis>&gt;<emphasis role="strong">［Bundles (バンドル)］ </emphasis>に移動します。
pt_br: Vá para <emphasis role="strong">Advanced</emphasis> &gt; <emphasis role="strong">Bundles</emphasis> (Avançado > Bundles).
zh_cn: 转到 <emphasis role="strong">Advanced</emphasis>（高级）&gt; <emphasis role="strong">Bundles</emphasis>（捆绑包）

source: Select <emphasis role="strong">Create from YAML</emphasis>
es: Seleccione <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML).
ja: <emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>を選択します。
pt_br: Selecione <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML).
zh_cn: 选择 <emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）

source: From here you can create the Bundle in one of the following ways:
es: Desde aquí, puede crear el Bundle de las siguientes maneras:
ja: ここから次のいずれかの方法でバンドルを作成できます。
pt_br: Nesse local, você pode criar o bundle de uma das seguintes maneiras:
zh_cn: 此处可通过以下方式之一创建捆绑包：

source: There might be use-cases where you would need to include custom changes to the <literal>SUC plans</literal> that the bundle ships (e.g. to add custom tolerations). Make sure to include those changes in the bundle that will be generated by the below steps.
es: Puede haber casos en los que sea necesario incluir cambios personalizados en los <literal>planes de SUC</literal> que incluye el Bundle (por ejemplo, para añadir tolerancias personalizadas). Asegúrese de incluir esos cambios en el Bundle que se generará con los pasos siguientes.
ja: バンドルが配布する<literal>SUC Plan</literal>にカスタム変更を含める必要があるユースケースがある場合があります(カスタム許容値の追加など)。これらの変更を、以下の手順で生成されるバンドルに必ず含めてください。
pt_br: Há casos de uso em que você precisa incluir alterações personalizadas nos <literal>planos do SUC</literal> que o bundle envia (por exemplo, para adicionar tolerâncias personalizadas). Inclua essas alterações no bundle que será gerado pelas etapas a seguir.
zh_cn: 在某些使用场景中，您可能需要在捆绑包附带的 <literal>SUC 计划</literal>中包含自定义更改。请确保在以下步骤生成的捆绑包中包含这些更改。

source: By manually copying the <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">bundle content</link> from <literal>suse-edge/fleet-examples</literal> to the <emphasis role="strong">Create from YAML</emphasis> page.
es: Copiando manualmente el <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">contenido del Bundle</link> desde <literal>suse-edge/fleet-examples</literal> a la página <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML).
ja: <link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">バンドルコンテンツ</link>を<literal>suse-edge/fleet-examples</literal>から<emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>ページに手動でコピーする。
zh_cn: 手动将 <literal>suse-edge/fleet-examples</literal> 中的<link xl:href="https://raw.githubusercontent.com/suse-edge/fleet-examples/refs/tags/release-3.4.0/bundles/day2/system-upgrade-controller-plans/os-upgrade/os-upgrade-bundle.yaml">捆绑包内容</link>复制到 <emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）页面。

source: By cloning the <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> repository from the desired <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag and selecting the <emphasis role="strong">Read from File</emphasis> option in the <emphasis role="strong">Create from YAML</emphasis> page. From there, navigate to the bundle location (<literal>bundles/day2/system-upgrade-controller-plans/os-upgrade</literal>) and select the bundle file. This will auto-populate the <emphasis role="strong">Create from YAML</emphasis> page with the bundle content.
es: Clonando el repositorio <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> desde la etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> deseada y seleccionando la opción<emphasis role="strong">Read from File</emphasis> (Leer desde archivo) en la página <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML). Desde ahí, diríjase a la ubicación del Bundle (<literal>bundles/day2/system-upgrade-controller-plans/os-upgrade</literal>) y seleccione el archivo del Bundle. Esto rellenará automáticamente la página <emphasis role="strong">Create from YAML</emphasis> (Crear desde YAML) con el contenido del Bundle.
ja: 目的の<link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグから<link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>のクローンを作成し、<emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>ページの<emphasis role="strong">［Read from File (ファイルから読み取り)］</emphasis>オプションを選択する。ここからバンドルの場所(<literal>bundles/day2/system-upgrade-controller-plans/os-upgrade</literal>)に移動して、バンドルファイルを選択できます。これにより、バンドルコンテンツを持つ<emphasis role="strong">［Create from YAML (YAMLから作成)］</emphasis>ページが自動入力されます。
pt_br: Clone o repositório <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> da tag da <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> desejada e selecione a opção <emphasis role="strong">Read from File</emphasis> (Ler arquivo) na página <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML). Dessa página, navegue até o local do bundle (<literal>bundles/day2/system-upgrade-controller-plans/os-upgrade</literal>) e selecione o arquivo do bundle. Esse procedimento preencherá automaticamente a página <emphasis role="strong">Create from YAML</emphasis> (Criar do YAML) com o conteúdo do bundle.
zh_cn: 从所需的<link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记克隆 <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> 储存库，并在 <emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）页面中选择 <emphasis role="strong">Read from File</emphasis>（从文件读取）选项。然后导航到捆绑包位置 (<literal>bundles/day2/system-upgrade-controller-plans/os-upgrade</literal>) 并选择捆绑包文件。这会在<emphasis role="strong">Create from YAML</emphasis>（基于 YAML 创建）页面中自动填充捆绑包内容。

source: Edit the Bundle in the Rancher UI:
es: Edite el Bundle en la interfaz de usuario de Rancher:
ja: Rancher UIでバンドルを編集します。
pt_br: Edite o bundle na IU do Rancher:
zh_cn: 在 Rancher UI 中编辑捆绑包：

source: Change the <emphasis role="strong">namespace</emphasis> of the <literal>Bundle</literal> to point to the <literal>fleet-local</literal> namespace.
es: Cambie el <emphasis role="strong">espacio de nombres</emphasis> del <literal>bundle</literal> para que dirija al espacio de nombres <literal>fleet-local</literal>.
ja: <literal>バンドル</literal>の<emphasis role="strong">ネームスペース</emphasis>を<literal>fleet-local</literal>ネームスペースを指すように変更します。
pt_br: Altere o <emphasis role="strong">namespace</emphasis> do <literal>Bundle</literal> para apontar para o namespace <literal>fleet-local</literal>.
zh_cn: 更改<literal>捆绑包</literal>的<emphasis role="strong">名称空间</emphasis>，使其指向 <literal>fleet-local</literal> 名称空间。

source: Change the <emphasis role="strong">target</emphasis> clusters for the <literal>Bundle</literal> to point to your <literal>local</literal>(management) cluster:
es: Cambie los clústeres de <emphasis role="strong">destino</emphasis> para que el <literal>bundle</literal> apunte a su clúster de gestión <literal>local</literal>:
ja: <literal>バンドル</literal>の<emphasis role="strong">ターゲット</emphasis>クラスタを<literal>ローカル</literal>(管理)クラスタを指すように変更します。
pt_br: Altere os clusters de <emphasis role="strong">destino</emphasis> para que o <literal>Bundle</literal> aponte para o seu cluster <literal>local</literal> (gerenciamento):
zh_cn: 更改<literal>捆绑包</literal>的<emphasis role="strong">目标</emphasis>群集，使其指向<literal>本地</literal>（管理）群集：

source: There are some use-cases where your <literal>local</literal> cluster could have a different name.
es: Hay casos prácticos en los que el clúster <literal>local</literal> podría tener un nombre diferente.
ja: 一部のユースケースでは、<literal>ローカル</literal>クラスタに異なる名前を付けることができます。
pt_br: Em alguns casos de uso, o cluster <literal>local</literal> pode ter um nome diferente.
zh_cn: 在某些使用场景中，您的<literal>本地</literal>群集的名称可能会有所不同。

source: To retrieve your <literal>local</literal> cluster name, execute the command below:
es: Para recuperar el nombre del clúster <literal>local</literal>, ejecute el siguiente comando:
ja: <literal>ローカル</literal>クラスタ名を取得するには、次のコマンドを実行します。
pt_br: Para recuperar o nome do cluster <literal>local</literal>, execute o comando abaixo:
zh_cn: 要获取<literal>本地</literal>群集名称，请执行以下命令：

source: Select <emphasis role="strong">Create</emphasis>
es: Seleccione <emphasis role="strong">Create</emphasis> (Crear).
ja: <emphasis role="strong">［Create (作成)］</emphasis>を選択します。
pt_br: Selecione <emphasis role="strong">Create</emphasis> (Criar).
zh_cn: 选择 <emphasis role="strong">Create</emphasis>（创建）

source: Bundle creation - manual
es: Creación del Bundle - Manual
ja: バンドルの作成 - 手動
pt_br: Criação do bundle – manual
zh_cn: 捆绑包创建 - 手动

source: Pull the <emphasis role="strong">Bundle</emphasis> resource:
es: Extraiga el recurso <emphasis role="strong">Bundle</emphasis>:
ja: <emphasis role="strong">バンドル</emphasis>リソースをプルします。
pt_br: Obtenha o recurso <emphasis role="strong">Bundle</emphasis>:
zh_cn: 提取<emphasis role="strong">捆绑包</emphasis>资源：

source: Edit the <literal>Bundle</literal> configuration:
es: Edite la configuración del <literal>Bundle</literal>:
ja: <literal>バンドル</literal>設定を編集します。
pt_br: Edite a configuração do <literal>Bundle</literal>:
zh_cn: 编辑<literal>捆绑包</literal>配置：

source: Apply the <emphasis role="strong">Bundle</emphasis> resource to your <literal>management cluster</literal>:
es: Aplique el recurso <emphasis role="strong">Bundle</emphasis> al <literal>clúster de gestión</literal>:
ja: <emphasis role="strong">バンドル</emphasis>リソースを<literal>管理クラスタ</literal>に適用します。
pt_br: Aplique o recurso <emphasis role="strong">Bundle</emphasis> ao seu <literal>cluster de gerenciamento</literal>:
zh_cn: 将<emphasis role="strong">捆绑包</emphasis>资源应用于<literal>管理群集</literal>：

source: View the created <emphasis role="strong">Bundle</emphasis> resource under the <literal>fleet-local</literal> namespace:
es: Compruebe que el recurso <emphasis role="strong">Bundle</emphasis> se ha creado en el espacio de nombres <literal>fleet-local</literal>:
ja: 作成した<emphasis role="strong">バンドル</emphasis>リソースを<literal>fleet-local</literal>ネームスペースの下に表示します。
pt_br: Visualize o recurso <emphasis role="strong">Bundle</emphasis> criado no namespace <literal>fleet-local</literal>:
zh_cn: 查看 <literal>fleet-local</literal> 名称空间下创建的<emphasis role="strong">捆绑包</emphasis>资源：

source: SUC Plan deployment - third-party GitOps workflow
es: Despliegue del plan de SUC - Flujo de trabajo de GitOps de terceros
ja: SUC Planのデプロイメント - サードパーティのGitOpsワークフロー
pt_br: Implantação do plano do SUC: fluxo de trabalho do GitOps de terceiros
zh_cn: SUC 计划部署 - 第三方 GitOps 工作流程

source: There might be use-cases where users would like to incorporate the <literal>OS SUC plans</literal> to their own third-party GitOps workflow (e.g. <literal>Flux</literal>).
es: Puede haber casos prácticos en los que los usuarios deseen incorporar los <literal>planes de SUC de sistema operativo</literal> a su propio flujo de trabajo de GitOps de terceros (por ejemplo, <literal>Flux</literal>).
ja: ユーザが<literal>OS SUC Plan</literal>を独自のサードパーティGitOpsワークフロー(例: <literal>Flux</literal>)に組み込むユースケースがある場合があります。
pt_br: Em alguns casos de uso, talvez você queira incorporar os <literal>planos do SUC de sistema operacional</literal> ao fluxo de trabalho do GitOps de terceiros (por exemplo, o <literal>Flux</literal>).
zh_cn: 在某些使用场景中，用户可能希望将<literal>操作系统 SUC 计划</literal>合并到自己的第三方 GitOps 工作流程（例如 <literal>Flux</literal>）中。

source: To get the OS upgrade resources that you need, first determine the Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> tag of the <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> repository that you would like to use.
es: Para obtener los recursos de actualización del sistema operativo que necesita, determine primero la etiqueta de <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de Edge del repositorio <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> que desea utilizar.
ja: 必要なOSアップグレードリソースを取得するには、まず使用する<link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link>リポジトリのEdge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>タグを決定します。
pt_br: Para obter os recursos de upgrade de sistema operacional que você precisa, primeiro determine a tag da <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> do Edge do repositório <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> que deseja usar.
zh_cn: 要获取所需的操作系统升级资源，首先请确定您要使用的 <link xl:href="https://github.com/suse-edge/fleet-examples">suse-edge/fleet-examples</link> 储存库的 Edge <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>标记。

source: After that, resources can be found at <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>, where:
es: Después, los recursos se encuentran en <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>, donde:
ja: その後、リソースは<literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>で見つかります。ここでは次のようになります。
pt_br: Depois disso, os recursos estarão disponíveis em <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal>, em que:
zh_cn: 然后，便可以在 <literal>fleets/day2/system-upgrade-controller-plans/os-upgrade</literal> 中找到资源，其中：

source: <literal>plan-control-plane.yaml</literal> is a SUC plan resource for <emphasis role="strong">control-plane</emphasis> nodes.
es: <literal>plan-control-plane.yaml</literal> es un recurso de plan de SUC para los nodos de <emphasis role="strong">plano de control</emphasis>.
ja: <literal>plan-control-plane.yaml</literal>は、<emphasis role="strong">コントロールプレーン</emphasis>ノードのSUC Planリソースです。
pt_br: <literal>plan-control-plane.yaml</literal> é um recurso do plano do SUC para nós do <emphasis role="strong">plano de controle</emphasis>.
zh_cn: <literal>plan-control-plane.yaml</literal> 是用于<emphasis role="strong">控制平面</emphasis>节点的 SUC 计划资源。

source: <literal>plan-worker.yaml</literal> is a SUC plan resource for <emphasis role="strong">worker</emphasis> nodes.
es: <literal>plan-worker.yaml</literal> es un recurso de plan de SUC para los nodos de <emphasis role="strong">trabajador</emphasis>.
ja: <literal>plan-worker.yaml</literal>は、 <emphasis role="strong">ワーカー</emphasis>ノードのSUC Planリソースです。
pt_br: <literal>plan-worker.yaml</literal> é um recurso do plano do SUC para nós do <emphasis role="strong">worker</emphasis>.
zh_cn: <literal>plan-worker.yaml</literal> 是用于<emphasis role="strong">工作</emphasis>节点的 SUC 计划资源。

source: <literal>secret.yaml</literal> is a Secret that contains the <literal>upgrade.sh</literal> script, which is responsible for creating the systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>).
es: <literal>secret.yaml</literal> es un secreto que contiene el guion <literal>upgrade.sh</literal>, que se encarga de crear el servicio systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>).
ja: <literal>secret.yaml</literal>は、systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>)の作成を担当する、<literal>upgrade.sh</literal>スクリプトを含むSecretです。
pt_br: <literal>secret.yaml</literal> é um segredo que contém o script <literal>upgrade.sh</literal>, responsável por criar o systemd.service (<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>).
zh_cn: <literal>secret.yaml</literal> 是一个包含 <literal>upgrade.sh</literal> 脚本的机密，该脚本负责创建 systemd.service（<xref linkend="management-day2-fleet-os-upgrade-components-systemd-service"/>）。

source: <literal>config-map.yaml</literal> is a ConfigMap that holds configurations that are consumed by the <literal>upgrade.sh</literal> script.
es: <literal>config-map.yaml</literal> es un mapa de configuración que contiene las configuraciones que utiliza el guion <literal>upgrade.sh</literal>.
ja: <literal>config-map.yaml</literal>は、<literal>upgrade.sh</literal>スクリプトによって使用される設定を保持するConfigMapです。
pt_br: <literal>config-map.yaml</literal> é um ConfigMap que armazena as configurações consumidas pelo script <literal>upgrade.sh</literal>.
zh_cn: <literal>config-map.yaml</literal> 是 ConfigMap，提供 <literal>upgrade.sh</literal> 脚本使用的升级配置。

source: These <literal>Plan</literal> resources are interpreted by the <literal>System Upgrade Controller</literal> and should be deployed on each downstream cluster that you wish to upgrade. For SUC deployment information, see <xref linkend="components-system-upgrade-controller-install"/>.
es: Estos recursos de <literal>plan</literal> son interpretados por <literal>System Upgrade Controller</literal> y se deben desplegar en cada clúster descendente que desee actualizar. Para obtener información sobre el despliegue de SUC, consulte la <xref linkend="components-system-upgrade-controller-install"/>.
ja: これらの<literal>Plan</literal>リソースは、 <literal>System Upgrade Controller</literal>によって解釈され、アップグレードする各ダウンストリームクラスタにデプロイする必要があります。SUCデプロイメントの情報については、<xref linkend="components-system-upgrade-controller-install"/>を参照してください。
pt_br: Esses recursos do <literal>plano</literal> são interpretados pelo <literal>System Upgrade Controller</literal> e devem ser implantados em cada cluster downstream do qual você deseja fazer upgrade. Para obter informações sobre a implantação do SUC, consulte a <xref linkend="components-system-upgrade-controller-install"/>.
zh_cn: 这些<literal>计划</literal>资源由<literal>系统升级控制器</literal>解释，应部署在您要升级的每个下游群集上。有关 SUC 部署信息，请参见<xref linkend="components-system-upgrade-controller-install"/>。

source: To better understand how your GitOps workflow can be used to deploy the <emphasis role="strong">SUC Plans</emphasis> for OS upgrade, it can be beneficial to take a look at overview (<xref linkend="management-day2-fleet-os-upgrade-overview"/>).
es: Para comprender mejor cómo usar su flujo de trabajo de GitOps para desplegar los <emphasis role="strong">planes de SUC</emphasis> para actualizar el sistema operativo, puede resultar útil echar un vistazo a la descripción general (<xref linkend="management-day2-fleet-os-upgrade-overview"/>).
ja: GitOpsワークフローをOSアップグレードの<emphasis role="strong">SUC Plan</emphasis>をデプロイするために使用する方法をよりよく理解するために、概要(<xref linkend="management-day2-fleet-os-upgrade-overview"/>)を確認すると役立つ場合があります。
pt_br: Para entender melhor como usar o fluxo de trabalho do GitOps para implantar os <emphasis role="strong">planos do SUC</emphasis> para upgrade de sistema operacional, consulte a visão geral (<xref linkend="management-day2-fleet-os-upgrade-overview"/>).
zh_cn: 为了更好地了解如何使用 GitOps 工作流程来部署操作系统升级的 <emphasis role="strong">SUC 计划</emphasis>，建议查看<xref linkend="management-day2-fleet-os-upgrade-overview"/>。

source: Kubernetes version upgrade
es: Actualización de la versión de Kubernetes
ja: Kubernetesバージョンアップグレード
pt_br: Upgrade da versão do Kubernetes
zh_cn: Kubernetes 版本升级

source: This section describes how to perform a Kubernetes upgrade using <xref linkend="components-fleet"/> and the <xref linkend="components-system-upgrade-controller"/>.
es: En esta sección se describe cómo realizar una actualización de Kubernetes utilizando <xref linkend="components-fleet"/> y <xref linkend="components-system-upgrade-controller"/>.
ja: このセクションでは、<xref linkend="components-fleet"/>と<xref linkend="components-system-upgrade-controller"/>を使用してKubernetesアップグレードを実行する方法について説明します。
pt_br: Esta seção descreve como fazer um upgrade do Kubernetes usando o <xref linkend="components-fleet"/> e o <xref linkend="components-system-upgrade-controller"/>.
zh_cn: 本节介绍如何使用<xref linkend="components-fleet"/>和<xref linkend="components-system-upgrade-controller"/>执行 Kubernetes 升级。

source: <xref linkend="management-day2-fleet-k8s-upgrade-components"/> - additional components used by the upgrade process.
es: <xref linkend="management-day2-fleet-k8s-upgrade-components"/>: componentes adicionales usados por el proceso de actualización.
ja: <xref linkend="management-day2-fleet-k8s-upgrade-components"/> - アップグレードプロセスで使用される追加のコンポーネント。
pt_br: <xref linkend="management-day2-fleet-k8s-upgrade-components"/>: componentes adicionais usados pelo processo de upgrade.
zh_cn: <xref linkend="management-day2-fleet-k8s-upgrade-components"/> - 升级过程使用的其他组件。
