Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: The examples shown in the previous sections provide guidance and examples on how to set up a single-stack IPv4 management cluster. Such a management cluster is independent of the operational status of downstream clusters, which can be individually configured to operate in either IPv4/IPv6 single-stack or dual-stack configuration, once deployed. However, they way the management cluster is configured has a direct impact on the communication protocols that can be used during the provisioning phase, where both the in-band and out-of-band communications must happen according to which protocols are supported by the management cluster and downstream host. In case some or all of the BMCs and/or downstream cluster nodes are expected to use IPv6, a dual-stack setup for the management cluster is then required.
es: Los ejemplos mostrados en las secciones anteriores proporcionan orientación y ejemplos sobre cómo configurar un clúster de gestión IPv4 de pila única. Dicho clúster de gestión es independiente del estado operativo de los clústeres descendentes, que pueden configurarse individualmente para funcionar en una configuración IPv4/IPv6 de pila única o de pila doble una vez implementados. Sin embargo, la forma en que se configura el clúster de gestión tiene un impacto directo en los protocolos de comunicación que se pueden usar durante la fase de aprovisionamiento, en la que las comunicaciones en banda y fuera de banda deben realizarse de acuerdo con los protocolos compatibles con el clúster de gestión y el host descendente. En caso de que se prevea que algunos o todos los BMC o los nodos de clúster descendentes utilicen IPv6, se requiere una configuración de doble pila para el clúster de gestión.
ja: 前のセクションで示した例では、シングルスタックIPv4管理クラスタの設定方法に関するガイダンスと例を示しています。このような管理クラスタは、ダウンストリームクラスタの動作状態とは無関係であり、デプロイ後にIPv4/IPv6シングルスタック設定またはデュアルスタック設定のいずれかで動作するように個別に設定できます。ただし、管理クラスタの設定方法は、プロビジョニングフェーズ中に使用可能な通信プロトコルに直接影響します。このフェーズでは、管理クラスタとダウンストリームホストがサポートするプロトコルに応じて、インバンド通信とアウトオブバンド通信の両方が行われる必要があります。BMCやダウンストリームクラスタノードの一部またはすべてがIPv6を使用することが想定される場合、管理クラスタにはデュアルスタックセットアップが必要となります。
zh_cn: 前面章节中的示例提供了有关如何设置单栈 IPv4 管理群集的指导和示例。此类管理群集不受下游群集运行状态的影响，下游群集在部署后可分别配置为以 IPv4/IPv6 单栈或双栈模式运行。然而，管理群集的配置方式会直接影响置备阶段可使用的通信协议 - 在此阶段，带内和带外通信都必须遵循管理群集和下游主机支持的协议。如果部分或所有 BMC 和/或下游群集节点需使用 IPv6，则管理群集需采用双栈配置。

source: Single-stack IPv6 management clusters are not yet supported.
es: Aún no se admiten clústeres de gestión IPv6 de un pila única.
ja: シングルスタックIPv6管理クラスタはまだサポートされていません。
zh_cn: 目前暂不支持单栈 IPv6 管理群集。

source: In order to achieve dual-stack functionality, Kubernetes must be provided with both IPv4 and IPv6 CIDRs for PODs and Services. However, other components also require specific tuning before building the management cluster image with EIB. The Metal<superscript>3</superscript> provisioning services (Ironic) can be configured in different ways, depending on your infrastructure or requirements:
es: Para lograr la funcionalidad de doble pila, Kubernetes debe contar con CIDR IPv4 e IPv6 para POD y servicios. Sin embargo, otros componentes también requieren un ajuste específico antes de crear la imagen del clúster de gestión con EIB. Los servicios de aprovisionamiento de Metal<superscript>3</superscript> (Ironic) se pueden configurar de diferentes maneras, dependiendo de su infraestructura o requisitos:
ja: デュアルスタック機能を実現するには、KubernetesにPodとService用のIPv4とIPv6両方のCIDRを提供する必要があります。ただし、EIBを使用して管理クラスタイメージを構築する前に、他のコンポーネントについても特定の調整が必要です。Metal<superscript>3</superscript>プロビジョニングサービス(Ironic)は、インフラストラクチャや要件に応じて異なる方法で設定できます。
zh_cn: 要实现双栈功能，必须为 Kubernetes 提供用于 POD 和服务的 IPv4 和 IPv6 CIDR。此外，在使用 EIB 构建管理群集映像前，还需对其他组件进行特定调整。可根据您的体系结构或要求，通过不同方式配置 Metal<superscript>3</superscript> 置备服务 (Ironic)：

source: The Ironic services can be configured to listen on all the interfaces on the system rather than a single IP address, thus, as long as the management cluster host(s) has both IPv4 and IPv6 addresses assigned to the relevant interface, any of them can potentially be used during the provisioning. Note that at this time only one of these addresses can be selected for the URL generation (for consumption by other services, e.g. the Baremetal Operator, BMCs, etc.); as a consequence, to enable IPv6 communications with the BMCs, the Baremetal Operator can be instructed to expose and pass on an IPv6 URL when dealing BMH definitions including an IPv6 address. In other words, when a BMC is identified as IPv6 capable, the provisioning will be performed via IPv6 only, and via IPv4 in all the other cases.
es: Los servicios de Ironic se pueden configurar para escuchar en todas las interfaces del sistema en lugar de en una única dirección IP, por lo que, siempre que los hosts del clúster de gestión tengan asignadas direcciones IPv4 e IPv6 a la interfaz correspondiente, cualquiera de ellas podrá utilizarse durante el aprovisionamiento. Tenga en cuenta que, en este momento, solo se puede seleccionar una de estas direcciones para la generación de la URL (para su uso por otros servicios, como el operador bare metal, BMC, etc.); por lo tanto, para habilitar las comunicaciones IPv6 con los BMC, se puede indicar al operador bare metal que exponga y transmita una URL IPv6 al tratar definiciones BMH que incluyan una dirección IPv6. En otras palabras, cuando se identifica que un BMC es compatible con IPv6, el aprovisionamiento se realizará únicamente a través de IPv6, y a través de IPv4 en todos los demás casos.
ja: Ironicサービスは、単一のIPアドレスではなくシステム上のすべてのインタフェースでリスンするよう設定できます。したがって、管理クラスタホストで関連インタフェースにIPv4とIPv6の両方のアドレスが割り当てられている限り、プロビジョニング中にいずれのアドレスも使用される可能性があります。この時点では、URL生成(Baremetal OperatorやBMCなどの他のサービスが利用するため)には、これらのアドレスの1つしか選択できないことに注意してください。結果として、BMCとのIPv6通信を有効にするには、IPv6アドレスを含むBMH定義を処理する際に、Baremetal OperatorはIPv6 URLを公開して渡すように指示できます。つまり、BMCがIPv6対応と識別された場合、プロビジョニングはIPv6経由でのみ実行され、それ以外の場合はすべてIPv4経由で実行されます。
zh_cn: 可将 Ironic 服务配置为在系统的所有接口上侦听，而非仅在单个 IP 地址上侦听。因此，只要管理群集主机在相关接口上分配了 IPv4 和 IPv6 地址，置备过程中就可能使用其中任意一个地址。请注意，目前仅能选择这些地址中的一个用于生成 URL（供裸机操作器、BMC 等其他服务使用）；因此，要实现与 BMC 的 IPv6 通信，可指示裸机操作器在处理包含 IPv6 地址的 BMH 定义时公开并传递 IPv6 URL。也就是说，当 BMC 被识别为支持 IPv6 时，将仅通过 IPv6 进行置备；其他所有情况下则通过 IPv4 进行置备。

source: A single hostname, resolving to both IPv4 and IPv6, can be used by Metal<superscript>3</superscript> to let Ironic use those addresses for binding and URL creation. This approach allows for an easy configuration and flexible behavior (both IPv4 and IPv6 remain viable at each provisioning step), but requires an infrastructure with preexisting DNS servers, IP allocations and records already in place.
es: Metal<superscript>3</superscript> puede utilizar un único nombre de host, que se resuelve tanto en IPv4 como en IPv6, para permitir que Ironic utilice esas direcciones para la vinculación y la creación de URL. Este enfoque permite una configuración sencilla y un comportamiento flexible (tanto IPv4 como IPv6 siguen siendo viables en cada paso del aprovisionamiento), pero requiere una infraestructura con servidores DNS preexistentes, asignaciones de IP y registros ya establecidos.
ja: IPv4とIPv6の両方に解決される単一のホスト名をMetal<superscript>3</superscript>で使用することで、IronicがこれらのアドレスをバインディングとURL作成に使用できるようになります。このアプローチにより、簡単な設定と柔軟な動作が可能になります(プロビジョニングの各ステップでIPv4とIPv6の両方が使用可能)。ただし、既存のDNSサーバ、IP割り当て、およびレコードがすでに設定されているインフラストラクチャが必要です。
zh_cn: Metal<superscript>3</superscript> 可以使用解析为 IPv4 和 IPv6 的单个主机名，让 Ironic 使用这些地址进行绑定和创建 URL。此方法可实现简单的配置和灵活的行为（置备的每个步骤都可使用 IPv4 和 IPv6），但要求体系结构中已存在 DNS 服务器、IP 分配和记录。

source: In both cases, Kubernetes will need to know what CIDRs to use for both IPv4 and IPv6, so you can add the following lines to your <literal>kubernetes/config/server.yaml</literal> in the EIB directory, making sure to list IPv4 first:
es: En ambos casos, Kubernetes necesitará saber qué CIDR utilizar tanto para IPv4 como para IPv6, por lo que puede añadir las siguientes líneas a su archivo <literal>kubernetes/config/server.yaml</literal> en el directorio EIB, asegurándose de añadir primero IPv4:
ja: 両方のケースで、KubernetesはIPv4とIPv6の両方に使用するCIDRを認識する必要があります。そのため、EIBディレクトリ内の<literal>kubernetes/config/server.yaml</literal>に次の行を追加できます。必ずIPv4を最初にリストしてください。
zh_cn: 无论采用哪种方式，Kubernetes 都需要知道用于 IPv4 和 IPv6 的 CIDR。因此，您可在 EIB 目录下的 <literal>kubernetes/config/server.yaml</literal> 中添加以下行，并确保 IPv4 排在前面：

source: Some containers leverage the host networking, so modify the network configuration for the host(s), under the <literal>network</literal> directory, to enable IPv6 connectivity:
es: Algunos contenedores aprovechan la red del host, por lo que debe modificar la configuración de red de los hosts, en el directorio <literal>network</literal>, para habilitar la conectividad IPv6:
ja: 一部のコンテナはホストネットワーキングを利用します。そのため、<literal>network</literal>ディレクトリの下でホストのネットワーク設定を変更して、IPv6接続を有効にします。
zh_cn: 某些容器会利用主机网络，因此需要在 <literal>network</literal> 目录下修改主机的网络配置，以启用 IPv6 连接：

source: Replace the placeholders with the gateway IP addresses, additional DNS server (if needed), the MAC address of the network interface and the the IP addressed of the management cluster. If address autoconfiguration is preferred instead, refer to the following excerpt and just set the <literal>${MGMT_MAC}</literal> variable:
es: Sustituya los marcadores de posición por las direcciones IP del gateway, el servidor DNS adicional (si fuera necesario), la dirección MAC de la interfaz de red y la dirección IP del clúster de gestión. Si prefiere la configuración automática de direcciones, consulte el siguiente apartado y establezca la variable <literal>${MGMT_MAC}</literal>:
ja: プレースホルダーをゲートウェイIPアドレス、追加のDNSサーバ(必要な場合)、ネットワークインタフェースのMACアドレス、および管理クラスタのIPアドレスで置き換えてください。代わりにアドレス自動設定を希望する場合は、以下の抜粋を参照すれば、<literal>${MGMT_MAC}</literal>変数を設定するだけで済みます。
zh_cn: 将占位符替换为网关 IP 地址、额外的 DNS 服务器（如有需要）、网络接口的 MAC 地址以及管理群集的 IP 地址。如果更喜欢使用地址自动配置，可参考以下代码，只需设置 <literal>${MGMT_MAC}</literal> 变量：

source: We can now define the remaining files for a single node configuration, starting from the first option, by creating <literal>kubernetes/helm/values/metal3.yaml</literal> as:
es: Ahora se pueden definir los archivos restantes para una configuración de un solo nodo, comenzando por la primera opción, creando <literal>kubernetes/helm/values/metal3.yaml</literal> como:
ja: 最初のオプションから開始し、<literal>kubernetes/helm/values/metal3.yaml</literal>を以下のように作成することで、単一ノード設定の残りのファイルを定義できます。
zh_cn: 现在，我们从第一种方式开始，为单节点配置定义其余文件。创建 <literal>kubernetes/helm/values/metal3.yaml</literal>，内容如下：

source: and <literal>kubernetes/helm/values/rancher.yaml</literal> as:
es: y <literal>kubernetes/helm/values/rancher.yaml</literal> como:
ja: また、<literal>kubernetes/helm/values/rancher.yaml</literal>を次のようにします。
zh_cn: 创建 <literal>kubernetes/helm/values/rancher.yaml</literal>，内容如下：

source: where <literal>${MGMT_CLUSTER_IP_V4}</literal> and <literal>${MGMT_CLUSTER_IP_V6}</literal> are the IP addresses previously assigned to the host.
es: donde <literal>${MGMT_CLUSTER_IP_V4}</literal> y <literal>${MGMT_CLUSTER_IP_V6}</literal> son las direcciones IP asignadas anteriormente al host.
ja: ここで、<literal>${MGMT_CLUSTER_IP_V4}</literal>と<literal>${MGMT_CLUSTER_IP_V6}</literal>は、ホストに以前に割り当てられたIPアドレスです。
zh_cn: 其中，<literal>${MGMT_CLUSTER_IP_V4}</literal> 和 <literal>${MGMT_CLUSTER_IP_V6}</literal> 是之前分配给主机的 IP 地址。

source: Alternatively, to use the hostname in place of the IP addresses, modify <literal>kubernetes/helm/values/metal3.yaml</literal> to:
es: Como alternativa, para usar el nombre del host en lugar de las direcciones IP, modifique <literal>kubernetes/helm/values/metal3.yaml</literal> a:
ja: または、IPアドレスの代わりにホスト名を使用するには、<literal>kubernetes/helm/values/metal3.yaml</literal>を次のように変更します。
zh_cn: 或者，如要使用主机名替代 IP 地址，可将 <literal>kubernetes/helm/values/metal3.yaml</literal> 修改为：

source: and <literal>kubernetes/helm/values/rancher.yaml</literal> to:
es: y <literal>kubernetes/helm/values/rancher.yaml</literal> a:
ja: また、<literal>kubernetes/helm/values/rancher.yaml</literal>を次のように変更します。
zh_cn: 将 <literal>kubernetes/helm/values/rancher.yaml</literal> 修改为：

source: where <literal>${MGMT_CLUSTER_HOSTNAME}</literal> should be a Fully Qualified Domain Name resolving to your host IP addresses.
es: donde <literal>${MGMT_CLUSTER_HOSTNAME}</literal> debe ser un nombre de dominio completo que se resuelva en las direcciones IP de su host.
ja: ここで、<literal>${MGMT_CLUSTER_HOSTNAME}</literal>は、ホストのIPアドレスに解決される完全修飾ドメイン名である必要があります。
zh_cn: 其中，<literal>${MGMT_CLUSTER_HOSTNAME}</literal> 应为解析为您主机 IP 地址的完全限定域名。

source: For more information visit <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/mgmt-cluster/dual-stack">SUSE Edge GitHub repository under the "dual-stack" folder</link>, where an example directory structure can be found.
es: Para obtener más información, consulte <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/mgmt-cluster/dual-stack">repositorio GitHub de SUSE Edge, en la carpeta "dual-stack"</link>, donde encontrará un ejemplo de estructura de directorios.
ja: 詳細については、<link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/mgmt-cluster/dual-stack">SUSE Edge GitHubリポジトリの「dual-stack」フォルダ</link>を参照してください。ここでディレクトリ構造の例を確認できます。
zh_cn: 有关详细信息，请访问 <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/mgmt-cluster/dual-stack">SUSE Edge GitHub 代码库的“dual-stack”文件夹</link>，其中提供了示例目录结构。

source: Telco features configuration
es: Configuración de funciones de telecomunicaciones
ja: 通信機能の設定
pt_br: Configuração dos recursos de telecomunicações
zh_cn: 电信功能配置

source: This section documents and explains the configuration of Telco-specific features on clusters deployed via SUSE Telco Cloud.
es: Esta sección documenta y explica la configuración de las funciones específicas para telecomunicaciones en clústeres desplegados mediante SUSE Telco Cloud.
ja: このセクションでは、SUSE Telco Cloudを介してデプロイされたクラスタの通信事業者固有の機能の設定について記述および説明します。
zh_cn: 本章将阐释通过 SUSE Telco Cloud 部署的群集上与电信相关的功能配置。

source: The directed network provisioning deployment method is used, as described in the Automated Provisioning (<xref linkend="atip-automated-provisioning"/>) section.
es: Se utiliza el método de despliegue de aprovisionamiento de red dirigida, descrito en la sección sobre aprovisionamiento automatizado (<xref linkend="atip-automated-provisioning"/>).
ja: ダイレクトネットワークプロビジョニングのデプロイメント方法を使用します。この方法については、自動化されたプロビジョニング(<xref linkend="atip-automated-provisioning"/>)に関するセクションで説明しています。
pt_br: O método de implantação de provisionamento de rede direcionado é usado, conforme descrito na seção sobre provisionamento automatizado (<xref linkend="atip-automated-provisioning"/>).
zh_cn: 将使用有关自动置备的一章（<xref linkend="atip-automated-provisioning"/>）中所述的定向网络置备部署方法。

source: The following topics are covered in this section:
es: En esta sección se tratan los siguientes temas:
ja: このセクションでは、次のトピックについて説明します。
pt_br: Os seguintes tópicos são abordados nesta seção:
zh_cn: 本章涵盖以下主题：

source: Kernel image for real time (<xref linkend="kernel-image-for-real-time"/>): Kernel image to be used by the real-time kernel.
es: Imagen del kernel en tiempo real (<xref linkend="kernel-image-for-real-time"/>): imagen que se usará para el kernel en tiempo real.
ja: リアルタイム用のカーネルイメージ(<xref linkend="kernel-image-for-real-time"/>): リアルタイムカーネルで使用するカーネルイメージ。
pt_br: Imagem do kernel para tempo real (<xref linkend="kernel-image-for-real-time"/>): que será usada pelo kernel Real-Time.
zh_cn: 实时内核映像（<xref linkend="kernel-image-for-real-time"/>）：实时内核使用的内核映像。

source: Kernel arguments for low latency and high performance (<xref linkend="kernel-args"/>): Kernel arguments to be used by the real-time kernel for maximum performance and low latency running telco workloads.
es: Argumentos del kernel para baja latencia y alto rendimiento (<xref linkend="kernel-args"/>): los argumentos que debe utilizar el kernel en tiempo real para conseguir el máximo rendimiento y una baja latencia al ejecutar cargas de trabajo de telecomunicaciones.
ja: 低レイテンシとハイパフォーマンスのためのカーネル引数(<xref linkend="kernel-args"/>): 通信ワークロードを最大のパフォーマンスと低レイテンシで実行するために、リアルタイムカーネルによって使用されるカーネル引数。
pt_br: Argumentos do kernel para baixa latência e alto desempenho (<xref linkend="kernel-args"/>): usados pelo kernel Real-Time para máximo desempenho e baixa latência na execução de cargas de trabalho de telecomunicações.
zh_cn: 实现低延迟和高性能需指定的内核参数（<xref linkend="kernel-args"/>）：为了在运行电信工作负载时实现最高性能和低延迟，实时内核需使用的内核参数。

source: CPU Pinning via Tuned and kernel args (<xref linkend="cpu-tuned-configuration"/>): Isolating the CPUs via kernel arguments and Tuned profile.
es: Fijación de CPU mediante Tuned y argumentos del kernel (<xref linkend="cpu-tuned-configuration"/>): aislamiento de las CPU mediante argumentos del kernel y el perfil Tuned.
ja: Tunedとカーネル引数によるCPUピニング(<xref linkend="cpu-tuned-configuration"/>): カーネル引数とTunedプロファイルを使用してCPUを分離します。
pt_br: Fixação de CPU via TuneD e argumentos do kernel (<xref linkend="cpu-tuned-configuration"/>): isolamento de CPUs por meio de argumentos do kernel e perfil do TuneD.
zh_cn: 通过 Tuned 和内核参数实现 CPU 绑定（<xref linkend="cpu-tuned-configuration"/>）：通过内核参数和 Tuned 配置文件隔离 CPU。

source: CNI configuration (<xref linkend="cni-configuration"/>): CNI configuration to be used by the Kubernetes cluster.
es: Configuración de la CNI (<xref linkend="cni-configuration"/>): la configuración de la CNI que usará el clúster de Kubernetes.
ja: CNI設定(<xref linkend="cni-configuration"/>): Kubernetesクラスタで使用するCNI設定。
pt_br: Configuração da CNI (<xref linkend="cni-configuration"/>): usada pelo cluster Kubernetes.
zh_cn: CNI 配置（<xref linkend="cni-configuration"/>）：Kubernetes 群集使用的 CNI 配置。

source: SR-IOV configuration (<xref linkend="sriov"/>): SR-IOV configuration to be used by the Kubernetes workloads.
es: Configuración de SR-IOV (<xref linkend="sriov"/>): la configuración de SR-IOV que usarán las cargas de trabajo de Kubernetes.
ja: SR-IOV設定(<xref linkend="sriov"/>): Kubernetesワークロードで使用するSR-IOV設定。
pt_br: Configuração do SR-IOV (<xref linkend="sriov"/>): usada pelas cargas de trabalho Kubernetes.
zh_cn: SR-IOV 配置（<xref linkend="sriov"/>）：Kubernetes 工作负载使用的 SR-IOV 配置。

source: DPDK configuration (<xref linkend="dpdk"/>): DPDK configuration to be used by the system.
es: Configuración de DPDK (<xref linkend="dpdk"/>): la configuración de DPDK que usará el sistema.
ja: DPDK設定(<xref linkend="dpdk"/>): システムで使用するDPDK設定。
pt_br: Configuração do DPDK (<xref linkend="dpdk"/>): usada pelo sistema.
zh_cn: DPDK 配置（<xref linkend="dpdk"/>）：系统使用的 DPDK 配置。

source: vRAN acceleration card (<xref linkend="acceleration"/>): Acceleration card configuration to be used by the Kubernetes workloads.
es: Tarjeta de aceleración vRAN (<xref linkend="acceleration"/>): configuración de la tarjeta de aceleración que usarán las cargas de trabajo de Kubernetes.
ja: vRANアクセラレーションカード(<xref linkend="acceleration"/>): Kubernetesワークロードで使用するアクセラレーションカードの設定。
pt_br: Placa aceleradora vRAN (<xref linkend="acceleration"/>): configuração da placa aceleradora usada pelas cargas de trabalho Kubernetes.
zh_cn: vRAN 加速卡（<xref linkend="acceleration"/>）：Kubernetes 工作负载使用的加速卡配置。

source: Huge pages (<xref linkend="huge-pages"/>): Huge pages configuration to be used by the Kubernetes workloads.
es: Páginas enormes (<xref linkend="huge-pages"/>): configuración de páginas enormes (huge) que usarán las cargas de trabajo de Kubernetes.
ja: Huge Page (<xref linkend="huge-pages"/>): Kubernetesワークロードで使用するHuge Pageの設定。
pt_br: HugePages (<xref linkend="huge-pages"/>): configuração do HugePages usada pelas cargas de trabalho Kubernetes.
zh_cn: 大页（<xref linkend="huge-pages"/>）：Kubernetes 工作负载使用的大页配置。

source: CPU pinning on Kubernetes (<xref linkend="cpu-pinning-kubernetes"/>): Configuring Kubernetes and the applications to leverage CPU pinning.
es: Fijación de CPU en Kubernetes (<xref linkend="cpu-pinning-kubernetes"/>): configuración de Kubernetes y las aplicaciones para aprovechar la fijación de CPU.
ja: KubernetesでのCPUピニング(<xref linkend="cpu-pinning-kubernetes"/>): CPUピニングを活用するようにKubernetesとアプリケーションを設定する。
pt_br: Fixação de CPU no Kubernetes (<xref linkend="cpu-pinning-kubernetes"/>): configuração do Kubernetes e de aplicativos para aproveitar a fixação de CPU.
zh_cn: Kubernetes 上的 CPU 绑定（<xref linkend="cpu-pinning-kubernetes"/>）：配置 Kubernetes 和应用程序以利用 CPU 绑定的优势。

source: NUMA-aware scheduling configuration (<xref linkend="numa-aware-scheduling"/>): NUMA-aware scheduling configuration to be used by the Kubernetes workloads.
es: Configuración de programación compatible con NUMA (<xref linkend="numa-aware-scheduling"/>): configuración de programación compatible con NUMA que usarán las cargas de trabajo de Kubernetes.
ja: NUMA対応のスケジューリング設定(<xref linkend="numa-aware-scheduling"/>): Kubernetesワークロードで使用するNUMA対応のスケジューリング設定。
pt_br: Configuração da programação com reconhecimento de NUMA (<xref linkend="numa-aware-scheduling"/>): usada pelas cargas de trabalho Kubernetes.
zh_cn: 可感知 NUMA 的调度配置（<xref linkend="numa-aware-scheduling"/>）：Kubernetes 工作负载使用的可感知 NUMA 的调度配置。

source: Metal LB configuration (<xref linkend="metal-lb-configuration"/>): Metal LB configuration to be used by the Kubernetes workloads.
es: Configuración de MetalLB (<xref linkend="metal-lb-configuration"/>): configuración de MetalLB que usarán las cargas de trabajo de Kubernetes.
ja: Metal LB設定(<xref linkend="metal-lb-configuration"/>): Kubernetesワークロードで使用するMetal LB設定。
pt_br: Configuração do Metal LB (<xref linkend="metal-lb-configuration"/>): usada pelas cargas de trabalho Kubernetes.
zh_cn: MetalLB 配置（<xref linkend="metal-lb-configuration"/>）：Kubernetes 工作负载使用的 MetalLB 配置。

source: Private registry configuration (<xref linkend="private-registry"/>): Private registry configuration to be used by the Kubernetes workloads.
es: Configuración del registro privado (<xref linkend="private-registry"/>): configuración del registro privado que usarán las cargas de trabajo de Kubernetes.
ja: プライベートレジストリ設定(<xref linkend="private-registry"/>): Kubernetesワークロードで使用するプライベートレジストリ設定。
pt_br: Configuração do registro particular (<xref linkend="private-registry"/>): usada pelas cargas de trabalho Kubernetes.
zh_cn: 专用仓库配置（<xref linkend="private-registry"/>）：Kubernetes 工作负载使用的专用仓库配置。

source: Precision Time Protocol configuration (<xref linkend="ptp-configuration"/>): Configuration files for running PTP telco profiles.
es: Configuración del protocolo de tiempo de precisión (<xref linkend="ptp-configuration"/>): archivos de configuración para ejecutar perfiles PTP de telecomunicaciones.
ja: Precision Time Protocolの設定(<xref linkend="ptp-configuration"/>): 実行中のPTP通信事業者プロファイルの設定ファイル。
pt_br: Configuração do Precision Time Protocol (<xref linkend="ptp-configuration"/>): arquivos de configuração para execução de perfis de telecomunicações PTP.
zh_cn: 精确时间协议配置（<xref linkend="ptp-configuration"/>）：用于运行电信行业 PTP 配置的配置文件。

source: Kernel image for real time
es: Imagen del kernel en tiempo real
ja: リアルタイム用のカーネルイメージ
pt_br: Imagem do kernel para tempo real
zh_cn: 实时内核映像
