Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Upgrade Controller (<xref linkend="components-upgrade-controller"/>)
pt_br: Controller de upgrade (<xref linkend="components-upgrade-controller"/>)
zh_cn: 升级控制器（<xref linkend="components-upgrade-controller"/>）

source: Quick Starts
es: Guías de inicio rápido
ja: クイックスタート
pt_br: Guias de início rápido
zh_cn: 快速入门

source: Quick Starts here
es: Aquí están las guías de inicio rápido
ja: クイックスタートはこちら
pt_br: Estes são os guias de início rápido
zh_cn: 从这里快速入门

source: BMC automated deployments with Metal<superscript>3</superscript>
es: Despliegues automatizados de BMC con Metal<superscript>3</superscript>
ja: Metal<superscript>3</superscript>を使用したBMCの自動デプロイメント
pt_br: Implantações automatizadas de BMC com Metal<superscript>3</superscript>
zh_cn: 使用 Metal<superscript>3</superscript> 实现 BMC 自动化部署

source: Metal<superscript>3</superscript> is a <link xl:href="https://metal3.io/">CNCF project</link> which provides bare-metal infrastructure management capabilities for Kubernetes.
es: Metal<superscript>3</superscript> es un <link xl:href="https://metal3.io/">projecto de la CNCF</link> que proporciona capacidades de gestión de infraestructura bare metal para Kubernetes.
ja: Metal<superscript>3</superscript>は、Kubernetesにベアメタルインフラストラクチャ管理機能を提供する<link xl:href="https://metal3.io/">CNCFプロジェクト</link>です。
pt_br: Metal<superscript>3</superscript> é um <link xl:href="https://metal3.io/">projeto da CNCF</link> que oferece recursos de gerenciamento de infraestrutura bare metal para Kubernetes.
zh_cn: Metal<superscript>3</superscript> 是一个 <link xl:href="https://metal3.io/">CNCF 项目</link>，它为 Kubernetes 提供裸机基础架构管理功能。

source: Metal<superscript>3</superscript> provides Kubernetes-native resources to manage the lifecycle of bare-metal servers which support management via out-of-band protocols such as <link xl:href="https://www.dmtf.org/standards/redfish">Redfish</link>.
es: Metal<superscript>3</superscript> ofrece recursos nativos de Kubernetes para gestionar el ciclo de vida de los servidores bare metal que admiten la gestión a través de protocolos fuera de banda, como <link xl:href="https://www.dmtf.org/standards/redfish">Redfish</link>.
ja: Metal<superscript>3</superscript>は、<link xl:href="https://www.dmtf.org/standards/redfish">Redfish</link>などのアウトオブバンドプロトコルを介した管理をサポートするベアメタルサーバのライフサイクルを管理するためのKubernetesネイティブリソースを提供します。
pt_br: O Metal<superscript>3</superscript> inclui recursos nativos do Kubernetes para gerenciar o ciclo de vida de servidores bare metal que suportam gerenciamento com protocolos fora da banda, como o <link xl:href="https://www.dmtf.org/standards/redfish">Redfish</link>.
zh_cn: Metal<superscript>3</superscript> 提供 Kubernetes 原生资源来管理裸机服务器的生命周期，支持通过 <link xl:href="https://www.dmtf.org/standards/redfish">Redfish</link> 等带外协议进行管理。

source: It also has mature support for <link xl:href="https://cluster-api.sigs.k8s.io/">Cluster API (CAPI)</link> which enables management of infrastructure resources across multiple infrastructure providers via broadly adopted vendor-neutral APIs.
es: También cuenta con un soporte maduro para <link xl:href="https://cluster-api.sigs.k8s.io/">Cluster API (CAPI)</link> que permite la gestión de recursos de infraestructura a través de múltiples proveedores de infraestructura mediante API ampliamente adoptadas y neutrales con respecto a los proveedores.
ja: また、<link xl:href="https://cluster-api.sigs.k8s.io/">Cluster API (CAPI)</link>も十分にサポートされており、広く採用されているベンダニュートラルなAPIを使用して、複数のインフラストラクチャプロバイダにわたってインフラストラクチャリソースを管理できます。
pt_br: Ele também conta com suporte a <link xl:href="https://cluster-api.sigs.k8s.io/">Cluster API (CAPI)</link>, que permite gerenciar os recursos da infraestrutura de vários provedores por meio de APIs amplamente adotadas e independentes de fornecedor.
zh_cn: 它还为 <link xl:href="https://cluster-api.sigs.k8s.io/">Cluster API (CAPI)</link> 提供成熟的支持，允许通过广泛采用的不限供应商的 API 来管理跨多个基础架构提供商的基础架构资源。

source: Why use this method
es: Por qué usar este método
ja: この方法を使用する理由
pt_br: Por que usar este método
zh_cn: 为何使用此方法

source: This method is useful for scenarios where the target hardware supports out-of-band management, and a fully automated infrastructure management flow is desired.
es: Este método es útil para situaciones en las que el hardware de destino admite la gestión fuera de banda y se desea un flujo de gestión de la infraestructura totalmente automatizado.
ja: この方法は、ターゲットハードウェアがアウトオブバンド管理をサポートしていて、完全に自動化されたインフラストラクチャ管理フローが望まれるシナリオで役立ちます。
pt_br: Este método é útil em cenários com hardware de destino que permite o gerenciamento fora da banda e quando se deseja um fluxo de gerenciamento de infraestrutura automatizado.
zh_cn: 此方法非常适合用于目标硬件支持带外管理，并且需要全自动化基础架构管理流程的场景。

source: A management cluster is configured to provide declarative APIs that enable inventory and state management of downstream cluster bare-metal servers, including automated inspection, cleaning and provisioning/deprovisioning.
es: Se configura un clúster de gestión para proporcionar API declarativas que permitan la gestión del inventario y el estado de los servidores bare metal del clúster descendente, incluida la inspección, limpieza y aprovisionamiento/desaprovisionamiento automatizados.
ja: 管理クラスタは宣言型APIを提供するように設定されており、このAPIによってダウンストリームクラスタのベアメタルサーバのインベントリと状態を管理できます。これには、自動検査、クリーニング、プロビジョニング/プロビジョニング解除も含まれます。
pt_br: O cluster de gerenciamento é configurado para oferecer APIs declarativas que permitem o gerenciamento de inventário e de estado dos servidores bare metal do cluster downstream, incluindo inspeção automatizada, limpeza e provisionamento/desprovisionamento.
zh_cn: 管理群集配置为提供声明性 API 来对下游群集裸机服务器进行清单和状态管理，包括自动检查、清理和置备/取消置备。

source: High-level architecture
es: Arquitectura general
ja: 高レベルアーキテクチャ
pt_br: Arquitetura de alto nível
zh_cn: 总体体系结构

source: quickstart metal3 architecture
es: inicio rápido de la arquitectura de metal3
ja: クイックスタートmetal3アーキテクチャ
pt_br: início rápido da arquitetura do metal3
zh_cn: metal3 体系结构快速入门

source: Prerequisites
es: Requisitos previos
ja: 前提条件
pt_br: Pré-requisitos
zh_cn: 先决条件

source: There are some specific constraints related to the downstream cluster server hardware and networking:
es: Existen algunas restricciones específicas relacionadas con el hardware y la red del servidor del clúster descendente:
ja: ダウンストリームクラスタのサーバハードウェアとネットワーキングに関連する固有の制約がいくつかあります。
pt_br: Há algumas restrições específicas relacionadas ao hardware e à rede de servidor do cluster downstream:
zh_cn: 下游群集服务器硬件和网络相关的限制具体如下所述：

source: Management cluster
es: Clúster de gestión
ja: 管理クラスタ
pt_br: Cluster de gerenciamento
zh_cn: 管理群集

source: Must have network connectivity to the target server management/BMC API
es: Debe tener conectividad de red con la API de gestión/BMC del servidor de destino
ja: ターゲットサーバ管理/BMC APIへのネットワーク接続が必要
pt_br: É preciso ter conectividade de rede com a API de gerenciamento/BMC do servidor de destino
zh_cn: 必须与目标服务器管理/BMC API 建立网络连接

source: Must have network connectivity to the target server control plane network
es: Debe tener conectividad de red con la red del plano de control del servidor de destino
ja: ターゲットサーバのコントロールプレーンネットワークへのネットワーク接続が必要
pt_br: É preciso ter conectividade com a rede do plano de controle do servidor de destino
zh_cn: 必须与目标服务器控制平面网络建立网络连接

source: For multi-node management clusters, an additional reserved IP address is required
es: Para clústeres de gestión de varios nodos, se requiere una dirección IP reservada adicional
ja: マルチノード管理クラスタの場合、追加の予約済みIPアドレスが必要
pt_br: Para clusters de gerenciamento de vários nós, é necessário um endereço IP reservado adicional
zh_cn: 对于多节点管理群集，需要配置额外的预留 IP 地址

source: Hosts to be controlled
es: Hosts que se van a controlar
ja: 制御対象ホスト
pt_br: Hosts para serem controlados
zh_cn: 要控制的主机

source: Must support out-of-band management via Redfish, iDRAC or iLO interfaces
es: Deben admitir la gestión fuera de banda mediante interfaces Redfish, iDRAC o iLO
ja: Redfish、iDRAC、またはiLOのインタフェースを介したアウトオブバンド管理のサポートが必要
pt_br: É preciso ter suporte a gerenciamento fora da banda pelas interfaces do Redfish, iDRAC ou iLO
zh_cn: 必须支持通过 Redfish、iDRAC 或 iLO 接口进行带外管理

source: Must support deployment via virtual media (PXE is not currently supported)
es: Deben admitir el despliegue mediante medios virtuales (actualmente no se admite PXE)
ja: 仮想メディアを使用したデプロイメントのサポートが必要(PXEは現在サポートされていない)
pt_br: É preciso ter suporte à implantação por mídia virtual (não há suporte a PXE no momento)
zh_cn: 必须支持通过虚拟媒体进行部署（目前不支持 PXE）

source: Must have network connectivity to the management cluster for access to the Metal<superscript>3</superscript> provisioning APIs
es: Deben tener conectividad de red con el clúster de gestión para acceder a las API de aprovisionamiento de Metal<superscript>3</superscript>
ja: Metal<superscript>3</superscript>プロビジョニングAPIにアクセスするために管理クラスタへのネットワーク接続が必要
pt_br: É preciso ter conectividade de rede com o cluster de gerenciamento para acessar as APIs de provisionamento do Metal<superscript>3</superscript>
zh_cn: 必须与管理群集建立网络连接，以便能够访问 Metal<superscript>3</superscript> 置备 API

source: Some tools are required, these can be installed either on the management cluster, or on a host which can access it.
es: Se requieren algunas herramientas, que se pueden instalar en el clúster de gestión o en un host que pueda acceder a él.
ja: ツールがいくつか必要です。ツールは管理クラスタにインストールするか、管理クラスタにアクセス可能なホストにインストールできます。
pt_br: Algumas ferramentas são necessárias e podem ser instaladas no cluster de gerenciamento ou em um host que possa acessá-lo.
zh_cn: 需要安装一些工具，可以安装在管理群集上，也可以安装在能够访问管理群集的主机上。

source: <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>, <link xl:href="https://helm.sh">Helm</link> and <link xl:href="https://cluster-api.sigs.k8s.io/user/quick-start.html#install-clusterctl">Clusterctl</link>
es: <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>, <link xl:href="https://helm.sh">Helm</link> y <link xl:href="https://cluster-api.sigs.k8s.io/user/quick-start.html#install-clusterctl">Clusterctl</link>
ja: <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>、<link xl:href="https://helm.sh">Helm</link>、および<link xl:href="https://cluster-api.sigs.k8s.io/user/quick-start.html#install-clusterctl">Clusterctl</link>
pt_br: <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>, <link xl:href="https://helm.sh">Helm</link> e <link xl:href="https://cluster-api.sigs.k8s.io/user/quick-start.html#install-clusterctl">Clusterctl</link>
zh_cn: <link xl:href="https://kubernetes.io/docs/reference/kubectl/kubectl/">Kubectl</link>、<link xl:href="https://helm.sh">Helm</link> 和 <link xl:href="https://cluster-api.sigs.k8s.io/user/quick-start.html#install-clusterctl">Clusterctl</link>

source: A container runtime such as <link xl:href="https://podman.io">Podman</link> or <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>
es: Un entorno de ejecución de contenedores como <link xl:href="https://podman.io">Podman</link> o <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>
ja: <link xl:href="https://podman.io">Podman</link>や<link xl:href="https://rancherdesktop.io">Rancher Desktop</link>などのコンテナランタイム
pt_br: Um tempo de execução do contêiner, como <link xl:href="https://podman.io">Podman</link> ou <link xl:href="https://rancherdesktop.io">Rancher Desktop</link>
zh_cn: <link xl:href="https://podman.io">Podman</link> 或 <link xl:href="https://rancherdesktop.io">Rancher Desktop</link> 等容器运行时

source: The <literal>SL-Micro.x86_64-6.1-Base-GM.raw</literal> OS image file must be downloaded from the <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> or the <link xl:href="https://www.suse.com/download/sle-micro/">SUSE Download page</link>.
es: El archivo de imagen de sistema operativo <literal>SL-Micro.x86_64-6.1-Base-GM.raw</literal> se debe descargar del <link xl:href="https://scc.suse.com/">Centro de servicios al cliente de SUSE</link> o de la <link xl:href="https://www.suse.com/download/sle-micro/">página de descargas de SUSE</link>.
ja: <literal>SL-Micro.x86_64-6.1-Base-GM.raw</literal> OSイメージファイルは<link xl:href="https://scc.suse.com/">SUSE Customer Center</link>または<link xl:href="https://www.suse.com/download/sle-micro/">SUSEダウンロードページ</link>からダウンロードする必要があります。
pt_br: Faça download do arquivo de imagem de sistema operacional <literal>SL-Micro.x86_64-6.1-Base-GM.raw</literal> pelo <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> ou pela <link xl:href="https://www.suse.com/download/sle-micro/">página de download da SUSE</link>.
zh_cn: <literal>SL-Micro.x86_64-6.1-Base-GM.raw</literal> 操作系统映像文件必须从 <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> 或 <link xl:href="https://www.suse.com/download/sle-micro/">SUSE 下载页面</link>下载。

source: Deployment
es: Despliegue
ja: デプロイメント
pt_br: Implantação
zh_cn: 部署

source: Setup Management Cluster
es: Configuración del clúster de gestión
ja: 管理クラスタのセットアップ
pt_br: Configurar o cluster de gerenciamento
zh_cn: 设置管理群集

source: The basic steps to install a management cluster and use Metal<superscript>3</superscript> are:
es: Los pasos básicos para instalar un clúster de gestión y usar Metal<superscript>3</superscript> son:
ja: 管理クラスタをインストールし、Metal<superscript>3</superscript>を使用する基本的な手順は次のとおりです。
pt_br: As etapas básicas de instalação de um cluster de gerenciamento e uso do Metal<superscript>3</superscript> são:
zh_cn: 安装管理群集和使用 Metal<superscript>3</superscript> 的基本步骤如下：

source: Install an RKE2 management cluster
es: Instalar un clúster de gestión RKE2
ja: RKE2管理クラスタをインストールします。
pt_br: Instalar um cluster de gerenciamento RKE2
zh_cn: 安装 RKE2 管理群集

source: Install Rancher
es: Instalar Rancher
ja: Rancherのインストール
pt_br: Instalar o Rancher
zh_cn: 安装 Rancher

source: Install a storage provider (optional)
es: Instalar un proveedor de almacenamiento (opcional)
ja: ストレージプロバイダをインストールします(オプション)。
pt_br: Instalar um provedor de armazenamento (opcional)
zh_cn: 安装存储服务提供程序（可选）

source: Install the Metal<superscript>3</superscript> dependencies
es: Instalar las dependencias de Metal<superscript>3</superscript>
ja: Metal<superscript>3</superscript>の依存関係をインストールします。
pt_br: Instalar as dependências do Metal<superscript>3</superscript>
zh_cn: 安装 Metal<superscript>3</superscript> 依赖项

source: Install CAPI dependencies via Rancher Turtles
es: Instalar las dependencias de CAPI mediante Rancher Turtles
ja: Rancher Turtles経由でCAPIの依存関係をインストールします。
pt_br: Instalar as dependências da CAPI pelo Rancher Turtles
zh_cn: 通过 Rancher Turtles 安装 CAPI 依赖项

source: Build a SLEMicro OS image for downstream cluster hosts
es: Crear una imagen del sistema operativo SLEMicro para los hosts del clúster descendente
ja: ダウンストリームクラスタホスト用のSLEMicro OSイメージを構築します。
pt_br: Criar uma imagem do sistema operacional SLEMicro para hosts do cluster downstream
zh_cn: 为下游群集主机构建 SLEMicro 操作系统映像

source: Register BareMetalHost CRs to define the bare-metal inventory
es: Registrar los CR de BareMetalHost para definir el inventario de bare metal
ja: BareMetalHost CRを登録し、ベアメタルのインベントリを定義します。
pt_br: Registrar CRs de BareMetalHost para definir o inventário de bare metal
zh_cn: 注册 BareMetalHost CR 以定义裸机清单

source: Create a downstream cluster by defining CAPI resources
es: Crear un clúster descendente definiendo los recursos de CAPI
ja: CAPIリソースを定義して、ダウンストリームクラスタを作成します。
pt_br: Criar um cluster downstream definindo recursos da CAPI
zh_cn: 通过定义 CAPI 资源创建下游群集

source: This guide assumes an existing RKE2 cluster and Rancher (including cert-manager) has been installed, for example by using Edge Image Builder (<xref linkend="components-eib"/>).
es: En esta guía se entiende que ya existe un clúster RKE2 y que se ha instalado Rancher (incluido cert-manager), por ejemplo, utilizando Edge Image Builder (<xref linkend="components-eib"/>).
ja: このガイドでは、既存のRKE2クラスタとRancher (cert-managerを含む)が、たとえばEdge Image Builder (<xref linkend="components-eib"/>)を使用してインストールされていることを前提としています。
pt_br: Este guia considera que já existe um cluster RKE2 e que o Rancher (incluindo o cert-manager) foi instalado, por exemplo, usando o Edge Image Builder (<xref linkend="components-eib"/>).
zh_cn: 本指南假设已安装现有的 RKE2 群集和 Rancher（包括 cert-manager），例如已使用 Edge Image Builder 安装（<xref linkend="components-eib"/>）。

source: The steps here can also be fully automated as described in the Management Cluster Documentation (<xref linkend="atip-management-cluster"/>).
es: Estos pasos también se pueden automatizar por completo, como se describe en la documentación sobre el clúster de gestión (<xref linkend="atip-management-cluster"/>).
ja: ここでの手順は、管理クラスタのドキュメント(<xref linkend="atip-management-cluster"/>)で説明されているように、完全に自動化することもできます。
pt_br: Estas etapas também podem ser totalmente automatizadas conforme descrito na documentação do cluster de gerenciamento (<xref linkend="atip-management-cluster"/>).
zh_cn: 也可以按照管理群集文档（<xref linkend="atip-management-cluster"/>）中所述，将此处所述的步骤完全自动化。

source: Installing Metal<superscript>3</superscript> dependencies
es: Instalación de las dependencias de Metal<superscript>3</superscript>
ja: Metal<superscript>3</superscript>の依存関係のインストール
pt_br: Instalando as dependências do Metal<superscript>3</superscript>
zh_cn: 安装 Metal<superscript>3</superscript> 依赖项

source: If not already installed as part of the Rancher installation, cert-manager must be installed and running.
es: Si aún no se ha hecho como parte de la instalación de Rancher, se debe instalar y ejecutar cert-manager.
ja: cert-managerがまだRancherのインストールの一部としてインストールされていない場合は、cert-managerをインストールして実行する必要があります。
pt_br: O cert-manager deve ser instalado e executado caso não tenha sido junto com a instalação do Rancher.
zh_cn: 必须安装并运行 cert-manager（如果在安装 Rancher 的过程中未安装）。

source: A persistent storage provider must be installed. SUSE Storage is recommended but <literal>local-path-provisioner</literal> can also be used for dev/PoC environments. The instructions below assume a StorageClass has been <link xl:href="https://kubernetes.io/docs/tasks/administer-cluster/change-default-storage-class/">marked as default</link>, otherwise additional configuration for the Metal<superscript>3</superscript> chart is required.
es: Se debe instalar un proveedor de almacenamiento persistente. Se recomienda SUSE Storage, pero también se puede utilizar <literal>local-pathprovisioner</literal> para entornos de desarrollo/PoC. Las instrucciones siguientes dan por sentado que se ha <link xl:href="https://kubernetes.io/docs/tasks/administer-cluster/change-default-storage-class/">marcado una StorageClass como predeterminada</link>; de lo contrario, se requiere una configuración adicional para el chart de Metal<superscript>3</superscript>.
ja: 永続ストレージプロバイダをインストールする必要があります。SUSE Storageを推奨しますが、開発/PoC環境では<literal>local-path-provisioner</literal>を使用することもできます。以下の手順は、StorageClassが<link xl:href="https://kubernetes.io/docs/tasks/administer-cluster/change-default-storage-class/">デフォルトとしてマーク</link>されていることを前提としています。マークされていない場合は、Metal<superscript>3</superscript>チャートに追加の設定が必要です。
pt_br: É necessário instalar um provedor de armazenamento persistente. O SUSE Storage é recomendado, mas também é possível usar o <literal>local-path-provisioner</literal> em ambientes de desenvolvimento/PoC. A instrução abaixo considera que StorageClass foi <link xl:href="https://kubernetes.io/docs/tasks/administer-cluster/change-default-storage-class/">marcada como padrão</link>; do contrário, será necessária uma configuração adicional para o gráfico do Metal<superscript>3</superscript>.
zh_cn: 必须安装持久性存储提供程序。建议使用 SUSE Storage，但对于开发/PoC 环境，也可以使用 <literal>local-path-provisioner</literal>。以下说明假设已将 StorageClass <link xl:href="https://kubernetes.io/docs/tasks/administer-cluster/change-default-storage-class/">标记为默认值</link>，否则需要对 Metal<superscript>3</superscript> chart 进行额外的配置。

source: An additional IP is required, which is managed by <link xl:href="https://metallb.universe.tf/">MetalLB</link> to provide a consistent endpoint for the Metal<superscript>3</superscript> management services. This IP must be part of the control plane subnet and reserved for static configuration (not part of any DHCP pool).
es: Se requiere una IP adicional, gestionada por <link xl:href="https://metallb.universe.tf/">MetalLB</link> para proporcionar un punto final coherente para los servicios de gestión de Metal<superscript>3</superscript>. Esta IP debe formar parte de la subred del plano de control y estar reservada para la configuración estática (no debe formar parte de ningún grupo DHCP).
ja: 追加のIPが必要です。このIPは<link xl:href="https://metallb.universe.tf/">MetalLB</link>によって管理され、Metal<superscript>3</superscript>管理サービスに一貫したエンドポイントを提供します。このIPは、コントロールプレーンサブネットに属していて、静的設定用に予約されている必要があります(どのDHCPプールにも属していてはなりません)。
pt_br: Um IP adicional é necessário, que pode ser gerenciado por <link xl:href="https://metallb.universe.tf/">MetalLB</link> para fornecer um endpoint consistente aos serviços de gerenciamento do Metal<superscript>3</superscript>. Esse IP deve fazer parte da sub-rede do plano de controle e ser reservado para configuração estática (e não fazer parte de um pool DHCP).
zh_cn: 需要提供一个额外的 IP，该 IP 由 <link xl:href="https://metallb.universe.tf/">MetalLB</link> 管理，用于为 Metal<superscript>3</superscript> 管理服务提供一致的端点。此 IP 必须是控制平面子网的一部分，并且为静态配置预留（不是任何 DHCP 池的一部分）。

source: If the management cluster is a single node, the requirement for an additional floating IP managed via MetalLB can be avoided, see <xref linkend="id-single-node-configuration"/>
es: Si el clúster de gestión es un solo nodo, no es necesario contar con una IP fleetnte adicional gestionada mediante MetalLB. Consulte la <xref linkend="id-single-node-configuration"/>.
ja: 管理クラスタがシングルノードである場合、MetalLBを介して管理されるフローティングIPを追加する必要はありません。<xref linkend="id-single-node-configuration"/>を参照してください。
pt_br: Se o cluster de gerenciamento é um nó único, é possível evitar o requisito de IP flutuante adicional gerenciado por MetalLB. Consulte a <xref linkend="id-single-node-configuration"/>.
zh_cn: 如果管理群集仅包含单个节点，则可以避免通过 MetalLB 管理额外的浮动 IP，具体参见<xref linkend="id-single-node-configuration"/>

source: First, we install MetalLB:
es: Primero, se instala MetalLB:
ja: まず、MetalLBをインストールします。
pt_br: Vamos instalar primeiro o MetalLB:
zh_cn: 首先，我们需要安装 MetalLB：

source: Then we define an <literal>IPAddressPool</literal> and <literal>L2Advertisement</literal> using the reserved IP, defined as <literal>STATIC_IRONIC_IP</literal> below:
es: Luego, se definen <literal>IPAddressPool</literal> y <literal>L2Advertisement</literal> con la IP reservada, definida como <literal>STATIC_IRONIC_IP</literal> a continuación:
ja: 続いて、次のように、<literal>STATIC_IRONIC_IP</literal>として定義された予約済みIPを使用して 、<literal>IPAddressPool</literal>と <literal>L2Advertisement</literal>を定義します。
pt_br: Na sequência, definimos um <literal>IPAddressPool</literal> e <literal>L2Advertisement</literal> usando o IP reservado, especificado abaixo como <literal>STATIC_IRONIC_IP</literal>:
zh_cn: 然后使用预留 IP 来定义 <literal>IPAddressPool</literal> 和 <literal>L2Advertisement</literal>（如下方的 <literal>STATIC_IRONIC_IP</literal> 所定义）：

source: Now Metal<superscript>3</superscript> can be installed:
es: Ya se puede instalar Metal<superscript>3</superscript>:
ja: これでMetal<superscript>3</superscript>をインストールできます。
pt_br: Agora é possível instalar o Metal<superscript>3</superscript>:
zh_cn: 现在可以安装 Metal<superscript>3</superscript>：
