Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Make sure that the version of the fleet-cli you download matches the version of Fleet that has been deployed on your cluster.
es: Asegúrese de que la versión de fleet-cli que descargue coincida con la versión de Fleet que se ha desplegado en su clúster.
ja: ダウンロードしたfleet-cliのバージョンが、クラスタにデプロイされているFleetのバージョンと一致していることを確認してください。
pt_br: Garanta que a versão do fleet-cli do download seja a mesma do Fleet que foi implantado em seu cluster.
zh_cn: 确保您下载的 fleet-cli 版本与群集上部署的 Fleet 版本匹配。

source: For Mac users there is a <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulae.
es: Para usuarios de Mac, hay una versión propia de <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.
ja: Macユーザの場合、<link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulaeがあります。
pt_br: Para usuários do Mac, existe um Homebrew Formulae <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link>.
zh_cn: 对于 Mac 用户，有一个 <link xl:href="https://formulae.brew.sh/formula/fleet-cli">fleet-cli</link> Homebrew Formulae。

source: For Linux and Windows users the binaries are present as <emphasis role="strong">assets</emphasis> to each Fleet <link xl:href="https://github.com/rancher/fleet/releases">release</link>.
es: Para usuarios de Linux y Windows, los binarios son <emphasis role="strong">recursos</emphasis> distintos para cada <link xl:href="https://github.com/rancher/fleet/releases">versión</link> de Fleet.
ja: LinuxおよびWindowsユーザの場合、Fleet<link xl:href="https://github.com/rancher/fleet/releases">リリース</link>ごとに<emphasis role="strong">アセット</emphasis>としてバイナリが存在します。
pt_br: Para usuários do Linux e Windows, os binários estão presentes como <emphasis role="strong">ativos</emphasis> para cada <link xl:href="https://github.com/rancher/fleet/releases">versão</link> do Fleet.
zh_cn: 对于 Linux 和 Windows 用户，每个 Fleet <link xl:href="https://github.com/rancher/fleet/releases">版本</link>都会有作为<emphasis role="strong">资产</emphasis>存在的二进制文件。

source: Make <literal>fleet-cli</literal> executable:
es: Permita que <literal>fleet-cli</literal> se pueda ejecutar:
ja: <literal>fleet-cli</literal>を実行可能にします。
pt_br: Torne o <literal>fleet-cli</literal> executável:
zh_cn: 将 <literal>fleet-cli</literal> 设为可执行文件：

source: Clone the <literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/releases">release</link> that you wish to use:
es: Clone la <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versión</link> de <literal>suse-edge/fleet-examples</literal> que desee usar:
ja: 使用する<literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/releases">リリース</link>のクローンを作成します。
pt_br: Clone a <link xl:href="https://github.com/suse-edge/fleet-examples/releases">versão</link> do <literal>suse-edge/fleet-examples</literal> que deseja usar:
zh_cn: 克隆您要使用的 <literal>suse-edge/fleet-examples</literal> <link xl:href="https://github.com/suse-edge/fleet-examples/releases">版本</link>：

source: Navigate to the SUC fleet, located in the <literal>fleet-examples</literal> repo:
es: Diríjase a la instancia de Fleet de SUC, situada en el repositorio <literal>fleet-examples</literal>:
ja: <literal>fleet-examples</literal>リポジトリにある、SUC Fleetに移動します。
pt_br: Navegue até a instância do Fleet do SUC, localizada no repositório <literal>fleet-examples</literal>:
zh_cn: 导航到 <literal>fleet-examples</literal> 储存库中的 SUC Fleet：

source: Determine on which clusters you want to deploy SUC. This is done by deploying the SUC Bundle in the correct Fleet workspace inside your management cluster. By default, Fleet has two workspaces:
es: Determine en qué clústeres desea desplegar SUC. Para ello, despliegue el Bundle de SUC en el espacio de trabajo correcto de Fleet dentro de su clúster de gestión. De forma predeterminada, Fleet tiene dos espacios de trabajo:
ja: SUCをデプロイするクラスタを決定します。これは、管理クラスタ内の適切な FleetワークスペースにSUCバンドルをデプロイすることで実行されます。デフォルトでは、Fleetには2つのワークスペースがあります。
pt_br: Determine os clusters em que deseja implantar o SUC. Para fazer isso, implante o bundle do SUC no espaço de trabalho correto do Fleet em seu cluster de gerenciamento. Por padrão, o Fleet tem dois espaços de trabalho:
zh_cn: 确定要在哪些群集上部署 SUC，方法是在管理群集内的适当 Fleet 工作空间中部署 SUC 捆绑包。默认情况下，Fleet 有两个工作空间：

source: If you intend to deploy SUC only on downstream clusters, create a <literal>targets.yaml</literal> file that matches the specific clusters:
es: Si tiene intención de desplegar SUC solo en clústeres descendentes, cree un archivo <literal>targets.yaml</literal> que coincida con los clústeres específicos:
ja: ダウンストリームクラスタにのみSUCをデプロイする場合は、特定のクラスタに一致する<literal>targets.yaml</literal>ファイルを作成します。
pt_br: Se você pretende implantar o SUC apenas em clusters downstream, crie um arquivo <literal>targets.yaml</literal> correspondente aos clusters específicos:
zh_cn: 如果您只打算在下游群集上部署 SUC，请创建一个与特定群集匹配的 <literal>targets.yaml</literal> 文件：

source: For information on how to map to downstream clusters, see <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link>
es: Para obtener información sobre cómo realizar la asignación a clústeres descendentes, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Asignación a clústeres descendentes).
ja: ダウンストリームクラスタへのマッピング方法については、「<link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters (ダウンストリームクラスタへのマッピング)</link>」を参照してください。
pt_br: Para obter informações sobre como mapear para clusters downstream, consulte <link xl:href="https://fleet.rancher.io/gitrepo-targets">Mapping to Downstream Clusters</link> (Mapeando para clusters downstream).
zh_cn: 有关如何映射到下游群集的信息，请参见<link xl:href="https://fleet.rancher.io/gitrepo-targets">映射到下游群集</link>

source: Proceed to building the Bundle:
es: Cree el Bundle:
ja: バンドルの構築に進みます。
pt_br: Avance para a criação do bundle :
zh_cn: 继续构建捆绑包：

source: Make sure you did <emphasis role="strong">not</emphasis> download the fleet-cli in the <literal>fleet-examples/fleets/day2/system-upgrade-controller</literal> directory, otherwise it will be packaged with the Bundle, which is not advised.
es: Asegúrese de que <emphasis role="strong">no</emphasis> ha descargado fleet-cli en el directorio <literal>fleet-examples/fleets/day2/system-upgrade-controller</literal>, ya que, si fuera así, se empaquetaría con el Bundle, lo cual no es recomendable.
ja: <literal>fleet-examples/fleets/day2/system-upgrade-controller</literal>ディレクトリのfleet-cliをダウンロード<emphasis role="strong">していない</emphasis>ことを確認してください。これをダウンロードすると、バンドルでパッケージ化され、これは推奨されません。
pt_br: Certifique-se de que você <emphasis role="strong">não</emphasis> fez download de fleet-cli no diretório <literal>fleet-examples/fleets/day2/system-upgrade-controller</literal>; do contrário, ele será empacotado com o bundle, o que não é aconselhável.
zh_cn: 请确保您<emphasis role="strong">没有</emphasis>下载 <literal>fleet-examples/fleets/day2/system-upgrade-controller</literal> 目录中的 fleet-cli，否则它将和捆绑包封装在一起，不建议这么做。

source: To deploy SUC on your management cluster, execute:
es: Para desplegar SUC en su clúster de gestión, ejecute:
ja: 管理クラスタにSUCをデプロイするには、次のコマンドを実行します。
pt_br: Para implantar o SUC no cluster de gerenciamento, execute:
zh_cn: 要在管理群集上部署 SUC，请执行：

source: To deploy SUC on your downstream clusters, execute:
es: Para desplegar SUC en sus clústeres descendentes, ejecute:
ja: ダウンストリームクラスタにSUCをデプロイするには、次のコマンドを実行します。
pt_br: Para implantar o SUC em clusters downstream, execute:
zh_cn: 要在下游群集上部署 SUC，请执行：

source: For more information about this process, see <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link>.
es: Para obtener más información sobre este proceso, consulte la sección <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link> (Conversión de un chart de Helm en un Bundle).
ja: このプロセスの詳細については、「<link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle (Helmチャートをバンドルに変換する)</link>」を参照してください。
pt_br: Para obter mais informações sobre esse processo, consulte <link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">Convert a Helm Chart into a Bundle</link> (Converter um gráfico Helm em bundle).
zh_cn: 有关此过程的详细信息，请参见<link xl:href="https://fleet.rancher.io/bundle-add#convert-a-helm-chart-into-a-bundle">将 Helm Chart 转换为捆绑包</link>。

source: For more information about the <literal>fleet-cli apply</literal> command, see <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>.
es: Para obtener más información sobre el comando <literal>fleet-cli apply</literal>, consulte <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>.
ja: <literal>fleet-cli apply</literal>コマンドの詳細については、「<link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>」を参照してください。
pt_br: Para obter mais informações sobre o comando <literal>fleet-cli apply</literal>, consulte <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>.
zh_cn: 有关 <literal>fleet-cli apply</literal> 命令的详细信息，请参见 <link xl:href="https://fleet.rancher.io/cli/fleet-cli/fleet_apply">fleet apply</link>。

source: Transfer the <literal>system-upgrade-controller-bundle.yaml</literal> bundle to your management cluster machine:
es: Transfiera el Bundle <literal>system-upgrade-controller-bundle.yaml</literal> al equipo del clúster de gestión:
ja: <literal>system-upgrade-controller-bundle.yaml</literal>バンドルを管理クラスタマシンに転送します。
pt_br: Transfira o bundle <literal>system-upgrade-controller-bundle.yaml</literal> para sua máquina do cluster de gerenciamento:
zh_cn: 将 <literal>system-upgrade-controller-bundle.yaml</literal> 捆绑包传输到您的管理群集计算机：

source: On your management cluster, deploy the <literal>system-upgrade-controller-bundle.yaml</literal> Bundle:
es: En el clúster de gestión, despliegue el Bundle <literal>system-upgrade-controller-bundle.yaml</literal>:
ja: 管理クラスタで、<literal>system-upgrade-controller-bundle.yaml</literal>バンドルをデプロイします。
pt_br: No cluster de gerenciamento, implante o bundle <literal>system-upgrade-controller-bundle.yaml</literal>:
zh_cn: 在您的管理群集上，部署 <literal>system-upgrade-controller-bundle.yaml</literal> 捆绑包：

source: On your management cluster, validate that the Bundle is deployed:
es: En el clúster de gestión, compruebe que el Bundle está desplegado:
ja: 管理クラスタで、バンドルがデプロイされていることを検証します。
pt_br: No cluster de gerenciamento, valide se o bundle foi implantado:
zh_cn: 在您的管理群集上，验证捆绑包是否已部署：

source: Based on the Fleet workspace that you deployed your Bundle to, navigate to the cluster and validate the SUC deployment:
es: Según el espacio de trabajo de Fleet en el que haya desplegado su Bundle, diríjase al clúster y compruebe que SUC se ha desplegado:
ja: バンドルをデプロイしたFleetワークスペースに基づいて、クラスタに移動し、SUCデプロイメントを検証します。
pt_br: De acordo com o espaço de trabalho do Fleet em que você implantou o bundle, navegue até o cluster e valide a implantação do SUC:
zh_cn: 根据捆绑包部署到的 Fleet 工作空间，导航到群集并验证 SUC 部署：

source: SUC is always deployed in the <emphasis role="strong">cattle-system</emphasis> namespace.
es: SUC siempre se despliega en el espacio de nombres <emphasis role="strong">cattle-system</emphasis>.
ja: SUCは常に、<emphasis role="strong">cattle-system</emphasis>ネームスペースにデプロイされます。
pt_br: O SUC é sempre implantado no namespace <emphasis role="strong">cattle-system</emphasis>.
zh_cn: SUC 始终部署在 <emphasis role="strong">cattle-system</emphasis> 名称空间中。

source: System Upgrade Controller Helm installation
es: Instalación de System Upgrade Controller con Helm
ja: System Upgrade Controller Helmのインストール
pt_br: Instalação do System Upgrade Controller com o Helm
zh_cn: 系统升级控制器 Helm 安装

source: Add the Rancher chart repository:
es: Añada el repositorio de charts de Rancher:
ja: Rancherチャートリポジトリを追加します。
pt_br: Adicione o repositório de gráficos do Rancher:
zh_cn: 添加 Rancher chart 储存库：

source: Deploy the SUC chart:
es: Despliegue el chart de SUC:
ja: SUCチャートをデプロイします。
pt_br: Implante o gráfico do SUC:
zh_cn: 部署 SUC chart：

source: This will install SUC version 0.16.0 which is needed by the Edge 3.4 platform.
es: Esto instalará la versión 0.16.0 de SUC, que se necesita en la plataforma Edge 3.4.
ja: これにより、Edge 3.4プラットフォームに必要なSUCバージョン0.16.0がインストールされます。
zh_cn: 此命令将安装 Edge 3.4 平台所需的 SUC 0.16.0 版本。

source: Validate the SUC deployment:
es: Compruebe que SUC se ha desplegado:
ja: SUCデプロイメントを検証します。
pt_br: Valide a implantação do SUC:
zh_cn: 验证 SUC 部署：

source: Monitoring System Upgrade Controller Plans
es: Supervisión de planes de System Upgrade Controller
ja: System Upgrade Controller Planのモニタリング
pt_br: Monitorando os planos do System Upgrade Controller
zh_cn: 监控系统升级控制器计划

source: SUC Plans can be viewed in the following ways:
es: Los planes de SUC se pueden consultar de las siguientes maneras:
ja: SUC Planは次の方法で確認できます。
pt_br: É possível ver os planos do SUC destas maneiras:
zh_cn: 可以通过以下方式查看 SUC 计划：

source: Through the Rancher UI (<xref linkend="components-system-upgrade-controller-monitor-plans-rancher"/>).
es: Mediante la interfaz de usuario de Rancher (<xref linkend="components-system-upgrade-controller-monitor-plans-rancher"/>).
ja: Rancher UI (<xref linkend="components-system-upgrade-controller-monitor-plans-rancher"/>)を通じて
pt_br: Pela IU do Rancher (<xref linkend="components-system-upgrade-controller-monitor-plans-rancher"/>).
zh_cn: 通过 Rancher UI（<xref linkend="components-system-upgrade-controller-monitor-plans-rancher"/>）。

source: Through manual monitoring (<xref linkend="components-system-upgrade-controller-monitor-plans-manual"/>) inside of the cluster.
es: Manualmente dentro del clúster (<xref linkend="components-system-upgrade-controller-monitor-plans-manual"/>).
ja: クラスタ内の手動モニタリング(<xref linkend="components-system-upgrade-controller-monitor-plans-manual"/>)を通じて
pt_br: Por monitoramento manual (<xref linkend="components-system-upgrade-controller-monitor-plans-manual"/>) dentro do cluster.
zh_cn: 通过群集内部的手动监控（<xref linkend="components-system-upgrade-controller-monitor-plans-manual"/>）。

source: Pods deployed for SUC Plans are kept alive <emphasis role="strong">15</emphasis> minutes after a successful execution. After that they are removed by the corresponding Job that created them. To have access to the Pod’s logs after this time period, you should enable logging for your cluster. For information on how to do this in Rancher, see <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/logging">Rancher Integration with Logging Services</link>.
es: Los pods desplegados para los planes de SUC se mantienen activos <emphasis role="strong">15</emphasis> minutos tras una ejecución correcta. Después, son eliminados por el trabajo correspondiente que los creó. Para tener acceso a los registros del pod después de este periodo de tiempo, debe habilitar el registro para su clúster. Para obtener información sobre cómo hacerlo en Rancher, consulte <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/logging">Rancher Integration with Logging Services</link> (Integración de Rancher con servicios de registro).
ja: SUC Plan用にデプロイされたPodは正常実行後、<emphasis role="strong">15</emphasis>分間維持されます 。その後、作成元の対応するJobによって削除されます。この時間後もPodのログにアクセスできるようにするには、クラスタのログ記録を有効にする必要があります。Rancherでこれを実行する方法については、「<link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/logging">Rancher Integration with Logging Services (Rancherとログ記録サービスの統合)</link>」を参照してください。
zh_cn: 为 SUC 计划部署的 Pod 在执行成功后会保留 <emphasis role="strong">15</emphasis> 分钟，之后会被创建它们的相应作业去除。如果您希望在此时间段后仍能访问 Pod 日志，需为群集启用日志记录。有关如何在 Rancher 中实现此操作的信息，请参见 <link xl:href="https://ranchermanager.docs.rancher.com/v2.12/integrations-in-rancher/logging">Rancher 与日志记录服务的集成</link>。

source: Monitoring System Upgrade Controller Plans - Rancher UI
es: Supervisión de planes de System Upgrade Controller - Interfaz de usuario de Rancher
ja: System Upgrade Controller Planのモニタリング - Rancher UI
pt_br: Monitorando os planos do System Upgrade Controller – IU do Rancher
zh_cn: 监控系统升级控制器计划 - Rancher UI

source: To check Pod logs for the specific SUC plan:
es: Para comprobar los registros del pod para el plan de SUC específico:
ja: 特定のSUC PlanのPodログを確認するには、次の手順を実行します。
pt_br: Para consultar os registros do pod referentes ao plano do SUC específico:
zh_cn: 要检查特定 SUC 计划的 Pod 日志，请执行以下操作：

source: In the upper left corner, <emphasis role="strong">☰ → &lt;your-cluster-name&gt;</emphasis>
es: En la esquina superior izquierda, <emphasis role="strong">☰ → &lt;nombre-de-su-clúster&gt;</emphasis>.
ja: 左上隅で、<emphasis role="strong">［☰］→［&lt;クラスタ名&gt;］</emphasis>を選択します。
pt_br: No canto superior esquerdo, <emphasis role="strong">☰ → &lt;nome-do-seu-cluster&gt;</emphasis>
zh_cn: 在左上角，选择 <emphasis role="strong">☰ → &lt;您的群集名称&gt;</emphasis>

source: Select Workloads → Pods
es: Seleccione Workloads → Pods (Cargas de trabajo > Pods).
ja: ［Workloads (ワークロード)］→［Pods］を選択します。
pt_br: Selecione Workloads → Pods (Cargas de trabalho → Pods).
zh_cn: 选择“Workloads”（工作负载）→“Pod”

source: Select the <literal>Only User Namespaces</literal> drop down menu and add the <literal>cattle-system</literal> namespace
es: Seleccione el menú desplegable <literal>Only User Namespaces</literal> (Solo espacios de nombres de usuario) y añada el espacio de nombres <literal>cattle-system</literal>.
ja: ［<literal>Only User Namespaces (ユーザネームスペースのみ)</literal>］ドロップダウンメニューを選択し、［<literal>cattle-system</literal>］ネームスペースを追加します。
pt_br: Selecione o menu suspenso <literal>Only User Namespaces</literal> (Somente namespaces de usuário) e adicione o namespace <literal>cattle-system</literal>.
zh_cn: 选择 <literal>Only User Namespaces</literal>（仅用户名称空间）下拉菜单，并添加 <literal>cattle-system</literal> 名称空间。

source: In the Pod filter bar, write the name for your SUC Plan Pod. The name will be in the following template format: <literal>apply-&lt;plan_name&gt;-on-&lt;node_name&gt;</literal>
es: En la barra de filtro Pod, escriba el nombre de su pod del plan de SUC. El nombre tendrá el siguiente formato: <literal>apply-&lt;nombre_plan&gt;-on-&lt;nombre_nodo&gt;</literal>.
ja: Podフィルタバーに、SUC Plan Podの名前を入力します。名前は次のテンプレート形式になります: <literal>apply-&lt;plan_name&gt;-on-&lt;node_name&gt;</literal>。
pt_br: Na barra de filtro Pod, escreva o nome do pod do plano do SUC, que terá este formato de gabarito: <literal>apply-&lt;nome_do_plano&gt;-on-&lt;nome_do_nó&gt;</literal>
zh_cn: 在 Pod 过滤栏中输入 SUC 计划 Pod 的名称。该名称采用以下模板格式：<literal>apply-&lt;计划名称&gt;-on-&lt;节点名称&gt;</literal>

source: There may be both <literal>Completed</literal> and <literal>Unknown</literal> Pods for a specific SUC Plan. This is expected and happens due to the nature of some of the upgrades.
es: Puede haber pods con los estados <literal>Completed</literal> (Completado) y <literal>Unknown</literal> (Desconocido) para un plan de SUC específico. Esto está previsto debido a la naturaleza de algunas de las actualizaciones.
ja: 特定のSUC Planに対して［<literal>Completed (完了)</literal>］Podと［<literal>Unknown (不明)</literal>］Podの両方が存在する場合があります。これは予期されており、一部のアップグレードの性質により発生します。
pt_br: Pode haver pods tanto <literal>Completed</literal> (Concluídos) quanto <literal>Unknown</literal> (Desconhecidos) para um plano do SUC específico. Isso é esperado e acontece por causa da natureza de alguns upgrades.
zh_cn: 对于特定的 SUC 计划，可能同时有<literal>已完成</literal>和<literal>未知</literal>的 Pod。这是正常的，原因要归咎于一些升级的性质。

source: Select the pod that you want to review the logs of and navigate to <emphasis role="strong">⋮ → View Logs</emphasis>
es: Seleccione el pod cuyos registros desea revisar y vaya a <emphasis role="strong">⋮ → View Logs</emphasis> (⋮ > Ver registros).
ja: ログを確認するPodを選択し、<emphasis role="strong">［⋮］ → ［View Logs (ログの表示)］</emphasis>に移動します。
pt_br: Selecione o pod dos quais deseja revisar os registros e navegue até <emphasis role="strong">⋮ → View Logs</emphasis> (Ver registros).
zh_cn: 选择您要查看其日志的 Pod，然后导航到 <emphasis role="strong">⋮ → View Logs（查看日志）</emphasis>

source: Monitoring System Upgrade Controller Plans - Manual
es: Supervisión de planes de System Upgrade Controller - Manual
ja: System Upgrade Controller Planのモニタリング - 手動
pt_br: Monitorando os planos do System Upgrade Controller – Manual
zh_cn: 监控系统升级控制器计划 - 手动

source: The below steps assume that <literal>kubectl</literal> has been configured to connect to the cluster where the <emphasis role="strong">SUC Plans</emphasis> have been deployed to.
es: Los pasos siguientes dan por supuesto que <literal>kubectl</literal> se ha configurado para conectarse al clúster en el que se han desplegado los <emphasis role="strong">planes de SUC</emphasis>.
ja: 以下の手順は、 <literal>kubectl</literal>が、<emphasis role="strong">SUC Plan</emphasis>がデプロイされたクラスタに接続するように設定されていることを前提としています。
pt_br: As etapas abaixo pressupõem que o <literal>kubectl</literal> foi configurado para conectar-se ao cluster em que os <emphasis role="strong">planos do SUC</emphasis> foram implantados.
zh_cn: 以下步骤假设 <literal>kubectl</literal> 已配置为连接到已部署 <emphasis role="strong">SUC 计划</emphasis>的群集。

source: List deployed <emphasis role="strong">SUC</emphasis> Plans:
es: Muestre los planes de <emphasis role="strong">SUC</emphasis> desplegados:
ja: デプロイした<emphasis role="strong">SUC</emphasis> Planを一覧にします。
pt_br: Liste os planos do <emphasis role="strong">SUC</emphasis> implantados:
zh_cn: 列出部署的 <emphasis role="strong">SUC</emphasis> 计划：

source: Get Pod for <emphasis role="strong">SUC</emphasis> Plan:
es: Obtenga el pod para el plan de <emphasis role="strong">SUC</emphasis>:
ja: <emphasis role="strong">SUC</emphasis> Plan用Podを入手します。
pt_br: Obtenha o pod para o plano do <emphasis role="strong">SUC</emphasis>:
zh_cn: 获取 <emphasis role="strong">SUC</emphasis> 计划的 Pod：

source: Get logs for the Pod:
es: Obtenga los registros del pod:
ja: Podのログを取得します。
pt_br: Obtenha os registros do pod:
zh_cn: 获取 Pod 的日志：

source: Upgrade Controller
pt_br: Controller de upgrade
zh_cn: 升级控制器

source: A Kubernetes controller capable of performing upgrades over the following SUSE Edge platform components:
es: Upgrade Controller es un controlador de Kubernetes capaz de realizar actualizaciones en los siguientes componentes de la plataforma SUSE Edge:
ja: 次のSUSE Edgeプラットフォームコンポーネントに対してアップグレードを実行できるKubernetesコントローラ:
pt_br: Um controlador do Kubernetes que faz upgrades dos seguintes componentes da plataforma SUSE Edge:
zh_cn: Kubernetes 控制器可以执行以下 SUSE Edge 平台组件的升级：

source: Operating System (SUSE Linux Micro)
es: Sistema operativo (SUSE Linux Micro)
ja: オペレーティングシステム(SUSE Linux Micro)
pt_br: Sistema operacional (SUSE Linux Micro)
zh_cn: 操作系统 (SUSE Linux Micro)

source: Kubernetes (K3s &amp; RKE2)
es: Kubernetes (K3s y RKE2)
ja: Kubernetes (K3sとRKE2)
pt_br: Kubernetes (K3s e RKE2)
zh_cn: Kubernetes（K3s 和 RKE2）

source: Additional components (Rancher, Elemental, SUSE Security, etc.)
es: Componentes adicionales (Rancher, Elemental, SUSE Security, etc.)
ja: 追加のコンポーネント(Rancher、Elemental、SUSE Securityなど)
pt_br: Componentes adicionais (Rancher, Elemental, SUSE Security etc.)
zh_cn: 其他组件（Rancher、Elemental、SUSE Security 等）
