Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: It can take around two minutes for the init container to run on this deployment, so ensure the pods are all running before proceeding:
es: El contenedor de inicio puede tardar unos dos minutos en ejecutarse en este despliegue, así que asegúrese de que todos los pods estén funcionando antes de continuar:
ja: initコンテナがこのデプロイメントで実行されるまで約2分かかる場合があるため、続行する前にPodがすべて実行されていることを確認します。
pt_br: A execução do contêiner init pode levar cerca de dois minutos nesta implantação, portanto, garanta que todos os pods estejam em execução antes de continuar:
zh_cn: 大约要经过两分钟，init 容器才会在此部署中运行，因此请确保所有 Pod 都已运行再继续操作：

source: Do not proceed to the following steps until all pods in the <literal>metal3-system</literal> namespace are running.
es: No continúe con los siguientes pasos hasta que todos los pods del espacio de nombres <literal>metal3-system</literal> estén en ejecución.
ja: <literal>metal3-system</literal>ネームスペースのすべてのPodが実行されるまで、以下の手順に進まないでください。
pt_br: Não avance para as etapas seguintes até que todos os pods no namespace <literal>metal3-system</literal> estejam em execução.
zh_cn: 请在 <literal>metal3-system</literal> 名称空间中的所有 Pod 都已运行后再继续执行以下步骤。

source: Installing cluster API dependencies
es: Instalación de las dependencias de Cluster API
ja: Cluster APIの依存関係のインストール
pt_br: Instalando as dependências de API do cluster
zh_cn: 安装 Cluster API 依赖项

source: Cluster API dependencies are managed via the Rancher Turtles Helm chart:
es: Las dependencias de Cluster API se gestionan mediante el chart de Helm de Rancher Turtles:
ja: Cluster APIの依存関係は、Rancher Turtles Helmチャートで管理されます。
pt_br: As dependências de API do cluster são gerenciadas pelo gráfico Helm do Rancher Turtles:
zh_cn: Cluster API 依赖项通过 Rancher Turtles Helm chart 管理：

source: After some time, the controller pods should be running in the <literal>capi-system</literal>, <literal>capm3-system</literal>, <literal>rke2-bootstrap-system</literal> and <literal>rke2-control-plane-system</literal> namespaces.
es: Después de un tiempo, los pods del controlador deberían estar ejecutándose en los espacios de nombres <literal>capi-system</literal>, <literal>capm3-system</literal>, <literal>rke2-bootstrap-system</literal> y <literal>rke2-control-plane-system</literal>.
ja: しばらくすると、コントローラPodが<literal>capi-system</literal>、<literal>capm3-system</literal>、<literal>rke2-bootstrap-system</literal>、および<literal>rke2-control-plane-system</literal>の各ネームスペースで実行されているはずです。
pt_br: Após algum tempo, os pods do controlador deverão estar em execução nos namespaces <literal>capi-system</literal>, <literal>capm3-system</literal>, <literal>rke2-bootstrap-system</literal> e <literal>rke2-control-plane-system</literal>.
zh_cn: 一段时间后，控制器 Pod 应会在 <literal>capi-system</literal>、<literal>capm3-system</literal>、<literal>rke2-bootstrap-system</literal> 和 <literal>rke2-control-plane-system</literal> 名称空间中运行。

source: Prepare downstream cluster image
es: Preparación de la imagen del clúster descendente
ja: ダウンストリームクラスタイメージの準備
pt_br: Preparar a imagem do cluster downstream
zh_cn: 准备下游群集映像

source: Kiwi (<xref linkend="guides-kiwi-builder-images"/>) and Edge Image Builder (<xref linkend="components-eib"/>) are used to prepare a modified SLEMicro base image which is provisioned on downstream cluster hosts.
es: Kiwi (<xref linkend="guides-kiwi-builder-images"/>) y Edge Image Builder (<xref linkend="components-eib"/>) se usan para preparar una imagen base de SLEMicro modificada que se aprovisiona en los hosts de clústeres descendentes.
ja: Kiwi (<xref linkend="guides-kiwi-builder-images"/>)とEdge Image Builder (<xref linkend="components-eib"/>)を使用して、ダウンストリームクラスタホスト上にプロビジョニングされる、変更されたSLEMicroゴールデンイメージを準備します。
pt_br: O Kiwi (<xref linkend="guides-kiwi-builder-images"/>) e o Edge Image Builder (<xref linkend="components-eib"/>) são usados para preparar a imagem base do SLEMicro modificado que foi provisionado nos hosts do cluster downstream.
zh_cn: Kiwi（<xref linkend="guides-kiwi-builder-images"/>）和 Edge Image Builder（<xref linkend="components-eib"/>）用于准备将在下游群集主机上置备的经过修改的 SLEMicro 基础映像。

source: In this guide, we cover the minimal configuration necessary to deploy the downstream cluster.
es: En esta guía, se trata la configuración mínima necesaria para desplegar el clúster descendente.
ja: このガイドではダウンストリームクラスタをデプロイするために必要な最小限の設定について説明します。
pt_br: Neste guia, abordamos a configuração mínima necessária para implantar o cluster downstream.
zh_cn: 本指南介绍部署下游群集所需的最低限度配置。

source: Image configuration
es: Configuración de la imagen
ja: イメージの設定
pt_br: Configuração da imagem
zh_cn: 映像配置

source: Please follow <xref linkend="guides-kiwi-builder-images"/> first to build a fresh image as the first step required to create clusters.
es: Como primer paso necesario para crear clústeres, cree una imagen nueva siguiendo las instrucciones del <xref linkend="guides-kiwi-builder-images"/>.
ja: クラスタの作成に必要な最初の手順として、まず<xref linkend="guides-kiwi-builder-images"/>に従って、新しいイメージを構築してください。
pt_br: Primeiro siga o <xref linkend="guides-kiwi-builder-images"/> para gerar uma imagem nova como a primeira etapa necessária para criar clusters.
zh_cn: 首先，请先按照<xref linkend="guides-kiwi-builder-images"/>中的说明构建一个创建群集所需的全新映像。

source: When running Edge Image Builder, a directory is mounted from the host, so it is necessary to create a directory structure to store the configuration files used to define the target image.
es: Al ejecutar Edge Image Builder, se monta un directorio desde el host, por lo que es necesario crear una estructura de directorios para almacenar los archivos de configuración usados para definir la imagen de destino.
ja: Edge Image Builderを実行すると、そのホストからディレクトリがマウントされるため、ターゲットイメージの定義に使用する設定ファイルを保存するディレクトリ構造を作成する必要があります。
pt_br: Ao executar o Edge Image Builder, um diretório é montado com base no host, portanto, é necessário criar uma estrutura de diretórios para armazenar os arquivos de configuração usados para definir a imagem de destino.
zh_cn: 运行 Edge Image Builder 时，将从主机挂载一个目录，因此需要创建一个目录结构来存储用于定义目标映像的配置文件。

source: <literal>downstream-cluster-config.yaml</literal> is the image definition file, see <xref linkend="quickstart-eib"/> for more details.
es: <literal>downstream-cluster-config.yaml</literal> es el archivo de definición de la imagen. Consulte el <xref linkend="quickstart-eib"/> para obtener más detalles.
ja: <literal>downstream-cluster-config.yaml</literal>はイメージ定義ファイルです。詳細については、<xref linkend="quickstart-eib"/>を参照してください。
pt_br: <literal>downstream-cluster-config.yaml</literal> é o arquivo de definição da imagem. Consulte o <xref linkend="quickstart-eib"/> para obter mais detalhes.
zh_cn: <literal>downstream-cluster-config.yaml</literal> 是映像定义文件，有关详细信息，请参见<xref linkend="quickstart-eib"/>。

source: The base image when downloaded is <literal>xz</literal> compressed, which must be uncompressed with <literal>unxz</literal> and copied/moved under the <literal>base-images</literal> folder.
es: La imagen base, cuando se descarga, está comprimida con <literal>xz</literal>, por lo que debe descomprimirse con <literal>unxz</literal> y copiarse/moverse a la carpeta <literal>base-images</literal>.
ja: ダウンロードされたゴールデンイメージは<literal>xz</literal>で圧縮されているので、<literal>unxz</literal>で展開し、<literal>base-images</literal>フォルダの下にコピー/移動する必要があります。
pt_br: Quando o download da imagem base é feito, ela é compactada com <literal>xz</literal>, que deve ser descompactada com <literal>unxz</literal> e copiada/movida para a pasta <literal>base-images</literal>.
zh_cn: 下载的基础映像已经过 <literal>xz</literal> 压缩，必须使用 <literal>unxz</literal> 将其解压缩，并将其复制/移动到 <literal>base-images</literal> 文件夹中。

source: The <literal>network</literal> folder is optional, see <xref linkend="metal3-add-network-eib"/> for more details.
es: La carpeta <literal>network</literal> es opcional. Para obtener más información, consulte la <xref linkend="metal3-add-network-eib"/>.
ja: <literal>network</literal>フォルダはオプションです。詳細については、<xref linkend="metal3-add-network-eib"/>を参照してください。
pt_br: A pasta <literal>network</literal> é opcional. Consulte a <xref linkend="metal3-add-network-eib"/> para obter mais detalhes.
zh_cn: <literal>network</literal> 文件夹是可选的，有关详细信息，请参见<xref linkend="metal3-add-network-eib"/>。

source: The custom/scripts directory contains scripts to be run on first-boot; currently a <literal>01-fix-growfs.sh</literal> script is required to resize the OS root partition on deployment
es: El directorio custom/scripts contiene guiones que se ejecutan en el primer arranque; actualmente, se requiere un guion <literal>01-fix-growfs.sh</literal> para cambiar el tamaño de la partición raíz del sistema operativo en el despliegue.
ja: custom/scriptsディレクトリには、初回ブート時に実行するスクリプトが含まれます。現在、デプロイメントのOSルートパーティションのサイズを変更するには、<literal>01-fix-growfs.sh</literal>スクリプトが必要です。
pt_br: O diretório custom/scripts contém scripts que são executados na primeira inicialização. Atualmente, um script <literal>01-fix-growfs.sh</literal> é necessário para redimensionar a partição raiz do sistema operacional na implantação.
zh_cn: custom/scripts 目录包含首次引导时运行的脚本；目前需要使用 <literal>01-fix-growfs.sh</literal> 脚本来调整部署中的操作系统根分区的大小

source: Downstream cluster image definition file
es: Archivo de definición de la imagen del clúster descendente
ja: ダウンストリームクラスタイメージ定義ファイル
pt_br: Arquivo de definição da imagem do cluster downstream
zh_cn: 下游群集映像定义文件

source: The <literal>downstream-cluster-config.yaml</literal> file is the main configuration file for the downstream cluster image. The following is a minimal example for deployment via Metal<superscript>3</superscript>:
es: El archivo <literal>downstream-cluster-config.yaml</literal> es el principal archivo de configuración para la imagen del clúster descendente. A continuación, se muestra un ejemplo mínimo de despliegue mediante Metal<superscript>3</superscript>:
ja: <literal>downstream-cluster-config.yaml</literal>ファイルは、ダウンストリームクラスタイメージの主要な設定ファイルです。次に、Metal<superscript>3</superscript>を介したデプロイメントの最小例を示します。
pt_br: O <literal>downstream-cluster-config.yaml</literal> é o arquivo de configuração principal para a imagem do cluster downstream. Veja a seguir um exemplo mínimo de implantação por meio do Metal<superscript>3</superscript>:
zh_cn: <literal>downstream-cluster-config.yaml</literal> 文件是下游群集映像的主配置文件。下面是通过 Metal<superscript>3</superscript> 进行部署的极简示例：

source: Where <literal>$SCC_REGISTRATION_CODE</literal> is the registration code copied from <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, and the package list contains <literal>jq</literal> w hich is required.
es: Donde <literal>$SCC_REGISTRATION_CODE</literal> es el código de registro copiado del <link xl:href="https://scc.suse.com/">Centro de servicios al cliente de SUSE</link> y la lista de paquetes contiene <literal>jq</literal>, que es obligatorio.
ja: ここで、<literal>$SCC_REGISTRATION_CODE</literal>は<link xl:href="https://scc.suse.com/">SUSE Customer Center</link>からコピーした登録コードで、パッケージリストには必要な<literal>jq</literal>が含まれています。
pt_br: Em que <literal>$SCC_REGISTRATION_CODE</literal> é o código de registro copiado do <link xl:href="https://scc.suse.com/">SUSE Customer Center</link>, e a lista de pacotes contém o <literal>jq</literal>, que é obrigatório.
zh_cn: 其中 <literal>$SCC_REGISTRATION_CODE</literal> 是从 <link xl:href="https://scc.suse.com/">SUSE Customer Center</link> 中复制的注册代码，并且软件包列表包含必需的 <literal>jq</literal>。

source: <literal>$ROOT_PASSWORD</literal> is the encrypted password for the root user, which can be useful for test/debugging. It can be generated with the <literal>openssl passwd -6 PASSWORD</literal> command
es: <literal>$ROOT_PASSWORD</literal> es la contraseña cifrada del usuario root, que puede ser útil para pruebas y depuración. Se puede generar con el comando <literal>openssl passwd -6 PASSWORD</literal>.
ja: <literal>$ROOT_PASSWORD</literal>はルートユーザの暗号化パスワードで、テスト/デバッグに役立ちます。このパスワードは、<literal>openssl passwd -6 PASSWORD</literal>コマンドで生成できます。
pt_br: <literal>$ROOT_PASSWORD</literal> é a senha criptografada do usuário root, que pode ser útil para teste/depuração. É possível gerá-la com o comando <literal>openssl passwd -6 PASSWORD</literal>.
zh_cn: <literal>$ROOT_PASSWORD</literal> 是 root 用户的已加密口令，可用于测试/调试目的。可以使用 <literal>openssl passwd-6 PASSWORD</literal> 命令生成此口令

source: For the production environments, it is recommended to use the SSH keys that can be added to the users block replacing the <literal>$USERKEY1</literal> with the real SSH keys.
es: En entornos de producción, se recomienda usar las claves SSH que se pueden añadir al bloque de usuarios sustituyendo <literal>$USERKEY1</literal> por las claves SSH reales.
ja: 運用環境では、<literal>$USERKEY1</literal>を実際のSSHキーに置き換えて、usersブロックに追加できるSSHキーを使用することをお勧めします。
pt_br: Para os ambientes de produção, a recomendação é usar as chaves SSH que podem ser adicionadas ao bloco de usuários substituindo a <literal>$USERKEY1</literal> pelas chaves SSH reais.
zh_cn: 对于生产环境，建议使用可添加到 users 块的 SSH 密钥（需将 <literal>$USERKEY1</literal> 替换为实际 SSH 密钥）。

source: <literal>net.ifnames=1</literal> enables <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">Predictable Network Interface Naming</link>
es: <literal>net.ifnames=1</literal> permite los <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">nombres predecibles para las interfaces de red</link>
ja: <literal>net.ifnames=1</literal>は、<link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">Predictable Network Interface Naming</link>を有効にします。
pt_br: O <literal>net.ifnames=1</literal> habilita a <link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">Nomenclatura de interface de rede previsível</link>.
zh_cn: <literal>net.ifnames=1</literal> 会启用<link xl:href="https://documentation.suse.com/smart/network/html/network-interface-predictable-naming/index.html">可预测网络接口命名</link>

source: This matches the default configuration for the Metal<superscript>3</superscript> chart, but the setting must match the configured chart <literal>predictableNicNames</literal> value.
es: Esto coincide con la configuración predeterminada para el chart de Metal<superscript>3</superscript>, pero el ajuste debe coincidir con el valor de <literal>predictableNicNames</literal> configurado en el chart.
ja: これはMetal<superscript>3</superscript>チャートのデフォルト設定と一致しますが、この設定は、設定されたチャートの<literal>predictableNicNames</literal>の値と一致する必要があります。
pt_br: Isso corresponde à configuração padrão do gráfico do Metal<superscript>3</superscript>, mas a configuração deve corresponder ao valor <literal>predictableNicNames</literal> do gráfico.
zh_cn: 这与 Metal<superscript>3</superscript> chart 的默认配置相匹配，但设置必须与配置的 chart <literal>predictableNicNames</literal> 值相匹配。

source: Also note that <literal>ignition.platform.id=openstack</literal> is mandatory - without this argument SUSE Linux Micro configuration via ignition will fail in the Metal<superscript>3</superscript> automated flow.
es: Tenga en cuenta también que <literal>ignition.platform.id=openstack</literal> es obligatorio. Sin este argumento, la configuración de SUSE Linux Micro a través de Ignition fallará en el flujo automatizado de Metal<superscript>3</superscript>.
ja: また、<literal>ignition.platform.id=openstack</literal>は必須であり、この引数がないと、Metal<superscript>3</superscript>の自動化フローでIgnitionによるSUSE Linux Microの設定が失敗することにも注意してください。
pt_br: Veja também que o <literal>ignition.platform.id=openstack</literal> é obrigatório. Sem esse argumento, a configuração do SUSE Linux Micro pelo ignition vai falhar no fluxo automatizado do Metal<superscript>3</superscript>.
zh_cn: 另请注意，<literal>ignition.platform.id=openstack</literal> 是必需的，如果不指定此参数，在 Metal<superscript>3</superscript> 自动化流程中通过 ignition 进行 SUSE Linux Micro 配置将会失败。

source: The <literal>time</literal> section is optional but it is highly recommended to be configured to avoid potential issues with certificates and clock skew. The values provided in this example are for illustrative purposes only. Please adjust them to fit your specific requirements.
es: La sección <literal>time</literal> es opcional, pero se recomienda encarecidamente configurarla para evitar posibles problemas con los certificados y la desviación del reloj. Los valores proporcionados en este ejemplo son solo ilustrativos. Ajústelos según sus requisitos específicos.
ja: <literal>time</literal> セクションはオプションですが、証明書とクロックスキューに関する潜在的な問題を回避するように設定することを強くお勧めします。この例で指定されている値は説明のみを目的としています。ご自身の特定の要件に合わせて調整してください。
zh_cn: <literal>time</literal> 部分为可选配置，但强烈建议您进行设置，以避免证书和时钟偏差可能引发的问题。本示例中提供的值仅作说明之用，请根据您的具体要求相应调整。

source: Growfs script
es: Guion Growfs
ja: Growfsスクリプト
pt_br: Script growfs
zh_cn: Growfs 脚本

source: Currently, a custom script (<literal>custom/scripts/01-fix-growfs.sh</literal>) is required to grow the file system to match the disk size on first-boot after provisioning. The <literal>01-fix-growfs.sh</literal> script contains the following information:
es: Actualmente, se requiere un guion personalizado (<literal>custom/scripts/01-fix-growfs.sh</literal>) para ampliar el sistema de archivos y que coincida con el tamaño del disco en el primer arranque después del aprovisionamiento. El guion <literal>01-fix-growfs.sh</literal> contiene la siguiente información:
ja: 現在、プロビジョニング後の初回ブート時にディスクサイズに合わせてファイルシステムを拡張するには、カスタムスクリプト(<literal>custom/scripts/01-fix-growfs.sh</literal>)が必要です。<literal>01-fix-growfs.sh</literal>スクリプトには次の情報が含まれます。
pt_br: Atualmente, é necessário um script personalizado (<literal>custom/scripts/01-fix-growfs.sh</literal>) para expandir o sistema de arquivos de acordo com o tamanho do disco na primeira inicialização após o provisionamento. O script <literal>01-fix-growfs.sh</literal> contém as seguintes informações:
zh_cn: 目前，在置备后首次引导时，需要使用一个自定义脚本 (<literal>custom/scripts/01-fix-growfs.sh</literal>) 来增大文件系统，使之与磁盘大小匹配。<literal>01-fix-growfs.sh</literal> 脚本包含以下信息：

source: Add your own custom scripts to be executed during the provisioning process using the same approach. For more information, see <xref linkend="quickstart-eib"/>.
es: Use el mismo método para añadir sus propios guiones personalizados que se ejecuten durante el proceso de aprovisionamiento. Para obtener más información, consulte el <xref linkend="quickstart-eib"/>.
ja: 同じアプローチを使用して、プロビジョニングプロセス中に実行する独自のカスタムスクリプトを追加します。詳細については、<xref linkend="quickstart-eib"/>を参照してください。
pt_br: Adicione seus próprios scripts personalizados para execução durante o processo de provisionamento usando a mesma abordagem. Para obter mais informações, consulte o <xref linkend="quickstart-eib"/>.
zh_cn: 使用相同的方法添加要在置备过程中执行的您自己的自定义脚本。有关详细信息，请参见<xref linkend="quickstart-eib"/>。

source: Image creation
es: Creación de la imagen
ja: イメージの作成
pt_br: Criação de imagem
zh_cn: 映像创建

source: Once the directory structure is prepared following the previous sections, run the following command to build the image:
es: Cuando se haya preparado la estructura de directorios siguiendo las secciones anteriores, ejecute el siguiente comando para crear la imagen:
ja: これまでのセクションに従ってディレクトリ構造を準備したら、次のコマンドを実行してイメージを構築します。
pt_br: Depois que a estrutura de diretórios for preparada de acordo com as seções anteriores, execute o seguinte comando para criar a imagem:
zh_cn: 按照前面的章节准备好目录结构后，运行以下命令来构建映像：

source: This creates the output image file named <literal>SLE-Micro-eib-output.raw</literal>, based on the definition described above.
es: Esto crea el archivo de imagen de salida denominado <literal>SLE-Micro-eib-output.raw</literal>, basado en la definición descrita anteriormente.
ja: これにより、上記の定義に基づいて、<literal>SLE-Micro-eib-output.raw</literal>という名前の出力イメージファイルが作成されます。
pt_br: Ele cria o arquivo de imagem de saída chamado <literal>SLE-Micro-eib-output.raw</literal>, com base na definição descrita acima.
zh_cn: 这会根据上述定义创建名为 <literal>SLE-Micro-eib-output.raw</literal> 的输出映像文件。

source: The output image must then be made available via a webserver, either the media-server container enabled via the Metal3 chart (<xref linkend="metal3-media-server"/>) or some other locally accessible server. In the examples below, we refer to this server as <literal>imagecache.local:8080</literal>
es: La imagen resultante debe estar disponible a través de un servidor web, ya sea el contenedor del servidor multimedia habilitado mediante el chart de Metal3 (<xref linkend="metal3-media-server"/>) o algún otro servidor al que se pueda acceder localmente. En los ejemplos siguientes, nos referimos a este servidor como <literal>imagecache.local:8080</literal>.
ja: その後、この出力イメージをWebサーバ経由で利用できるようにする必要があります。その際、Metal3チャートを使用して有効にしたメディアサーバコンテナ(<xref linkend="metal3-media-server"/>)か、ローカルにアクセス可能な他のサーバのいずれかを使用します。以下の例では、このサーバを<literal>imagecache.local:8080</literal>として参照します。
pt_br: Depois disso, a imagem de saída deverá estar disponível em um servidor web, ou o contêiner de servidor de mídia habilitado pelo gráfico do Metal3 (<xref linkend="metal3-media-server"/>) ou um outro servidor acessível localmente. Nos exemplos a seguir, chamamos esse servidor de <literal>imagecache.local:8080</literal>.
zh_cn: 然后必须通过 Web 服务器提供输出映像，该服务器可以是通过 Metal3 chart 启用的媒体服务器容器（<xref linkend="metal3-media-server"/>），也可以是其他某个本地可访问的服务器。在下面的示例中，此服务器是 <literal>imagecache.local:8080</literal>

source: When deploying EIB images to downstream clusters, it is required also to include the sha256 sum of the image on the <literal>Metal3MachineTemplate</literal> object. It can be generated as:
es: Al desplegar imágenes de EIB en clústeres descendentes, también es necesario incluir la suma sha256 de la imagen en el objeto <literal>Metal3MachineTemplate</literal>. Se puede generar de la siguiente manera:
ja: EIBイメージをダウンストリームクラスタにデプロイする際は、<literal>Metal3MachineTemplate</literal>オブジェクトにイメージのSHA256ハッシュ値を含める必要があります。これは次のように生成できます:
pt_br: Na implantação de imagens EIB em clusters downstream, é necessário também incluir a soma sha256 da imagem no objeto <literal>Metal3MachineTemplate</literal>. É possível gerá-la com este comando:
zh_cn: 将 EIB 映像部署到下游群集时，还需要在 <literal>Metal3MachineTemplate</literal> 对象中包含该映像的 sha256 校验和。可通过以下方式生成该校验和：

source: Adding BareMetalHost inventory
es: Adición del inventario de BareMetalHost
ja: BareMetalHostインベントリの追加
pt_br: Adicionando o inventário de BareMetalHost
zh_cn: 添加 BareMetalHost 清单

source: Registering bare-metal servers for automated deployment requires creating two resources: a Secret storing BMC access credentials and a Metal<superscript>3</superscript> BareMetalHost resource defining the BMC connection and other details:
es: El registro de servidores bare metal para el despliegue automatizado requiere la creación de dos recursos: un secreto que almacena las credenciales de acceso a BMC y un recurso BareMetalHost de Metal<superscript>3</superscript> que define la conexión de BMC y otros detalles:
ja: 自動デプロイメント用にベアメタルサーバを登録するには、リソースを2つ作成する必要があります。BMCアクセス資格情報を保存するシークレットと、BMC接続とその他の詳細を定義するMetal<superscript>3</superscript> BareMetalHostリソースです。
pt_br: Para registrar servidores bare metal para implantação automatizada, é necessário criar dois recursos: um segredo com as credenciais de acesso ao BMC e um recurso BareMetalHost do Metal<superscript>3</superscript> com a definição da conexão com o BMC e outros detalhes:
zh_cn: 注册自动部署的裸机服务器需要创建两个资源：一个用于存储 BMC 访问身份凭证的机密，以及一个用于定义 BMC 连接和其他细节的 Metal<superscript>3</superscript> BareMetalHost 资源：

source: Note the following:
es: Tenga en cuenta lo siguiente:
ja: 次の点に注意してください。
pt_br: Observe o seguinte:
zh_cn: 请注意以下几点：
