Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Once the file is created by joining the previous blocks, the following command has to be executed in the management cluster to start provisioning the new three bare-metal hosts:
pt_br: Após a criação do arquivo unindo os blocos anteriores, execute o seguinte comando no cluster de gerenciamento para iniciar o provisionamento dos três novos hosts bare metal:

source: <literal>${CONTROLPLANE1_INTERFACE}</literal> — The control-plane interface to be used for the edge cluster (for example, <literal>eth0</literal>). Including <literal>identifier: mac-address</literal> the naming is inspected automatically by the MAC address so any interface name can be used.
pt_br: <literal>${CONTROLPLANE1_INTERFACE}</literal>: a interface do plano de controle que será usada para o cluster Edge (por exemplo, <literal>eth0</literal>). Incluindo o <literal>identifier: mac-address</literal>, o endereço MAC inspeciona automaticamente a nomenclatura para que qualquer nome de interface possa ser usado.

source: <literal>${CONTROLPLANE1_IP}</literal> — The IP address to be used as an endpoint for the edge cluster (must match with the kubeapi-server endpoint).
pt_br: <literal>${CONTROLPLANE1_IP}</literal>: o endereço IP usado como endpoint para o cluster de borda (deve corresponder ao endpoint do servidor kubeapi).

source: <literal>${CONTROLPLANE1_PREFIX}</literal> — The CIDR to be used for the edge cluster (for example, <literal>24</literal> if you want <literal>/24</literal> or <literal>255.255.255.0</literal>).
pt_br: <literal>${CONTROLPLANE1_PREFIX}</literal>: o CIDR usado para o cluster de borda (por exemplo, <literal>24</literal> para <literal>/24</literal> ou <literal>255.255.255.0</literal>).

source: <literal>${CONTROLPLANE1_GATEWAY}</literal> — The gateway to be used for the edge cluster (for example, <literal>192.168.100.1</literal>).
pt_br: <literal>${CONTROLPLANE1_GATEWAY}</literal>: o gateway usado para o cluster de borda (por exemplo, <literal>192.168.100.1</literal>).

source: <literal>${CONTROLPLANE1_MAC}</literal> — The MAC address to be used for the control-plane interface (for example, <literal>00:0c:29:3e:3e:3e</literal>).
pt_br: <literal>${CONTROLPLANE1_MAC}</literal>: o endereço MAC usado para a interface do plano de controle (por exemplo, <literal>00:0c:29:3e:3e:3e</literal>).

source: You can refer to <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/edge-clusters">the SUSE Edge for Telco examples repo</link> for more complex examples, including IPv6 only and dual-stack configurations.
pt_br: Acesse o <link xl:href="https://github.com/suse-edge/atip/tree/main/telco-examples/edge-clusters">repositório de exemplos do SUSE Edge for Telco</link> para ver exemplos mais complexos, incluindo configurações somente IPv6 e de pilha dupla.

source: The <literal>${RKE2_VERSION}</literal> is the version of <literal>RKE2</literal> to be used replacing this value (for example, <literal>v1.32.4+rke2r1</literal>).
pt_br: A <literal>${RKE2_VERSION}</literal> é a versão do <literal>RKE2</literal> usada no lugar desse valor (por exemplo, <literal>v1.32.4+rke2r1</literal>).

source: This section covers the lifecycle management actions for clusters deployed via SUSE Edge for Telco.
pt_br: Esta seção aborda as ações de gerenciamento do ciclo de vida para clusters implantados pelo SUSE Edge for Telco.

source: <emphasis role="strong">Versions</emphasis>: SUSE Edge is an opinionated and thorough tested version of different SUSE components. he versions of each component per SUSE Edge release can be observed in the <link xl:href="https://documentation.suse.com/suse-edge/support-matrix/html/support-matrix/index.html">SUSE Edge support matrix</link>.
pt_br: <emphasis role="strong">Versões</emphasis>: o SUSE Edge é uma versão consistente e completamente testada de diferentes componentes SUSE. Consulte as versões de cada componente por lançamento do SUSE Edge na <link xl:href="https://documentation.suse.com/suse-edge/support-matrix/html/support-matrix/index.html">matriz de suporte do SUSE Edge</link>.

source: <link xl:href="https://longhorn.io/docs/1.8.1/troubleshoot/troubleshooting/">Longhorn Troubleshooting</link>
pt_br: <link xl:href="https://longhorn.io/docs/1.8.1/troubleshoot/troubleshooting/">Solução de problemas do Longhorn</link>

source: SUSE Edge 3.3 is a tightly integrated and comprehensively validated end-to-end solution for addressing the unique challenges of the deployment of infrastructure and cloud-native applications at the edge. Its driving focus is to provide an opinionated, yet highly flexible, highly scalable, and secure platform that spans initial deployment image building, node provisioning and onboarding, application deployment, observability, and lifecycle management.
pt_br: O SUSE Edge 3.3 é uma solução completa, de estreita integração e amplamente validada, capaz de abordar os desafios exclusivos da implantação da infraestrutura e dos aplicativos nativos de nuvem na borda. Seu foco principal é oferecer uma plataforma consistente, porém altamente flexível, escalável e segura, que envolva a criação de imagem da implantação inicial, o provisionamento e a integração de nós, a implantação de aplicativos, a observabilidade e o gerenciamento do ciclo de vida.

source: SUSE Edge for Telco (formerly known as Adaptive Telco Infrastructure Platform/ATIP) is a derivative (or downstream product) of SUSE Edge, with additional optimizations and components that enable the platform to address the requirements found in telecommunications use-cases. Unless explicitly stated, all the release notes are applicable for both SUSE Edge 3.3, and SUSE Edge for Telco 3.3.
pt_br: O SUSE Edge for Telco (antes conhecido como Adaptive Telco Infrastructure Platform/ATIP) deriva (produto downstream) do SUSE Edge, com otimizações e componentes adicionais que possibilitam que a plataforma atenda aos requisitos constantes nos casos de uso de telecomunicações. A menos que claramente indicado, todas as Notas de lançamento são aplicáveis ao SUSE Edge 3.3 e ao SUSE Edge for Telco 3.3.

source: However, repeated entries are provided as a courtesy only. Therefore, if you are skipping one or more releases, check the release notes of the skipped releases also. If you are only reading the release notes of the current release, you could miss important changes that may affect system behavior. SUSE Edge versions are defined as x.y.z, where 'x' denotes the major version, 'y' denotes the minor, and 'z' denotes the patch version, also known as the "z-stream". SUSE Edge product lifecycles are defined based around a given minor release, e.g. "3.3", but ship with subsequent patch updates through its lifecycle, e.g. "3.3.1".
pt_br: No entanto, as entradas repetidas são fornecidas apenas como conveniência. Portanto, se você pular um ou mais lançamentos, consulte as Notas de lançamento também dos lançamentos que forem pulados. Se você estiver apenas lendo as Notas de lançamento referentes ao lançamento atual, poderá perder alterações importantes que podem afetar o comportamento do sistema. As versões do SUSE Edge são definidas como x.y.z, em que "x" indica a versão principal, "y" indica a versão secundária e "z" indica a versão do patch, também conhecida como "z-stream". Os ciclos de vida do produto SUSE Edge são definidos com base na versão secundária especificada, por exemplo, "3.3", mas acompanham as atualizações de patch subsequentes ao longo do seu ciclo de vida, por exemplo, "3.3.1".

source: Release 3.3.1
pt_br: Versão 3.3.1

source: Availability Date: 13th June 2025
pt_br: Data da disponibilidade: 13 de junho de 2025

source: Summary: SUSE Edge 3.3.1 is first z-stream release in the SUSE Edge 3.3 release stream.
pt_br: Resumo: SUSE Edge 3.3.1 é a primeira versão z-stream no fluxo de versões do SUSE Edge 3.3.

source: Updated to Kubernetes 1.32.4 and Rancher Prime 2.11.2 <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.11.2">Release Notes</link>
pt_br: Atualizado para o Kubernetes 1.32.4 e o Rancher Prime 2.11.2 <link xl:href="https://github.com/rancher/rancher/releases/tag/v2.11.2">Notas de lançamento</link>

source: Updated to SUSE Security (Neuvector) 5.4.4 <link xl:href="https://open-docs.neuvector.com/releasenotes/5x#544-may-2025">Release Notes</link>
pt_br: Atualizado para o SUSE Security (Neuvector) 5.4.4 <link xl:href="https://open-docs.neuvector.com/releasenotes/5x#544-may-2025">Notas de lançamento</link>

source: Updated to Rancher Turtles 0.20.0 <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/changelogs/changelogs/v0.20.0.html">Release Notes</link>
pt_br: Atualizado para o Rancher Turtles 0.20.0 <link xl:href="https://turtles.docs.rancher.com/turtles/stable/en/changelogs/changelogs/v0.20.0.html">Notas de lançamento</link>

source: In some cases when using a management cluster that has been upgraded from Edge 3.2 to 3.3.0, downstream rolling upgrades via CAPI could result in Machines stuck in Deleting state, this has been resolved via an update to the RKE2 CAPI provider <link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/661">Upstream RKE2 provider issue 661</link>
pt_br: Em alguns casos, ao usar um cluster de gerenciamento que foi atualizado do Edge 3.2 para 3.3.0, os upgrades downstream contínuos feitos via CAPI podem fazer com que as máquinas fiquem travadas no estado "em exclusão". Isso foi resolvido com a atualização para o provedor CAPI RKE2 (<link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/661">Upstream RKE2 provider issue 661</link>)

source: When configuring networking via nm-configurator, certain configurations which identify interfaces by MAC in 3.3.0 did not work, this has been resolved by updating NMC to 0.3.3 with corresponding updates to the EIB and Metal<superscript>3</superscript> IPA downloader container images <link xl:href="https://github.com/suse-edge/nm-configurator/issues/163">Upstream NM Configurator Issue</link>
pt_br: Ao configurar a rede pelo nm-configurator, algumas configurações que identificam as interfaces por MAC na versão 3.3.0 não funcionavam, o que foi resolvido ao atualizar o NMC para 0.3.3, com as atualizações correspondentes nas imagens do contêiner do mecanismo de download IPA do EIB e do Metal<superscript>3</superscript> <link xl:href="https://github.com/suse-edge/nm-configurator/issues/163">Problema com o NM Configurator upstream</link>

source: For long running Metal<superscript>3</superscript> management clusters in 3.3.0, it was possible for certificate expiry to cause the baremetal-operator connection to ironic to fail, requiring a workaround of a manual pod restart, this has been resolved via updates to the Metal<superscript>3</superscript> chart <link xl:href="https://github.com/suse-edge/charts/issues/178">SUSE Edge charts issue</link>
pt_br: Nos clusters de gerenciamento Metal<superscript>3</superscript> de longa execução na versão 3.3.0, o vencimento do certificado poderia provocar falha na conexão do operador bare metal com o Ironic, exigindo como solução alternativa a reinicialização manual do pod, o que foi resolvido por meio de atualizações no gráfico do Metal<superscript>3</superscript> <link xl:href="https://github.com/suse-edge/charts/issues/178">Problema nos gráficos do SUSE Edge</link>

source: Previously Rancher UI was not not able to list SUSE Edge charts from OCI registry in the Application catalog. This has been resolved with the update to Rancher 2.11.2 <link xl:href="https://github.com/rancher/rancher/issues/48746">Rancher Issue</link>
pt_br: Antes, a IU do Rancher não listava os gráficos do SUSE Edge do registro OCI no catálogo de aplicativos. Isso foi resolvido com a atualização para o Rancher 2.11.2 <link xl:href="https://github.com/rancher/rancher/issues/48746">Problema no Rancher</link>

source: When using <literal>toolbox</literal> in SUSE Linux Micro 6.1, the default container image does not contain some tools which were included in the previous 5.5 version. The workaround is to configure toolbox to use the previous <literal>suse/sle-micro/5.5/toolbox</literal> container image, see <literal>toolbox --help</literal> for options to configure the image.
pt_br: Ao usar o <literal>toolbox</literal> no SUSE Linux Micro 6.1, a imagem do contêiner padrão não inclui algumas ferramentas que eram incluídas na versão 5.5 anterior. A solução alternativa é configurar o toolbox para usar a imagem do contêiner <literal>suse/sle-micro/5.5/toolbox</literal> anterior. Consulte <literal>toolbox --help</literal> para ver opções de configuração da imagem.

source: In some cases rolling upgrades via CAPI can result in Machines stuck in Deleting state, this will be resolved via a future update <link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/655">Upstream RKE2 provider issue 655</link>
pt_br: Em alguns casos, os upgrades contínuos feitos via CAPI podem fazer com que as máquinas fiquem travadas no estado "em exclusão". Isso será resolvido com uma atualização futura (<link xl:href="https://github.com/rancher/cluster-api-provider-rke2/issues/655">Upstream RKE2 provider issue 655</link>)

source: Due to fixes related to <link xl:href="https://nvd.nist.gov/vuln/detail/CVE-2025-1974">CVE-2025-1974</link> as mentioned in 3.3.0, SUSE Linux Micro 6.1 <emphasis role="strong">must</emphasis> be updated to include kernel <literal>&gt;=6.4.0-26-default</literal> or <literal>&gt;=6.4.0-30-rt</literal> (real-time kernel) due to required SELinux kernel patches. If not applied, the ingress-nginx pod will remain in a <literal>CrashLoopBackOff</literal> state. To apply the kernel update run <literal>transactional-update</literal> on the host itself (to update all packages), or <literal>transactional-update pkg update kernel-default</literal> (or kernel-rt) to update just the kernel, then reboot the host. If deploying new clusters, please follow <xref linkend="guides-kiwi-builder-images"/> to build fresh images containing the latest kernel.
pt_br: Devido a correções relacionadas ao <link xl:href="https://nvd.nist.gov/vuln/detail/CVE-2025-1974">CVE-2025-1974</link>, conforme mencionado na versão 3.3.0, o SUSE Linux Micro 6.1 <emphasis role="strong">deve</emphasis> ser atualizado para incluir o kernel <literal>&gt;=6.4.0-26-default</literal> ou <literal>&gt;=6.4.0-30-rt</literal> (kernel real-time) por causa dos patches de kernel obrigatórios do SELinux. Se não forem aplicados, o pod ingress-nginx continuará no estado <literal>CrashLoopBackOff</literal>. Para aplicar a atualização do kernel, execute <literal>transactional-update</literal> no próprio host (para atualizar todos os pacotes), ou <literal>transactional-update pkg update kernel-default</literal> (ou kernel-rt) para atualizar apenas o kernel e, em seguida, reinicialize o host. Se estiver implantando novos clusters, siga o <xref linkend="guides-kiwi-builder-images"/> para criar novas imagens com o kernel mais recente.

source: A bug with Kubernetes Job Controller has been identified that on certain conditions it can cause the RKE2/K3s nodes to stay in <literal>NotReady</literal> state (see the <link xl:href="https://github.com/rancher/rke2/issues/8357">#8357 RKE2 issue</link>). The errors can look like:
pt_br: Um bug no controlador de jobs do Kubernetes foi identificado em determinadas condições nas quais ele pode fazer com que os nós do RKE2/K3s permaneçam no estado <literal>NotReady</literal> (consulte o <link xl:href="https://github.com/rancher/rke2/issues/8357">problema #8357 do RKE2</link>). Os erros podem ter esta aparência:

source: As a workaround, the <literal>kube-controller-manager</literal> pod can be restarted with <literal>crictl</literal> as:
pt_br: Como solução alternativa, reinicie o pod <literal>kube-controller-manager</literal> com <literal>crictl</literal> como:

source: On RKE2/K3s 1.31 and 1.32 versions, the directory <literal>/etc/cni</literal> being used to store CNI configurations may not trigger a notification of the files being written there to <literal>containerd</literal> due to certain conditions related to <literal>overlayfs</literal> (see the <link xl:href="https://github.com/rancher/rke2/issues/8356">#8356 RKE2 issue</link>). This in turn results in the deployment of RKE2/K3s to get stuck waiting for the CNI to start, and the RKE2/K3s nodes to stay in <literal>NotReady</literal> state. This can be seen at node level with <literal>kubectl describe node &lt;affected_node&gt;</literal>:
pt_br: Nas versões do RKE2/K3s 1.31 e 1.32, o diretório <literal>/etc/cni</literal> usado para armazenar as configurações de CNI podem não acionar uma notificação sobre os arquivos que estão sendo gravados nele para o <literal>containerd</literal> devido a determinadas condições relacionadas ao <literal>overlayfs</literal> (consulte o <link xl:href="https://github.com/rancher/rke2/issues/8356">problema #8356 do RKE2</link>). Isso, por sua vez, acaba travando a implantação do RKE2/K3s na espera pela inicialização da CNI, e os nós do RKE2/K3s no estado <literal>NotReady</literal>. Isso pode ser observado no nível do nó com <literal>kubectl describe node &lt;nó_afetado&gt;</literal>:

source: The following table describes the individual components that make up the 3.3.1 release, including the version, the Helm chart version (if applicable), and from where the released artifact can be pulled in the binary format. Please follow the associated documentation for usage and deployment examples.
pt_br: A tabela a seguir descreve os componentes individuais que compõem o lançamento 3.3.1, incluindo a versão, a versão do gráfico Helm (se aplicável) e de onde obter o artefato lançado no formato binário. Consulte a documentação associada para ver exemplos de uso e implantação.

source: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.32.4%2Bk3s1">Upstream K3s Release</link>
pt_br: <link xl:href="https://github.com/k3s-io/k3s/releases/tag/v1.32.4%2Bk3s1">Versão upstream do K3s</link>

source: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.32.4%2Brke2r1">Upstream RKE2 Release</link>
pt_br: <link xl:href="https://github.com/rancher/rke2/releases/tag/v1.32.4%2Brke2r1">Versão upstream do RKE2</link>

source: <link xl:href="https://charts.rancher.com/server-charts/prime/index.yaml">Rancher Prime Helm Repository</link><?asciidoc-br?> <link xl:href="https://github.com/rancher/rancher/releases/download/v2.11.1/rancher-images.txt">Rancher 2.11.1 Container Images</link>
pt_br: <link xl:href="https://charts.rancher.com/server-charts/prime/index.yaml">Repositório Helm do Rancher Prime</link><?asciidoc-br?> <link xl:href="https://github.com/rancher/rancher/releases/download/v2.11.1/rancher-images.txt">Imagens do contêiner do Rancher 2.11.1</link>

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v5.2.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.13.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v8.2.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.13.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.15.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.52<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.8.1<?asciidoc-br?>
pt_br: <link xl:href="https://charts.rancher.io/index.yaml">Repositório de gráficos Helm do Rancher</link><?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-attacher:v4.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-provisioner:v5.2.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-resizer:v1.13.2<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-snapshotter:v8.2.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-csi-node-driver-registrar:v2.13.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-livenessprobe:v2.15.0<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-backing-image-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-engine:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-instance-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-share-manager:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-ui:v1.8.1<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-support-bundle-kit:v0.0.52<?asciidoc-br?> registry.suse.com/rancher/mirrored-longhornio-longhorn-cli:v1.8.1<?asciidoc-br?>

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-controller:5.4.4</emphasis><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-enforcer:5.4.4</emphasis><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-manager:5.4.4</emphasis><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-compliance-config:1.0.5</emphasis><?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-updater:0.0.3</emphasis>
pt_br: <link xl:href="https://charts.rancher.io/index.yaml">Repositório de gráficos Helm do Rancher</link><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-controller:5.4.4</emphasis><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-enforcer:5.4.4</emphasis><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-manager:5.4.4</emphasis><?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-compliance-config:1.0.5</emphasis><?asciidoc-br?> registry.suse.com/rancher/neuvector-registry-adapter:0.1.6<?asciidoc-br?> registry.suse.com/rancher/neuvector-scanner:6<?asciidoc-br?> <emphasis role="strong">registry.suse.com/rancher/neuvector-updater:0.0.3</emphasis>

source: <emphasis role="strong">Rancher Turtles Airgap Resources</emphasis>
pt_br: <emphasis role="strong">Recursos de isolamento do Rancher Turtles</emphasis>

source: Akri (Tech Preview)
pt_br: Akri (prévia de tecnologia)

source: <link xl:href="https://charts.rancher.io/index.yaml">Rancher Charts Helm Repository</link><?asciidoc-br?> registry.suse.com/rancher/system-upgrade-controller:v0.15.2
pt_br: <link xl:href="https://charts.rancher.io/index.yaml">Repositório de gráficos Helm do Rancher</link><?asciidoc-br?> registry.suse.com/rancher/system-upgrade-controller:v0.15.2

source: <emphasis role="strong">Upgrade Controller</emphasis>
pt_br: <emphasis role="strong">Controller de upgrade</emphasis>

source: Release 3.3.0
pt_br: Versão 3.3.0

source: Availability Date: 20th May 2025
pt_br: Data da disponibilidade: 20 de maio de 2025
