Repository: suse-edge/suse-edge.github.io
Catalog: l10n/po/*.po
Languages: es, ja, pt_br, zh_cn

source: Always perform cluster migrations from the <literal>latest Z-stream</literal> release of <literal>Edge 3.3</literal>.
es: Realice siempre las migraciones de clústeres desde la última versión <literal>z-stream</literal> de <literal>Edge 3.3</literal>.
ja: クラスタマイグレーションは常に、<literal>Edge 3.3</literal>の <literal>最新のZ-stream</literal>リリースから実行してください。
zh_cn: 始终从 <literal>Edge 3.3</literal> 的<literal>最新 z-stream</literal> 版本执行群集迁移。

source: Always migrate to the <literal>Edge 3.4.0</literal> release. For subsequent post-migration upgrades, refer to the management (<xref linkend="day2-mgmt-cluster"/>) and downstream (<xref linkend="day2-downstream-clusters"/>) cluster sections.
es: Migre siempre a la versión <literal>Edge 3.4.0</literal>. Para actualizaciones posteriores a la migración, consulte las secciones sobre los clústeres de gestión (<xref linkend="day2-mgmt-cluster"/>) y los clústeres descendentes (<xref linkend="day2-downstream-clusters"/>).
ja: 常に、<literal>Edge 3.4.0</literal>リリースに移行してください。マイグレーション後のアップグレードについては、管理クラスタ(<xref linkend="day2-mgmt-cluster"/>)およびダウンストリームクラスタ(<xref linkend="day2-downstream-clusters"/>)のセクションを参照してください。
zh_cn: 始终迁移到 <literal>Edge 3.4.0</literal> 版本。对于迁移后的后续升级，请参见管理群集（<xref linkend="day2-mgmt-cluster"/>）和下游群集（<xref linkend="day2-downstream-clusters"/>）章节。

source: This section covers the following topics:
es: En esta sección se tratan los temas siguientes:
ja: このセクションでは、次のトピックについて説明します。
pt_br: Esta seção aborda os seguintes tópicos:
zh_cn: 本节将介绍以下主题：

source: <xref linkend="day2-migration-mgmt-prereq"/> - prerequisite steps to complete before starting the migration.
es: <xref linkend="day2-migration-mgmt-prereq"/>: pasos previos que deben completarse antes de iniciar la migración.
ja: <xref linkend="day2-migration-mgmt-prereq"/> - マイグレーションを開始する前に完了する必要がある前提条件の手順。
pt_br: <xref linkend="day2-migration-mgmt-prereq"/>: etapas de pré-requisito para concluir antes de iniciar a migração.
zh_cn: <xref linkend="day2-migration-mgmt-prereq"/> - 开始迁移前需要完成的先决步骤。

source: <xref linkend="day2-migration-mgmt-upgrade-controller"/> - how to do a <literal>management</literal> cluster migration using the <xref linkend="components-upgrade-controller"/>.
es: <xref linkend="day2-migration-mgmt-upgrade-controller"/>: cómo migrar un clúster de <literal>gestión</literal> con <xref linkend="components-upgrade-controller"/>.
ja: <xref linkend="day2-migration-mgmt-upgrade-controller"/> - <xref linkend="components-upgrade-controller"/>を使用して<literal>管理</literal>クラスタのマイグレーションを実行する方法。
pt_br: <xref linkend="day2-migration-mgmt-upgrade-controller"/>: como migrar um cluster de <literal>gerenciamento</literal> usando o <xref linkend="components-upgrade-controller"/>.
zh_cn: <xref linkend="day2-migration-mgmt-upgrade-controller"/> - 如何使用<xref linkend="components-upgrade-controller"/>执行<literal>管理</literal>群集迁移。

source: <xref linkend="day2-migration-mgmt-fleet"/> - how to do a <literal>management</literal> cluster migration using <xref linkend="components-fleet"/>.
es: <xref linkend="day2-migration-mgmt-fleet"/>: cómo migrar un clúster de <literal>gestión</literal> con <xref linkend="components-fleet"/>.
ja: <xref linkend="day2-migration-mgmt-fleet"/> - <xref linkend="components-fleet"/>を使用して<literal>管理</literal>クラスタのマイグレーションを実行する方法。
pt_br: <xref linkend="day2-migration-mgmt-fleet"/>: como migrar um cluster de <literal>gerenciamento</literal> usando o <xref linkend="components-fleet"/>.
zh_cn: <xref linkend="day2-migration-mgmt-fleet"/> - 如何使用<xref linkend="components-fleet"/>执行<literal>管理</literal>群集迁移。

source: Upgrade the Bare Metal Operator CRDs
es: Actualización de las CRD del operador bare metal
ja: Bare Metal Operator CRDのアップグレード
pt_br: Fazer upgrade das CRDs do Bare Metal Operator
zh_cn: 升级裸机操作器 CRD

source: Applies only to clusters that require a <xref linkend="components-metal3"/> chart upgrade.
es: Solo se aplica a clústeres que requieren una actualización del chart de <xref linkend="components-metal3"/>.
ja: <xref linkend="components-metal3"/>チャートのアップグレードが必要なクラスタにのみ適用されます。
pt_br: Aplica-se apenas a clusters que exigem upgrade do gráfico do <xref linkend="components-metal3"/>.
zh_cn: 仅适用于需要进行 <xref linkend="components-metal3"/> chart 升级的群集。

source: The <literal>Metal<superscript>3</superscript></literal> Helm chart includes the <link xl:href="https://book.metal3.io/bmo/introduction.html">Bare Metal Operator (BMO)</link> CRDs by leveraging Helm’s <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#method-1-let-helm-do-it-for-you">CRD</link> directory.
es: El chart de Helm de <literal>Metal<superscript>3</superscript></literal> incluye las CRD de <link xl:href="https://book.metal3.io/bmo/introduction.html">Bare Metal Operator (BMO)</link> obtenidas del directorio <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#method-1-let-helm-do-it-for-you">CRD</link> de Helm.
ja: <literal>Metal<superscript>3</superscript></literal> Helmチャートには、<link xl:href="https://book.metal3.io/bmo/introduction.html">Bare Metal Operator (BMO)</link> CRDが含まれており、これはHelmの<link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#method-1-let-helm-do-it-for-you">CRD</link>ディレクトリを活用することで提供されています。
pt_br: O gráfico Helm do <literal>Metal<superscript>3</superscript></literal> inclui as CRDs do <link xl:href="https://book.metal3.io/bmo/introduction.html">Bare Metal Operator (BMO)</link> aproveitando o diretório <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#method-1-let-helm-do-it-for-you">CRD</link> do Helm.
zh_cn: <literal>Metal<superscript>3</superscript></literal> Helm chart 利用 Helm 的 <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#method-1-let-helm-do-it-for-you">CRD</link> 目录来包含<link xl:href="https://book.metal3.io/bmo/introduction.html">裸机操作器 (BMO)</link> CRD。

source: However, this approach has certain limitations, particularly the inability to upgrade CRDs in this directory using Helm. For more information, refer to the <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#some-caveats-and-explanations">Helm documentation</link>.
es: Sin embargo, este enfoque tiene ciertas limitaciones, en particular la imposibilidad de actualizar las CRD de este directorio utilizando Helm. Para obtener más información, consulte la <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#some-caveats-and-explanations">documentación de Helm</link>.
ja: ただし、このアプローチには特定の制限があり、特にHelmを使用してこのディレクトリ内のCRDをアップグレードできません。詳細については、<link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#some-caveats-and-explanations">Helmのドキュメント</link>を参照してください。
pt_br: Entretanto, essa abordagem tem algumas limitações, especificamente a incapacidade de fazer upgrade das CRDs nesse diretório usando o Helm. Para obter mais informações, consulte a <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#some-caveats-and-explanations">documentação do Helm</link>.
zh_cn: 然而，这种方法存在一定的局限性，特别是无法使用 Helm 升级此目录中的 CRD。有关详细信息，请参见 <link xl:href="https://helm.sh/docs/chart_best_practices/custom_resource_definitions/#some-caveats-and-explanations">Helm 文档</link>。

source: As a result, before upgrading Metal<superscript>3</superscript> to an <literal>Edge 3.4.0</literal> compatible version, users must manually upgrade the underlying BMO CRDs.
es: Como resultado, antes de actualizar Metal<superscript>3</superscript> a una versión compatible con <literal>Edge 3.4.0</literal>, los usuarios deben actualizar manualmente las CRD de BMO subyacentes.
ja: そのため、Metal<superscript>3</superscript>を<literal>Edge 3.4.0</literal>互換のバージョンにアップグレードする前に、ユーザは基盤となるBMO CRDを手動でアップグレードする必要があります。
zh_cn: 因此，在将 Metal<superscript>3</superscript> 升级到与 <literal>Edge 3.4.0</literal> 兼容的版本之前，用户必须手动升级底层的 BMO CRD。

source: On a machine with <literal>Helm</literal> installed and <literal>kubectl</literal> configured to point to your <literal>management</literal> cluster:
es: En un equipo con <literal>Helm</literal> instalado y <literal>kubectl</literal> configurado que apunte al clúster de <literal>gestión</literal>:
ja: <literal>Helm</literal>がインストールされ、<literal>kubectl</literal>が<literal>管理</literal> クラスタを指すように設定されているマシンで、次の手順を実行します。
pt_br: Em uma máquina com o <literal>Helm</literal> instalado e o <literal>kubectl</literal> configurado para apontar para o cluster de <literal>gerenciamento</literal>:
zh_cn: 在安装了 <literal>Helm</literal> 且 <literal>kubectl</literal> 已配置为指向<literal>管理</literal>群集的计算机上：

source: Manually apply the BMO CRDs:
es: Aplique manualmente las CRD de BMO:
ja: BMO CRDを手動で適用します。
pt_br: Aplique manualmente as CRDs do BMO:
zh_cn: 手动应用 BMO CRD：

source: The <literal>Upgrade Controller</literal> currently supports Edge release migrations only for <emphasis role="strong">non air-gapped management</emphasis> clusters.
es: <literal>Upgrade Controller</literal> actualmente solo admite migraciones de versiones de Edge para clústeres <emphasis role="strong">de gestión que no estén en entornos aislados</emphasis>.
ja: <literal>Upgrade Controller</literal>は現在、<emphasis role="strong">非エアギャップ管理</emphasis>クラスタに対してのみEdgeリリースのマイグレーションをサポートしています。
pt_br: O <literal>Controller de upgrade</literal> oferece suporte a migrações de versão do Edge somente para clusters de <emphasis role="strong">gerenciamento não air-gapped</emphasis>.
zh_cn: <literal>升级控制器</literal>目前仅支持<emphasis role="strong">非隔离管理</emphasis>群集的 Edge 版本迁移。

source: The following topics are covered as part of this section:
es: En esta sección se tratan los siguientes temas:
ja: 次のトピックは、このセクションの一部として説明します。
pt_br: Os seguintes tópicos são abordados como parte desta seção:
zh_cn: 本节将介绍以下主题：

source: <xref linkend="day2-migration-mgmt-upgrade-controller-prereq"/> - prerequisites specific to the <literal>Upgrade Controller</literal>.
es: <xref linkend="day2-migration-mgmt-upgrade-controller-prereq"/>: requisitos previos específicos de <literal>Upgrade Controller</literal>.
ja: <xref linkend="day2-migration-mgmt-upgrade-controller-prereq"/> - <literal>Upgrade Controller</literal>に固有の前提条件。
pt_br: <xref linkend="day2-migration-mgmt-upgrade-controller-prereq"/>: pré-requisitos específicos para o <literal>Controller de upgrade</literal>.
zh_cn: <xref linkend="day2-migration-mgmt-upgrade-controller-prereq"/> - 针对<literal>升级控制器</literal>的先决条件。

source: <xref linkend="day2-migration-mgmt-upgrade-controller-migration"/> - steps for migrating a <literal>management</literal> cluster to a new Edge version using the <literal>Upgrade Controller</literal>.
es: <xref linkend="day2-migration-mgmt-upgrade-controller-migration"/>: pasos para migrar un clúster de <literal>gestión</literal> a una versión nueva de Edge mediante <literal>Upgrade Controller</literal>.
ja: <xref linkend="day2-migration-mgmt-upgrade-controller-migration"/> - <literal>Upgrade Controller</literal>を使用して、<literal>管理</literal>クラスタを新しいEdgeバージョンに移行するための手順。
pt_br: <xref linkend="day2-migration-mgmt-upgrade-controller-migration"/>: etapas para migrar o cluster de <literal>gerenciamento</literal> para uma nova versão do Edge usando o <literal>Controller de upgrade</literal>.
zh_cn: <xref linkend="day2-migration-mgmt-upgrade-controller-migration"/> - 使用<literal>升级控制器</literal>将<literal>管理</literal>群集迁移到新 Edge 版本的步骤。

source: Edge 3.4 Upgrade Controller
zh_cn: Edge 3.4 升级控制器

source: Before using the <literal>Upgrade Controller</literal>, you must first ensure that it is running a version that is capable of migrating to the desired Edge release.
es: Antes de usar <literal>Upgrade Controller</literal>, debe asegurarse de que está ejecutando una versión que sea compatible con la migración a la versión de Edge deseada.
ja: <literal>Upgrade Controller</literal>を使用する前に、まず目的のEdgeリリースに移行できるバージョンが実行されていることを確認する必要があります。
pt_br: Antes de usar o <literal>Controller de upgrade</literal>, verifique se ele executa uma versão com capacidade de migração para o lançamento desejado do Edge.
zh_cn: 使用<literal>升级控制器</literal>之前，必须先确保其运行的版本能够迁移到目标 Edge 版本。

source: To do this:
es: Para ello:
ja: このためには:
pt_br: Para fazer isso:
zh_cn: 操作步骤如下：

source: If you already have <literal>Upgrade Controller</literal> deployed from a previous Edge release, upgrade its chart:
es: Si ya ha desplegado <literal>Upgrade Controller</literal> desde una versión anterior de Edge, actualice su chart:
ja: 以前のEdgeリリースから<literal>Upgrade Controller</literal>がすでにデプロイされている場合は、そのチャートをアップグレードします。
pt_br: Se você já tem o <literal>Controller de upgrade</literal> implantado de uma versão anterior do Edge, faça upgrade do respectivo gráfico:
zh_cn: 如果您已在之前的 Edge 版本中部署了<literal>升级控制器</literal>，请升级其 chart：

source: If you do <emphasis role="strong">not</emphasis> have <literal>Upgrade Controller</literal> deployed, follow <xref linkend="components-upgrade-controller-installation"/>.
es: Si <emphasis role="strong">no</emphasis> ha desplegado <literal>Upgrade Controller</literal>, siga la <xref linkend="components-upgrade-controller-installation"/>.
ja: <literal>Upgrade Controller</literal>がデプロイされて<emphasis role="strong">いない</emphasis>場合は、<xref linkend="components-upgrade-controller-installation"/>に従います。
pt_br: Se você <emphasis role="strong">não</emphasis> tem o <literal>Controller de upgrade</literal> implantado, siga a <xref linkend="components-upgrade-controller-installation"/>.
zh_cn: 如果您尚<emphasis role="strong">未</emphasis>部署<literal>升级控制器</literal>，请按照<xref linkend="components-upgrade-controller-installation"/>中所述操作。

source: Migration steps
es: Pasos de la migración
ja: マイグレーション手順
pt_br: Etapas de migração
zh_cn: 迁移步骤

source: Performing a <literal>management</literal> cluster migration with the <literal>Upgrade Controller</literal> is fundamentally similar to executing an upgrade.
es: Migrar un clúster de <literal>gestión</literal> con <literal>Upgrade Controller</literal> es básicamente igual a ejecutar una actualización.
ja: <literal>Upgrade Controller</literal>を使用した<literal>管理</literal>クラスタのマイグレーションの実行は、アップグレードの実行と基本的に類似しています。
pt_br: A execução da migração de um cluster de <literal>gerenciamento</literal> com o <literal>Controller de upgrade</literal> é basicamente similar à execução de um upgrade.
zh_cn: 使用<literal>升级控制器</literal>执行<literal>管理</literal>群集迁移本质上与执行升级类似。

source: The only difference is that your <literal>UpgradePlan</literal> <emphasis role="strong">must</emphasis> specify the <literal>3.4.0</literal> release version:
es: La única diferencia es que su recurso <literal>UpgradePlan</literal> <emphasis role="strong">debe</emphasis> especificar la versión <literal>3.4.0</literal>:
ja: 唯一の違いは、<literal>UpgradePlan</literal> が<literal>3.4.0</literal>リリースバージョンを指定する<emphasis role="strong">必要がある</emphasis>ことです。
zh_cn: 唯一的区别是，<literal>UpgradePlan</literal> <emphasis role="strong">必须</emphasis>指定 <literal>3.4.0</literal> 版本：

source: For information on how to use the above <literal>UpgradePlan</literal> to do a migration, refer to Upgrade Controller upgrade process (<xref linkend="management-day2-upgrade-controller"/>).
es: Para obtener información sobre cómo usar el recurso <literal>UpgradePlan</literal> mencionado para realizar una migración, consulte el proceso de actualización de Upgrade Controller (<xref linkend="management-day2-upgrade-controller"/>).
ja: 上記の<literal>UpgradePlan</literal>を使用してマイグレーションを実行する方法については、Upgrade Controllerのアップグレードプロセス(<xref linkend="management-day2-upgrade-controller"/>)を参照してください。
pt_br: Para obter informações sobre como usar o <literal>UpgradePlan</literal> acima para fazer uma migração, consulte Processo de upgrade do Controller de upgrade (<xref linkend="management-day2-upgrade-controller"/>).
zh_cn: 有关如何使用上述 <literal>UpgradePlan</literal> 进行迁移的信息，请参见升级控制器升级过程（<xref linkend="management-day2-upgrade-controller"/>）。

source: Whenever possible, use the <xref linkend="day2-migration-mgmt-upgrade-controller"/> for migration.
es: Siempre que sea posible, use las instrucciones de la <xref linkend="day2-migration-mgmt-upgrade-controller"/> para la migración.
ja: 可能な限り、マイグレーションには<xref linkend="day2-migration-mgmt-upgrade-controller"/>を使用してください。
pt_br: Sempre que possível, siga as instruções da <xref linkend="day2-migration-mgmt-upgrade-controller"/> para a migração.
zh_cn: 只要有可能，便使用<xref linkend="day2-migration-mgmt-upgrade-controller"/>进行迁移。

source: Refer to this section only for use cases not covered by the <literal>Upgrade Controller</literal>.
es: Consulte esta sección solo para los casos no cubiertos por la migración con <literal>Upgrade Controller</literal>.
ja: <literal>Upgrade Controller</literal>でカバーされていないユースケースの場合にのみ、このセクションを参照してください。
pt_br: Consulte esta seção apenas para casos de uso não cobertos pelo <literal>Controller de upgrade</literal>.
zh_cn: 仅在<literal>升级控制器</literal>未涵盖的使用场景下，才需参考本节内容。

source: Performing a <literal>management</literal> cluster migration with <literal>Fleet</literal> is fundamentally similar to executing an upgrade.
es: Migrar un clúster de <literal>gestión</literal> con <literal>Fleet</literal> es básicamente igual a ejecutar una actualización.
ja: <literal>Fleet</literal>を使用した<literal>管理</literal>クラスタのマイグレーションの実行は、基本的にアップグレードの実行と類似しています。
pt_br: A execução da migração de um cluster de <literal>gerenciamento</literal> com o <literal>Fleet</literal> é basicamente similar a de um upgrade.
zh_cn: 使用 <literal>Fleet</literal> 执行<literal>管理</literal>群集迁移本质上与执行升级类似。

source: The <emphasis role="strong">key</emphasis> differences being that:
es: Estas son las diferencias <emphasis role="strong">principales</emphasis>:
ja: <emphasis role="strong">主な</emphasis>違いは次のとおりです。
pt_br: As <emphasis role="strong">principais</emphasis> diferenças são:
zh_cn: <emphasis role="strong">主要</emphasis>区别在于：

source: The fleets <emphasis role="strong">must be used</emphasis> from the <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">release-3.4.0</link> release of the <literal>suse-edge/fleet-examples</literal> repository.
es: Fleet <emphasis role="strong">se debe usar</emphasis> desde la versión <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">release-3.4.0</link> del repositorio <literal>suse-edge/fleet-examples</literal>.
ja: フリートは<literal>suse-edge/fleet-examples</literal>リポジトリの<link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">release-3.4.0</link>リリースから<emphasis role="strong">使用される必要があります</emphasis>。
zh_cn: <emphasis role="strong">必须使用</emphasis> <link xl:href="https://github.com/suse-edge/fleet-examples/releases/tag/release-3.4.0">release-3.4.0</link> 版本 <literal>suse-edge/fleet-examples</literal> 储存库中的 Fleet。

source: Charts scheduled for an upgrade <emphasis role="strong">must</emphasis> be upgraded to versions compatible with the <literal>Edge 3.4.0</literal> release. For a list of the <literal>Edge 3.4.0</literal> components, refer to <xref linkend="release-notes-3-4-0"/>.
es: Los charts cuya actualización esté programada, <emphasis role="strong">deben</emphasis> actualizarse a versiones compatibles con la versión <literal>Edge 3.4.0</literal>. Para ver una lista de los componentes de <literal>Edge 3.4.0</literal>, consulte la <xref linkend="release-notes-3-4-0"/>.
ja: アップグレードがスケジュールされているチャートは、<literal>Edge 3.4.0</literal>リリースと互換性のあるバージョンにアップグレードする <emphasis role="strong">必要があります</emphasis>。<literal>Edge 3.4.0</literal>コンポーネントのリストについては、<xref linkend="release-notes-3-4-0"/>を参照してください。
zh_cn: 安排升级的 chart <emphasis role="strong">必须</emphasis>升级到与 <literal>Edge 3.4.0</literal> 版本兼容的版本。有关 <literal>Edge 3.4.0</literal> 组件的列表，请参见<xref linkend="release-notes-3-4-0"/>。

source: To ensure a successful <literal>Edge 3.4.0</literal> migration, it is important that users comply with the points outlined above.
es: Para garantizar que la migración a <literal>Edge 3.4.0</literal> se realice correctamente, es importante que los usuarios cumplan con los puntos descritos anteriormente.
ja: <literal>Edge 3.4.0</literal>へのマイグレーションを成功させるには、ユーザが上記の点に従うことが重要です。
zh_cn: 为确保 <literal>Edge 3.4.0</literal> 迁移成功，用户必须遵守上述要点。

source: Considering the points above, users can follow the <literal>management</literal> cluster Fleet (<xref linkend="management-day2-fleet"/>) documentation for a comprehensive guide on the steps required to perform a migration.
es: Teniendo en cuenta los puntos anteriores, los usuarios pueden seguir la documentación de Fleet (<xref linkend="management-day2-fleet"/>) sobre el clúster de <literal>gestión</literal>, que incluye todos los pasos necesarios para realizar la migración.
ja: 上記の点を踏まえて、ユーザはマイグレーションの実行に必要な手順に関する包括的なガイドとして、<literal>管理</literal> クラスタFleet (<xref linkend="management-day2-fleet"/>)のドキュメントに従うことができます。
pt_br: Considerando os pontos acima, os usuários podem seguir a documentação do Fleet sobre cluster de <literal>gerenciamento</literal> (<xref linkend="management-day2-fleet"/>) para obter um guia completo das etapas necessárias à migração.
zh_cn: 鉴于上述要点，用户可参考<literal>管理</literal>群集 Fleet（<xref linkend="management-day2-fleet"/>）文档，获取执行迁移需要完成的步骤的全面指南。

source: <xref linkend="day2-migration-downstream-fleet"/> - how to do a <literal>downstream</literal> cluster migration using <xref linkend="components-fleet"/>.
es: <xref linkend="day2-migration-downstream-fleet"/>: cómo migrar un clúster <literal>descendente</literal> con <xref linkend="components-fleet"/>.
ja: <xref linkend="day2-migration-downstream-fleet"/> - <xref linkend="components-fleet"/>を使用して<literal>ダウンストリーム</literal>クラスタのマイグレーションを実行する方法。
pt_br: <xref linkend="day2-migration-downstream-fleet"/>: como migrar um cluster <literal>downstream</literal> usando o <xref linkend="components-fleet"/>.
zh_cn: <xref linkend="day2-migration-downstream-fleet"/> - 如何使用<xref linkend="components-fleet"/>执行<literal>下游</literal>群集迁移。

source: Performing a <literal>downstream</literal> cluster migration with <literal>Fleet</literal> is fundamentally similar to executing an upgrade.
es: Migrar un clúster <literal>descendente</literal> con <literal>Fleet</literal> es básicamente igual a ejecutar una actualización.
ja: <literal>Fleet</literal>を使用した<literal>ダウンストリーム</literal>クラスタのマイグレーションの実行は、アップグレードの実行と基本的に類似しています。
pt_br: A execução da migração de um cluster <literal>downstream</literal> com o <literal>Fleet</literal> é basicamente similar a de um upgrade.
zh_cn: 使用 <literal>Fleet</literal> 执行<literal>下游</literal>群集迁移本质上与执行升级类似。

source: Considering the points above, users can follow the <literal>downstream</literal> cluster Fleet (<xref linkend="downstream-day2-fleet"/>) documentation for a comprehensive guide on the steps required to perform a migration.
es: Teniendo en cuenta los puntos anteriores, los usuarios pueden seguir la documentación de Fleet (<xref linkend="downstream-day2-fleet"/>) sobre los clústeres <literal>descendentes</literal> para obtener una guía completa sobre los pasos necesarios para realizar la migración.
ja: 上記の点を踏まえて、ユーザはマイグレーションの実行に必要な手順に関する包括的なガイドとして、 <literal>ダウンストリーム</literal>クラスタFleet (<xref linkend="downstream-day2-fleet"/>)のドキュメントに従うことができます。
pt_br: Considerando os pontos acima, os usuários podem seguir a documentação do Fleet sobre cluster <literal>downstream</literal> (<xref linkend="downstream-day2-fleet"/>) para obter um guia completo das etapas necessárias à migração.
zh_cn: 鉴于上述要点，用户可参考<literal>下游</literal>群集 Fleet（<xref linkend="downstream-day2-fleet"/>）文档，获取执行迁移需要完成的步骤的全面指南。
